[
  {
    "text": "<@U7SL518D6>, thanks for your advice but that does not seem to do the trick either! :confused:\n\nDoes that work for you?",
    "time_stamp": "2021-09-23 02:13:57"
  },
  {
    "text": "Another solution could be to make use of the embed-code for CTAs in a way that we call them by Macro  and leave the script part out of the Vue component. However, any possible escape operation for the script would be more straightforward than this workaround :slightly_smiling_face: wdyt Jon?",
    "time_stamp": "2021-09-23 02:22:46",
    "edited": {
      "time_stamp": "2021-09-23 02:23:51"
    }
  },
  {
    "poster": {
      "poster_name": "Beniamin Makal",
      "poster_handle": "beniamin.makal"
    },
    "time_stamp": "2021-09-23 03:23:17",
    "text": "Hi all,\nDid any of you try to build Angular app in HubSpot? I just inherited a small application written in Vue.js that is build based on `cms-vue-boilerplate` and I thinking about rewriting it to Angular. The client has some big plans so it would be easier for me and my team to extend and maintain Angular app. It is also possible to rewrite it to React but I'd like to check Angular in the first place."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-23 07:17:28",
    "edited": {
      "time_stamp": "2021-09-23 07:17:39"
    },
    "text": "When you use the v-once method, what’s the output you’re seeing? are you getting a JavaScript error? is the CTA HTML not being rendered?\n\nI ask because the HubL tag shouldn’t produce significantly different results from the macro you created. The only difference is that it will indeed include the script tag needed to trigger it’s rendering and analytics."
  },
  {
    "text": "CTA HTML is being rendered with or without  v-once .\nv-once does not seem to make any difference. Always seeing this error\n&gt; `Templates should only be responsible for mapping the state to the UI. Avoid placing tags with side-effects in your templates, such as &lt;script&gt;, as they will not be parsed.`\nThis is the page if you want to check the console.log.\n<https://HubSpot-developers-jlitb4-24938640.hs-sites-eu1.com/demo-serhat>\n&gt; When you use the v-once method, what’s the output you’re seeing? are you getting a JavaScript error? is the CTA HTML not being rendered?",
    "time_stamp": "2021-09-23 08:20:07"
  },
  {
    "text": "With the macro option, I know that there will be a CTA that the editor might add since I am wrapping it up for the CTA field in this specific case.\nThus, adding its HTML via Macro and its script outside of the Vue component like this.\nThat does the trick.\nIt will trigger its rendering analytics with no problem.\n However, it is not ideal considering that the editor can add a CTA via RT module. :slightly_smiling_face:\n&gt; I ask because the HubL tag shouldn’t produce significantly different results from the macro you created. The only difference is that it will indeed include the script tag needed to trigger it’s rendering and analytics.",
    "time_stamp": "2021-09-23 08:21:35",
    "edited": {
      "time_stamp": "2021-09-23 08:22:18"
    }
  }
]