[
  {
    "text": "Hey HubSpot Marketplace team!  Just some UX feedback I’m getting from HS customers who purchase a single template.  Since the template is part of 2 separate packs I sell, it’s being added twice to the customers account creating a redundancy.\n\nNot a HUGE deal. Just letting you know.\nCC: <@U22PWJ41G>",
    "time_stamp": "2020-02-07 11:13:27",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-02-07 11:15:46"
      },
      {
        "time_stamp": "2020-02-07 11:21:54"
      },
      {
        "time_stamp": "2020-02-07 11:44:01"
      },
      {
        "time_stamp": "2020-02-07 12:51:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2020-02-07 11:15:46",
    "text": "Thanks Kevin. Since the asset is technically part of two packs we deliver two unique instances of the asset.\nI assume that you’d like to see templates get consolidated in an upgrade situation (basic pack to premium pack) but that also can pose issues if any updates are made prior to the upgrade."
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2020-02-07 11:21:54",
    "text": "Thanks for the clarity <@U22PWJ41G>…. I actually didn’t consider the upgrade situation, frankly.\n\nLargely, I’d expect that if an single asset is purchased the directory structure it is in reflect the label of the single asset (template).\n\nFor example… Instead of being in a top-level folder called “CLEAN_6_Landing_Page_Pack”  the folder name would take the name of the template “CLEAN_6_LP_Opt_1_Video”\n\nNot a huge concern like I said. Just pointing it out as I’ve had a few customers mention the confusion around the redundancy."
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2020-02-07 11:44:01",
    "text": "Just to confirm that I’m following; in your mind there would be a parent folder for each template?"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2020-02-07 12:51:07",
    "text": "<@U22PWJ41G> Yes, but only for single template purcahases.  However, I can see that being potentially unideal as well if multiple single templates were purchased."
  }
]