[
  {
    "poster": {
      "poster_name": "Ace Hedger",
      "poster_handle": "ace"
    },
    "time_stamp": "2025-01-27 07:30:24",
    "edited": {
      "time_stamp": "2025-01-27 09:01:21"
    },
    "text": "Hello!\nI'm trying to use the avatar image for a contact in a ui extension. I read somewhere is is hs_avatar_filemanager_key. Is this correct? If so, how do I form the URL? Or do I need to use something like the file manager API?"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2025-01-27 09:52:45",
    "text": "Hello Annie, thank you for reporting this. We are looking into the issue."
  },
  {
    "poster": {
      "poster_name": "Ryan Huff",
      "poster_handle": "ryan687"
    },
    "time_stamp": "2025-01-27 10:57:09",
    "text": "Booking!"
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2025-01-27 12:21:02",
    "text": "<@U04AWEE4J10> Sorry for this! We've identified the issue, <https://github.com/vitejs/vite/pull/19249|there was a bug merged into vite> last week, and we use vite behind the scenes to handle the local dev updates. We are going to release a new version of the CLI that pins the local dev commands to the previous version of vite."
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2025-01-27 12:29:09",
    "edited": {
      "time_stamp": "2025-01-28 15:44:11"
    },
    "text": "*Update:* Per the message below, this should be resolved!\n\n:warning: ~We've identified a bug that breaks the \"hot reloading\" feature when using `hs project dev`. The bug was <https://github.com/vitejs/vite/pull/19249|merged into vite> last week, and we rely on <https://vite.dev/|vite> behind the scenes to handle the local dev updates, so if you've recently upgraded or downgraded your CLI you might experience this issue.~\n\n~We're releasing an updated version of the CLI today that fixes this issue by pinning our CLI to the previous version of vite, before the bug was introduced, and I will update this message once that's complete!~\n\n*Important notes:*\n1. This only affects what you see when running `hs project dev` , this does not affect existing deployed extensions in any way\n2. This only broke the \"hot reloading\" feature of local development. If you reload the page after making changes locally, everything still works.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-27 12:29:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2025-01-27 12:29:26",
    "text": "Thanks to <@U04AWEE4J10> for helping us troubleshoot this problem!"
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2025-01-27 12:30:10",
    "text": "Moving this to its own top-level thread: <https://HubSpotdev.slack.com/archives/C05R599UA12/p1738006149929349>\n\nThanks for helping us understand the impact of this issue on your local dev experience <@U04AWEE4J10>!"
  },
  {
    "poster": {
      "poster_name": "Annie Short",
      "poster_handle": "annie.short"
    },
    "time_stamp": "2025-01-27 12:31:28",
    "text": "Thank you so much for figuring this out so quickly! Glad I was able to help out!"
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2025-01-27 16:54:32",
    "text": "The only other thing I wanted tp call out on this Annie, is while this is definitely annoying, it won't actually prevent you from shipping anything, You'll just need to fall back to the (slower, more annoying, but workable) workflow where you reload the page to see your changes. It's only the live-reload functionality that isn't working today.\n\nWe've got a fix in the works: <https://github.com/HubSpot/HubSpot-cli/pull/1358>\nBut I want to make sure you're not blocked from shipping anything!"
  }
]