[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-07-18 02:45:24",
    "text": "Thanks both for coming back to me with ideas!\n\nEssentially we have a large number of deals and tickets created each day, and we want to add specific association labels to them when anything changes.\nDeal/ticket creation is one way to do trigger it, but of course it doesn't catch those ones where a contact or company is added later.\n\nAlot of our workflows are based on association label so that scheduled emails can go to, for example, one contact with 'XYZ' label on a deal that has 3 contacts associated to it.\n\nWe also add labels to tickets and companies associated to deals as well so we can see the 'type' of association, without having to track 10 different pipelines as the pipeline stages are the same but it needs to be labelled differently.\n\nThe webhook on association changes of course worked perfectly for this because i didn't need any additional fields or workflows so i'm sad i can't use it, but i'll have a look at these suggestions as I think i can make use of both ideas! Thankyou! :star:"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-07-18 06:59:36",
    "text": "<@U065R73V8SY> Just wanted to thank-you, as i've set a test up and this is exactly how I can recreate what I want!"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-07-18 07:01:05",
    "text": "<@U06H94JKK1P> i know :wink:\n\nhaha no worries happy to help! :slightly_smiling_face: if you need any help feel free to reach out! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Darrian Bagley",
      "poster_handle": "darrianbagley"
    },
    "time_stamp": "2024-07-18 13:04:23",
    "text": "The Country targeting option on Chatflows isn't working. Even when every country selected in the targeting, the Chatflow doesn't appear. Country targeting on CTAs is working as expected. I created a developer sandbox to confirm it wasn't related to my account settings and the bug occurs there as well.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-19 09:30:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rohit Kansal",
      "poster_handle": "rohit362"
    },
    "time_stamp": "2024-07-18 13:05:47",
    "text": "Hi everyone, I am trying to use the new Sequences API (Beta) but I get the following error...\n{\n    “status”: “error”,\n    “message”: “The scope needed for this API call isn’t available for public use. If you have questions, contact support or post in our developer forum.“,\n    “correlationId”: “*******************************“,\n    “links”: {\n        “support”: “<https://help.HubSpot.com/>”,\n        “forum”: “<https://community.HubSpot.com/t5/APIs-Integrations/bd-p/integrations>”\n    },\n    “category”: “MISSING_SCOPES”\n}",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-19 10:09:40"
      }
    ]
  }
]