[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-02 09:33:24",
    "text": "YEah, I’m sorry I haven’t attempted to do this — I’m not sure what is going on here and why a timeout is happening."
  },
  {
    "text": "Hi guys,\nI just got operations hub recently and wanted to run their premade custom coded workflow to merge duplicate contacts using phone numbers, but when i tested the workflow im getting this error, does anyone here know how to fix this?\nthanks.",
    "time_stamp": "2024-07-02 09:47:40",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-02 09:52:36"
      },
      {
        "time_stamp": "2024-07-02 09:56:19"
      },
      {
        "time_stamp": "2024-07-02 09:59:43"
      },
      {
        "time_stamp": "2024-07-02 10:07:27"
      },
      {
        "time_stamp": "2024-07-02 10:15:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Cameron Harro",
      "poster_handle": "cameron420"
    },
    "time_stamp": "2024-07-02 09:48:50",
    "text": "Hey <@U0773U84NBZ>, don’t know if you already sorted this out, but my guess is that your inputField type is “STATIC_VALUE”,  which will take the label of the given property or properties and convert them to a string before sending them to your endpoint. I’m not 100% sure, but I think that if you used “OBJECT_PROPERTY” as your inputField type, you would get the date in milliseconds, which is what HubSpot uses internally to store date values. Once you have that number, it should be easy enough to parse it into whatever format you want."
  },
  {
    "poster": {
      "poster_name": "Cameron Harro",
      "poster_handle": "cameron420"
    },
    "time_stamp": "2024-07-02 09:52:36",
    "text": "Hi <@U06DSUHSAMS>, we’d have to see the code itself to help, but my first guess is an issue around authentication or scopes in your private app."
  },
  {
    "text": "this is the code, its from their premade custom coded workflows i didnt make any changes to it because the description was exactly what i needed from it",
    "time_stamp": "2024-07-02 09:56:19"
  },
  {
    "poster": {
      "poster_name": "Cameron Harro",
      "poster_handle": "cameron420"
    },
    "time_stamp": "2024-07-02 09:59:43",
    "text": "Did you follow the directions in lines 8-14 exactly? Looks like you left “YOUR_PRIVATE_APP_ACCESS_TOKEN” as-is."
  },
  {
    "poster": {
      "poster_name": "Mohammad Anas",
      "poster_handle": "mohammadanas81"
    },
    "time_stamp": "2024-07-02 10:07:27",
    "text": "what needs to be put in here?"
  },
  {
    "text": "In order for your code to be able to make requests to HubSpot, you need to create a Private App and use its authentication token in your code.\n\nHere’s a knowledge base article on Private Apps in general, which will help you create an app and access its secret: <https://developers.HubSpot.com/docs/api/private-apps>\n\nOnce that’s done, you need to add the app’s secret to your code using the dropdown menu in the picture below.\n\nOnce that’s done, you’ll be able to access the value in the code as an environment variable using “process.env.YOUR_PRIVATE_APP_ACCESS_TOKEN”, where “YOUR_PRIVATE_APP_ACCESS_TOKEN” should be replaced with whatever Secret Name you choose.",
    "time_stamp": "2024-07-02 10:15:48"
  }
]