[
  {
    "text": "Are you saying these kind of toolbars are missing in your editor when using chrome?",
    "time_stamp": "2021-06-11 11:15:47"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-11 11:19:03",
    "text": "If so, we’ve seen this be reported before, but have never been able to reproduce it. We suspect it’s related to custom fonts overriding the fonts we have on the page. Do you happen to be using any different fonts on the page in question?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-06-11 12:53:05",
    "edited": {
      "time_stamp": "2021-06-11 13:09:45"
    },
    "text": "I don't really see a feedback channel, so I think this is the most relevant area? But it would be nice if we could easily add class(es) (and or id) to individual sections, modules, columns, and rows. Possibly an *Advanced Options* section like you have for CTAs on each of the sections, modules, columns, and rows.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-06-11 13:06:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-11 13:06:11",
    "text": "Historically our fear has been CSS classes on layout fragments that have selectors that target child nodes would scare marketers when, for example, they start moving / adding / deleting things inside of a dnd area, and then the styles substantially change in a way they don’t understand (because, you know, CSS). We _might_ start relaxing that a bit with some new stuff we are cooking up, with the big caveat being “please, please, PLEASE only use classes on a chunk of layout if it’s resilient to underlaying markup changing as things get dragged / dropped edited”."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-06-11 14:38:47",
    "text": "I also wonder if there is a browser extension as the common denominator"
  }
]