[
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-16 07:49:36",
    "text": "I’ve got a fix on the way, the main gist is there is some code that waits around and makes sure our custom fonts are loaded inside of the preview iframe, and for some reason, in some cases, the promise that determines whether or not the fonts have loaded never resolves. My fix is basically “if we can’t detect our fonts loaded within 5 seconds, just show the toolbars anyway”. So your toolbars _might_ look a little off compared to screenshots you see (maybe a different font?), but they should still atleast show (after a small delay) and be functional."
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-16 07:49:45",
    "text": "working on getting it deployed to prod today for you"
  },
  {
    "poster": {
      "poster_name": "Rashid Rehman",
      "poster_handle": "rrehman"
    },
    "time_stamp": "2021-06-16 08:54:10",
    "text": "Thank you Brian! Appreciate it"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-16 10:35:32",
    "text": "<@U01AZBWH71U> can you try refreshing the editor and seeing if it works now? Just remember there is a delay of 5 seconds before we say “lets just load the toolbars without the fonts”."
  },
  {
    "poster": {
      "poster_name": "Rashid Rehman",
      "poster_handle": "rrehman"
    },
    "time_stamp": "2021-06-16 10:41:21",
    "text": "Yes, it's working now! the toolbars are loading now after 5 seconds"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-16 10:59:13",
    "text": ":thumbsup:"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-06-16 11:00:17",
    "text": "Yeah something is up with fonts somewhere. I’m wondering if it’s system based (since the font doesn’t appear to load in the parent frame editor app either, based on your autosave text), as it doesn’t exclusively appear to be CSS based. Either way, it’s super hard to reproduce the _root_ cause, but hopefully this will atleast make it workable for you."
  },
  {
    "poster": {
      "poster_name": "Rashid Rehman",
      "poster_handle": "rrehman"
    },
    "time_stamp": "2021-06-16 11:14:42",
    "text": "yes, this helps a lot. I have been having this issue for months now on Chrome. I was editing pages on Firefox till a couple of weeks ago when it stopped working there too and then moved to Edge which stopped working this week :sweat_smile:"
  }
]