[
  {
    "poster": {
      "poster_name": "Kobe Kapoor",
      "poster_handle": "kobe"
    },
    "time_stamp": "2023-04-16 19:10:37",
    "text": "Anyone think its possible to use this in other areas of HubSpot?\n<https://knowledge.HubSpot.com/connected-email/automatically-populate-contact-properties-with-HubSpot-ai>\nLike in messenger conversations?",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-04-17 08:56:58"
      },
      {
        "time_stamp": "2023-04-17 08:57:22"
      },
      {
        "time_stamp": "2023-04-17 08:57:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kobe Kapoor",
      "poster_handle": "kobe"
    },
    "time_stamp": "2023-04-16 21:58:28",
    "text": "Struggling right now with a massive issue to properly attribute facebook messenger conversations to a HubSpot conversation in the inbox.\n\nWe have paid ads running, someone will click the ad to message us, and the first message is treated as a “form” that HubSpot uses to create a new contact, with its proper attribution.\n\nBut then when they continue messaging us, it comes up in our HS inbox and creates a new contact with none of the original data from Facebook.\n\nHas anyone found a way around this? My two options are so far…\n\n*Custom code to combine the two contacts (Done, but not great)*\nI created a custom workflow that combines the two contacts if they have the same first/last name and also that they had a conversion happen within a few hours. Its working well actually, but I am only nervous of the situation that comes up where 2 people might message us at the same time with the same name.\n\n*Webhook from Facebook - Don’t know how to achieve this*\nThe form submission contact gets the Facebook inbox ID. So I can use that as a unique identifier. But the contact that is created from the conversation in HubSpot does not have any unique information like that to identify which contact it should merge with.\nMy idea in principle is to have facebook send a webhook to HubSpot with the conversation ID to a new contact that was created in the last 30 seconds and with the same name. It would still technically be the same issue as the option above but it would significantly reduce the margin for two people with the same name messaging us.\n\nIf you feel that its not so likely and I should just not bother, remember this account I have gets nearly 50 enquiries a day on messenger. It has happened already to us before.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-17 08:58:57"
      },
      {
        "time_stamp": "2023-04-20 05:16:25"
      },
      {
        "time_stamp": "2023-04-20 05:16:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mike Eastwood",
      "poster_handle": "mike330"
    },
    "time_stamp": "2023-04-17 00:43:10",
    "text": "Thank you, thank you, thank you Zack!"
  },
  {
    "poster": {
      "poster_name": "Mike Eastwood",
      "poster_handle": "mike330"
    },
    "time_stamp": "2023-04-17 00:43:19",
    "text": "I was pulling my hair out"
  }
]