[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2017-09-18 09:18:42",
    "text": "<@U4W2EG8RY> this is a known and in progress point here. At this time, you will simply have to use the `html` attribute of a HubL module as opposed using blog syntax for default content. I will do my best to keep you posted on this progress!"
  },
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2017-09-18 09:19:48",
    "text": "Cool, <@U6W3H6YN8>! Thanks for clarifying :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2017-09-18 09:20:54",
    "text": "Sure thing! Thanks for voicing the use case <@U4W2EG8RY>!"
  },
  {
    "poster": {
      "poster_name": "Andrew Rogers",
      "poster_handle": "andrewrogers"
    },
    "time_stamp": "2017-09-18 09:43:07",
    "text": "Here is HubSpot's Response:"
  },
  {
    "poster": {
      "poster_name": "Andrew Rogers",
      "poster_handle": "andrewrogers"
    },
    "time_stamp": "2017-09-18 09:43:08",
    "text": "Hello Andrew,\n\nThanks for your patience regarding this matter! You are correct - in order for the template to publish, we must convert the contact property token Signing Bonus that is a string to become an Integer, however using the filter is yielding 0 instead of 1028. After digging into this with the team, I have confirmed that this is because it is currently not possible to apply certain HubL functions such as the int filter to a contact or company property token in emails. This is something the team is aware of and taking measured strides towards improving, but we currently do not have a short term fix for you. In light of this, the division functionality you are trying to implement in this email template is not currently possible. Let me know if there is anything I can clarify about this for you, and I'll be happy to help when I'm back in the office on Monday!\n\nRegards,\n\nClare"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2017-09-18 09:47:14",
    "edited": {
      "time_stamp": "2017-09-18 09:47:34"
    },
    "text": "interesting. One last idea you might've already tried, could you assign an additional variable to the value of that tag, then put the filter on that? something like: {% set dummyVar = contact.signing_bonus %} {{ dummyVar|int }}\n\nThat might log the value \"as is\" to the variable, then let you operate on it without the code that may be attached to the contact object."
  }
]