[
  {
    "poster": {
      "poster_name": "Arjun Mahindru",
      "poster_handle": "arjun.mahindru"
    },
    "time_stamp": "2021-12-06 02:37:04",
    "text": "Hey guys,\nIs someone using <https://app.HubSpot.com/ecosystem/8105018/marketplace/apps/marketing/analytics-data/tableau|Tableau Integration> by <http://datawarehouse.io|datawarehouse.io>? I have a couple of quick questions and would love to talk to someone using this tool :)"
  },
  {
    "time_stamp": "2021-12-06 08:00:38",
    "text": "Reminder: Did you know you can message <@U02162GK9SP|sprocky> at any time to get HubSpot development questions answered? It’s an experimental chat bot built to tackle developer questions. It won’t read your code, but can answer a lot of questions about building on the HubSpot platform."
  },
  {
    "poster": {
      "poster_name": "Darío Rocha",
      "poster_handle": "dario.rocha"
    },
    "time_stamp": "2021-12-06 10:46:31",
    "text": "Hi, I wonder if we can add a form submission preview confirmation pop-up window when a contact clicks submit and then add another button inside the pop-up that actually submits the data once it’s been reviewed.\n\nHas any of you worked on something similar?"
  },
  {
    "poster": {
      "poster_name": "Nick Ostreim",
      "poster_handle": "nick149"
    },
    "time_stamp": "2021-12-06 15:07:26",
    "text": "Hello,\n\nI am updating my app's scopes per a recent email regarding the `contacts` scope. That email states HubSpot will deprecate the `contacts` scope in favor of more granular scopes.\n\nRight now, if I replace the `contacts` scope with the generated scopes from the \"Install Url (OAuth)\" section, I see the following error when attempting to authenticate:\n\n```Insufficient scopes were provided. Please contact the app developer.```\nHowever, if I include the `contacts` scope along with my granular `crm.` scopes then I can authenticate.\n\nIs it ok to leave the `contacts` scope in place? Or if I leave it in place, will authentication break when HubSpot deprecates the `contacts` scope?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-12-07 02:08:57"
      },
      {
        "time_stamp": "2022-02-24 12:51:06"
      },
      {
        "time_stamp": "2022-03-03 00:19:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Augus Zou",
      "poster_handle": "augus"
    },
    "time_stamp": "2021-12-06 20:50:52",
    "edited": {
      "time_stamp": "2021-12-06 20:52:15"
    },
    "text": "Hi,\nI have a integration issue about timeline.\njust created a HubSpot timeline event assciated a contact by email.  but I can not find it in this contact page.\nthe timeline event created successfully after checked it by api.\n\nso anything I missed? or where I can find the timeline event"
  }
]