[
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2021-12-21 12:01:48",
    "text": ":wave: Hey folks! Anyone have any luck exporting an experience from Ceros and hosting it on HubSpot?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-21 13:19:17"
      },
      {
        "time_stamp": "2021-12-21 13:46:16"
      },
      {
        "time_stamp": "2021-12-21 14:08:31"
      },
      {
        "time_stamp": "2021-12-21 14:15:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-21 13:19:17",
    "edited": {
      "time_stamp": "2021-12-21 13:19:55"
    },
    "text": ":wave-yeti: Hey Zog, I don’t have experience with Ceros but it appears from their website and knowledgebase there’s no way to direct export pages or “experiences”, or at least it’s not documented if there is.\n\nDepending on how complicated the part is that you’re trying to migrate I would consider using the chrome inspector to remove all of the elements from the page that you don’t want to migrate. Then “save as” within chrome to save the assets that are left in the page to your computer.\n\nThen it’s a matter of identifying what HTML CSS and JS is actually related to the HTML you’re copying over. Cut out any excess, and either turn the rest into modules or templates based on your needs."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2021-12-21 13:46:16",
    "text": ":corgi-wave: Hi Jon! There’s a tiny *tiny* bit of documentation on it <https://www.ceros.com/educate/help_center/export-and-host-ceros-experience-on-your-own-server/|here>, but you’re right- it’s not much, and it’s full of relative paths to the assets (which the CMS just loves :sweat_smile:)\n\nI’ve got all those paths updated, and no console errors, but still a blank page. Figured this slack would be my last shot before I throw the files elsewhere and iframe it in :shrug:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-21 14:08:31",
    "edited": {
      "time_stamp": "2021-12-21 14:08:53"
    },
    "text": "I completely failed to find that doc.\n\n1. It looks like you’d need to upload the media folder to the HS file manager. \n2. Create a semi-blank HTML + HubL template (just the required includes). Paste in the HTML that was exported\n3. manually get the links for all of the images and swap them in the template\n4. do the same for CSS and JS files but store them in the developer file system.\n5. Implement jQuery (not sure what version, tried checking the Ceros website but their own site appears to be built on WordPress not Ceros, so it may not use the same version). I would just check the HTML file you exported and cmd+f to find it in the code and swap it.\n\nAll in all it’s a bit of work but it sounds doable. The iframe bit they talk about comes off strange. I think they do that just to say “hey if you have other stylesheets and JavaScript on the page it could make it look funky”.\n\nWish ya luck."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2021-12-21 14:15:30",
    "text": "Thanks Jon! I appreciate the insight (and luck!)"
  }
]