[
  {
    "poster": {
      "poster_name": "arati",
      "poster_handle": "desai"
    },
    "time_stamp": "2024-07-24 02:17:29",
    "edited": {
      "time_stamp": "2024-07-24 02:19:35"
    },
    "text": "Hi Everyone , i want to minify the Css in HubSpot website ,how i can do it? how to solved the issues like -Reduce page layout shifts,Reduce how long the page is blocked from responding to user input; Improve page loading time.please tell which code can be used.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-24 02:29:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-24 02:29:08",
    "text": "Hi <@U078STA2BL0>,\nHubSpot minifies all CSS files that are stored in your theme/design-manager automatically. There's no need to minify them manually\n<https://developers.HubSpot.com/beta-docs/guides/cms/content/performance/overview#javascript-and-css-minification>\n\nSomething that might be interesting too: <https://developers.HubSpot.com/beta-docs/guides/cms/content/performance/speed>"
  },
  {
    "poster": {
      "poster_name": "User155",
      "poster_handle": "guste"
    },
    "time_stamp": "2024-07-24 03:10:44",
    "text": "Hi everyone, I'm new to the HubSpot Slack. My team is developing an app, and we have a question that I could not locate in the forums.\nWe want the tool to be available to other users, so we are going forward with the *app* option.\n\n*Can anyone clarify, is it possible to build an integration of another tool (\"XY\") within the HubSport CRM user interface?*\n\nFor example, I am in the Company CRM page within HubSpot. I then launch the XY app (without leaving that page), call our API, get enriched data, and the same Company CRM page gets refreshed with new data/properties.\n\nIs this possible at all? Or does the user have to leave the HubSpot CRM, go to the \"X\" platform, do all the actions there, and then all new information gets pushed to HubSpot?\n\nI'd appreciate any guidance on this, or if you've seen any similar apps/tools that did it.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-24 18:58:56"
      },
      {
        "time_stamp": "2024-07-24 23:15:42"
      },
      {
        "time_stamp": "2024-07-25 05:20:12"
      },
      {
        "time_stamp": "2024-07-25 05:20:29"
      },
      {
        "time_stamp": "2024-07-25 05:20:39"
      },
      {
        "time_stamp": "2024-07-31 03:31:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-24 18:58:56",
    "text": "Hi, our team developed a custom card that integrated with another system. It had values that could be updated in HubSpot and pushed to the other system. In theory, it should also work that those properties also get updated in the HubSpot record."
  },
  {
    "text": "Hi <@U03AKL6Q1B2> thanks so much for the quick response! Am I correct that your custom card popped up within HubSpot?",
    "time_stamp": "2024-07-24 23:15:42"
  }
]