[
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-08-16 02:27:46",
    "text": "Hey everyone,\n\nJust following up on my previous post regarding the issue with tracking Google and Facebook leads after the recent API shift. We haven't received any feedback yet and would really appreciate your insights or suggestions on how to resolve this. Has anyone else faced similar issues or found a workaround?\n\nThanks in advance for your help!"
  },
  {
    "poster": {
      "poster_name": "Syed Jazil Ali",
      "poster_handle": "syedjazilali0"
    },
    "time_stamp": "2024-08-16 07:43:59",
    "text": "Hi everyone,\nI'm building a bot using the Conversations API, and I'm facing an issue with quick replies. When I send quick replies using the API (`<https://api.hubapi.com/conversations/v3/conversations/threads/${threadId}/messages>`), the user can't type in the chat, even though I've set the `allowUserInput` property to `true` in the attachments. Has anyone encountered this before, or know how to enable both quick replies and text input simultaneously?\nThanks in advance for any help!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-16 08:36:24"
      },
      {
        "time_stamp": "2024-08-16 09:04:24"
      },
      {
        "time_stamp": "2024-08-20 07:31:09"
      },
      {
        "time_stamp": "2024-08-22 00:04:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-08-16 08:36:24",
    "edited": {
      "time_stamp": "2024-08-16 08:37:48"
    },
    "text": "Hi Syed,\n\nAre you getting any responses to your API service? For example, do you see the allowUserInput property as being registered in the payload?\n\nIf not, please note that allowUserInput needs to be inside of the attachment object where you want to allow user input.\n\nAn example of this is:\n\n\n``` {\n      \"type\": \"quick_reply\",\n      \"quickReply\": {\n        \"options\": [\n          {\n            \"text\": \"Option 1\",\n            \"payload\": \"option_1\"\n          },\n          {\n            \"text\": \"Option 2\",\n            \"payload\": \"option_2\"\n          }\n        ],\n        \"allowUserInput\": true\n      }```\nIf not, please try making this adjustment and seeing if it works. This is something I struggled with for some time and tried a couple dozen fixes for but in the end it was just my placement of the tag! :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Syed Jazil Ali",
      "poster_handle": "syedjazilali0"
    },
    "time_stamp": "2024-08-16 09:04:24",
    "text": "Hi Michael,\n\nThanks for your response! Yes, I am receiving responses from my API, but for some reason, the allowUserInput property is still being registered as false in that. Here’s the payload I’m sending:\n```{\n            type: \"MESSAGE\",\n            text: botMessage,\n            senderActorId: senderActorId,\n            channelId: channelId,\n            channelAccountId: channelAccountId,\n            attachments: [\n                {\n                    type: \"QUICK_REPLIES\",\n                    quickReplies: [\n                        {\n                            label: \"Yes\",\n                            value: \"Yes\",\n                            valueType: \"TEXT\"\n                        },\n                        {\n                            label: \"No\",\n                            value: \"No\",\n                            valueType: \"TEXT\"\n                        },\n                       \n                    ],\n                    allowUserInput: true,  \n                    allowMultiSelect: false\n                },\n\n            ],\n        };```\nIt seems like everything should be correct, but I'm still encountering this issue. Any ideas on what might be going wrong? I appreciate your help!"
  },
  {
    "poster": {
      "poster_name": "Eric Hirsh",
      "poster_handle": "ehirsh"
    },
    "time_stamp": "2024-08-16 10:51:40",
    "edited": {
      "time_stamp": "2024-08-16 10:53:48"
    },
    "text": "hi <@U07HBAD6K16> can't share more precise timelines yet but public beta is coming soon, like weeks, not months.\n\nThe reason you don't see it as an option to 'request beta' in the Product Updates section right now is that I have it hidden, instead was bringing in one private beta participant at a time. That cohort is full and we are so close to public beta.\n\nGenerally, connecting another live chat channel (besides HubSpot's own live chat product) via this API is a strong use case. That said, HubSpot already has its own routing engine (can do things like agent availability, skills based routing, etc), and there is not currently an API that would let you know whether it is 'worth it' to pass a new incoming conversation to HubSpot or not."
  },
  {
    "text": "Hello! Has anyone noticed unexpected behavior while creating line items via API from an existing product using hs_product_id in the post body? It was working normally yesterday, but now any time an item is attempted to be added, this error is returned even if there is a price set for the original product item.",
    "time_stamp": "2024-08-16 11:15:03"
  },
  {
    "text": "Same error here.\nAnd my account has the *Automation/Sequence* access. My user is a super admin, able to create/edit Sequences from the HS portal, but is getting this `missing_scope` error.",
    "subtype": "thread_broadcast",
    "time_stamp": "2024-08-16 12:50:13"
  },
  {
    "text": "Just FYI, my access token has `automation` scope.",
    "time_stamp": "2024-08-16 12:57:32"
  },
  {
    "poster": {
      "poster_name": "Victor Barros",
      "poster_handle": "victor387"
    },
    "time_stamp": "2024-08-16 13:07:34",
    "text": "Pulling this thread to <#C076YMWHZQS|automation-workflows-api-beta>"
  }
]