[
  {
    "poster": {
      "poster_name": "Abhinav Srivastava",
      "poster_handle": "abhinav.srivastava1"
    },
    "time_stamp": "2024-08-26 01:27:23",
    "text": "Hey everyone, I want to fetch all data of custom object  please let me know if any api available for this without limit at one go"
  },
  {
    "poster": {
      "poster_name": "Dirk van der Giesen",
      "poster_handle": "dvandergiesen"
    },
    "time_stamp": "2024-08-26 02:41:29",
    "text": "Reply from HubSpot :slightly_smiling_face:\n\n\"global search results refers to showing in up global search, it does not have any affect on CrmSearch. To update the default search properties, the customer can patch the object schema for that custom object. The documentation for updating the object schema is here: [<https://developers.HubSpot.com/docs/api/crm/crm-custom-objects><https://developers.HubSpot.com/docs/api/crm/crm-custom-objects.|.>] What they should update is \"searchableProperties\".\""
  },
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-08-26 02:53:28",
    "text": "Hey everyone,\n\nJust following up on my previous post regarding the issue with tracking Google and Facebook leads after the recent API shift. We haven't received any feedback yet and would really appreciate your insights or suggestions on how to resolve this. Has anyone else faced similar issues or found a workaround?\n\nThanks in advance for your help!"
  },
  {
    "poster": {
      "poster_name": "Mika Roethlisberger",
      "poster_handle": "mika.roethlisberger"
    },
    "time_stamp": "2024-08-26 06:06:24",
    "edited": {
      "time_stamp": "2024-08-26 06:08:26"
    },
    "text": "Hello Everyone,\nI'm experimenting with APIs and want to Export a List from HubSpot. But when I try to execute the Code (made with the CRM API | Exports Endpoints from the docs), I get the Error:\n\"*Fatal error*: Uncaught Error: Class \"HubSpot\\Client\\Crm\\Exports\\Export\\Async\\Model\\PublicExportRequest\" not found in...\"\n\nI am wondering why this Path isn't found or how I could change that, because it isn't my directory, it's supposed to be from the HubSpot directory, yet I can't find it. I am wondering if I am missing something simple..\nI would be very grateful for any help I could get on how to fix this error / get it to work."
  },
  {
    "poster": {
      "poster_name": "Whoo",
      "poster_handle": "dominique796"
    },
    "time_stamp": "2024-08-26 08:04:36",
    "text": "Is it a good or a wrong way to retrieve the tracking pixel ?"
  },
  {
    "poster": {
      "poster_name": "Fredrikke Eriksson",
      "poster_handle": "fredrikke.eriksson"
    },
    "time_stamp": "2024-08-26 08:34:59",
    "text": "Hi All!! Anyone familiar with an HubSpot API that allows for a migration of content from WebFlow? Prob a better explaination: I want to migrate all of my content in Webflow to HubSpot Content Hub :smile: Does anyone know how?"
  },
  {
    "text": "Hello all,\n\nWhenever I post to the engagements communications API to log an SMS it works, _with one exception._ As you can see below, it is showing as \"unknown user\" when I post. I'm not seeing anything in the documentation that can set this, am I stuck with logging SMS as an Unknown User or is there a property I can set with my request? Thanks in advance",
    "time_stamp": "2024-08-26 09:27:42",
    "edited": {
      "time_stamp": "2024-08-26 09:28:27"
    }
  },
  {
    "poster": {
      "poster_name": "Jhovenell Manait",
      "poster_handle": "jhov"
    },
    "time_stamp": "2024-08-26 09:27:51",
    "text": "Good day, anyone knows if there are retry headers in 429 errors?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-26 09:31:20"
      },
      {
        "time_stamp": "2024-08-26 17:21:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Broomell",
      "poster_handle": "mark407"
    },
    "time_stamp": "2024-08-26 09:31:20",
    "text": "I don't believe so - the current docs are pointing back to <https://legacydocs.HubSpot.com/docs/faq/working-within-the-HubSpot-api-rate-limits> which seems to only give information around running out of requests."
  },
  {
    "poster": {
      "poster_name": "Steve Hinojosa",
      "poster_handle": "hinojosa"
    },
    "time_stamp": "2024-08-26 09:37:55",
    "text": "We received an email that states that we need to migrate our integrations to the new API. From v2 Owners API to the new*<https://protect-us.mimecast.com/s/d4SeC8290LtjQJjgClw-KQ?domain=8-04.na1.HubSpotlinks.com| v3 Owners API>*. I don't have a proper understanding of how this works, so I will need to outsource this to someone else on our team.\n\nDoes anyone know about how long this takes to complete? I wanted to give them an idea of how much time it might require from them.\n\nLet me know if you need more information from me to assist."
  },
  {
    "text": "GM all!\nanyone knows if there are some endpoint to get these sales metrics?",
    "time_stamp": "2024-08-26 09:42:07"
  },
  {
    "poster": {
      "poster_name": "Ievgen Gavrylenko",
      "poster_handle": "ieg"
    },
    "time_stamp": "2024-08-26 10:33:13",
    "text": "It works now, thank you for your answer!"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-08-26 11:21:38",
    "text": "Am I missing something there. API endpoint.\n1. Create an draft email in portal (POST*`/marketing/v3/emails/`* )\n2. In portal, publish the email.\n3. In Code, create a updated “draft” version because of a changes (PATCH*`/marketing/v3/emails/{emailId}/draft`* )\n4. Then I try to publish the change with POST*`/marketing/v3/emails/{emailId}/publish`* but the SCOPE changed on that call to transactional-email or marketing-email (which are BOTH Marketing Enterprise only).\nAny reason why we can’t update an email from a draft state automatically?"
  },
  {
    "poster": {
      "poster_name": "Justin Dearing",
      "poster_handle": "justin.dearing"
    },
    "time_stamp": "2024-08-26 12:40:03",
    "text": "Hello!\nDoes anyone know how I can get custom property values when making a GET request to a custom crm object from my HubSpot account? Currently Im receiving the default HubSpot properties such as hs_object_id and \"createdAt\" but im not seeing any of my custom properties on these objects",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-26 12:53:03"
      },
      {
        "time_stamp": "2024-08-26 12:58:40"
      },
      {
        "time_stamp": "2024-08-26 13:00:10"
      },
      {
        "time_stamp": "2024-08-26 13:02:44"
      },
      {
        "time_stamp": "2024-08-26 13:03:25"
      },
      {
        "time_stamp": "2024-08-26 13:06:36"
      },
      {
        "time_stamp": "2024-08-26 13:07:08"
      },
      {
        "time_stamp": "2024-08-26 13:12:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Dearing",
      "poster_handle": "justin.dearing"
    },
    "time_stamp": "2024-08-26 12:53:03",
    "text": "Update. While I didnt figure out a way to get all properties, you can append ?properties={property_internal_name} to add specific properties to the request. Leaving my question up for visibility to others with this issue."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-08-26 12:58:40",
    "text": "Can you post your code here without the API Key?"
  },
  {
    "text": "It's only in a Bruno/Postman request rn but I'll send that",
    "time_stamp": "2024-08-26 13:00:10"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-08-26 13:02:44",
    "text": "Sounds like you figured it out.  Are you trying to get all properties or just a few?"
  },
  {
    "poster": {
      "poster_name": "Justin Dearing",
      "poster_handle": "justin.dearing"
    },
    "time_stamp": "2024-08-26 13:03:25",
    "text": "Was trying to get all. Thought it was odd that it doesnt grab custom properties by default, especially if the value is present on the object"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-08-26 13:06:36",
    "text": "The API will default to the bare minimum fields in the initial response.\n\nDepending on your use case, you'll want to only fetch the fields you need.\n\nIf you do in fact need all the properties, you'll need to specify all of them in the request.\n\nWhat I suggest is to first get all the properties on the custom object.  You can use the /properties endpoint (<https://developers.HubSpot.com/beta-docs/reference/api/crm/properties>)"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-08-26 13:07:08",
    "text": "Next you could construct your GET request dynamically"
  },
  {
    "poster": {
      "poster_name": "Justin Dearing",
      "poster_handle": "justin.dearing"
    },
    "time_stamp": "2024-08-26 13:12:44",
    "text": "Gotcha gotcha, yeah thats a neat idea. Thanks for sharing :]"
  },
  {
    "poster": {
      "poster_name": "Tyler Smith",
      "poster_handle": "tyler505"
    },
    "time_stamp": "2024-08-26 16:57:17",
    "text": "Hey everyone! I am trying to determine whether I need to use the API for this or if we can get away with using Segment's \"HubSpot Web Actions\" service.\n\nWe're trying to automate the syncing process from our web app to Segment to HubSpot via the \"Upsert Contact\" (HubSpot Web Actions) service. Here's there docs on this: <https://segment.com/docs/connections/destinations/catalog/actions-HubSpot-web/#upsert-contact>, but it's not working.. Is there a way to add that new contact to a company? We are passing the \"Company Name\" but nothing is updating in HubSpot. I see the identify call come into Segment from our app but nothing updates in HubSpot and I have no visibility into why that call isn't working. My guess is it's because \"Upsert Contact\" only gives us a \"Company Name\" field and not a \"Company ID\" field, so it can't successfully complete the \"Upsert Contact\" call from Segment to HubSpot.\n\nI was told we may not be able to use Segment's HubSpot Web Actions and have to directly call HubSpot's API's, but I want to make sure that is actually the case before we build out our own HubSpot API service.\n\nFor more context, we service K-12 teachers. So for instance, if a teacher from ABC School in NYC joins and we have never had a teacher from that school before, then we want to create a company titled \"ABC School, NYC\" and then associate that teacher with this newly created company. The next teacher that signs up from ABC School, NYC will be linked to that Company that is already existing.\n\nThanks in advance for your help!"
  },
  {
    "poster": {
      "poster_name": "Jhovenell Manait",
      "poster_handle": "jhov"
    },
    "time_stamp": "2024-08-26 17:21:44",
    "text": "Thought so too, thanks <@U06FWG1RNEA>"
  },
  {
    "poster": {
      "poster_name": "yingyu",
      "poster_handle": "yingyu"
    },
    "time_stamp": "2024-08-26 20:23:50",
    "edited": {
      "time_stamp": "2024-08-26 21:12:03"
    },
    "text": "Hello!\n\nHow can I know the line items of a invoice through API?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-27 08:33:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Abhinav Srivastava",
      "poster_handle": "abhinav.srivastava1"
    },
    "time_stamp": "2024-08-26 23:57:47",
    "text": "Hey everyone, I want to fetch all data of custom object  please let me know if any api available for this without limit at one go",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-27 13:15:24"
      }
    ]
  }
]