[
  {
    "poster": {
      "poster_name": "Takuya Hashimoto",
      "poster_handle": "takuya.hashimoto"
    },
    "time_stamp": "2024-08-01 01:05:09",
    "edited": {
      "time_stamp": "2024-08-01 01:07:53"
    },
    "text": "Hi Everyone,\n\nI am looking for Endpoint for Sending Message and Checking Agent Availability, Initialising Conversations.\nwhich our clients in Japan, wants to integrate our API and HubSpot with livechat.\n\nSo,to seamlessly integrate our <http://CM.com|CM.com> live chat widget with HubSpot, we need all the necessary endpoints that facilitate communication between our live chat system and HubSpot's agents and users.\n\nThis integration is crucial for providing a smooth and efficient interaction between customers and agent. However, we have encountered several significant issues in achieving this goal due to gaps in HubSpot's official documentation of below mentioned endpoints.\n\n1. No Endpoints for Sending Messages:\n  - The official HubSpot documentation does not provide endpoints for sending messages from customers to agents.\n  - This absence creates a significant gap in functionality, making it impossible to enable direct communication between customers and agents through our live chat product.\n\n2. No Endpoints for Checking Agent Availability:\n  - There are no documented endpoints for checking agent availability in HubSpot.\n  - Without this information, our system cannot accurately determine if an agent is available to respond to a customer.\n\n3. Missing Endpoint for Initialising Conversations:\n  - To create a new conversation from our live chat product, we require an endpoint to initialise the conversation, which is not documented.\n  - This endpoint is essential for starting a new interaction between a customer and an agent. The absence of this endpoint hinders the ability to initiate new conversations from our system\n\nIf you can allow and support to see those Endpoint, it would be great.\n\nThanks\nTakuya"
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2024-08-01 01:36:44",
    "text": "I am a HubSpot Specialist and platinum partner. I have already developed a couple of HubSpot Marketplace Apps and worked with API for several clients. Please check your DM."
  },
  {
    "poster": {
      "poster_name": "EL ALMI Taha",
      "poster_handle": "taha.el-almi"
    },
    "time_stamp": "2024-08-01 03:02:49",
    "text": "I'm trying to load forms via the HubSpot API, but the forms are not complete and don't look the same as when I export them via CSV. Below are the endpoints I'm using: # Define the URL for the form submissions endpoint form_id = 'xxxxxxxxxxxxxxxxxxxxxxxxxxx'  # my form ID url = f'<https://api.hubapi.com/form-integrations/v1/submissions/forms/{form_id}>' token = '********************'  # my token, Despite using this script, the forms data retrieved via the API doesn't match the data from the CSV export. Does anyone know why this discrepancy is happening and how to resolve it?"
  },
  {
    "poster": {
      "poster_name": "Michal Wezykowski",
      "poster_handle": "michal.wezykowski"
    },
    "time_stamp": "2024-08-01 06:10:39",
    "edited": {
      "time_stamp": "2024-08-01 06:12:36"
    },
    "text": "<@U07F1C4SVPB> \nI see my mistake, the utk value is not surfaced in available properties. The only way to get contacts using it is through v1 endpoint. You can use v1 endpoint on V3 PHP library using a not wrapped endpoint: <https://github.com/HubSpot/HubSpot-api-php?tab=readme-ov-file#not-wrapped-endpoints|https://github.com/HubSpot/HubSpot-api-php?tab=readme-ov-file#not-wrapped-endpoints>"
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2024-08-01 06:15:41",
    "text": "Thank you <@U03RH7UPPDJ>. That was what my peers suggested, getting the Subject standardized in sequences, for example.\n\nI though of something else: reading the Contact info and getting the Sequence properties from the Contact.\n\nThen, comparing the Sequence Dates (Contact record) against the Email dates it's possible to deduct if the email was sent from a sequence or not.\n\nI'm just confirming now if it is possible to manually email a Contact when it's enrolled in a sequence. If it is not possible, the deduction can be pretty accurate."
  },
  {
    "poster": {
      "poster_name": "Monica",
      "poster_handle": "monica.sears"
    },
    "time_stamp": "2024-08-01 07:42:41",
    "edited": {
      "time_stamp": "2024-08-01 07:43:47"
    },
    "text": "I would like to get form submissions by source via the api, but I only get formViews, submissionsPerFormView, submissions, nonContactSubmissions, etc. using https://api.hubapi.com/analytics/v2/reports/forms/daily"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-08-01 08:08:07",
    "text": "As explained above this voilates CORS policy. You need to make this request from the back end not the front end.\n\nThe reason behind CORS being a thing and why APIs restrict this (these are items I mention don’t include all reasons)—\n• exposing part 1 exposing your api key in the front end is a no no. You using your api key here would allow any website visitor to explore developer tools and gain access to your HubSpot api key. \n•  exposing part 2  bad actors could use that api key to do anything that your api key has scoped. at minimum they could overwrite your hubdb table or delete it with the scope you are attempting here. Many developers (not limited to new developers) just check all the scope boxes. So this would create a huge security risk for data in HubSpot\nCORS prevents other websites from using this and setting up something similar as well —"
  },
  {
    "poster": {
      "poster_name": "Anand Kumar",
      "poster_handle": "anand"
    },
    "time_stamp": "2024-08-01 08:10:30",
    "text": "Could you please provide any example code  for  upload csv becasue in HubSpot doc there are not example provided"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-08-01 08:16:07",
    "text": "your code is likely correct, but you need ot make the code happen on a serverless function or in some backend code"
  },
  {
    "poster": {
      "poster_name": "Anand Kumar",
      "poster_handle": "anand"
    },
    "time_stamp": "2024-08-01 08:21:07",
    "text": "Sure <@U25PYL3Q8>\nThanks"
  },
  {
    "poster": {
      "poster_name": "Harpreet Bhatia",
      "poster_handle": "posttoharpreet"
    },
    "time_stamp": "2024-08-01 09:00:09",
    "text": "OK, let me give it a try and get back to you."
  },
  {
    "poster": {
      "poster_name": "Harpreet Bhatia",
      "poster_handle": "posttoharpreet"
    },
    "time_stamp": "2024-08-01 09:07:28",
    "text": "Nope, still same error."
  },
  {
    "text": "Hi. I'm trying to do this and it won't let me select a back date any more. Very frustrating.",
    "time_stamp": "2024-08-01 11:49:12"
  },
  {
    "poster": {
      "poster_name": "Leonardo Gonzalez",
      "poster_handle": "leonardo572"
    },
    "time_stamp": "2024-08-01 12:53:54",
    "text": "There's a new API available for Communications, I was in doubt, Communications is now an object? And I already collected the data regarding the Communication Messages Logged (WhatsApp and Linkedin) but I need the Associations between those messages and the Deals and Contacts they refer to, I tried with these two endpoints:\n• url = f\"<https://api.hubapi.com/crm/v4/associations/{object_from}/{object_to}/batch/read>\"\n• url = f\"<https://api.hubapi.com/crm/v4/objects/communications/{object_id}/associations/{association_type}>\"\nI already tested the second method, but for simplification of the code I was trying to implement using the first API, it's possible?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-02 06:05:38"
      }
    ]
  },
  {
    "text": "hmmm, weird, This is on one of my test portals - it still lets me do that.  The only days greyed out are previous and next month.  But those days appear fine when navigating back and forth with the arrows.",
    "time_stamp": "2024-08-01 13:17:50",
    "edited": {
      "time_stamp": "2024-08-01 13:18:08"
    }
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-08-01 13:18:56",
    "text": "i figured it out. You have to acutally go to the edit post screen, and click on the publish button in the top right there. If you do it from the blog list screen it won't work"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-08-01 13:19:15",
    "text": "ahhh, glad you got it"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-08-01 13:19:44",
    "text": "it should work both ways but oh well."
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2024-08-01 14:47:58",
    "edited": {
      "time_stamp": "2024-08-01 17:30:09"
    },
    "text": "Hi partners/dev- I am stuck in a SFdC and HubSpot back and forth with support. A client integration was working with reps seeing visual force data in lighting for months just fine, the CTO did a MS email update for security in June- the last 30 days only admin users in SFdC can see the visual force data- we have tried everything - and I think it’s a SFdC issue or an issue where the CTO needs to white list HubSpot or something now that they did that security but SFdC support is saying call HubSpot support which is no help. Any ideas? Anyone else do a ms outlook update recently that somehow this happened??happy to send a Starbucks gift card for ideas!"
  },
  {
    "poster": {
      "poster_name": "Mary Song",
      "poster_handle": "mary705"
    },
    "time_stamp": "2024-08-01 15:28:26",
    "text": "Hi,  I'm new to HubSpot APIs. Do you plan to have java client SDK soon?"
  },
  {
    "poster": {
      "poster_name": "Mary Song",
      "poster_handle": "mary705"
    },
    "time_stamp": "2024-08-01 15:29:25",
    "text": "Please help to point me to your swagger (yml files) on APIs related with company, contacts, payment and their associations."
  },
  {
    "poster": {
      "poster_name": "Alex Ratiu",
      "poster_handle": "alex.ratiu"
    },
    "time_stamp": "2024-08-01 16:10:04",
    "edited": {
      "time_stamp": "2024-08-01 16:10:37"
    },
    "text": "Hello,\n\nI'm trying to associate a team (custom object) with a contact. However, I'm encountering an issue with the association property in the create method:\n\nHow can an association be established between a custom object and a team?\n\n```const team = await client.crm.objects.basicApi.create('teams', {\n      properties: {\n          [HubSpot_TEAM_ID_PROPERTY_NAME]: unique_team_id,\n      },\n      associations: [\n          {\n              types: [\n                  {\n                      associationCategory: AssociationSpecAssociationCategoryEnum.UserDefined,\n                      association: AssociationTypes.companyToContact,\n                  },\n              ],\n          },\n      ],\n  });```\nor\n\n```await client.crm.associations.v4.basicApi.create(\n      'teams',\n      unique_team_id,\n      'contacts',\n      userId.toString(),\n      [\n          {\n              associationCategory: AssociationSpecAssociationCategoryEnum.UserDefined,\n              associationTypeId: AssociationTypes.companyToContact,\n          },\n      ],\n  );\n  ```\n`associationTypeId: AssociationTypes.companyToContact,` I don't know what should be here in this situation.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-02 04:05:02"
      },
      {
        "time_stamp": "2024-08-02 11:44:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Janosch Franke",
      "poster_handle": "jfranke"
    },
    "time_stamp": "2024-08-02 00:02:38",
    "text": "Good morning <@U25PYL3Q8>\nThanks for your reply. I will try it."
  },
  {
    "poster": {
      "poster_name": "Janosch Franke",
      "poster_handle": "jfranke"
    },
    "time_stamp": "2024-08-02 00:35:56",
    "text": "<@U25PYL3Q8> How can I get the email order as you said? <mailto:email1@domain.com|email1@domain.com>;<mailto:email2@domain.com|email2@domain.com>\nWhich API Call should I make to get it and which one to update?"
  }
]