[
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-08-05 03:34:38",
    "text": "Hi everyone,\n\nI hope you are doing well. We need assistance with an issue that has come up after we transitioned from using Hapikey (v2 version) to a Private App (v3 version) for our API calls. Since this change, we've had trouble tracking Google and Facebook leads in our HubSpot contacts list.\n\nPreviously, using [specific code], tracking for Google contacts worked correctly with the v2 version. However, after switching to the v3 version, the tracking no longer differentiates properly between Google and Facebook leads. Instead, [specific code] seems to aggregate contacts from both sources under a single filter in the HubSpot contacts list, specifically under the \"Original source drill-down 2\" filter option.\n\nCould you help us resolve this issue so that we can correctly track and differentiate leads coming from Google and Facebook separately, as we did before?\n\nYour prompt attention to this matter would be greatly appreciated.\n\nThank you in advance for your help and support.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-08 02:40:07"
      },
      {
        "time_stamp": "2024-08-16 02:27:46"
      }
    ]
  },
  {
    "text": "It seems like a unknown oauth scope (crm.objects.partner-accounts.read) prevents development apps from authentication at all - anyone else experiencing this or have a solution?\n\nThe scope it not in the documentation or avaliable to select in my app settings.",
    "time_stamp": "2024-08-05 03:38:43",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-09 18:11:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mauro Assano",
      "poster_handle": "massano"
    },
    "time_stamp": "2024-08-05 07:20:20",
    "text": "Hi all! Good morning!\n\nI'm trying to export the email task data, to integrate with another CRM, but all fields email HTML are mistakenly formatted when exported through the email read API. For some reason, JSON objects in Python misinterpret the HTML code in the field.\n\nAnyone had similar experience and found a simple way to address this issue?\n\nThanks,\n\nMauro."
  },
  {
    "poster": {
      "poster_name": "Mauro Assano",
      "poster_handle": "massano"
    },
    "time_stamp": "2024-08-05 07:22:13",
    "text": "If the contact already exists (which seems to be the case), you should use PATCH. If you will only read the contact contents, you should use GET.\n\nPOST is just in case if you will create a new contact, and in such case, the URL you are using, does not make sense."
  },
  {
    "poster": {
      "poster_name": "Chris Simoni",
      "poster_handle": "chris.s9606"
    },
    "time_stamp": "2024-08-05 11:29:18",
    "text": "I have an integration that needs these OAuth scopes. For some accounts I am getting an insufficient permission error when trying to authorize the accounts. How can I enable all these scopes using permission sets? I suspect the schema ones are the issue.\n\n• crm.lists.read\n• crm.lists.write\n• crm.objects.contacts.read\n• crm.objects.contacts.write\n• crm.schemas.contacts.read\n• crm.schemas.contacts.write\n"
  },
  {
    "poster": {
      "poster_name": "Tan Mahmud",
      "poster_handle": "tan"
    },
    "time_stamp": "2024-08-05 12:08:37",
    "text": "Hi team! I'm finding that communication-preferences/v3/status/email is returning SUBSCRIBED for cases where it should return NOT_SPECIFIED (i.e, contact has not opted in or out of this subscription type). Is there a way to fix this?"
  },
  {
    "poster": {
      "poster_name": "Casimiro Betancourt",
      "poster_handle": "casimiro.betancourt"
    },
    "time_stamp": "2024-08-05 14:13:55",
    "text": "Hello! Does anyone here have any experience working with custom timeline events and if they are able to work with custom objects?"
  },
  {
    "text": "Hey guys! I need your help :homealone:\nI am trying to connect an external partner app with my HubSpot account, the idea is to have that partner getting new contacts that would then come into my account through an integration.\n\nI created a private app to get the API key to hand it out, and they want to transfer the contacts through a CVS file, so they are requesting a \"*URL where the file needs to be posted\"* (screenshot bellow)\n\nDoes anyone have any idea of what URL might they mean or where can I get it from? I am a bit lost and not very proficient when it comes to integrations :grumpycat:\nThanks in advance :sparkles:",
    "time_stamp": "2024-08-05 16:49:26",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-06 04:11:06"
      }
    ]
  },
  {
    "text": "Anyone know how to find the user's locale?",
    "time_stamp": "2024-08-05 22:27:49"
  }
]