[
  {
    "text": "Thank you <@UJAPS2K4N>! I added the CSS directly inside the module and updated the for loop to what you suggested. For some reason, the icon now just doesn't show, even though the icon is called the exact same way, though there is a gap where it should be.  On top is the original and below is the new for loop.\n\nFrom what I can tell with inspect, it also seems like the path that holds the font icon is out of place.",
    "time_stamp": "2024-11-14 06:54:32",
    "edited": {
      "time_stamp": "2024-11-14 07:03:05"
    }
  },
  {
    "text": "",
    "time_stamp": "2024-11-14 06:55:38"
  },
  {
    "poster": {
      "poster_name": "Tanya Scales",
      "poster_handle": "tscales"
    },
    "time_stamp": "2024-11-14 08:54:32",
    "edited": {
      "time_stamp": "2024-11-14 08:54:40"
    },
    "text": ":wave: I have a beta release of up for the current working tarball (0.3.2)— Seeing some adjustments I’d like to make still to the overall output in subsequent version update, but tests were passing on it and running locally is also working on my end. Would love to see if it is as expected on your side so that I can use this version as a working milestone and keep iterating on a couple things.\n\nLet me know! No rush and no obligation"
  },
  {
    "poster": {
      "poster_name": "Pat Pope",
      "poster_handle": "patrick.pope847"
    },
    "time_stamp": "2024-11-14 12:33:37",
    "edited": {
      "time_stamp": "2024-11-14 12:35:24"
    },
    "text": "Hey all, I am working on a resource page that combines blogs, HubDB tables, and now products,  and the data is being normalized.\n\nHowever, I can't seem to find the table id for the products table.\n\nWhere can I find the products table id, or how can I access the products table so I can include the products data to be normalized?\n\nAlso, if there is a better channel to post this question in please LMK. Thanks.\n\nHere is the code that needs to be updated if it helps. I duplicated the testimonials HubDB table. I was going to swap out the testimonial info for products.\n\n```<!-- Fetch Products Rows -->\n{% set productsRows = hubdb_table_rows(PRODUCTS TABLE ID) %}\n  {% for product in productsRows %}\n  {% set contentItem = {\n  \"published_date\": content.publish_date,\n  \"meta_label\": '',\n  \"meta_name\": '',\n  \"content_type\": testimonial.content_type[0].name,\n  \"title\": testimonial.name,\n  \"position\": testimonial.description,\n  \"description\": testimonial.testimonial|striptags,\n  \"image\": testimonial.profile_pic.url,\n  \"request_path\": request.path,\n  \"url\": testimonial.hs_path,\n  \"tags_name\": testimonial.practice_area,\n  \"tags_label\": testimonial.practice_area,\n  \"custom_lp\": testimonial.clp_or_lp,\n  \"custom_lp_url\": testimonial.web_page_url,\n  } %}\n  {% do contentItems.append(contentItem) %}\n  {% endfor %}```"
  },
  {
    "poster": {
      "poster_name": "Tom Quinn",
      "poster_handle": "tquinn"
    },
    "time_stamp": "2024-11-14 13:24:25",
    "text": "Hard to say from the screenshot, but it looks like the icon isnt getting a width/height. Try adding a flex-basis to it like :\n```.icon-text__icon {\n      font-size: 2rem;\n      flex: 0 0 20px\n}```"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-14 14:25:04",
    "text": "This did the trick!\n\nFor some reason, the icon itself that I select in the module shows up differently in the template, and certain icons I select in the page just disappear. I'm guessing this has something to do with which icon packs are available, but I'm wondering if either of you have ever run into this before?"
  },
  {
    "poster": {
      "poster_name": "Tom Quinn",
      "poster_handle": "tquinn"
    },
    "time_stamp": "2024-11-14 14:27:39",
    "text": "you should only be able to select icons that are available. Without seeing it, Id guess it has something to do with the styling- but its hard to say without looking at it"
  },
  {
    "poster": {
      "poster_name": "Don Denton",
      "poster_handle": "don.denton"
    },
    "time_stamp": "2024-11-14 14:48:09",
    "text": "Seems to format things the same way as my fork, which is a win for me.\n\n(There are some bugs in this version that were also in previous versions, so I’ll let you know what those are… somewhere. In GH Issues? Here?)"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-14 14:56:10",
    "text": "I'm pretty sure it's because I changed the font awesome icon set in the icon field to the latest one :grimacing: It's all working now though!\n\nThank you both so much! This was driving me crazy"
  }
]