[
  {
    "poster": {
      "poster_name": "Dnyaneshwar Zukle",
      "poster_handle": "zukle855198"
    },
    "time_stamp": "2024-12-16 02:54:38",
    "text": "Hello everyone,\nI have blog posts in HubSpot that use tags, and the current URLs for tag-specific pages are structured like this:\n`<http://example.com/blog/tag/cloud|example.com/blog/tag/cloud>`\nI’d like to change the URL structure in one of the following ways:\n1. Replace the word *\"tag\"* with *\"topic\"* so it looks like this:\n2. `<http://example.com/blog/topic/cloud|example.com/blog/topic/cloud>`\n3. Alternatively, I’d like to remove *\"tag\"* or *\"topic\"* entirely from the URL, making it look like this:\n4. `<http://example.com/blog/cloud|example.com/blog/cloud>`\nIs it possible to achieve either of these in HubSpot? Any tips or solutions would be greatly appreciated"
  },
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2024-12-16 07:04:04",
    "text": "Am I correctly assuming that you can't simply publish workflows, Pipelines, other process setup from Sandbox to Production?\nDo I need to recreate everything manually again in Prod?",
    "reply_count": 5,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2024-12-16 08:19:56"
      },
      {
        "time_stamp": "2024-12-16 09:43:10"
      },
      {
        "time_stamp": "2024-12-16 12:40:35"
      },
      {
        "time_stamp": "2024-12-17 01:34:41"
      },
      {
        "time_stamp": "2024-12-21 17:58:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-12-16 08:19:56",
    "text": "Yes, you can push from production to sandbox but not the opposite (they basically created sandbox the opposite way people need to use it)"
  },
  {
    "poster": {
      "poster_name": "Jeff Bell - Level 4",
      "poster_handle": "jeffrey.bell"
    },
    "time_stamp": "2024-12-16 09:43:10",
    "text": "Yeah, it's a huge hole in the development cycle. Sandbox is basically a place to test stuff before building it (again) in production."
  },
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2024-12-16 12:40:35",
    "text": "Sandboxes PM here :slightly_smiling_face:\n\nIn the current iteration Sandboxes support the copying of supported assets from production to sandbox.\n\nThe future will include a way to copy supported assets from sandbox to production.\n\n<@U05UMKSJNQ0> - I'd love to connect with you to discuss your use case for workflows, pipelines. Would you be open to a feedback call?"
  },
  {
    "poster": {
      "poster_name": "Samantha Barnes",
      "poster_handle": "sam623"
    },
    "time_stamp": "2024-12-16 13:19:48",
    "text": "Hello hello! I am implementing a Bullhorn OSCP (open source career portal) into HubSpot. But when I upload it to the root directory in Design Manager, the file seems to get hung up in the CMS. Has anyone implemented bullhorn’s career portal before?"
  },
  {
    "poster": {
      "poster_name": "Yuan Tao Zhou",
      "poster_handle": "yzhou177"
    },
    "time_stamp": "2024-12-16 13:59:57",
    "text": "Hey guys! \nI am running into a problem with associating and logging meetings to my custom object. the setting to log meeting activities on but it doesn't seem to work. The meeting link is send through an email. The activity shows up on the contact but not on the custom object. The setting is working if I manually log a meeting in the crm. Any idea on why that's the case, or potential work around it would be great! Thanks"
  },
  {
    "poster": {
      "poster_name": "Viviana Cardenas",
      "poster_handle": "vcardenas"
    },
    "time_stamp": "2024-12-16 17:34:27",
    "text": "Hi team, I'm using the visitor identification API to ID users in the chat on an external webpage. The ID is working correctly except identified users do not have access to private knowledgebase articles in the article search bar. The Customer Portal and Knowledgebase Articles access control is set to SSO (Google SAML). Any advice on how to get this to work?"
  }
]