[
  {
    "poster": {
      "poster_name": "James Jordan",
      "poster_handle": "james681"
    },
    "time_stamp": "2024-12-22 14:24:40",
    "edited": {
      "time_stamp": "2024-12-22 14:25:30"
    },
    "text": "Hi All,\nI am looking to understand HubSpot marketplace apps best practices in relation to external SaaS architecture.\n\nI.E. my app has multiple functions and a lot of them involve\n\na. Calculations and data storage (non HS private data..more like math calculations and non standard reporting of data processing) that would be best done outside of HubSpot\nb. Dashboards and reporting that, again, would be much better outside of HS, and would be best with a dashboard and settings page external to HS.\nc. Some LLM operations that can only be executed and reported on outside of HS\nd. Instruction and help desk type operations that, again, would work best outside of HS\n\nSo...having installed a fair number of HS apps in my past all the ones I remember did one simple thing and then simply reported the data into HS where all other operations took place.\n\nSo my questions are:\n1. Are there any requirements for a HS Marketplace app to be solely managed from inside HS once installed?\n2. Is it fine to build a \"hybrid\" type app which updates HS but has a robust external SaaS interface. (No customer data will be exported)\n3. If this is possible, are there any guidelines, rules or best practices documentation that I can access on the web?\nThanks in advance for any information or wisdom on this topic. Thank you.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-22 14:27:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Jordan",
      "poster_handle": "james681"
    },
    "time_stamp": "2024-12-22 14:27:27",
    "edited": {
      "time_stamp": "2024-12-22 14:29:13"
    },
    "text": "I guess I CAN think of an example like this. QuickBooks executes operations inside of HS but reports on and sends data to the QB app.\n\nBut they are a huge organization and I am unsure of how tightly integrated with HS or what kind of approvals they had to get from very senior teams in HS.\n\nThat is why I am here to hopefully find someone at HS that knows the process and rules around this...so I don't develop something that can never be approved."
  }
]