[
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-12-02 07:49:30",
    "text": "i dont have an answer off the top of my head, but will ask around."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-12-02 10:11:25",
    "text": "Feedback from the team:\n&gt; No recent changes to bundle size here or anything. Only a few recent deploys that probably invalidated caches and causes slow downs as new versions were delivered."
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2024-12-02 17:00:24",
    "text": "Our client has their site built on Wix and are using Wix forms. Since we have a hotspot tracking code embedded onto the site it’s picking up those forms as non-HubSpot forms, which is fine except we can’t control the fields that are getting pulled in and where they’re getting mapped into, and it’s causing issues. If we delete the form on HubSpot and somebody submits a new response on the Wix side, is that going to bring back the form on HubSpot?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-02 17:28:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-12-02 17:28:35",
    "edited": {
      "time_stamp": "2024-12-02 17:28:56"
    },
    "text": "Hey <@U05S96AE2N8> if you have Non-HubSpot Forms set to on, then it will bring back the form into HubSpot when a new submission comes in.\n\nIf you go to the Submissions of the form, hover over one of the submissions and click \"View Submission\", a panel should show up on the right with all the fields captured on the Wix form. It will also show you the internal values of those fields(properties). If you want to map them to HubSpot properties you can create new properties with the Internal Values that you see in the submission.\n\nDoes that make sense? I have not done this with Wix, just with WordPress but I think it should be the same concept."
  },
  {
    "poster": {
      "poster_name": "Mackenly Jones",
      "poster_handle": "mackenly"
    },
    "time_stamp": "2024-12-02 21:05:28",
    "text": "Hello! Has anyone successfully created a Next.js site that utilized HubSpot CMS in a headless way? We don't want to be tied into the hosted HubSpot CMS ecosystem, but would like to utilize it for CRM, email, etc. and ideally wish that we could use it as a headless CMS with custom server rendered react components that integrate with HubSpot. Going through the docs and cert course and it is seeming increasingly less likely that this use case is supported.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-03 01:22:01"
      },
      {
        "time_stamp": "2024-12-03 09:43:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-12-03 00:53:51",
    "text": "Thanks <@UD53A9UUR>"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-12-03 00:57:23",
    "text": "Doesn’t seem to have bounced back (a high traffic site). Just a massive drop all around our HS sites, even with extreme detail to speed optimization (of what can be done with the platform).\n\nIf it’s not HS causing it, it is likely the service itself, but we see nothing new in regards to areas to optimize"
  }
]