[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-12-18 04:56:10",
    "text": "Hey all, Has anyone else been having intermittent issues the last week or so with the HubSpot backend not loading / being very slow?\nJust had another “brown out” in the office, it only seems to last a minute or so, but still annoying"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-12-18 08:11:41",
    "edited": {
      "time_stamp": "2024-12-18 08:28:21"
    },
    "text": "<@U08517U64RH> I think 100 is the max for the limit parameter - after that you have to use the paging to get more"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-12-18 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-12-18 13:45:43",
    "edited": {
      "time_stamp": "2024-12-18 13:46:27"
    },
    "text": "I have images linked to a CDN on AWS throughout 400 or so pages in HubSpot that I need to find and replace with HubSpot URLs. Is there any way to find and replace URLs in HubSpot? Or any way to search the content of pages to at least see what pages these old CDN image links are? Hoping to avoid opening each page and manually searching and replacing if I can help it. In WordPress I can install a plugin to find and replace URLs, easy peasy. If it matters, the site is behind a login."
  },
  {
    "text": "How can I get time on the x-axis for a social report? I’m looking for something like this but would like to have social channels for each area:",
    "time_stamp": "2024-12-18 14:12:20"
  },
  {
    "poster": {
      "poster_name": "Dev dev",
      "poster_handle": "devdivakar8"
    },
    "time_stamp": "2024-12-18 22:37:57",
    "text": "Hi Everyone!\nI have a question regarding attachments.\n\n*Subject*: Adding Attachments to Contacts via API Without Engagements\nHi Team,\nI have a question regarding adding attachments to a contact via the API:\n1. Is it possible to add an attachment directly to a contact (under the attachments section) *without creating an engagement* (like a Note)?\n2. If so, can the source of the attachment be customized to reflect my company’s name instead of a default or generic label?\n3. If We can not upload attachment without *engagement*, is there a way to customize the source to a custom source like my company name.\nI’d appreciate any guidance or documentation that can help with this use case.\nThanks in advance!"
  }
]