[
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-12-03 01:22:01",
    "text": "I'll never ever do that:\n• client won't be able to preview changes\n• you're unable to respond to any publish / update changes in the CMS (if you intended to go full static and needed to trigger a redeploy)\n• how are you supposed to build a page in the editor if you don't build a HubSpot theme that visually shows you the row / column system?\nThe list can go on, what I'll do instead (if you don't want to use HubSpot as a cms and want to go headless) is to build the website with any other headless CMS of your choice and just add HS tracking and HS forms"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-12-03 03:16:48",
    "text": "Just following up on this as we just tested some of our non-HubSpot sites with the thought that the pagetest tool itself had issues.\n\nWe see no change to our WP / Payload / Umbraco etc. sites, so I doubt it’s an issue with the service"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-12-03 07:10:09",
    "text": "thanks for the detailed response.  i will send this to the team"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-12-03 07:11:44",
    "text": "do you have a specific site that i can send to them as an example?  also, do you happen to have an old speed test to compare to :fingerscrossed:"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-12-03 07:11:59",
    "text": "Yes i’ll pm you a couple"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-12-03 07:12:08",
    "text": "perfect"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-12-03 07:19:15",
    "text": "Sent, fingers crossed that they are able to work something out :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Antonio Garcia",
      "poster_handle": "antoniogarcia.gt"
    },
    "time_stamp": "2024-12-03 07:28:24",
    "text": "Hey! I also have some recent data screenshots to share. I will DM you with the information <@UD53A9UUR>. Hope it helps!"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-12-03 09:00:06",
    "edited": {
      "time_stamp": "2024-12-03 09:00:24"
    }
  },
  {
    "poster": {
      "poster_name": "Mackenly Jones",
      "poster_handle": "mackenly"
    },
    "time_stamp": "2024-12-03 09:43:04",
    "text": "Thank you for your reply <@UV23JHEJY>. I was hoping that users could preview/build pages in the HubSpot visual editor as they went then save or publish changes that are picked up by the site. Meaning using the HubSpot CMS to design/create content islands (such as an easily editable section, page, or blog post), however, it seems that isn't an option. We would have wanted to go largely with an SSR approach where content from HubSpot would be cached and refetched after it was stale. While not really relevant to this, some headless CMS solutions allow you to fetch draft or preview pages such as by having a query parameter that's picked up and used to use the draft content, allowing for previews and most headless CMSs allow you to specify a webhook to trigger redeploys if using static.\n\nThank you for your thoughts. It does seem that just adding tracking and forms will be what we have to do. Thanks again!"
  }
]