[
  {
    "text": "Hello all!!! I am facing an issue while working on theme settings. I have made a setting to change body font and this is the is the value I have passed font-size: {{ body_font.size ~ body_font.size_unit }}; But it works only when default value is set. When I try changing the font size from theme settings editor the font-size value does not get applied. (screenshot attached). So to resolve this issue I used the code font-size: {{ body_font.size.value ~ body_font.size_unit }}; which actually worked for me when I changed the font size in theme settings editor. But when I reset the value it gives me a warning.(screenshot attached). Can anyone help me with this?",
    "time_stamp": "2021-06-28 01:22:14",
    "edited": {
      "time_stamp": "2021-06-28 01:23:39"
    }
  },
  {
    "poster": {
      "poster_name": "jjjuho",
      "poster_handle": "jjjum8o"
    },
    "time_stamp": "2021-06-28 04:43:56",
    "text": "thanks will do :+1:"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-06-28 08:58:10",
    "text": "<@U025EJ42PMF> latest version is here: <https://www.fasterbetter.dev/blog/setting-up-webpack-in-HubSpot> (still very much in progress)"
  },
  {
    "text": "Hello everyone, we are facing some issues with the styles that gets included in the final page. When we preview the page the settings for the colors look ok, but when we publish the page and preview it the button settings that gets included are of the other theme (We cloned an existing theme to keep the settings of the other). And also for some reason the border settings are not included even though I made sure I set it in the theme settings. I would appreciate a little help here it has been a little bit frustrating.",
    "time_stamp": "2021-06-28 10:23:31",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-06-28 12:37:30"
      },
      {
        "time_stamp": "2021-06-30 11:05:43"
      },
      {
        "time_stamp": "2021-06-30 11:07:56"
      },
      {
        "time_stamp": "2021-06-30 11:10:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-06-28 12:37:30",
    "text": "It would look like you aren’t properly referencing the hubl code. Can you show us what you have setup for the borders in your css?\n\nIf you cloned a theme it’s likely that there are still references in the head to stylesheets that were ported over. If youre wanting to remove them entirely you will have to hunt them down likely at the template layout level to see what is all being included"
  },
  {
    "poster": {
      "poster_name": "Pawan Kumar",
      "poster_handle": "pawanpepz"
    },
    "time_stamp": "2021-06-28 23:23:37",
    "text": "",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-06-29 09:09:43"
      },
      {
        "time_stamp": "2021-06-29 09:10:20"
      }
    ]
  }
]