[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2019-11-13 12:48:52",
    "text": "cc: <@U7TAZ6V2Q> I know you showcased something like this at partner day"
  },
  {
    "poster": {
      "poster_name": "Gary Wong",
      "poster_handle": "gary"
    },
    "time_stamp": "2019-11-13 15:15:23",
    "text": "Thanks for pinging me <@U3T21PDBK>! Hi <@UMGLMQLA0>! To do this, I recommend  leveraging a 3rd party tool to keep track of the submissions.  For example, Google Sheets or Airtable.  Upon submit, we can use Javascript to update the data in the Google Sheets table or Airtable (increment by one), then on the TY page, you would use Javascript to read the value.  This to me would be the easiest implementation."
  },
  {
    "poster": {
      "poster_name": "Caralyza",
      "poster_handle": "caralyza"
    },
    "time_stamp": "2019-11-13 15:21:58",
    "text": "I see appreciate the reply guys !!that makes sense.I was also thinking of something along the lines of using a HUBL variable to spit out a 'list size' but doesn't seem possible.- bec there's no supported variable for list meta info.  This solution means that a HubSpot form submission will go out to a google sheet and come back to HubSpot for use. Have you implemented something like this before?"
  },
  {
    "text": "Hello, I'd like to understand how to add an image to a rich text field in the new email editor, or how to create a smart module that can update both the text and an image. The new rich text field editor seems to be missing the \"insert image\" option which was available in the older editor ... -&gt; see next screenshot.",
    "time_stamp": "2019-11-13 17:38:55"
  },
  {
    "text": "Here is the old email editor where you could add an image into a rich text field associated with a smart module rules.",
    "time_stamp": "2019-11-13 17:40:43"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-11-13 19:22:41",
    "text": "Your problem is you are using the drag and drop editor. You have to use the image module"
  },
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-11-13 21:10:58",
    "text": "<@U38EZFVFE> the image module doesn't give me the smart option"
  }
]