[
  {
    "poster": {
      "poster_name": "Thorlak Fink",
      "poster_handle": "thorlak.fink"
    },
    "time_stamp": "2024-02-28 04:53:37",
    "text": "Hi\nIs there an action in workflows what can help me check if a number in the phone property is exactly 8 digits and not starting with \"+\" or \"00\"?\n\nBackground info:\n- The workflow will help format all phone numbers in the same way.\n- In Denmark all phone numbers are 8 digits (not counting country code)\n- The country code is +45\n--- Sometimes the country code is written as 0045\n- Most of our customers are danish, but we do have customers from other countries as well, so my workflow solution must accommodate that also.\n\nThe solution I have in mind\n• Branch check if a phone number is starting with + or 00 :white_check_mark: \n• Branch check if a phone number is 8 digits. :point_left: How do I do that?  \n• Transform the phone number depending on the above results. :white_check_mark: \nAny feedback on approach and how to solve the middle step is much appreciated.\n\nKind regards,\nThorlak",
    "reply_count": 6,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-02-28 11:26:50"
      },
      {
        "time_stamp": "2024-02-28 11:30:13"
      },
      {
        "time_stamp": "2024-02-29 01:37:31"
      },
      {
        "time_stamp": "2024-02-29 06:58:17"
      },
      {
        "time_stamp": "2024-03-02 17:08:24"
      },
      {
        "time_stamp": "2024-03-08 08:59:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2024-02-28 06:47:53",
    "text": ":wave: Hi Ryan, if you have thoughts or feedback for us surrounding the unenrollment feature (or any future versions of the feature) drop me a line. I’m the technical lead of the team that supports the feature and would love to hear your thoughts"
  },
  {
    "text": "If you don't want to involve custom code, your 'in mind' solution is likely the best way to manage it.",
    "time_stamp": "2024-02-28 11:26:50"
  },
  {
    "poster": {
      "poster_name": "Jacob Davis",
      "poster_handle": "jdavis"
    },
    "time_stamp": "2024-02-28 11:30:13",
    "text": "If you want to format the numbers with custom code, you've a pretty good example available: <https://www.HubSpot.com/programmable-automation-use-cases?offer=format-international-phone-numbers>"
  }
]