[
  {
    "poster": {
      "poster_name": "Carlsson Elkins",
      "poster_handle": "carlsson.e"
    },
    "time_stamp": "2024-02-26 02:24:34",
    "text": "Hello <@U0695UMTM2M>, sorry, I really don't want to rush/hassle you as I super appreciate the help you're giving! But I just wondered if you had any more ideas on our challenge? :slightly_smiling_face: Very many thanks again for your help!"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-26 03:28:58",
    "text": "Thanks Justin! So i'm actually not using a private app for this as it's just sending data to a 3rd party API, and then receiving response data and putting it back into HubSpot. Therefore there are no logs to review... I can check the events on the workflow but there is no mention of how long it is taking.\n\nI have separated it out now and it appears to have fixed the issue though - I just worry that if HubSpot has a funny 5 there is no way to branch off on the ones that will retry, and I can't re-enrol a contact part way through a workflow so I may need to create another back-up workflow to re-enrol contacts into if something does go wrong, just to finish off those final steps."
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2024-02-26 04:47:01",
    "edited": {
      "time_stamp": "2024-02-26 04:47:08"
    },
    "text": "I was using parseInt for now but this might be a different solution as well, thanks!\nThe problem is still there though, really expect an int at least to come back instead of a string :D"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-02-26 08:14:37",
    "text": "Yes that happens. If you ever pull in Selection or Dropdown fields, you will get the interval value, not the name value. That was initially confusing to me!"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-02-26 17:02:59",
    "text": "Hi Carlsson, Sorry I was out of office a bit last week and Ive been digging out today. I am happy to keep helping you with this, just give me a bit to dig out and I’ll be able to do so! One question I had: Do you think its okay to add this stuff as a “Note” activity? Who would you want the owner to be? Thank you!"
  }
]