[
  {
    "poster": {
      "poster_name": "Aqsa Qayyum",
      "poster_handle": "aqsa"
    },
    "time_stamp": "2024-02-14 03:52:00",
    "text": "Hey Everyone,\nI have implemented the authentication with my HubSpot application. Now I want to set some values as *global variables* against based on the response of the authentication API. How can I achieve this thing ? As based on auth token user will be able to watch his stored data in the custom actions forms."
  },
  {
    "poster": {
      "poster_name": "Eric Fiori",
      "poster_handle": "ericf"
    },
    "time_stamp": "2024-02-14 10:31:16",
    "text": "Is it possible to synchronize workflow execution? They appear to run in parallel and that's causing issues when updating the same record...",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-02-14 11:13:51"
      },
      {
        "time_stamp": "2024-02-18 04:16:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-02-14 10:46:13",
    "text": "Hi Gabriel, Do you have the zip code presently stored on your company records today?"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-02-14 10:46:56",
    "text": "And do you want it for all company records, do you want this when a user makes an action / needs the data?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-02-14 11:13:51",
    "text": "I don't think so - but I am interested in what others have to say if that is possible."
  },
  {
    "text": "I've got a weird issue with last message sent to visitor.  I'm trying to replicate the Zendesk \"Pending\" switch feature. The weird thing, is this flag which should be working, and does work on most tickets, doesn't work on some. I'm 100% confident on a particular ticket, the last message received was in fact from the support team. But the status is still \"True.\"\n\nDoes anyone what's happening behind the scenes for this calculation? They do CC each other on tickets, and this one has some of those. But that shouldn't categorize one of their team members as an visitor.\n\nThe other weird thing, is the calculation ran at 1:57, but the latest emails are at 3:21. Not 1:57. So it's like the calculation didn't run.",
    "time_stamp": "2024-02-14 11:15:44",
    "edited": {
      "time_stamp": "2024-02-14 11:21:27"
    }
  },
  {
    "text": "",
    "time_stamp": "2024-02-14 11:21:29"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-02-14 13:46:11",
    "text": "You can go into the private app you’re using to get the result and I Believe that the HTTP traffic will show you the response body, which may help."
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-02-14 13:46:48",
    "text": "What language is your action written in? I can try to give you the syntax in either python or js for printing the response body to your workflow test response log."
  }
]