[
  {
    "poster": {
      "poster_name": "Bram van den Bemt",
      "poster_handle": "bram403"
    },
    "time_stamp": "2024-02-08 01:10:53",
    "text": "Hi, for the new help desk, only contacts are associated automatically. However, we would like to have the company that is associated to the contact also to be automatically added to the ticket. Does anyone know whether this would be possible via a custom coded workflow and if so, could someone point me in the right direction for a start?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-02-08 08:58:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andrew Smeallie",
      "poster_handle": "andrew431"
    },
    "time_stamp": "2024-02-08 04:53:36",
    "text": "`I've created a workflow for tickets that copies data to their associated company, i want to make sure each company has the latest ticket information, can I promise that with bulk enrollment?`\n\n<@U04FYBV18UE> - No, not with the setup you've described.\n\nIf you were to use a *company-based workflow* and then add an additional data source to the \"copy property value\" action, you'll see there's more options for selecting _which_ ticket to pull the information from since it assumes there's a 1:MANY relationship.\n\n\"Most Recently Updated\" feels like the option you are looking for, but still might not guarantee with 100% accuracy that the specific fields you are looking for get copied over exactly as planned.\n\nThe thread below has some more info on this idea.\n\n<https://HubSpotdev.slack.com/archives/C019VT42R8X/p1706651808793059>"
  },
  {
    "poster": {
      "poster_name": "Aviv Kasuto",
      "poster_handle": "aviv211"
    },
    "time_stamp": "2024-02-08 05:01:41",
    "text": "got it, thanks!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-08 08:58:25",
    "text": "there should be settings for ticket creation on what is assocated"
  }
]