[
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-02-13 02:43:30",
    "text": "Hey everyone!\nDoes someone have an easy solution (codebased) for solving a branch which has to incoporate multiple checkboxes?\nIts 31 different outcomes so it would be 31 to the power of 31 or?\n\nThe different branch should then send a Email to recipient A and contain the values which were checked off.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-02-17 13:50:56"
      },
      {
        "time_stamp": "2024-02-21 03:23:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Eric Fiori",
      "poster_handle": "ericf"
    },
    "time_stamp": "2024-02-13 08:26:29",
    "text": "Is it possible to check if the output of a custom code step is known or unknown?",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-02-13 09:22:28"
      },
      {
        "time_stamp": "2024-02-13 09:28:36"
      },
      {
        "time_stamp": "2024-02-13 09:33:03"
      },
      {
        "time_stamp": "2024-02-13 09:52:59"
      },
      {
        "time_stamp": "2024-02-13 10:03:47"
      },
      {
        "time_stamp": "2024-02-13 11:28:33"
      },
      {
        "time_stamp": "2024-02-13 11:36:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-13 09:22:28",
    "text": "I have something basic like this set up in probably not the 'best' way, but an easy to understand way.I save the output value to a specific property, and then branch the workflow after the customer code based on if that property is known or unknown.\n\nYou could also use an if/else statement on the response?\n\nSomeone else may be along with a better idea though :)"
  },
  {
    "poster": {
      "poster_name": "Eric Fiori",
      "poster_handle": "ericf"
    },
    "time_stamp": "2024-02-13 09:28:36",
    "text": "Interesting, so do you have one specific property setup for each possible output of the custom code?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-13 09:33:03",
    "text": "It depends what you are looking to achieve, but my example is very basic and only relies on whether an output value is known or unknown as a result of the custom code - so it will copy the output to one property and then branch if that is known or unknown/blank.\n\nIf you only have a few possibilities then branching could work, albeit not a very sophisticated way to do it. An If/Else statement in javascript could work better for you on if a value is null or not. But i'm unsure what it is specifically you are looking to do with the output/how many outputs you do. If you provide a bit more detail either myself or someone else may have a better suggestion? :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Eric Fiori",
      "poster_handle": "ericf"
    },
    "time_stamp": "2024-02-13 09:52:59",
    "text": "Thanks, so basically I have a bit of custom code that has a set of outputs and inputs. There's some steps after the custom code that do a 'copy property value' from the custom code  to, in this example, the corresponding field in the contact. So for example I have first name, last name, company name, address, etc as inputs and the same as outputs, the custom code runs to modify those values as needed and the subsequent 'copy property value' ensures that the output of the custom code is assigned to the contact fields.\nThe issue is, I have discovered that not all inputs are provided all the time. I might get just first name and last name, so I just output those two values to the output.\nMy goal is to try and make the steps that follow the workflow check to see if those output values are defined (known) and then run the 'copy property value' if so, but it doesn't look like there's a way to check custom code output fields in this way..."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-13 10:03:47",
    "text": "hmmm. I would probably not kick off the workflow until all those values are known but that may not be an option for you.\n\nYou could always do something like this, i've just added a console.log so you can see where each if/else goes - but you can then make the appropriate code in relevant if/else sections based on the value being known or not?\n\nIt might not solve your problem fully though - in which case i do hope someone else will have a better suggestion for you!\n\n```const value = getValue(); // Get the value from somewhere\n\nif (typeof value !== 'undefined') {\n    console.log(\"Value is known:\", value);\n} else {\n    console.log(\"Value is unknown\");\n}```"
  },
  {
    "poster": {
      "poster_name": "Eric Fiori",
      "poster_handle": "ericf"
    },
    "time_stamp": "2024-02-13 11:28:33",
    "text": "Yeah, I think my problem is a bit different - really what it comes down to is the custom code isn't always getting all the defined input values so I don't pass them back to prevent subsequent 'copy property value' workflow steps from overwriting existing values. I really just want to check the output of the custom code to verify a value is present in the output before doing the 'copy property value' for each possible output... Thanks!"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-02-13 11:36:20",
    "text": "I would use the test function - when you have the workflow custom code window open, it's at the bottom.  You can then see the real output from the test right there.  I use this all the time and it definitely helps troubleshoot your output."
  }
]