[
  {
    "poster": {
      "poster_name": "Chris Kieran",
      "poster_handle": "ckieran"
    },
    "time_stamp": "2019-08-13 08:54:58",
    "text": "Hi folks, I've built an html email template (templatename.html) and have created a skeleton 3 column module. I understand how I embed fields into my module, but how do I embed the module into my code? The examples I am finding are using a GUI to drag and drop but as mentioned my template is html. Could someone help me with the code I need to embed my module in my html email template ?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-08-13 10:26:56"
      },
      {
        "time_stamp": "2019-08-13 11:37:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2019-08-13 09:52:33",
    "text": "Thanks Kamal! I did see that, but I am thinking more than that. The pages themselves should contain modules needed for the functions of that page, but inherit the base structure of the website - overall container, navigation and footer. In essence, the pages are the \"body\" of the website vs. standalone landing pages and should be structured accordingly.  E.g.  If we take on a growth-driven design approach and decide we need a new section at the top of every page or bottom of page based on what our users are telling/showing us, we now have to go into every single page to add it, whereas if you had the main site template that your other pages derived from you would simply add it to the core template and it would automatically be on all of your pages.  I am concerned about long-term maintainability here and wondering how this is typically handled in HubSpot? Do developers typically code in their independent IDEs vs. HubSpot to avoid these issues?"
  },
  {
    "poster": {
      "poster_name": "David Essery",
      "poster_handle": "david297"
    },
    "time_stamp": "2019-08-13 10:26:56",
    "text": "<@ULEBY9675> Hopefully this will help:\n\n<https://designers.HubSpot.com/docs/hubl/hubl-supported-tags#custom-modules>\n\nAlternatively, if you get stuck, if you create a drag and drop template, add your module to it, then export that template as HTML, you will see the code used to embed it. You can then copy that in your actual template."
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2019-08-13 10:49:42",
    "text": "...and I just realized I forgot something important.  What I need to use for this purpose is a module that I turn into a global group.  This can then be added to each template. As we gather usage details the module can be edited as needed and, after being compiled, all pages will reflect the edits. I think I'm good now. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Chris Kieran",
      "poster_handle": "ckieran"
    },
    "time_stamp": "2019-08-13 11:37:03",
    "text": "Yeah I think creating the drag and drop template is the way to go, thanks very much for this"
  },
  {
    "poster": {
      "poster_name": "David Ly Khim",
      "poster_handle": "dkhim"
    },
    "time_stamp": "2019-08-13 14:29:05",
    "text": "<@U22PKFRU5> Any resources we can share?"
  }
]