[
  {
    "poster": {
      "poster_name": "Chris Reynolds",
      "poster_handle": "chris.reynolds"
    },
    "time_stamp": "2024-05-13 13:13:41",
    "edited": {
      "time_stamp": "2024-05-13 13:24:04"
    },
    "text": "~Just saw the announcement about legacy lists being sunsetted in just 18 days (when the email was sent, it gave only 22 days of warning); *this is not enough time to make the changes needed to use the new v3 endpoints*, especially when the migration guide doesn't cover everything, and when~ I'm finding a bug with the first change I'm attempting (see below);\n\n*[UPDATE - my bad! I didn't realize the sunset date was for 2025, THANK YOU! This scared me, lol* :relieved:*]*\n\n*~Can the sunset date be pushed out further so I our team can have more time to migrate?~ And can I also get help on the first change I'm trying to make (below)?*\n\nI need to get a list of all contact lists to show the user (they will pick them from a list, and then I need to save the `\"listId\"` so I can sync new contacts added to it on a CRON job);\nI can do this easily with the legacy `GET /contacts/v1/lists`;\nWhen trying to use the new v3 endpoints, `GET /crm/v3/lists` returns an empty `\"lists\": []`, I'm not sure how to use that endpoint;\nSo I tried the v3 search endpoint using `POST /v3/lists/search` (not specifying anything in the payload);\nThis gets me a list of the lists, but there's a bug with the `listId` value, as it's no longer matching the ID value they should have :grimacing: (see screenshot for example of the legacy response showing the `listId` as `5`, and the v3 showing it as `\"11\"` instead of as `\"5\"`)\nI'm also trying to get the response to include the `\"listType\"` attribute but haven't figured that out yet.",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-13 13:14:47"
      },
      {
        "time_stamp": "2024-05-15 14:28:10"
      },
      {
        "time_stamp": "2024-05-15 14:31:03"
      },
      {
        "time_stamp": "2024-05-15 14:37:27"
      },
      {
        "time_stamp": "2024-05-16 09:15:38"
      },
      {
        "time_stamp": "2024-05-16 09:33:54"
      },
      {
        "time_stamp": "2024-05-16 09:34:23"
      }
    ]
  },
  {
    "text": "Here's the screenshot",
    "time_stamp": "2024-05-13 13:14:47"
  }
]