[
  {
    "poster": {
      "poster_name": "Luca Bartoli",
      "poster_handle": "bartoli"
    },
    "time_stamp": "2018-06-27 01:09:00",
    "edited": {
      "time_stamp": "2018-06-27 02:17:09"
    },
    "text": "I think the only way to do this is by creating a proxy pass on your WordPress web server inside that folder. But the HubSpot blog can't handle the URL rewriting in this case, so all internal links will be on the hs domain in any case.\nA workaround would be to use a response filter on the reverse proxy.\nI don't know if there are drawbacks, as I would not implement a solution like this one, and I never did (think to the seo iseues with the duplicated domains, for example)"
  },
  {
    "poster": {
      "poster_name": "Sean Bruso",
      "poster_handle": "sbruso"
    },
    "time_stamp": "2018-06-27 06:19:32",
    "text": "Is it possible to integrate hotjar forms tool with HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-06-27 06:24:30",
    "text": "<@UBEGST9QA> that has been the major pain with hotjar and most other heat tracking software with HubSpot. We are hopefull that somthing will change due to this limitation but for now… NO."
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Lizzy Malmquist",
      "poster_handle": "emalmquist"
    },
    "time_stamp": "2018-06-27 11:06:08",
    "text": "<@UAX5LJ9K3> thanks sounds like a reverse proxy could get messy. Not going to recommend that route. Yikes"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-06-27 11:42:47",
    "text": "Yeah, that’s definitely not supported. Since all the requests will come from your proxy and not from users, the traffic could get blocked as suspicious."
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2018-06-27 11:53:50",
    "text": "bit of a conundrum i'm dealing with:\nmy company has launched a new blog under it's own url `<https://www.groovecommerce.com/resources>` and like the blog, is giving a list of topics to filter by. There's only one currently out, but the topic url is `<https://www.groovecommerce.com/resources/topic/ecommerce>` however, the browser goes to `<https://www.groovecommerce.com/resources/tag/ecommerce>` instead.\nWe've checked our URL mappings and there's no redirect setup that would do this. Any ideas of where to further investigate?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-06-28 14:05:36"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-06-27 14:09:22",
    "text": "Not sure if anyone else is having this issue, but for some reason the \"back to website pages\" link of newly published pages isn't working for me. I just published two pages from drafts, got the confirmation \"analyze page\" screen, then tried to click the link above the page name to return to the website pages listing view and the routing did not work. It does work on pages that have already been published, however. I checked my JS console and did not see any errors. A very minor issue, but I wanted to report the bug just in case."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-06-27 15:35:03",
    "text": "the tags and topics were added to the blog a couple months ago. It's the same function though."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-06-27 16:44:40",
    "edited": {
      "time_stamp": "2018-06-27 16:44:53"
    },
    "text": "Who's coming to INBOUND 2018? - Make sure to hop into the new <#CBF8XQ57U|> channel for information on exciting developer sessions, announcements, and communications."
  }
]