[
  {
    "poster": {
      "poster_name": "Daniel Keogh",
      "poster_handle": "dkeogh"
    },
    "time_stamp": "2023-12-07 08:18:22",
    "text": ":wave: Hi Niko, I’m an engineer on the Marketing Email team at HubSpot.\n\n&gt; there seems to be a HubSpot enforced padding value assigned at a ~mobile breakpoint, 20px left and right. However, it isn’t consistently applied. It’s applied to the text modules, but not the image. And so, the mobile image ends up maintaining the 32px padding\nThis is a bug. The intended behaviour here is for the `hs_padded` media query to also be applied to your image module, so its horizontal padding will be consistent with the other elements in your email.\n\n&gt; What’s the best way to bring this image in line with the text fields on mobile, without creating custom modules to do so?\nThis has been updated as of this morning. My apologies if you already had to spend time coding a solution here."
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-12-07 08:43:29",
    "text": "Hey there Daniel - can’t tell you how much I appreciate the responsiveness. Kudos to you and your team. While some time was indeed spent working around the bug, it’s a relatively small price to pay knowing it won’t be an issue going forward. The client will be pleased to here this as well. I haven’t confirmed the fix on my end quite yet, but in the off chance I’m still seeing an issue, I’ll likely post another note in this thread.\n\nExcellent stuff, thanks!"
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2023-12-07 11:36:47",
    "text": "*EMAIL CUSTOM MODULE DISPLAYING WEIRDLY ON OFFICE365 APP ON WINDOWS*\n\nHey team,\n\nI have some emails that use Email Custom Modules to display customized headers and footers displaying very weirdly when the email is opened on the Office365 App for Windows.\n\nThe width of the elements get messed up and the colors change as well.\n\nIt looks like a compatibility problem with Office 365 App. I did not find any similar cases in the community, so I'm creating this post to see if anyone has found similar issues or even solved them.\n\nLet me know if you have experienced anything similar to this.\n\nThank you!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-07 11:55:48"
      },
      {
        "time_stamp": "2023-12-07 13:30:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-12-07 11:55:48",
    "text": "Are you able to share code, and screenshots of what it should look like vs. what you're seeing? That will help with troubleshooting."
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2023-12-07 13:30:01",
    "text": "Not sure <@UKGV272KS>, I'll check with the customer if we can share the code and images and update this thread. Thanks!"
  }
]