[
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-02-28 01:38:15",
    "text": "Thanks <@U26BLKGE4> I conceptualize the logic but the implementation is uncertain. Why you consider using a webhook vs the Forms api here in this case?Since it pulling in the hutk and updating all the information contain in the hs_context parameter how should the Ip field ideally look to ensure it does not pull in the server information and the Ip from the contact submitting the form?"
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-02-28 01:40:20",
    "text": "thanks <@UFBNA9K9A> so essentially forms submission data will no longer include analytics and will show \"activity excluded\" because we would not be able to get the user submitting Ip information?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-02-28 06:15:06",
    "text": "Hey KJ. by webook I just mean the POST request itself; the JSON being sent to the forms api.\n\nAs I said, I haven't used typeform so I don't know exactly what you need to do to make it work, just that typically you would want to populate the context object after the page has already loaded (either on pageload or after the user submits the form), using the information from the HubSpot cookie. Putting in a static value won't allow for accurate analytics."
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-02-28 06:50:13",
    "text": "gotcha thank you"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-02-28 07:04:38",
    "text": "Hey <@UEZJ74UN8> No, IP address was really only used to get inferred location. Activity excluded is really for explicitly blacklisted IP addresses.  The activity data is associated with the cookie which will still be supported via our API"
  }
]