[
  {
    "poster": {
      "poster_name": "Dave",
      "poster_handle": "hello479"
    },
    "time_stamp": "2024-02-06 03:21:44",
    "edited": {
      "time_stamp": "2024-02-06 03:24:27"
    },
    "text": "Hi all, I work for a property developer in the UK. We’re looking for a contractor to help with HubSpot customisation and integration. Must have expert knowledge of HubSpot, decent react and JS knowledge. We’re using the HubSpot React customisation beta so knowledge of this would be ideal. Azure serverless experience a plus too. 2-3 months to kick off, but likely more work after. Any recommendations appreciated!",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-02-06 03:23:13"
      },
      {
        "time_stamp": "2024-02-06 03:40:36"
      },
      {
        "time_stamp": "2024-02-06 07:26:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dave",
      "poster_handle": "hello479"
    },
    "time_stamp": "2024-02-06 03:23:13",
    "text": "tagging <@U2LEJ045D>, <@U3T21PDBK> , <@UBT0AHWLD>, <@UGDF9EBPW>, <@U04AQA0QM8E> as I saw a comment from The <@U01QVR44MEY> recommending your skills!"
  },
  {
    "poster": {
      "poster_name": "Martin",
      "poster_handle": "as20190101"
    },
    "time_stamp": "2024-02-06 03:40:36",
    "text": "DMed to you <@U063K756X46>"
  },
  {
    "poster": {
      "poster_name": "Martin",
      "poster_handle": "as20190101"
    },
    "time_stamp": "2024-02-06 03:45:56",
    "text": "[Remote][Front-end developer][Full-Stack developer][Freelancer]\nHi.\nAs a HubSpot developer, I specialize in designing and developing customized solutions using the HubSpot platform and HubSpot React customisation.\nI possess a deep understanding of HubSpot's marketing, sales, and service hubs and I am proficient in using the HubSpot APIs and tools to build custom integrations and workflows.\n\nI am experienced in developing custom modules, templates, and themes using HubSpot's CMS, and I have a strong focus on creating visually appealing and intuitive user interfaces that provide a seamless user experience. I am familiar with HubSpot's CRM system and I am experienced in building custom automation and workflows that help businesses streamline their sales and marketing processes.\n\nCurrently, I am unemployed, available full-time in a new position, start immediately~\nKindly reply to this message and let me know when would be a good time for us to connect this week.\nLooking forward to hearing from you for further process.\n\nBest regards."
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2024-02-06 07:26:54",
    "text": "Hi Dave,\n\nI have very good experience with the real estate sector check one of my clients <https://www.freedompropertyinvestors.com.au/>\nMy HubSpot Profile <https://ecosystem.HubSpot.com/marketplace/solutions/hub-devs>\n\nI have sound experience with HubSpot Customization and API integration.\n\nAlso having experience with React JS."
  }
]