[
  {
    "poster": {
      "poster_name": "Amanda White",
      "poster_handle": "amanda.white"
    },
    "time_stamp": "2023-11-10 14:10:55",
    "text": "Thanks for the feedback, Evelynn! I did go with a custom object, and I think that is going to work!"
  },
  {
    "poster": {
      "poster_name": "Amanda White",
      "poster_handle": "amanda.white"
    },
    "time_stamp": "2023-11-10 14:20:31",
    "text": "Does anyone know if it's possible to make CRM standard and custom objects appear on a Membership page, but the records that display are specific to the associated contact? For example, we have a custom object called \"Inspection Data,\" and we want users who are logged into the membership site to see Inspection Data records associated with their company. So an employee from Company A who's logged into the website can only see Company A's Inspection Data, but they cannot see Company B's inspection data.\n\nHopefully that makes sense.... thanks, everyone!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-10 14:31:58"
      },
      {
        "time_stamp": "2023-11-10 14:34:33"
      },
      {
        "time_stamp": "2023-11-10 14:49:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-11-10 14:31:58",
    "edited": {
      "time_stamp": "2023-11-10 14:32:09"
    },
    "text": "yes, definitely. It’s exactly the kind of thing membership pages are meant for. You could just use the {{contact}} variable, which will give you the ID, among a variety of other properties.\n\nThere are a few ways to go about retrieving the associated data - the most appropriate likely being the hubl, crm_associations() function. You can read more about its use via the link.\n\n<https://developers.HubSpot.com/docs/cms/hubl/functions>"
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-11-10 14:34:33",
    "text": "and just to clarify, the contact variable should be readily accessible on any membership page by default. No variable declaration necessary."
  },
  {
    "poster": {
      "poster_name": "Amanda White",
      "poster_handle": "amanda.white"
    },
    "time_stamp": "2023-11-10 14:49:50",
    "text": "Awesome! Thanks for the feedback, Niko :raised_hands:"
  }
]