[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-01 05:54:24",
    "text": "Now that we have access to historical data of this Slack Channel, wouldn´t it be cool to get all the great infos posted here in JS or Hubl or hubdb to export it and have it curated and posted, for example in the Code Gallery?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-03-01 10:03:03"
      },
      {
        "time_stamp": "2020-03-01 12:33:15"
      },
      {
        "time_stamp": "2020-03-01 12:33:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-01 05:55:55",
    "text": "i checked, there is an export feature to csv for Admins to export channel data"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-03-01 10:03:03",
    "edited": {
      "time_stamp": "2020-03-01 10:10:33"
    },
    "text": "Hi Andreas. While we will be utilizing the history to improve our developer documentation with best practices and better more detailed information to solve for needs you all have. I dont think we're likely to make all of the slack conversations publicly accessible on the web. Leaving aside technical aspects - while theres a lot of great information here, there is also outdated information and workarounds for things that no longer require them. It is important the information we provide developers is high quality and accurate.\n\nThe community is always welcome to submit to the code gallery examples they feel are useful.\n\nThank you for the idea suggestion, we hear you. We're just more likely to take a more cautious and HubSpot curated approach to extract the information that sets developers up for the most success."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-01 12:33:15",
    "text": "Hi Jon, agreed that makes sense :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-01 12:33:42",
    "text": "thanks for the detailed infos"
  }
]