[
  {
    "poster": {
      "poster_name": "Chris Walton",
      "poster_handle": "chris.walton"
    },
    "time_stamp": "2021-08-06 10:47:56",
    "text": "Hi, having an issue with styles.border not even acknowledging radius. Tried to add a default border_radius value and errors with invalid property of border. AND the appearance of the styles tab border customization doesn't match what I see in the docs.",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-06 10:48:19"
      },
      {
        "time_stamp": "2021-08-06 10:48:50"
      },
      {
        "time_stamp": "2021-08-06 10:52:46"
      },
      {
        "time_stamp": "2021-08-06 10:57:41"
      },
      {
        "time_stamp": "2021-08-06 10:58:08"
      },
      {
        "time_stamp": "2021-08-06 10:59:27"
      },
      {
        "time_stamp": "2021-08-06 11:06:08"
      }
    ]
  },
  {
    "text": "Docs show:",
    "time_stamp": "2021-08-06 10:48:19"
  },
  {
    "text": "I'm only getting this though:",
    "time_stamp": "2021-08-06 10:48:50"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-06 10:52:46",
    "text": "We made a few changes to the field just prior to announcing. Your screenshot is how it should be displaying. Thickness was found to be more confusing than width, so the label was updated. Corner radius I need to double check but I believe it was removed from the field."
  },
  {
    "poster": {
      "poster_name": "Chris Walton",
      "poster_handle": "chris.walton"
    },
    "time_stamp": "2021-08-06 10:57:41",
    "text": "That is a shame if corner radius was removed :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-06 10:58:08",
    "edited": {
      "time_stamp": "2021-08-06 10:58:35"
    },
    "text": "It doesn’t remove your ability to provide control over border radius as number field would still work fine."
  },
  {
    "poster": {
      "poster_name": "Chris Walton",
      "poster_handle": "chris.walton"
    },
    "time_stamp": "2021-08-06 10:59:27",
    "text": "Right, that's what I'll do. Thanks for your help, Jon."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-06 11:06:08",
    "text": "No problem, thanks for highlighting the difference in our documentation I’ll make sure we correct that screenshot"
  },
  {
    "poster": {
      "poster_name": "Alex Foster",
      "poster_handle": "alexfost94"
    },
    "time_stamp": "2021-08-06 12:11:41",
    "text": "Hey guys, so I am doing some A to B testing on my page <http://www.intimetec.com|www.intimetec.com> and now have a clone running on <http://www.intimetec.com/home-page-test|www.intimetec.com/home-page-test> . Originally I did not want a live clone of the site under the same domain (in an instance there would be a conflict which after some testing there isn't). Our account was originally given a HTTP domain vs our in time tec domain which is a HTTPS (all of our pages are hosted under the in time tec domain so this isn't an issue I am just trying to understand why and what is going on behind the scenes). I had originally published the clone to the http domain (the load times were terrible even with changes that should have only sped things up). Does anyone have a deeper understanding of why the exact same page was taking around 700-900MS slower page load going from the HTTPS domain to a HTTP domain? Originally I was very confused as the changes I made were image file compression and some lazy loading on those images below the fold. I am now currently running the tests for both pages as originally stated, and the main document file is loading around ~50 MS(HTTPS domain) compared to ~900MS(HTTP domain)?"
  }
]