[
  {
    "poster": {
      "poster_name": "Guido Porcaro",
      "poster_handle": "guido.porcaro"
    },
    "time_stamp": "2019-10-25 01:28:50",
    "text": "with `top: 0` or your top px"
  },
  {
    "poster": {
      "poster_name": "Shelbey Surgent",
      "poster_handle": "ssurgent"
    },
    "time_stamp": "2019-10-25 10:29:02",
    "text": "Hello! New to HubSpot CMS, trying to investigate transitioning from WordPress. Prior using a decent WordPress theme, I (the designer) can build the entire WordPress site (header, content, pages, h1 styles, forms, etc.) without dealing with code and at the end project, would need help from our developers for 10 items or less. Now in HubSpot CMS, I've watch the overview videos for developers and marketing, experimented myself and it seems like because of the coding of the modules, I can't see just myself ( a designer) being able to do this the way I can in WP. Anyone else in the same scenario make the switch?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-10-25 10:34:16"
      },
      {
        "time_stamp": "2019-10-25 10:53:03"
      },
      {
        "time_stamp": "2019-10-25 16:42:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-10-25 10:34:16",
    "text": "<@UPT2XAN0L> you want to look into custom modules and flex columns. That will be the way you create a marketer friendly site with very little to no coding required to make changes."
  },
  {
    "poster": {
      "poster_name": "Shelbey Surgent",
      "poster_handle": "ssurgent"
    },
    "time_stamp": "2019-10-25 10:53:03",
    "text": "Thanks <@U38EZFVFE>. I just watched a video on Custom Modules but it still seems like the person creating the modules, would have to know how to code. We'd like to build the site with as little developer involvement as possible, which I don't know is possible in this CMS."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-10-25 16:42:47",
    "text": "Hey <@UPT2XAN0L> think Chad misinterpreted a bit. You _can_ do a site with all drag-and-drop modules, but the functionality and layout options are going to be limited; the HubSpot drag and drop templates aren't quite at the level of detail as something like Divi or other WP visual builders (which from an SEO and site optimization standpoint, is usually actually a good thing).\n\nHS sites are usually handled the way a custom WordPress theme would be. I'd suggest taking a look at the HubSpot Marketplace and see if there is a theme similar to what you're envisioning. Otherwise, you'll likely want to design in a design program like Sketch or XD and then work with a developer to have your modules built out custom for your themes"
  }
]