[
  {
    "poster": {
      "poster_name": "Michael Schneider",
      "poster_handle": "michael.schneider"
    },
    "time_stamp": "2020-11-05 01:34:51",
    "text": "Hello together, i'm started with HubSpot and i'm new :wink: We want to update our HubSpot Contacts with some from Yawave (\"<https://yawave.com/de/>\"). Yawave offers an API, now my question is if there is an way to integrate an API like the Yawave in HubSpot. And if there is this way, how i can do it. Thanks for your help guys. Best Regards Michi from beautiful Switzerland"
  },
  {
    "poster": {
      "poster_name": "Quentin Lamamy",
      "poster_handle": "quentin.lamamy"
    },
    "time_stamp": "2020-11-05 03:11:40",
    "text": "<@U01EF64LFLH> You will have to develop custom script and use the HubSpot api and the yawave api to transfert contact"
  },
  {
    "poster": {
      "poster_name": "Tom Brouwer",
      "poster_handle": "tommymobi"
    },
    "time_stamp": "2020-11-05 03:43:07",
    "text": "Hey everyone!\n\nI don't really know which channel to post this question to.\n\nWe work with a hotel reservation tool (<https://www.hoteliers.com>). We have a page over there where people can book their hotel room. We are currently building our website in the HubSpot CMS and we want to implement a small form that makes a POST request to the reservation tool. If we use plain html and create a form, it works! But the input fields are not styled. We can put inline css there, that's not the problem.\n\nBut we'll like it if we can add a datepicker to these fields. Is there an ID or class we can set to get the HubSpot cms native datepicker (to match it with other froms we made within the CMS)?\n\nOr is there another way to achieve this with the native form builder tool?\n\nExample of working form in plain html:\n\n```&lt;form class=\"hoteliers-book-form\" method=\"post\" target=\"_blank\" action=\"<http://www.hoteliers.com/wlpEngine.php?ID=2990&amp;lang=nl>\"&gt;\n    &lt;input name=\"arrival\" type=\"text\" value=\"2020-11-01\"&gt;\n    &lt;input name=\"departure\" type=\"text\" value=\"2020-11-10\"&gt;\n    &lt;button type=\"submit\"&gt;Beschikbaarheid&lt;/button&gt;\n&lt;/form&gt;```\nThanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Brian Deer",
      "poster_handle": "brian302"
    },
    "time_stamp": "2020-11-05 16:01:25",
    "text": "We just went live with a bunch of pages that were on content staging and most were published fine but a handful of them say Error: *There was a problem publishing your staged proofs to your live domain.* Please check each proof for errors. However, I see no place in each proof to see any errors. There is no indication what the errors are or what would not allow them to publish."
  }
]