[
  {
    "poster": {
      "poster_name": "Scott Baxter",
      "poster_handle": "sbaxter"
    },
    "time_stamp": "2020-11-23 05:21:29",
    "edited": {
      "time_stamp": "2020-11-23 05:21:42"
    },
    "text": "Hey all, sorry, not sure where I should post this but I'm trying to integrate HubSpot &amp; OneTrust and I was wondering if anyone has successfully managed to do this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-11-30 14:42:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Baxter",
      "poster_handle": "sbaxter"
    },
    "time_stamp": "2020-11-23 06:24:53",
    "text": "Did you get anywhere with this <@U7BQUDTEJ>"
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2020-11-23 07:03:29",
    "text": "no"
  },
  {
    "poster": {
      "poster_name": "Angelica Munyao",
      "poster_handle": "amunyao"
    },
    "time_stamp": "2020-11-23 09:05:42",
    "text": "Hi :wave: . I’m <@U0163CK2J20>, a front-end engineer on CMS Developer Experience team at HubSpot. <@U0190968M6H> and I are collecting feedback on *serverless functions*. If folks aren’t using this feature, could you tell us why in a few sentences in the thread below? Thanks!\n<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1605714023470900>"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-11-23 09:24:33",
    "text": "The main thing holding me back at this point is not having cms enterprise"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-11-23 09:30:11",
    "edited": {
      "time_stamp": "2020-11-23 09:31:00"
    },
    "text": "Hey all, I'd say there are three main factors hindering us from using serverless functions more often:\n\n1. Cost - this one is fairly obvious with the price tag on CMS enterprise, but it is worth noting especially combined with...\n2. A lack of differentiation from other, oftentimes free services - Many of the use cases we run into where serverless functions may be a good fit, we can accomplish on free tiers of Firebase functions or similar services. \n3. Finding good use cases in the first place - Most of us who understand serverless functions know how to use them, but have a hard time advising our marketing partners for how they can integrate them into their strategies. It's easier to find the right tool for the job than the right job for the tool.\nThat said, if you're looking for a way to differentiate HubSpot Functions from other competitors, I think the biggest feature we were hoping for that is not in the current product is deeper trigger integration with HubSpot itself. Being able to trigger functions via actions in the CRM or CMS would go a long way, for example being able to fire a function every time a blog post is published, or when an active list reaches a certain size, for example."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-11-23 11:00:45",
    "text": "seconding Mark’s point #3 above as my primary reason.\n\nother reasons: many of our clients are on limited budgets and limit their functionality correspondingly; and i get bounced around between HS and other platforms so it’s hard to focus on learning the more technical points. i would love more in-depth academy stuff for developers, especially with more examples of real-world use (coming full circle to point 3)"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-11-23 11:55:01",
    "edited": {
      "time_stamp": "2020-11-23 12:02:41"
    },
    "text": "To add: I’m not sure where the HS Serverless offering fits, at least as it stands currently. It doesn’t really make sense price wise (in my opinion.) It takes very little time to configure a lambda on AWS, which for most users is going to cost $0-50/m based on demand.\n\nI’d also be concerned about the limits HubSpot has - 60 function executions per min - I wouldn’t feel comfortable using it with the hard limit - bad actors/mid sized marketing campaign could quite easily consume that.\n\n\nThe deep integration is a must, and I feel that this really will give people a reason to not go off and spin up their own stacks on AWS using the HubSpot API for integration."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-11-23 12:39:49",
    "edited": {
      "time_stamp": "2020-11-23 12:40:57"
    },
    "text": "Also, <@UDEASNWEB> hits the nail on the head in regards to clients and budgets. HubSpot Enterprise CMS as I see it is always going to be a hard sell. I’m not sure I would recommend it to clients - very rarely do they want just a simple membership site. Usually theres a whole bunch of custom functionality required on top of that (even just accepting reoccurring payments!)\n\nThe current list of features seems very developer targeted and would make very little sense to clients  “Code alerts”, “Partitioning”, “Reverse proxy support”, “Serverless functions” I feel like these   would better suited as “addons”"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2020-11-23 16:35:02",
    "text": "Just got around to watching this. Real interesting debate,  we took some licks in there, but I feel pretty good knowing that we have recently or are in the process of addressing many of the points. Thanks for putting this together! I’d love to see it happen again in another year :wink:"
  }
]