[
  {
    "poster": {
      "poster_name": "Dirk van der Giesen",
      "poster_handle": "dvandergiesen"
    },
    "time_stamp": "2023-05-01 02:50:13",
    "edited": {
      "time_stamp": "2023-05-01 02:51:26"
    },
    "text": "Hi Guys, i am using the Gizmo Bronze theme and they just released an update from 6 to 7. When i run update from the market place, the latets version number is not updated in my theme.json. Also not after reinstalling the theme. Any idea where that should be handled? Is this done manually by the theme owner or done by the HubSpot theming system or how is this supposed to work?\nCheers, Dirk",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-01 08:20:27"
      },
      {
        "time_stamp": "2023-05-01 08:49:00"
      },
      {
        "time_stamp": "2023-05-01 10:41:43"
      },
      {
        "time_stamp": "2023-05-01 10:47:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2023-05-01 07:07:45",
    "text": "Hi Aldo Carrillo, HubL, the templating language used by HubSpot, allows you to define and use variables in your templates. To do this, you can create a separate file to store global variables and then import it into your templates using the % import % tag23. For example, you could create a file called globals. HubSpot.<https://developers.HubSpot.com/docs/cms/hubl/variables-macros-syntax>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-01 08:20:27",
    "text": "The theme.json will only show the updated version number if the developer updated the file, if they didn't make the change on their end when they uploaded the update, it would still show the old number.\n\nIf you created a child theme, the theme.json will always show the version number from when you created the child theme, it would only update if you manually change it.\n\nAs long as the latest version number shows in marketplace downloads when you open the theme (right sidebar), you should be all set with the latest version.\n\nYou might reach out to the theme developer directly to see if this was a mistake on their side."
  },
  {
    "poster": {
      "poster_name": "Dirk van der Giesen",
      "poster_handle": "dvandergiesen"
    },
    "time_stamp": "2023-05-01 08:49:00",
    "edited": {
      "time_stamp": "2023-05-01 08:53:38"
    },
    "text": "Thank you Jennifer, i reached out to the developer and they will make sure the version number wil be updated properly in their next release.\nDo you happen to know how to completely remove a downloaded (either installed or uninstalled) theme from your own  marketplace downloads?"
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2023-05-01 09:24:38",
    "text": "I reached out to someone at HubSpot and let them know we were running in to problems with the validator now throwing errors after we had just successfully submitted updates the week before."
  },
  {
    "poster": {
      "poster_name": "Shiv Shukla",
      "poster_handle": "shivshukla095"
    },
    "time_stamp": "2023-05-01 10:24:25",
    "text": "Thanks <@U7BQUDTEJ> :+1:"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-01 10:41:43",
    "text": "you're welcome, happy to help!\n\nif you uninstall a theme from marketplace downloads, it should remove all of the coded files.\n\nafter it is uninstalled, you'll see it in marketplace downloads until you refresh, then it should disappear automatically"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-01 10:47:01",
    "text": "I just tried this and it looks like HubSpot stopped removing from this page, I guess this gives you the option to reinstall if you want. It doesn't look like its possible to remove fully from this view"
  },
  {
    "poster": {
      "poster_name": "Grant",
      "poster_handle": "HubSpot635"
    },
    "time_stamp": "2023-05-01 18:49:20",
    "edited": {
      "time_stamp": "2023-05-01 19:10:02"
    },
    "text": "Hey guys. I'm doing some custom quote templates and when we try to e-sign with them, we get a bad link in the email. It just says that the page isn't found. I was rolling with a modified e-sign module cloned from the base and just styled a bit differently. When I saw it wasn't working, support told me to use the stock one instead and I did but it didn't help. I have no visibility into what happens on e-sign and it just smells like that pdf converter dies. I've asked support to look into the logs on their end to see if there is an error that would give me any sort of information on what's not happening right but I can't get in touch with the right team to do so or they are not willing to grab that specifically for us. Do y'all have any idea what's going on with this thing and why would it die in this way?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-02 08:23:09"
      },
      {
        "time_stamp": "2023-05-02 11:15:07"
      },
      {
        "time_stamp": "2023-05-02 11:24:31"
      }
    ]
  }
]