[
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-05-12 02:48:24",
    "text": "Hi everyone,\n\nI’m building a theme that has a non-conventional functionality, and I would appreciate any input on the approach.\nI want to build a ‘Support hub’ or an ‘Advanced FAQ section’ similar to this one: <https://rivian.com/support>\n\nMy solutions so far are:\n1. Use HubDB to insert all the FAQ single pages, and create dynamic pages for every question\n2. Create a blog and each FAQ to be its own ‘blog post’\nOption 1: Seems more flexible, since I can create breadcrumbs and nest everything how I want, but I am afraid it might get a bit complicated (UX wise for the client) to maintain all the content in HubDB\n\nOption 2: I can filter everything with categories/tags but I am not sure if then I can create another ‘Blog’ to be used as an actual blog and not have tags to be mixed between the two.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-06-02 15:03:16"
      },
      {
        "time_stamp": "2023-06-05 07:38:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jean-Christophe Charlier",
      "poster_handle": "jccharlier"
    },
    "time_stamp": "2023-05-12 08:53:29",
    "text": "Hey everyone! Do you know if it is possible to change the paper size of the PDF Quote (generated by Download button). Nedd to change it from A4 ---&gt; Letter"
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2023-05-12 10:47:52",
    "text": "That screenshot is from the default HubSpot form module, right? In the design manager that module doesn't show it as even having Style fields so I think it's some completely separate functionality tied to forms that's not available for custom modules. There's certainly no documentation for it. Would be nice to have though."
  },
  {
    "poster": {
      "poster_name": "Andres Gutierrez",
      "poster_handle": "andres121"
    },
    "time_stamp": "2023-05-12 10:50:06",
    "text": "it's true, what a disappointment, it was a very good idea to customize my module in this way, thanks for your answer. <@U39DT5YFL> :the_horns:"
  }
]