[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-10 07:00:34",
    "text": "Hi <@U03NSBQA2UE>, I'm sorry that didn't work - being that it was another developer and you're not familiar with the code, it would be like trying to find a needle in a haystack for me to try to unravel the code to find the issue.\n\nMaybe there is a more experienced developer like <@UCT32UWDV> who would be willing to take a look and point you in the right direction, but if not, you might need to consider posting it as a job and having a developer resolve the issue directly"
  },
  {
    "poster": {
      "poster_name": "Logan Denzon",
      "poster_handle": "logandenzon890"
    },
    "time_stamp": "2023-05-10 07:12:53",
    "text": "thanks <@U03AKL6Q1B2> I am also a web developer, but I am not able to find the menu loading issue. :cry:"
  },
  {
    "poster": {
      "poster_name": "Julian Purser",
      "poster_handle": "juliangd"
    },
    "time_stamp": "2023-05-10 07:45:43",
    "text": "Hi everyone, I am trying to display the blog content on a page only if the content is filled in:\n```{% if content.post_body %}\n        &lt;div class=\"hs-content-body\"&gt;\n          {{ content.post_body }}\n        &lt;/div&gt;\n      {% endif %}```\nBut this returns null so I tried != null but that didn’t work either.\n\nDoes anyone know how I can get this to work?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-10 07:55:05",
    "text": "I'm sorry <@U03NSBQA2UE> I hope that didn't come across the wrong way about hiring a developer, it wasn't to say you weren't one, just that if you need help from someone with more experience with header modules, it might be an easier route to go"
  },
  {
    "text": "Hi - I mostly work with the CRM components of HubSpot and less with themes/front end, but am trying to figure out how to add a page break before a section in our quote template. I <https://community.HubSpot.com/t5/CMS-Development/Quote-Custom-template-break-page/m-p/414054|found a great thread about others that have been able to do this with CSS>, but I'm not as well versed in CSS or HubSpot themes to understand the implication of editing it or creating a child theme. Can I create a child theme that just the quote template uses? I'll likely outsource someone adding it, but want to be sure I give adequate direction. Any general thoughts would be helpful. Thanks in advance!!",
    "time_stamp": "2023-05-10 14:30:23",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-05-10 14:36:18"
      },
      {
        "time_stamp": "2023-05-10 14:45:15"
      },
      {
        "time_stamp": "2023-05-10 14:57:23"
      },
      {
        "time_stamp": "2023-05-11 03:16:46"
      },
      {
        "time_stamp": "2023-05-11 03:27:47"
      },
      {
        "time_stamp": "2023-05-11 07:31:18"
      },
      {
        "time_stamp": "2023-05-11 07:31:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2023-05-10 14:36:18",
    "text": "Hi Meredith. HubSpot quotes use a separate theme from your website theme. So a developer would have to match your branding and make any other style adjustments. Do you currently have a custom quote theme or default?"
  },
  {
    "poster": {
      "poster_name": "Meredith Scroggin",
      "poster_handle": "mscroggin"
    },
    "time_stamp": "2023-05-10 14:45:15",
    "text": "<@UG7S8J18D> - That makes sense and I appreciate this insight, that they'd have to customize the rest of the styling components. I believe we have a custom quote theme based on what those settings say, but it looks like a theme we installed if 'Flow' is not default."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2023-05-10 14:57:23",
    "text": "The flow quote template is a default HubSpot theme. I just downloaded the custom quote files and don't see flow included. <@UBT0AHWLD> have you ever customized the flow quote theme?"
  }
]