[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-05-11 03:16:46",
    "text": "Hi <@U04JMKA1D0A> and <@UG7S8J18D>,  no i always customized the templates inside of the \"cms-quotes-theme\". However, looking over the code its similar to the other templates."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-05-11 03:27:47",
    "text": "is this inside of a generated PDF Quote <@U04JMKA1D0A>? There is a page break property in CSS which might solve this problem :):  <https://css-tricks.com/almanac/properties/p/page-break/>"
  },
  {
    "poster": {
      "poster_name": "Grant",
      "poster_handle": "HubSpot635"
    },
    "time_stamp": "2023-05-11 05:34:28",
    "text": "It didn't work. I'm at the end of my rope here. I have removed any mention of a custom font, I've removed the video background we were using. I've removed every mention of display: none; because a forum post mentioned that."
  },
  {
    "text": "<@UBT0AHWLD> thank you so much for this!! Yes, this is inside a generated PDF quote - we are only using the downloaded/printed versions and not using e-signature or anything. This is ideally what we need. Would customizing our quote template to achieve this be a service you can provide?",
    "time_stamp": "2023-05-11 07:31:18"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-05-11 07:31:54",
    "text": "yes i can help you with this"
  },
  {
    "text": "In case it helps anyone else,  I ended up adding section layout fields to the fields.json and then applied these to the classes that HubSpot code renders.  Why use this method? It  provides a consistent layout from section to section and page to page while allowing the user to still control the sizing in the theme settings. The section sizing can be overridden in the styles as well.\n\n@media only screen and (min-width: 1200px) {\n *.dnd-section  &gt; .row-fluid* {\n    max-width: *var(--desktop-container)*;\n    margin-left: auto !important;\n    margin-right: auto !important;\n}\n}\n\n.body-container--home *.dnd-section* {\n  display: flow-root;\n  box-sizing: border-box;\n  /* 1 */\n  padding: var(--section-padding-tb) var(--section-padding-lr) var(--section-padding-tb) var(--section-padding-lr);\n}\nThe section padding is in here too:",
    "time_stamp": "2023-05-11 09:57:46"
  },
  {
    "text": "Hi guys, I come with a little doubt to see if any of you can help me, I'm adding css style fields for my form but it became very long with so many fields and I would like to group them in three parts modules-fields-button as shown in the image, does anyone know how to do to group them like this?",
    "time_stamp": "2023-05-11 16:02:26",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-12 10:47:52"
      },
      {
        "time_stamp": "2023-05-12 10:50:06"
      }
    ]
  }
]