[
  {
    "poster": {
      "poster_name": "Romelyn",
      "poster_handle": "romelynnellas"
    },
    "time_stamp": "2023-02-10 08:51:43",
    "text": "Hi, anyone using webpack serverless here? I can't seem to build it, it says Cannot find module  HubSpot/cms-cli/lib/prompts'. Appreciate any help I can get. :woman-bowing:",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-02-10 13:59:20"
      },
      {
        "time_stamp": "2023-02-10 18:17:57"
      },
      {
        "time_stamp": "2023-02-12 09:43:08"
      },
      {
        "time_stamp": "2023-02-12 09:44:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-02-10 13:59:20",
    "edited": {
      "time_stamp": "2023-02-10 14:00:30"
    },
    "text": "Unsure I’ll be able to personally provide a solution - but additional details on the steps you’ve taken to get it running and at what point you run into this “cannot find module” error would go a long way in helping us, help you.\n\nAt first glance, this doesn’t look to be related to the webpack inclusion itself.\n\nAre you using the latest version of the CLI? If not, npm install -g @HubSpot/cli@next\n\nI had issues in the past getting the newest version of the CLI installed (whenever they renamed it altogether), which required me to delete the folder at the root level and then proceed with reinstalling from scratch. Up until I figured that out, I was unable to get webpack to play nice with my serverless functions.\n\nJust an idea."
  },
  {
    "poster": {
      "poster_name": "Odin Morningstar",
      "poster_handle": "odin.morningstar.dev"
    },
    "time_stamp": "2023-02-10 18:17:57",
    "text": "If you're trying to bundle functions inline Rollup has been a faster solution for us. You can check out their online REPL to see what the output is and use dynamic imports to only bundle the used functions. This will allow you to build with Es modules and have a nice library. I use it in combination with Esbuild so I can have a nice typescript library and modular system to map between our external services and HubSpot."
  }
]