[
  {
    "poster": {
      "poster_name": "Mubariz Muneer",
      "poster_handle": "mubariz.muneer"
    },
    "time_stamp": "2023-02-06 07:36:53",
    "text": "*@hey guys* I am facing this issue - &gt;\n<https://prnt.sc/fkCDAOGDsZwo>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-06 08:36:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Louden",
      "poster_handle": "matt562"
    },
    "time_stamp": "2023-02-06 07:53:19",
    "text": "Kinda late replying here but I thought I would try and help. I've never used a package.json file in HubSpot. It hasn't allowed me to upload one before. I've written many serverless functions the last couple years and I don't believe there is a way around it to include the package.json file. The serverless.json kinda replaces the it to some degree. HS doesn't allow for package.json files most likely for security reasons. Don't quote me on it, but I feel that is why they only allow for inclusion of certain node packages like axios or request or the HubSpot API package. There are some dicey node packages out there so I could see why they would want to limit what you can and cannot use. I hope this helps."
  },
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2023-02-06 08:36:25",
    "text": "Make sure you’re actually hitting the right endpoint path, with the right HTTP method and that it’s setup like this as well in `serverless.json`"
  },
  {
    "poster": {
      "poster_name": "Dave Borca",
      "poster_handle": "dave128"
    },
    "time_stamp": "2023-02-06 14:24:28",
    "text": "Hi guys, I have one question. Where can I store external API keys in HubSpot and call them in HubSpot CMS?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-02-06 15:29:05"
      },
      {
        "time_stamp": "2023-02-06 15:39:30"
      },
      {
        "time_stamp": "2023-02-06 15:39:47"
      },
      {
        "time_stamp": "2023-02-06 23:22:30"
      },
      {
        "time_stamp": "2023-02-07 06:44:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-02-06 15:29:05",
    "text": "When you say CMS, do you mean within a template/module file? If so, I think you might be out of luck. The CMS isn’t really designed for the storage of sensitive data.\n\nHowever, if you’re referring to using secrets within serverless functions, as the fact you’re posting in this channel would suggest - then you’re in luck. The CLI provides a fairly straightforward method of managing secrets. If you have CMS Hub E, you could send whatever payload you’re working with to your function, let that take care of any API requests requiring authentication (assuming your use case is something along these lines) and send data back to the client once done: <https://developers.HubSpot.com/docs/cms/data/serverless-functions#secrets>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-06 15:39:30",
    "text": "<https://HubSpotdev.slack.com/archives/C2YH119N2/p1675718761578439>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-06 15:39:47",
    "text": "<@U039PUBV59N> I was also confused by the question a little"
  },
  {
    "poster": {
      "poster_name": "Dave Borca",
      "poster_handle": "dave128"
    },
    "time_stamp": "2023-02-06 23:22:30",
    "text": "Thanks for the information <@U01QVR44MEY> <@U039PUBV59N>! I am developing a membership website in HubSpot CMS using Booya and Stripe for the products and payments since client do not want to use HS Payments"
  }
]