[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-02-28 10:01:05",
    "text": "Thanks, Carter. Doesn’t look like that example is working anymore. I hate dealing with webpack. :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-28 10:01:23",
    "text": "true true it gets messy fast"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-02-28 13:41:44",
    "edited": {
      "time_stamp": "2023-02-28 13:44:27"
    },
    "text": "Does anyone know how to send a buffer response from a serverless function? Do we just send the buffer as the body? I’m getting a 500 server error when trying that. And are we not able to set the `Content-Disposition` header? It seems to be ignoring it for me. Also no errors from `hs logs`."
  },
  {
    "poster": {
      "poster_name": "Curtis Morte",
      "poster_handle": "cmorte"
    },
    "time_stamp": "2023-02-28 21:31:28",
    "edited": {
      "time_stamp": "2023-02-28 21:33:58"
    },
    "text": "<@U0429V78FDK> you might want to take a peek into what you can, and can't do with serverless functions in HubSpot's documentation. I'm not sure what you're buffering a response for, but what I can tell you is that there are restrictions. You're likely hitting one of them. My guess, memory, content type, or payload is causing your errors. If that's not it, timeouts.\n\nAs an aside, be sure your use case fits the serverless model:\n&gt; HubSpot's serverless functions are intended to be used to add functionality to your HubSpot site, such as supporting advanced form submissions and pulling in data from other APIs. It’s not intended as a generic computing platform where you would run code unrelated to HubSpot.\n<https://developers.HubSpot.com/docs/cms/data/serverless-functions#limits>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-03-02 07:24:59"
      }
    ]
  }
]