[
  {
    "poster": {
      "poster_name": "Oliver Lamming",
      "poster_handle": "oliver"
    },
    "time_stamp": "2021-03-12 04:25:57",
    "text": "Hi. Is it possible to record custom properties when tracking a user event? <https://legacydocs.HubSpot.com/docs/methods/enterprise_events/http_api> For example, logging the name or a similar parameter when the user creates an object on our site"
  },
  {
    "poster": {
      "poster_name": "Michel Dubord",
      "poster_handle": "michel.dubord"
    },
    "time_stamp": "2021-03-12 06:15:16",
    "edited": {
      "time_stamp": "2021-03-12 06:15:45"
    },
    "text": "I am getting the following error with the API and a Windows service. \"The request was aborted: Could not create SSL/TLS secure channel.\" The vb service is using Framework 4.0"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-03-12 07:05:26",
    "text": "Hey. I know this thread is super old, but i'm running into the same issue. I've tried some of the permission combinations outlined here, but I still cannot oauth to my own integration.\n\nI'm only requesting the `contacts` scope.\n\nMy issue started happening early March and I haven't made any changes to my oauth flow."
  },
  {
    "poster": {
      "poster_name": "David Al-Kanani",
      "poster_handle": "david.al-kanani"
    },
    "time_stamp": "2021-03-12 07:43:22",
    "text": "Hi there, I’m working on an integration that will use the bulk import API and I’m trying to get more information about the `idColumnType` field in the import request JSON. I see a screenshot of some draft documentation that mentions this field here:\n\n<https://community.HubSpot.com/t5/APIs-Integrations/CRM-Imports-Endpoint/m-p/314350>\n\nIs there a published version of the documentation of these fields anywhere I couldn’t find any?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-03-12 07:47:57",
    "text": "Hey Sidney, I would recommend signing up to our developer changelog here: <http://developers.HubSpot.com/changelog|developers.HubSpot.com/changelog>\n\nWe also take the changes listed there and post them out to the <#CEQQ9NFK2|releases-and-updates> channel here as well as the community developer forums here: <https://community.HubSpot.com/t5/Developer-Announcements/bd-p/developer-announcements>"
  },
  {
    "poster": {
      "poster_name": "Lance Erickson",
      "poster_handle": "lance.erickson"
    },
    "time_stamp": "2021-03-12 08:58:53",
    "text": "That is my understanding. They give an application controlled by you, a third-party, the tools to use the HubSpot API for integrations and provide data for things like CRM cards. Apps can be installed into multiple HubSpot portals, so you can essential have a multi-tenant SaaS app that does whatever you want and has the power to update HubSpot data for your users. Bear in mind I have only created a single private app; I am not the expert here."
  },
  {
    "poster": {
      "poster_name": "Vishesh Singhal",
      "poster_handle": "vishesh"
    },
    "time_stamp": "2021-03-12 10:00:59",
    "edited": {
      "time_stamp": "2021-03-12 10:03:51"
    },
    "text": "Hi everyone, I've created a \"login with HubSpot\" functionality for my web-app. For the oauth client id and secret, I created a HubSpot app. But while logging in, it says that the app is not reviewed by HubSpot. How do I go about the review? Is it same as the review for market place listing? I don't plan to list my app in HubSpot app marketplace as it's a simple \"Login with HubSpot\" funtionality",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-03-12 12:47:28"
      },
      {
        "time_stamp": "2021-03-14 19:37:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rod",
      "poster_handle": "rodrigo666"
    },
    "time_stamp": "2021-03-12 11:15:37",
    "text": "Hi,\nI need to analyze the CRM engagements (activities) data and to do it, I need the history.\nNothing found here:\n<https://legacydocs.HubSpot.com/docs/methods/engagements/get-all-engagements>"
  },
  {
    "poster": {
      "poster_name": "Rod",
      "poster_handle": "rodrigo666"
    },
    "time_stamp": "2021-03-12 11:16:01",
    "text": "Any help on how to achieve this?"
  },
  {
    "poster": {
      "poster_name": "Rod",
      "poster_handle": "rodrigo666"
    },
    "time_stamp": "2021-03-12 11:19:07",
    "text": "Also, for those APIs that supports \"properties history\", how to know WHO did the change? I didn't find this basic info."
  },
  {
    "poster": {
      "poster_name": "Noel Taylor",
      "poster_handle": "ntaylor"
    },
    "time_stamp": "2021-03-12 11:41:47",
    "text": "Hi Lance - Ok - I feel confident that my understanding is not totally off base.  Confident enough to publish anyway and see what happens. Haha. Thanks again for your thoughts."
  },
  {
    "poster": {
      "poster_name": "Daniel Lynton",
      "poster_handle": "daniel014"
    },
    "time_stamp": "2021-03-12 12:47:28",
    "text": "I don't think there's a workaround for this today, but I made a similar inquiry about it"
  },
  {
    "text": "To my knowledge, the only way to link a known contact's email address with their HUTK is to use the Form Submission API. However, this is creating problems on forms with a lot of submission events, like this Login Form example.\n\nIs there another recommended approach to save a contact's UTK to their email address?",
    "time_stamp": "2021-03-12 12:49:49",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-03-12 12:56:29"
      },
      {
        "time_stamp": "2021-03-15 12:12:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Daniel Lynton",
      "poster_handle": "daniel014"
    },
    "time_stamp": "2021-03-12 12:56:29",
    "text": "I answered my own question! The <https://legacydocs.HubSpot.com/docs/methods/tracking_code_api/identify_visitor|Identify a Visitor API>"
  },
  {
    "poster": {
      "poster_name": "Eucimar Raposo",
      "poster_handle": "eraposo"
    },
    "time_stamp": "2021-03-12 16:44:20",
    "text": "Hey guys. I am searching contacts by Phone Number using the api (\n```<https://api.hubapi.com/crm/v3/objects/contacts/search>?```\n)\n. It is saved in various format in my CRM.\nSo when I do the search if the format matches it returns otherwise it does not.\n\nDoes anybody know how to solve this ?\n\nThanks"
  }
]