[
  {
    "poster": {
      "poster_name": "Joao Pegoraro",
      "poster_handle": "joao.pegoraro"
    },
    "time_stamp": "2024-11-25 04:46:45",
    "text": "Hey guys, I integrated the HubSpot Chat widget in our application, however the mobile UI sometimes does not appear fullscreen, possibly due to the user agent being modified by browsers, making it so the chat appears as the web version, even on mobile.\nIs it possible to force the chat to use the mobile, fullscreen UI somehow?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-25 09:55:14"
      },
      {
        "time_stamp": "2024-11-25 09:57:47"
      },
      {
        "time_stamp": "2024-11-25 10:02:14"
      },
      {
        "time_stamp": "2024-11-25 10:03:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "George Kemp",
      "poster_handle": "gkemp"
    },
    "time_stamp": "2024-11-25 09:55:14",
    "text": "Hi, I'm an Engineer from the Live Chat product team. Would love to learn more about where you're seeing this behavior. Is there a specific device that you're not seeing the full screen behavior on?"
  },
  {
    "poster": {
      "poster_name": "Joao Pegoraro",
      "poster_handle": "joao.pegoraro"
    },
    "time_stamp": "2024-11-25 09:57:47",
    "edited": {
      "time_stamp": "2024-11-25 09:58:04"
    },
    "text": "Hey! Yeah, I couldn't add the mobile SDK on my iOS app, due to it having to use an older version of Flutter that does not support Swift Package Manager, a requirement of the SDK.\nSo, I had to implement a webview that opens a webpage, with the web SDK. However, on users that have the 'use desktop version' enabled on their Safari browser (which is a lot of our use base), the chat opens with the little bubble, like desktop, instead of the mobile, fullscreen version.\nI assume this is due to the user agent, is there a way to force the mobile version, regardless?"
  },
  {
    "poster": {
      "poster_name": "George Kemp",
      "poster_handle": "gkemp"
    },
    "time_stamp": "2024-11-25 10:02:14",
    "edited": {
      "time_stamp": "2024-11-25 10:03:07"
    },
    "text": "So there isn't a way to force full screen, however if you're opening a webview that only contains the widget (if I'm understanding what you're doing correctly), then you can embed the widget inline full screen. <https://developers.HubSpot.com/beta-docs/reference/api/conversations/chat-widget-sdk|Here are some docs related to that solution. >\n\nBasically, your webview would contains a div with an specific id (i.e. `#live-chat`), then you use `hsConversationsSettings` to include `inlineEmbedSelector`\n\nThis will ensure that the widget is open and full screen in that webview, and won't show any differences between mobile & desktop.\n\nHopefully that resolves your issue and makes it easier to embed."
  },
  {
    "poster": {
      "poster_name": "Joao Pegoraro",
      "poster_handle": "joao.pegoraro"
    },
    "time_stamp": "2024-11-25 10:03:39",
    "text": "Nice, perfect! I think that will work, I will try it out later. Thanks!"
  }
]