[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 14:00:11",
    "edited": {
      "time_stamp": "2018-09-12 14:02:06"
    },
    "text": "<@U7P6G42AX> would be nice if someone could add in the page editor a data attribute for the module’s id in the design manager. Inside the page editor.\n\nThis would allow us to add a button that if clicked could take a developer directly to that module in the design manager.\n\nThis kind of functionality is something that is perfect for the extension because if you guys were to do it on your end you’d want to add some kind of developer role to prevent marketers from seeing that button and breaking things, and that’d be a massive undertaking. Where as we can do this through the extension with less effort and without worrying about marketers because this is literally a developer extension.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-09-12 14:20:33"
      },
      {
        "time_stamp": "2018-09-12 14:24:03"
      },
      {
        "time_stamp": "2018-09-12 14:25:31"
      },
      {
        "time_stamp": "2018-09-12 14:33:00"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-12 14:20:33",
    "text": "I see, so in the rendered page within the editor something like `data-custom-widget-id=\"...\"` on a custom module?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 14:24:03",
    "text": "I was thinking more like in the page editor itself <https://spin.d.pr/0ClSzZ+>\n\n<https://spin.d.pr/E2EsM3+>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 14:25:31",
    "text": "could work too on those module overlays over the rendered page, just thought that I’d rather not muck with that as I know you guys have some complicated stuff going on to create those overlays."
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-12 14:33:00",
    "text": "Ah I see, in the sidebar then. Yeah the overlays are pretty complicated. I can pass something along to the editors team"
  }
]