[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-05 03:23:31",
    "text": "Hey <@U070KQ765CK>, what is the speed tester showing you as of recommended improvements?\n\nHere's a list of most common speed impacts:\n• images are not optimized for web (rule of thumb: an jpg/png should not exceed 200kb)\n• to many javascripts\n• duplicate/unused code\n• to many redirects (i.e from a to b, from b to c ...; note: HubSpot creates automatically redirects if a page is published and you change the page slug. This can quite often lead to redirect-loops)"
  },
  {
    "poster": {
      "poster_name": "Fran Casal",
      "poster_handle": "fcasal"
    },
    "time_stamp": "2024-07-05 03:28:22",
    "text": "I need to get our invoices in Commerce Hub to show the client´s VAT# automatically besides it´s postal info (legally mandatory around here). Can anyone advice on how to get it done?\nThanks in advance (editado)"
  },
  {
    "poster": {
      "poster_name": "Neeraj Singh",
      "poster_handle": "neeraj.singh"
    },
    "time_stamp": "2024-07-05 03:38:18",
    "edited": {
      "time_stamp": "2024-07-05 03:39:59"
    },
    "text": "I have a Dealer Name object. For each dealer, there are 2 labels:\n\n1. Dealer Contact: The internal contact of each dealer.\n2. Leads: These come through a form, and the association is based on matching the dealer name property.\nI need to send emails to the internal contact of each dealer, providing the data of the leads associated with that dealer.\n\n<@UDA553DRD>"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-07-05 11:17:38",
    "text": "Long shot, but does anyone have any free tickets to <https://www.inbound.com/|INbound> they’re looking to offload? :)"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-07-05 12:05:01",
    "edited": {
      "time_stamp": "2024-07-05 12:05:04"
    }
  },
  {
    "text": "In addition to <@UJAPS2K4N> profound answer, I'd like to mention the huge impact the unused/duplicated code might have on the page speed.  One needs to be careful adding rows, columns, and sections in the Content Editor because it bloats the markup, which significantly increases the time for JS to go through all those HTML elements. Usually, Google has a limit of the elements on the page, which is somewhere around 800. More than that gets penalized.\n\nFor example, if you switch off the display for the desktop in the Content Editor, the code for that section will still be on the page. I'd recommend avoiding this feature.\n\nIn general, Google provides a breakdown of the issues right below the key metrics. So, if you go through that list, you'll be able to figure out how to improve the speed results. Here's an example of the page speed diagnostic",
    "time_stamp": "2024-07-05 23:23:35"
  }
]