[
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-18 07:13:01",
    "text": "Appreciated Robert - yes we have a robust internal IT and App Dev team as well as a small yet capable agency partner."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-18 07:27:45",
    "text": "Shoot this their way and let me know if you have any other questions - I do HIGHLY recommend a HubSpot Technical Consulting service for this because there's a few moving pieces in HubSpot and having the additional troubleshooting is very helpful - This configuration isn't supported by HubSpot's front line support team, so it'll lead to a much more positive outcome with help from a consultant\n\nI'm happy to connect with your Customer Success Manager if you share your HubID"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-18 07:37:56",
    "text": "Hi Robert, much appreciated - let me circle back provided this is the option we want to pursue, our ID = 8300347"
  },
  {
    "poster": {
      "poster_name": "Eric Hirsh",
      "poster_handle": "ehirsh"
    },
    "time_stamp": "2024-07-18 10:15:02",
    "text": "HubSpot Product Manager here! (I have a keyword notification on `whatsapp` :slightly_smiling_face: )\n\nIt sounds like you might be well served by HubSpot's <https://knowledge.HubSpot.com/inbox/connect-whatsapp-to-the-conversations-inbox|own WhatsApp integration>. Incoming WhatsApp messages are directed to HubSpot's Inbox or Help Desk, and you your reps manage those conversations right alongside HubSpot chat or call channels.\nHas conversation user assignment, contact creation/update, all conversation logs are there for admins to see."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-07-18 11:09:25",
    "text": "Happy Thursday, HubSpot Developer Community! In case you don't remember me from your HS Dev Slack welcome DM, I'm SJ, and I lead developer community here at HubSpot. Today, I'm sharing a blog post about a program I've been working on for a long time, and I'm pretty excited about. I hope you will be too! Looking especially at folks who are interested in building a dev career on HubSpot but feel intimidated by all the ways you can do that.\n\n<https://developers.HubSpot.com/blog/introducing-the-HubSpot-developer-mentorship-program> (edited)"
  },
  {
    "poster": {
      "poster_name": "José Martínez",
      "poster_handle": "jose201"
    },
    "time_stamp": "2024-07-18 12:42:57",
    "edited": {
      "time_stamp": "2024-07-18 13:13:39"
    },
    "text": "Hello Eric, thanks for your response. This link is what I was looking for!!, but I see that there is a limitation. \"Each WhatsApp for Business Account can have up to 25 phone numbers associated with it.\"\n\nDoes this means that each employee can interact with 25 leads at the same time? or does it means that each employee can save 25 contacts? if its the second case. Can they interact with more than 25 leads at the same time without saving the contacts?"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2024-07-18 12:43:21",
    "text": "Anyone hook up MS Clarity with HubSpot yet?? :eyes: just got the email",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-19 03:54:49"
      },
      {
        "time_stamp": "2024-07-19 08:12:53"
      },
      {
        "time_stamp": "2024-07-19 08:15:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rohit Kansal",
      "poster_handle": "rohit362"
    },
    "time_stamp": "2024-07-18 13:06:10",
    "edited": {
      "time_stamp": "2024-07-18 13:06:37"
    },
    "text": "Hi everyone, I am trying to use the new Sequences API (Beta) but I get the following error...\n{\n    “status”: “error”,\n    “message”: “The scope needed for this API call isn’t available for public use. If you have questions, contact support or post in our developer forum.“,\n    “correlationId”: “*******************************“,\n    “links”: {\n        “support”: “<https://help.HubSpot.com/>”,\n        “forum”: “<https://community.HubSpot.com/t5/APIs-Integrations/bd-p/integrations>”\n    },\n    “category”: “MISSING_SCOPES”\n}\n\nIs there anyone can help to solve it?"
  }
]