[
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2024-07-17 03:13:07",
    "text": "Hi,\n\nI have two different excel files containing company and contact records exported from other CRM. I have to import it into HubSpot and I want to associate related records. how can I do this via Import tool?\n\nIn company records CSV I have column which containing emails which needs to associate. Please advice if someone already did this before.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-17 03:18:21"
      },
      {
        "time_stamp": "2024-07-17 03:24:35"
      },
      {
        "time_stamp": "2024-07-17 05:43:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Vinayak Jhunjhunwala",
      "poster_handle": "vinayak"
    },
    "time_stamp": "2024-07-17 03:18:21",
    "text": "Hi Jaydip - you can use <http://Superjoin.ai|Superjoin.ai>. It supports two way sync with HubSpot and Google Sheets."
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2024-07-17 03:24:35",
    "text": "Is this able to create association using email?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-07-17 03:32:26",
    "text": "Can you confirm what you mean by application server IP\n\nAre you wanting to host a website on HubSpot on the same domain as an application?\n\nThe @ Hosts would be for the root domain e.g. <http://example.com|example.com> (2 provided for load balancing)\nthe www Host would be for the www subdomain e.g. <http://www.example.com|www.example.com>\n\nI’ve seen people use a separate subdomain for an application e.g.\n<http://app.example.com|app.example.com>\nThis is fairly straight forward.\n\nIf you want both the website to work on <http://www.example.com|www.example.com> and your application to work on <http://www.example.com|www.example.com> this get’s a lot trickier, you’d have to set up a reverse proxy (this also requires a certain tier of HubSpot)\nIt basically involves a setup where you can point certain traffic to one server and certain traffic to another, The best way is to point everything to HubSpot other than for example a path with a wildcard e.g. <http://www.example.com/application/*|www.example.com/application/*> goes to your application server\nand everything else goes to HubSpot.\n\n<https://blog.HubSpot.com/website/reverse-proxy>\n\nI can’t give you any more information on reverse proxies other than I know it’s a pain to setup!"
  },
  {
    "poster": {
      "poster_name": "Ashwaq Reheman",
      "poster_handle": "ashwaqreheman"
    },
    "time_stamp": "2024-07-17 03:37:32",
    "text": "thanks for the info <@UDJV5B73R>, Is there any other way that we an setup the reverse proxy for our subpath like <http://example.com/blog|example.com/blog> to serve the contents of <http://blog.example.com|blog.example.com> because we need <http://example.com/blog|example.com/blog> for seo usecase, we have technical team with us who can understand the technicalities behind the implementation of reverse proxy but currently we cant afford HubSpot CMS Enterprise plan for now"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-07-17 03:48:47",
    "text": "It looks like maybe some people have done it with non enterprise but there’s no documentation\n<https://community.HubSpot.com/t5/CMS-Development/Reverse-Proxy-for-Starter-CMS/m-p/876821>\n\nHere’s the documentation for enterprise\n<https://developers.HubSpot.com/beta-docs/guides/cms/content/performance/reverse-proxy-support>\n\nThe other thing you may be able to do is set your server to dynamically pull the blog pages from HubSpot into your urls, I guess some htaccess rewrite rules or something, but you’ll have to ask your technical team as i’ve not used other servers for quite some time"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-07-17 03:52:19",
    "text": "Looks like the OP here did what you want to do by accident. instead of setting up a redirect that he wanted to do\n\n<https://wordpress.stackexchange.com/questions/129860/permanently-redirect-wordpress-subfolder-blog-to-subdomain-on-another-server>\n\nOnly thing is the pages would be live in 2 places so you’d need to make sure the canonicals are correct or there’s no indexes setup on one server but not the other\n\nIt all get’s very tricky"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-07-17 03:55:33",
    "text": "What I can tell you is one of my clients used weglot translation service which had something setup to add <http://example.com/de|example.com/de> and it was pulling in the HubSpot website, they did not have enterprise however and it kept going down until the client just got rid of the service"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-07-17 05:43:05",
    "text": "<https://knowledge.HubSpot.com/import-and-export/import-objects?hubs_content=knowledge.HubSpot.com/object-settings/automatically-create-and-associate-companies-with-contacts|https://knowledge.HubSpot.com/import-and-export/import-objects?hubs_content=knowledge.h[…]automatically-create-and-associate-companies-with-contacts>"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 08:18:57",
    "edited": {
      "time_stamp": "2024-07-17 08:38:49"
    },
    "text": "Hi! we want to create a subfolder (not a subdomain) on our main domain that will contain tens of thousands of dynamic landing pages. This subfolder will be hosted on a separate server, while our primary website remains hosted on HubSpot.\nWhat would be the best approach to doing this?",
    "reply_count": 14,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-17 12:15:38"
      },
      {
        "time_stamp": "2024-07-17 12:15:59"
      },
      {
        "time_stamp": "2024-07-17 12:17:37"
      },
      {
        "time_stamp": "2024-07-17 12:19:27"
      },
      {
        "time_stamp": "2024-07-17 14:22:19"
      },
      {
        "time_stamp": "2024-07-17 14:24:01"
      },
      {
        "time_stamp": "2024-07-17 14:45:36"
      },
      {
        "time_stamp": "2024-07-17 14:50:37"
      },
      {
        "time_stamp": "2024-07-17 15:02:18"
      },
      {
        "time_stamp": "2024-07-17 15:23:15"
      },
      {
        "time_stamp": "2024-07-17 15:34:23"
      },
      {
        "time_stamp": "2024-07-18 07:13:01"
      },
      {
        "time_stamp": "2024-07-18 07:27:45"
      },
      {
        "time_stamp": "2024-07-18 07:37:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kunal Rwt",
      "poster_handle": "jagmohanrwt1210"
    },
    "time_stamp": "2024-07-17 10:10:34",
    "text": "I want to upload a marketplace theme do I need any kind of partnership with HubSpot ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-17 12:13:12"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-07-17 10:55:02"
  },
  {
    "text": "When you sign up for a provider account you have to accept some terms, but there is not a fee for being a creator <https://www.HubSpot.com/template-providers>",
    "time_stamp": "2024-07-17 12:13:12"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:15:38",
    "text": "Sounds like you would need to setup a reverse proxy. Your domain would funnel into the proxy first, which then would route traffic selectively based on path (i.e. `/special-path` routes to your application and everything else routes to HubSpot"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:15:59",
    "text": "This would require a Content Hub Enterprise subscription"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:17:37",
    "text": "As a super basic example, I have 2 pages you can navigate to:\n1 <https://rp.robertpainslie.com/> - a static site served through AWS S3\n2. <https://rp.robertpainslie.com/proxy-page> is HubSpot hosted\n\nTraffic first hits AWS Cloudfront and then Cloudfront proxies based on the path"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:19:27",
    "edited": {
      "time_stamp": "2024-07-17 12:21:10"
    },
    "text": "Docs: <https://developers.HubSpot.com/beta-docs/guides/cms/content/performance/reverse-proxy-support>\n\nAn article I wrote about this setup (there are several comments that show how to do this in Cloudfront): <https://community.HubSpot.com/t5/CMS-Development/Tutorial-Setting-up-a-Reverse-Proxy-With-HubSpot-CMS-with-sample/m-p/435961>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:27:54",
    "text": "Can you highlight a few things to help troubleshoot:\n• what property was added?\n• where it was added?\n• what code was changed?\n• Where does it work and were doesn't it work?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-17 14:22:19",
    "text": "<@U041PDJ1HNZ> I just replied in the <#CF540P856|seo> channel. When you post the same question in multiple channels, make sure you cross post rather than create separate posts \n\n<@UJJ239SC9> your example is the opposite configuration of what he's looking for. Website is on HS and the proxy would be external - I've only done these as you have noted, if it is opposite does it still require the enterprise subscription?"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 14:24:01",
    "text": "Good news is that we do have an Enterprise Subscription - another recommendation we got is via CNAME <https://easydmarc.com/blog/what-is-a-cname-record-and-how-to-create-it/> would that work better?"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 14:45:36",
    "text": "A CNAME is kinda like your postal address whereas an A record is kinda like GPS coordinates - both detail where you can \"find\" a building, but they're different ways of finding the same place (in this case the building is your website address).  And in this case, it's a part of the overall solution, but the first/key problem isn't not knowing where to look, but rather how to route traffic to the right location.\n\nExtending the analogy a bit (apologies if this is pedantic, not intended)\n\nConsider your domain (<http://www.domain.com|www.domain.com>) as a building where people live.\n• Today, you have a single family home and when your mail carrier delivers a letter, assuming they get the address correct (It could be an IP address or a CNAME record that tells the DNS server where to find your website), the mail ends up on your kitchen counter for the addressed recipient to open, and then write a reply letter back to (that's your webpage content delivered to the visitor)\n• What you're looking to do now is condo-ize your building and have new residents move into the sub-divided house, each with their own apartment number, but the mail carrier doesn't know there are unique apartments inside - it's still the same building- the building is the same on the outside, but now an addressed letter that comes through the front mail slot needs someone inside to say \"Oh, this one goes to unit 1, this one goes to unit 2\"\n    ◦ HubSpot CMS/Content Hub does not directly offer a proxy routing service that can say \"when a request is on `<http://domain.com/page|domain.com/page>` it should go to unit 2 (this IP address or this CNAME), but when it's for `<http://domain.com/other-page|domain.com/other-page>` it should go to unit 1 (some other IP address or some other CNAME)\n    ◦ Instead, you need to add a letter router (i.e. separate mailboxes that have names on them) that is outside the building (this is where the analogy is stretched a bit) and then your letter router knows that items addressed to Rob go to unit 1 but items addressed to EJ go to unit 2 - instead of doing the letter routing inside the current building, you need to place a router in front of the building"
  },
  {
    "text": "In your current setup, the routing goes: User &gt; Internet &gt; DNS &gt; HubSpot Web servers\n\nIn this type of setup, the routing would go: User &gt; Internet &gt; DNS &gt; Proxy server &gt; (Split) HubSpot Web Server OR Custom application server",
    "time_stamp": "2024-07-17 14:50:37"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 15:02:18",
    "text": "What you need is:\n• Developer familiar with DNS &amp; either a CDN service or launching a load balanced web-server like NGINX\n• Dev, Testing &amp; Launch plan\n• Connect web domain to CDN &gt; proxy requests to HS or application\nOr...host this application on a subdomain instead of a subdirectory - it's probably easier.\n\n:question: Out of curiosity, what is the content of the site? (What is dynamic about it?)"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 15:23:15",
    "text": "Much appreciated Robert - and no offense to dumbing it down for me at all. We did try the subdomain route - while technically simpler, it is much slower to build domain authority i.e. drive page productivity.\nRe your content question - we have information on 100s of Ks of parts and if a prospect searches on that specific part#, we can offer a page that combines the insights we have about that part (some predefined, some pulled from separate DBs) to impress them towards a trial &amp; subscription."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 15:34:23",
    "text": "Do you have a dev or agency that’s still working on this app that could work on a proxy setup?\n \nIf so, I’d also recommend a HubSpot consulting block to help with the HS side of things. "
  },
  {
    "poster": {
      "poster_name": "José Martínez",
      "poster_handle": "jose201"
    },
    "time_stamp": "2024-07-17 16:00:07",
    "text": "Hello everyone, Im trying to implement this CRM on my company and cant completely figure it out yet, so I prefer to ask if its possible to achieve this to make sure Im on the right path. Thanks on advance.\n\nI have a website where the users can click on the WhatsApp contact button and it opens WhatsApp app to allow them to send a message. Now we are using WhaTicket, but its mostly for chats and not for calls, also de logs are not so useful for our needs.\n\nIm looking to automatically assign one of those chats to an employee and where the employees can chat and call directly from the crm leaving all the logs for the admin to see.\n\nFor now Im having trouble finding how to add the new contacts on HubSpot when they use the WhatsApp button. The contact should be created with only the number, and later, each employee must be able to add the other fields like email, name, notes, etc.\n\nWhen an employee receive a contact, it should be able to call, chat, send audios, images and files. While all employees interact with the clients/leads, an admin should be able to see all the logs possible\n\nIt is possible to achieve this flow/structure with HubSpot? I would appreciate any help or hint you could give me.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-18 10:15:02"
      },
      {
        "time_stamp": "2024-07-18 12:42:57"
      },
      {
        "time_stamp": "2024-07-22 08:42:35"
      },
      {
        "time_stamp": "2024-07-22 10:28:24"
      }
    ]
  }
]