[
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2024-07-24 01:20:48",
    "text": "Hey all, not sure where this sites but is it possible to store a pkl file in HubSpot and then call it using a custom code action?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-24 02:34:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-24 02:34:13",
    "edited": {
      "time_stamp": "2024-07-24 02:34:50"
    },
    "text": "Hi  <@U04512YU6GH>,\nI'd assume you're able to upload a pkl file to the files-manager, create a custom module for your desired outcome and call the pkl file either by \"hard-coding\" the url to it in the custom module or - add a simple text field(not rich-text) and use it for calling the url of the pkl file.\n\na simple example:\n```<script src=\"{{ module.url_to_pkl_file }}\"></script>```\nIn this example I've named the text field \"URL to pkl file\""
  },
  {
    "poster": {
      "poster_name": "Simone Del Gatto",
      "poster_handle": "simone.delgatto"
    },
    "time_stamp": "2024-07-24 02:42:36",
    "text": "Hello I'm building a custom card using react and beta dev tool. I need that when a company is added to my deal my card get this update. The only solution I found is make a polling to api to get this updates. Can I use a better and more reactive solution?"
  },
  {
    "poster": {
      "poster_name": "Ryan Tuck",
      "poster_handle": "sampsontuck"
    },
    "time_stamp": "2024-07-24 03:40:27",
    "text": "hey guys :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ryan Tuck",
      "poster_handle": "sampsontuck"
    },
    "time_stamp": "2024-07-24 03:40:29",
    "text": "Is it worth setting up meta conversions API to optimize my ad spending when trying to sell products on HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Ryan Tuck",
      "poster_handle": "sampsontuck"
    },
    "time_stamp": "2024-07-24 03:41:33",
    "text": "I'm new to HubSpot and can't seem to find any information on this. I'm beginning to think, when runnings ads on facebook through HubSpot all conversion apis are tracked?"
  },
  {
    "poster": {
      "poster_name": "Priyanka Salodia",
      "poster_handle": "minipikupie"
    },
    "time_stamp": "2024-07-24 04:16:04",
    "text": "Can anyone help me creating High Probability report - Basically m interested in report of 2 keywords , i want to know the no. of users came after searching that 2 keywords\n\nneed that report from HubSpot"
  },
  {
    "poster": {
      "poster_name": "Tim Venters",
      "poster_handle": "tventers00"
    },
    "time_stamp": "2024-07-24 07:06:53",
    "text": "Hi, I'm trying to enable voice narration for my blogs in HubSpot. I know I need to implement a piece of code into the template but I'm wondering where do I put the piece of code to have the narration option appear at the top of the blog?"
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-07-24 08:41:02",
    "text": "Hello, can someone give me clarity for what happened,\n\nMy client have 2 Blogs, one is Case Studies and the other is News.\nMy client said that he was making changes and would like to remove some static module from the blog template and was able to access the codes via the edit template in the settings from the Content Editor.\nHe said that he did not save the change but I received an urgent email that all the content (content.post_body) has been missing from the Case Studies blog and upon checking the individual blog through the Content Editor, all the history have no content too. When I checked the Design Manager for the file that was supposed to be edited, there was no revision record.\n\nWhat is happening here? Where are all the contents from the Case Studies blog? All the News blog is not affected though."
  },
  {
    "text": "According to the documentation there should be some buttons in this white bar to toggle the breakpoints but they are not showing up for me. Any clue why? Was this moved to somewhere else? I've looked in both Safari and Chrome.",
    "time_stamp": "2024-07-24 08:45:09",
    "edited": {
      "time_stamp": "2024-07-24 08:45:37"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-24 09:58:12"
      },
      {
        "time_stamp": "2024-07-24 10:01:04"
      }
    ]
  },
  {
    "text": "i want to remove this domain views filter on above\n\n\\",
    "time_stamp": "2024-07-24 09:42:03"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-24 09:58:12",
    "text": "Your theme should have this part in the theme.json file:\n\n```\"responsive_breakpoints\": [\n        {\n            \"name\": \"mobile\",\n            \"mediaQuery\": \"@media (max-width: 480px)\",\n            \"previewWidth\": {\n                \"value\": 480\n            }\n        }\n    ]```"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-07-24 10:01:04",
    "text": "So it's a theme issue. Got it. For now I just manually added the css for this because it was just one thing and soon I will be replacing it with my own theme."
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-07-24 10:55:02"
  },
  {
    "poster": {
      "poster_name": "Justin Dearing",
      "poster_handle": "justin.dearing"
    },
    "time_stamp": "2024-07-24 11:08:59",
    "text": "Need help from HubSpot app developers. I think I might be dumb idk lol.\nI have created a development sandbox account using HubSpot's cli. I then uploaded a project I've been working on to this account. I can even view the card and it is working as expected. However whenever I navigate to the applications page, it tells me \"This isn't a developer account\" and tells me to create a free developer account which when I do creates a totally different account that isnt using this development sandbox.\nHow can I link a developer account to *THIS* development sandbox? All help much appreciated.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-24 12:04:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-07-24 12:04:44",
    "edited": {
      "time_stamp": "2024-07-24 12:05:07"
    },
    "text": "Hey Justin, so developer sandboxes are associated to a parent account that is subscribed to the product hubs. Developer accounts are only intended for public app development and cannot be used with private apps and projects. If you intend to migrate your private app and project to a production account, you should be able to upload to the parent account it is associated with. You can use the CLI commands `hs accounts list` and `hs auth` to see these relationships and add other accounts that you have access to."
  },
  {
    "text": "talk to me about CSP nonces, please.\n\nwe have CSPs on some clients' sites in HubSpot, not yet using the nonce. i want to enable the nonce.\n\nit sounds like enabling nonce is a matter of that single click in the checkbox, but I don't want any surprises if i can help it.\n\nthis message box in the documentation is confusing me. does \"automatically\" mean this happens whether or not the nonce is enabled, OR does it mean that ONLY HubSpot-delivered assets are \"nonced,\" so to speak?\n\nif i click that checkbox, is there anything else that will need to be done, or does that one click really solve it all?",
    "time_stamp": "2024-07-24 12:38:40",
    "edited": {
      "time_stamp": "2024-07-24 12:39:07"
    }
  }
]