[
  {
    "poster": {
      "poster_name": "Vanessa Vettor",
      "poster_handle": "vanessa556"
    },
    "time_stamp": "2024-07-15 04:37:19",
    "text": "Hello all! Hope your week is starting well!\n\nQuick question, have someone worked with retrieving the information of inMails in HubSpot?\nI understand that in this cases the native connection don't allow to update the activity related to inMails and that a Zapier could be a solution.\nJust wondering if someone else has done it in the past?\nand if I will have to create a form for this in HS to add to my Zap? :eyes:\n\nMany thanks in afvance!"
  },
  {
    "text": "When I try to connect my domain with HubSpot you are asking to replace the cname and A records, I'm curious if i have changed my DNS records then how does the DNS resolve to my Application server IP",
    "time_stamp": "2024-07-15 07:14:13",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-17 03:32:26"
      },
      {
        "time_stamp": "2024-07-17 03:37:32"
      },
      {
        "time_stamp": "2024-07-17 03:48:47"
      },
      {
        "time_stamp": "2024-07-17 03:52:19"
      },
      {
        "time_stamp": "2024-07-17 03:55:33"
      }
    ]
  },
  {
    "time_stamp": "2024-07-15 08:00:22",
    "text": "Reminder: Did you know you can message <@U02162GK9SP|sprocky> at any time to get HubSpot development questions answered? It’s an experimental chat bot built to tackle developer questions. It won’t read your code, but can answer a lot of questions about building on the HubSpot platform."
  },
  {
    "poster": {
      "poster_name": "Willy Hernandez",
      "poster_handle": "willy"
    },
    "time_stamp": "2024-07-15 12:07:53",
    "text": "Hey Kyle - out of curiosity how did you sign up for a sandbox? We're trying to get one haha"
  },
  {
    "poster": {
      "poster_name": "Walter",
      "poster_handle": "art.wado"
    },
    "time_stamp": "2024-07-15 19:31:36",
    "text": "Hello, I am a front end developer, I am new here. \n\nI have started studying HubSpot CMS, I already have the files locally to develop a theme and everything is new.  any advice?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-16 08:06:50"
      }
    ]
  }
]