[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-31 01:17:57",
    "text": "Might seem obvious but since it's a common thing: Please make sure to click \"update the form\" everytime you change something in the form. Otherwise the changes won't be visible"
  },
  {
    "poster": {
      "poster_name": "Marcel van Beek",
      "poster_handle": "marcel077"
    },
    "time_stamp": "2024-07-31 02:19:11",
    "edited": {
      "time_stamp": "2024-07-31 02:21:38"
    },
    "text": "Hello everyone!\n\nI had a perfectly working app with custom crm-cards (<https://app.HubSpot.com/ecosystem/6097154/marketplace/apps/finance/accounting/exact-online>) on deals, contacts and companies. I removed the record target-types contacts and companies (but left the deal-target type). After re-installation of the app the crm-cards widget isn’t visible anymore. For customers that didn’t re-install the app it’s still showing up. Does anyone recognize this or have an idea how to fix?\n\nI already asked it in the HubSpot community and @JarnoKoopman seems to have the same problem: <https://community.HubSpot.com/t5/APIs-Integrations/CRM-cards-not-visible-after-re-install/m-p/1018289#M75387>\n\nAny help is really appreciated"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-31 04:08:14",
    "text": "Does an error message appear when you try to delete or it just doesn't work?"
  },
  {
    "poster": {
      "poster_name": "Dnyaneshwar Zukle",
      "poster_handle": "zukle855198"
    },
    "time_stamp": "2024-07-31 04:09:26",
    "text": "It just doesn’t work. I can see any error when remove and refresh the then again I can see the same fields"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-31 08:59:01",
    "text": "I haven't run into this before, without seeing the hubDB configuration it's hard to troubleshoot. It would be best to submit a ticket to support to see what's going on."
  },
  {
    "poster": {
      "poster_name": "Dnyaneshwar Zukle",
      "poster_handle": "zukle855198"
    },
    "time_stamp": "2024-07-31 08:59:47",
    "text": "Ok"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2024-07-31 10:13:39",
    "text": "Is there a way to pass an offset to\n```blog_recent_posts```\n? I need to fetch over 200 posts client side"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-07-31 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Leticia de Clickplan",
      "poster_handle": "leticia389"
    },
    "time_stamp": "2024-07-31 11:03:08",
    "text": "`Hi everyone, I just landed here and I'm excited to join the HubSpot Developers community!`"
  },
  {
    "poster": {
      "poster_name": "Anubhav Sharma",
      "poster_handle": "anubhav"
    },
    "time_stamp": "2024-07-31 18:49:43",
    "text": "Hi Everyone, I have a question about giving access to my team members\nI basically gave all the permissions manually to my team members but they are still not able to connect it to an external application.\nIf someone can share their thoughts?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-01 02:08:15"
      },
      {
        "time_stamp": "2024-08-02 10:55:25"
      },
      {
        "time_stamp": "2024-08-19 11:08:26"
      },
      {
        "time_stamp": "2024-08-19 11:08:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Priya",
      "poster_handle": "priya.chouhan"
    },
    "time_stamp": "2024-08-01 00:25:49",
    "text": "Hi Everyone\nIs there any plugin or script in HubSpot that I can add to my website , so that it reduce the loading time ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-01 02:31:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Takuya Hashimoto",
      "poster_handle": "takuya.hashimoto"
    },
    "time_stamp": "2024-08-01 00:59:33",
    "text": "HI Everyone, I am looking for Endpoint for Sending Message and Checking Agent Availability, Initialising Conversations.\n\nTo seamlessly integrate our live chat widget with HubSpot, we need all the necessary endpoints that facilitate communication between our live chat system and HubSpot's agents and users. This integration is crucial for providing a smooth and efficient interaction between customers and agent. However, we have encountered several significant issues in achieving this goal due to gaps in HubSpot's official documentation of below mentioned endpoints.\n\n1. No Endpoints for Sending Messages:\n  - The official HubSpot documentation does not provide endpoints for sending messages from customers to agents.\n  - This absence creates a significant gap in functionality, making it impossible to enable direct communication between customers and agents through our live chat product.\n\n2. No Endpoints for Checking Agent Availability:\n  - There are no documented endpoints for checking agent availability in HubSpot.\n  - Without this information, our system cannot accurately determine if an agent is available to respond to a customer.\n\n3. Missing Endpoint for Initialising Conversations:\n  - To create a new conversation from our live chat product, we require an endpoint to initialise the conversation, which is not documented.\n  - This endpoint is essential for starting a new interaction between a customer and an agent. The absence of this endpoint hinders the ability to initiate new conversations from our system\n\nIf you can allow to see those Endpoint, it would be great.\nThanks\nTakuya"
  }
]