[
  {
    "poster": {
      "poster_name": "Dnyaneshwar Zukle",
      "poster_handle": "zukle855198"
    },
    "time_stamp": "2024-07-16 01:58:18",
    "edited": {
      "time_stamp": "2024-07-16 01:59:15"
    },
    "text": "Hi all, I just want know one this is this possible or not.\n\nI have one contact us page with form and in that form there is one dropdown filed with a,b,c values. now I have saperate pages a, b and c so I want if user goes to contact page from ‘a’ page then ‘a’ dropdown a should be by default and if user from b or c then the dropdown should be by default ‘c’ or ‘b’",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-16 06:26:57"
      },
      {
        "time_stamp": "2024-07-16 07:56:37"
      }
    ]
  },
  {
    "text": "Hi everyone! Just joined here after someone from HubSpot support recommended asking in this channel so I hope someone can help me.\nI am trying to edit a quote in design manager by adding a custom property. I managed to get it working for the line items, however not for the line items table that actually appears on the quote.\nMade a child theme out of the line items table and added it under content options but it does not work. Can you please let me know what am I doing wrong? Any help is much appreciated! :pray:",
    "time_stamp": "2024-07-16 02:50:00",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-17 12:27:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2024-07-16 06:26:57",
    "text": "Give this a try: <https://knowledge.HubSpot.com/forms/can-i-auto-populate-form-fields-through-a-query-string>"
  },
  {
    "poster": {
      "poster_name": "Sabir Buxsoo",
      "poster_handle": "sabir"
    },
    "time_stamp": "2024-07-16 07:49:02",
    "text": "Hey everyone, I hope this is the right channel for this question. Is it actually possible to upload files from the new HubSpot React CRM UI Cards?"
  },
  {
    "poster": {
      "poster_name": "Dnyaneshwar Zukle",
      "poster_handle": "zukle855198"
    },
    "time_stamp": "2024-07-16 07:56:37",
    "text": "Thanks for sharing <@U058ZPH175H> I will try this approach."
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-07-16 08:06:50",
    "text": "Hey :wave:\nThe best possible advice would be to check HubSpot documentation on CMS development\n<https://developers.HubSpot.com/beta-docs/guides/cms/overview>"
  },
  {
    "text": "Hello busy people! :wave:\nI’m new in the HubSpot development and I’m happy to be in the right place.\n\nI’m working on a new project that was done by previous developers, and I ran into the following problem:\n\n• There are two identical search-results.html files in the database and while one redirects and displays search results, the other uses the same parameter but has no relevant search on its domain and webpage.\nHow to solve this problem?\n• New search-results. html or modify part of the existing one to redirect well? :thinking_face:\nI would really appreciate if you could share any examples of your solutions for this kind of a problem, or similar. Thanks! :pray:",
    "time_stamp": "2024-07-16 08:28:55"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2024-07-16 08:55:09",
    "text": "is there a way to do a global search on a HubSpot site to see where certain keywords are used?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-16 08:59:23"
      },
      {
        "time_stamp": "2024-07-16 09:01:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-16 08:59:23",
    "text": "Hey <@U05S96AE2N8> You can implement a global search with a results page... If you'd like to have the results categorized like\n• Blog\n    ◦ result with keyword\n    ◦ result with keyword\n    ◦ result with keyword\n• Website\n    ◦ result with keyword\n    ◦ result with keyword\n    ◦ result with keyword\nIt can be done with a bit of custom code"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-07-16 09:00:02",
    "edited": {
      "time_stamp": "2024-07-16 09:00:13"
    }
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2024-07-16 09:01:22",
    "text": "oh oh sorry i wasnt clear in the initial ask!! This is for internal use. We want to swap out any use cases of Keyword A and replace it (if applicable) with Keyword B"
  },
  {
    "poster": {
      "poster_name": "Andrew Schulz",
      "poster_handle": "andrew448"
    },
    "time_stamp": "2024-07-16 09:42:05",
    "text": ":wave: Hi everyone! Partner from Northwest and I'm looking for some support in the Insurance space. Has anyone integrated with IVANS directory to HubSpot? My client is transitioning from BetterAgency and IVANS has a direct API and I am hoping one of you rockstars has done something similar. Thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Ben Gordon",
      "poster_handle": "ben.gordon"
    },
    "time_stamp": "2024-07-16 10:06:07",
    "edited": {
      "time_stamp": "2024-07-16 10:09:30"
    },
    "text": "Hey James, thanks for responding. I've had a chance to watch your demo on the app but I have a few questions. Ultimately I am trying to get data from prod into developer accounts to test out new code.\nAt the free level, I see schema can be replicated but not data. Wouldn't the data be necessary for development?\nAnd with this tool along with a script to import pages, would that be everything? Are there more objects I should be aware of other than pages?\n<@U6URG5205>"
  },
  {
    "poster": {
      "poster_name": "Michal Wezykowski",
      "poster_handle": "michal.wezykowski"
    },
    "time_stamp": "2024-07-16 19:38:02",
    "text": "Hi everyone, I'm lost and in need of help. Is there a way to purge property after archiving it and then deleting it so it can be recreated with unique values set to true? \n\nCurrently after archiving and deleting property, recreating with a unique flag set to true returns error readable only through API that id was previously used. Recreating property with flag set to false restores all records. Not sure why would you even have a delete function that doesn't actually delete :joy: \n\nI was hoping that HubSpot support will help with this but I was left with a generic answer, promise that they are working on a feature to fix this and no viable solution. :confused: All my hopes are with you!"
  }
]