[
  {
    "poster": {
      "poster_name": "Eloy",
      "poster_handle": "egonzalez"
    },
    "time_stamp": "2022-04-27 02:45:38",
    "text": "Hello,\nI am following the following tutorial to create a Media Bridge Object <https://developers.HubSpot.com/docs/api/media-bridge/|(https://developers.HubSpot.com/docs/api/media-bridge/>).\nThe application get registred correctly but when I try to make the call to create an initial Media Bridge Definition I get an error if the object is of type 'OHTER'.\n```{\n  \"status\": \"error\",\n  \"message\": \"The MediaType provided is not currently supported for creating new object definitions.\",\n  \"correlationId\": \"f8afe9a6-48da-4a61-af55-1a871adca123\",\n  \"context\": {\n    \"App Id\": [\n      \"847718\"\n    ],\n    \"Media Type\": [\n      \"Other\"\n    ]\n  },\n  \"category\": \"BAD_REQUEST\"\n}```\nI have tried with the other object types (VIDEO, AUDIO) and it works. There is only a problem when I try with 'OTHER'.\nAny solution?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-27 11:52:12"
      },
      {
        "time_stamp": "2022-04-28 05:24:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Shaw",
      "poster_handle": "cshaw"
    },
    "time_stamp": "2022-04-27 11:52:12",
    "text": "Hi Eloy, this is an intentional error/blocking point on our side. While we do have an “other” media type, we have been trying to limit its usage when possible given its very generic nature. Most of the hesitation on our side is making sure we can provide a good user experience for the various media types, and for the “other” type, it is very hard for us to provide a good experience since it is unclear exactly what the ideal experience would be.\n\nWith that said, I’d love to hear what you were hoping to build using the “other” media type, so that we can help provide a path forward. Maybe it makes sense to provide a new media type to support your use case, or if that doesn’t makes sense, we could allow your app to create an “other” media type."
  }
]