[
  {
    "poster": {
      "poster_name": "Matthew Farmer",
      "poster_handle": "matthew130"
    },
    "time_stamp": "2019-08-19 08:11:45",
    "edited": {
      "time_stamp": "2019-08-19 08:16:39"
    },
    "text": "In those code samples, it looks like the content inside the `&lt;div class=\"left-invest\"&gt;` element would be swapped with the content inside the `&lt;div class=\"right-invest\"&gt;` element within the “slider video section”"
  },
  {
    "poster": {
      "poster_name": "Kira Jankowski",
      "poster_handle": "kjankowski"
    },
    "time_stamp": "2019-08-19 09:08:10",
    "text": "<@UMEA5PRC7> - here’s the link <https://www.tapemark.com/>"
  },
  {
    "poster": {
      "poster_name": "Julie Howsmon",
      "poster_handle": "jlhowsmon"
    },
    "time_stamp": "2019-08-19 14:41:55",
    "text": "Hello! I'm trying to create a second global footer for a different business we have. The main business's site settings are loaded and I can't seem to create a footer that HubSpot will accept for an email with the required street address, phone, unsubscribe. Is anyone able to help with the code?"
  },
  {
    "poster": {
      "poster_name": "Matthew Farmer",
      "poster_handle": "matthew130"
    },
    "time_stamp": "2019-08-19 19:49:57",
    "edited": {
      "time_stamp": "2019-08-19 20:08:48"
    },
    "text": "Thanks, I checked the page out.\n\nI’ve only been able to consistently replicate the issue you’ve described if I use Chrome at &lt; 768px viewport width (the mobile layout). The screen jump occurs for me if I click on the 2nd through 6th expert in the list, but not the last three. The “jumping” does go to roughly the same spot on the page each time regardless of which expert link I click, which was slightly above the 2nd expert in the list.\n\nThe hash links and IDs look good to me: the IDs matched up and I was taken to the correct expert initially when clicking the links before the jump each time. Perhaps there is content on the page which is not initially loaded when taken to the experts section, but once the content fully loads, it pushes the content down the page causing the jump in position? I’m not sure.\n\nWhen I checked the Chrome dev tools, it looked like there was a brief moment in the Chrome elements inspector in which the expert images were not present within the `class='left-col eq-height'` divs during the initial page load, but were then inserted soon after. Perhaps that is related to the page jump issue and affects the positioning of elements on the page after first load."
  }
]