[
  {
    "poster": {
      "poster_name": "Alexandru Bajenaru",
      "poster_handle": "alex555"
    },
    "time_stamp": "2022-03-24 03:15:00",
    "text": "Hi everyone, new in this group, growing interest in developing things in HubSpot. Greeting from Romania, Alex",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-24 03:15:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-03-24 03:15:35",
    "edited": {
      "time_stamp": "2022-03-24 03:15:50"
    },
    "text": "Hi Alexandru, welcome to this Slack"
  },
  {
    "poster": {
      "poster_name": "Prabin Shrestha",
      "poster_handle": "pshrestha"
    },
    "time_stamp": "2022-03-24 03:28:31",
    "text": "Hello everyone,\n\nI am preety new to development in the HubSpot and looking for some help from the community.\n\nWe are trying to build a form in HubSpot for creating tickets from the forms and  we would like to add the companies and deals(already in the HubSpot) as dropdown in the form so that we can know about the company and deal for which the ticket belongs to. Is it possible to add companies and deals dynamically on HubSpot form load?\n\nThank you"
  },
  {
    "poster": {
      "poster_name": "Gunnar Normand",
      "poster_handle": "gunnarnormand"
    },
    "time_stamp": "2022-03-24 13:34:37",
    "text": "Hello everyone!!! :fiestaparrot:\n\nMy name is Gunnar I'm a Front-End Dev and Agency owner looking to collaborate on HubSpot development projects. I'm excited to be working with this new and upcoming platform and I'm grateful to have this community to bounce ideas off of and learn from.\n\n*I am working with a HubSpot Agency Partner to develop our own Boilerplate theme for new projects loosely based off of HubSpot's and am curious if anyone has done something similar or has any related wisdom to share on that subject...* \n\nThanks and looking forward to connecting with y'all!\n\nGunnar Normand"
  }
]