[
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-04-19 10:00:15",
    "text": "Hey HubSpot Developers - as per our <https://developers.HubSpot.com/slack/code-of-conduct|Code of Conduct for this Slack>, we're letting you know that *we've made a few key changes and additions to the Code of Conduct that you should all be aware o*f. Here they are:\n\n• <https://developers.HubSpot.com/slack/code-of-conduct#updates-to-this-code-of-conduct|HubSpot reserves the right to downgrade or deactivate this Slac>k at any time but we are committed to doing so with plenty of notice to the community _(adding my note here: don't worry, it's not going anywhere anytime soon!)_\n• <https://developers.HubSpot.com/slack/code-of-conduct#undisclosed-use-of-ai-in-questions-responses-or-conversations|You MUST disclose if you are using AI/GPT> in any of your questions, code samples or responses, and you  should be very careful not to input any HubSpot sensitive information into any AI/GPT tool.\n• <https://developers.HubSpot.com/slack/code-of-conduct#use-of-the-HubSpot-developer-slack-for-private-team-conversations|You should NOT use this Slack for private team conversations>. By joining the HubSpot Developer Slack, you are making a commitment to contribute to the broader HubSpot Developer Community. No conversation topics are discouraged (that abide by this Code of Conduct), but we ask that you do not use the Developer Slack to conduct private company business through Direct Messaging or other means. \n• Finally, <https://developers.HubSpot.com/slack/code-of-conduct#reporting-code-of-conduct-violations|we've added a form to report any code of conduct violations>, with the option of anonymity. \nPlease let us know if you have any questions, and thanks for continuing to make this Developer Slack awesome!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-04-19 10:12:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-04-19 10:12:36",
    "text": "Thanks for the question <@UBT0AHWLD>! A few reasons.\n1 - GPT responses/answers aren't human. We want human participation in here. We don't mind if you use it, but it's important you first declare you are a human using it.\n2 - Similarly, using a GPT/AI generated question, response, code sample, etc is getting into sketchy ownership ground. Did you write the content/code you're posting in here? We want to ensure folks are directly responsible for what they post in here.\n3 - GPT generated code is often erroneous, and will, for example, make up HubSpot API endpoints that don't exist. Without disclosing that code is generated by AI, you're omitting a vita piece of information to help navigate an issue.\n\nFinally, we are making this specific inclusion now because AI/GPT is now and evolving fast. We are keeping our eyes on how it evolves. We need to know when it's being used so we can best help the community evolve alongside the evolution of AI."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-04-19 17:34:52",
    "edited": {
      "time_stamp": "2023-04-20 07:37:01"
    },
    "text": "_Edit: The dev doc was temporarily rolled back to a prior state, will remove this edit when we go live again with the updated explanation._\n\nNot quite a new release but felt posting it here was warranted:\n*Have you ever wanted to rename module fields, move them into different field groups, or even replace them with other module field types but chose not to because that would break existing pages depending on that module?*\n\nWhile this feature was announced a few months ago, I’ve updated the documentation to make it more clear how to use Aliases for module fields. Check it out, it’s a pretty powerful tool, for both marketplace providers and developers maintaining websites after they’ve gone live.\n\n<https://developers.HubSpot.com/docs/cms/marketplace-guidelines/module-requirements#aliases>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-04-20 05:42:46"
      }
    ]
  }
]