[
  {
    "poster": {
      "poster_name": "Joe Jerome",
      "poster_handle": "jerome"
    },
    "time_stamp": "2021-06-11 16:54:14",
    "text": "<@UCTAN7RPA> found out it was a bug after an update to an unrelated system update the flopped over into the variable for datetimeformat that supports the selector for that item in HubDB.  The issue was that the bug displayed the HubDB selector in GMT0 when it was supposed to display the selector in Local Time for the Account.  I knew it was a bug as you would never display a selector based on GMT0 in a HubDB table.  I do understand that the system value could be that.  And also understand that the solution you provided is very useful for rendering output as it can be confusing when dealing with multiple timezones as to what to display.  The HubSpot End User would want to input values for events in their local time and the end user reading the page would want it in their local time.  Nonetheless, they fixed it back on the selector to make sense.  I'm not sure how many people it may have impacted.  But if you are running events with memberships the impact is severe as you are displaying incorrect event times for things hundreds of people are registering for and planning on attending.  Thanks for the answer on that too.  Much appreciated!"
  },
  {
    "poster": {
      "poster_name": "Joe Jerome",
      "poster_handle": "jerome"
    },
    "time_stamp": "2021-06-11 16:57:27",
    "text": "My advice for those in the Membership area of HubSpot product is to let the team know of the importance of testing before they implement a change of events and memberships with HubDB.  As their testing process before going live should reflect a sample of a membership portal and to understand that events is more major testing point than it may have been in the past."
  },
  {
    "poster": {
      "poster_name": "Joe Jerome",
      "poster_handle": "jerome"
    },
    "time_stamp": "2021-06-11 17:01:02",
    "text": "Also what I found is that they are pushing system changes out on Friday with no Weekend Engineering escalation during the weekend.  I'd not advise pushing system changes on a Friday to anyone.  And if you do, please make sure you have 7 day per week 24/7 full escalation in place.  Which as a Global/Remote organization should seem to be a bit easier than perhaps in the past."
  }
]