[
  {
    "poster": {
      "poster_name": "Kyle Geiste",
      "poster_handle": "kg"
    },
    "time_stamp": "2019-09-18 08:51:33",
    "text": "Hey Mark! Thanks for the question. can you tell me a little more about that?"
  },
  {
    "poster": {
      "poster_name": "Mark Croft",
      "poster_handle": "mark184"
    },
    "time_stamp": "2019-09-18 08:54:11",
    "text": "Sure thing.  Since I can't create a custom Section with configuration visible in the editor like I can for Modules, I'm looking for a way that I can have more control over a section and how it looks.  Right now, I can't target a specific section to style it.  Being able to add a CSS class would make that a lot easier."
  },
  {
    "poster": {
      "poster_name": "Mark Croft",
      "poster_handle": "mark184"
    },
    "time_stamp": "2019-09-18 08:54:45",
    "text": "Here's a page I'm playing with <http://HubSpot-developers-1w7chhd-5091472.hs-sites.com/dnd-test-page>"
  },
  {
    "poster": {
      "poster_name": "Mark Croft",
      "poster_handle": "mark184"
    },
    "time_stamp": "2019-09-18 08:57:24",
    "text": "being able to add a class to the first Section that would allow me to style a page banner area (maybe to allow me to add a screen over the background image or have a consistent way to specify if a title should be dark or light)"
  },
  {
    "poster": {
      "poster_name": "Mark Croft",
      "poster_handle": "mark184"
    },
    "time_stamp": "2019-09-18 08:57:52",
    "text": "Right now, I don't think I can even add a CSS class to a section in HubL"
  },
  {
    "poster": {
      "poster_name": "Kyle Geiste",
      "poster_handle": "kg"
    },
    "time_stamp": "2019-09-18 09:00:58",
    "text": "Thanks for the context! Out of curiosity, if you had to pick one, would you prefer to add that class via the page or via HubL?"
  },
  {
    "poster": {
      "poster_name": "Mark Croft",
      "poster_handle": "mark184"
    },
    "time_stamp": "2019-09-18 11:33:10",
    "text": "Do we have to pick one? :slightly_smiling_face: Just like you can specify background image in both, it would be nice to have it both ways.  If I had to pick one, I'd do it in the editor.  But if someone is trying to build templates for marketplace or other distribution, I think HubL would be helpful."
  }
]