[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-19 06:47:18",
    "edited": {
      "time_stamp": "2019-06-19 07:31:26"
    },
    "text": "*Happy Birthday to the Developer Extension*\nI honestly cant believe its only been a year since we hit the chrome web store. It feels longer, this community has done so much with it in such a short time. A year and a half ago the extension was simply an idea in the minds of the community. <@U6W3H6YN8> started work on it getting a good foundation for the project started. Then us non HubSpot devs adopted the extension adding the things we wanted most from <@U7ADCU3BM>’s work on the dark theme. translations for every HubSpot supported language, all translated by community members. The developer menu, cachebuster, can’t forget Sprocky :sprocky: , tips, quick links to the most accessed docs, UI tweaks to the design manager. Huge thank you to everyone who contributed code, translations, feedback and ideas, the extension never would have become what it is without you. Thank you to the HubSpotters who saw the extension’s potential and have helped collaborate on new features, allow us to have this slack channel, and even go so far as to recommend. I think the extension itself is an embodiment of HubSpot’s recent mission to create the most lovable collaborative CMS experience. The extension is not an official HubSpot product, it’s more of a community project, and through it a lot of really great collaboration, understanding, and improvements have been made between HubSpotters and community members both in the extension and on HubSpot’s products and tools themselves. I’m sorry if i didn’t specifically mention you, there has honestly been so many people involved that even the GitHub contributors isn’t an accurate reflection of everyone.\n\nWhile we’ve had a great year, there’s no sign of stopping. We’ve hit 1,127 weekly active users(that’s stable build and beta build combined). It’s hard to put that number into perspective, especially as web developers we’re used to seeing unfathomable numbers. To help you understand how huge that is - realize this extension is for web developers, specifically web developers building on HubSpot’s CMS, that’s currently a niche crowd the HubSpot Developer slack itself has 2,832 members. We’ve amazingly never had below a 5 star rating(Thank you all for that, it means a lot).\n\nWe have some very cool features currently being worked on and very cool features yet to be started that you guys suggested. I aim to keep on keeping on, and anyone who is interested in helping just let us know we can show you the ropes and what things we’re working on.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-01 11:12:27"
      },
      {
        "time_stamp": "2019-07-03 06:22:44"
      }
    ]
  }
]