[
  {
    "poster": {
      "poster_name": "Ronald Berry III",
      "poster_handle": "ronald.berry"
    },
    "time_stamp": "2022-05-16 09:57:07",
    "text": "Hi everyone - I have a question that I'd love some insight on if anyone can help!\n\n\"We are currently using an external (non-HubSpot) registration form to collect contact and company data, which is then sent live via API to HubSpot.\nThe main goal is for us to create/save the information of both objects (Contact and Company) into HubSpot as quickly as possible and then send a \"registration successful\" response to the end user.\n\nIssues we encountered:\n- An API call for both object types at the same time is not possible.\n- Two API calls: first contact, then company is possible. However, HubSpot needs about 20-30 seconds to create the associated company and return the Company-ID via API.\n\nOur question:\nHow can we best achieve our main goal?\""
  },
  {
    "time_stamp": "2022-05-16 10:00:34",
    "text": "Reminder: *Want to be the first to know when a new API is available or an existing API has a new version?*  We publish all of that on our <https://developers.HubSpot.com/changelog|Developer Changelog>.  While we do our best to avoid <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes> to our APIs, sometimes for security, and reliability we have to. The Changelog is where we’ll post announcements ahead of time about it. <https://developers.HubSpot.com/changelog|Subscribe to the Developer Changelog> to stay up-to-date on what’s happening in the world of HubSpot development."
  },
  {
    "poster": {
      "poster_name": "Stéphane Burwash",
      "poster_handle": "stephane.burwash"
    },
    "time_stamp": "2022-05-16 13:27:50",
    "text": "Good day,\n\nWould anyone know the best way to associate a deal to a campaign through the API? In the CRM I can see \"deals with attributed revenue\", but how do I get that through the api?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-05-16 14:39:51"
      },
      {
        "time_stamp": "2022-05-16 14:44:47"
      },
      {
        "time_stamp": "2022-05-16 14:46:29"
      },
      {
        "time_stamp": "2022-05-16 14:47:39"
      },
      {
        "time_stamp": "2023-03-01 14:41:49"
      },
      {
        "time_stamp": "2023-03-01 14:43:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Silva",
      "poster_handle": "tp.william.ssilva"
    },
    "time_stamp": "2022-05-16 14:13:21",
    "text": "Hello. Anyone knows how to send an e-mail by the API?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-16 14:38:01"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-05-16 14:38:01",
    "text": "depends on what type of email, but this is a good place to start in the docs: <https://developers.HubSpot.com/docs/api/marketing/marketing-emails>"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-16 14:39:51",
    "text": "Could you create a custom property on the deal that holds the campaign name or id?"
  },
  {
    "poster": {
      "poster_name": "Stéphane Burwash",
      "poster_handle": "stephane.burwash"
    },
    "time_stamp": "2022-05-16 14:44:47",
    "text": "Yeah that could work. I think my broader question has expanded to: how to I access marketing interactions to a specific deal using the HubSpot api"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-16 14:46:29",
    "text": "I think you would need some sort of custom property or custom object in order to make those connections since the crm api and the marking api are separate, although there may be someone here who has done it and has a better idea. Bon courage!"
  },
  {
    "poster": {
      "poster_name": "Stéphane Burwash",
      "poster_handle": "stephane.burwash"
    },
    "time_stamp": "2022-05-16 14:47:39",
    "text": "Thanks! Guess it's down the rabbit hole I go :wink:"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-05-16 14:52:26",
    "text": "What would be the best approach to create a feature on a HubSpot CMS page that displays the number of contacts with a known contact property? Or the number of contacts in a dynamic list? To create something like \"join 102 other students\" with \"102\" being a dynamic number. What is the best way to handle authenticated api requests for clients that may not have a server to host the request script? Since they are on HubSpot is there away to show this data? Appreciate your help."
  },
  {
    "poster": {
      "poster_name": "William Silva",
      "poster_handle": "tp.william.ssilva"
    },
    "time_stamp": "2022-05-16 17:13:16",
    "text": "I'm trying to use this API: <https://developers.HubSpot.com/docs/api/crm/email>, it works to send email in create mode?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-16 19:33:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alexander Wazin",
      "poster_handle": "support432"
    },
    "time_stamp": "2022-05-16 18:39:14",
    "text": "Hi everyone! I'm looking for a node.js freelancer with experience implementing the Conversations API. Please DM me if this is you or know of anyone! Thank you!"
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2022-05-16 19:13:14",
    "text": "I’m having a hell of a time working to get external data into HubDB tables to play with in HubSpot. I usually rely on no-code tools to help me overcome my lack of coding knowledge, but there doesn’t seem to be any out there that work with HubDB."
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-16 19:33:59",
    "text": "probably gonna need a HubSpot person to answer that… the docs aren’t very clear. There is an endpoint to `Create a batch of emails`, but I don’t know if that sends it."
  },
  {
    "poster": {
      "poster_name": "Ken Walker",
      "poster_handle": "kenwalker833"
    },
    "time_stamp": "2022-05-17 00:44:59",
    "text": "Hi All,\n\nHope you are doing well!\n\nWe are facing issue when creating new list by using API endpoint\n\nWe are using the below API endpoint to create a new list in our HubSpot account.\n- <https://legacydocs.HubSpot.com/docs/methods/lists/create_list>\n\nPreviously this API endpoint was creating a new list in our HubSpot account  successfully but now it's returning a response like the below when  creating a new list:\n*- list_permission_issue*\n\nWe have shared this in the community but we couldn't get a solution.\n\nCould you please help us to resolve this issue?"
  }
]