[
  {
    "poster": {
      "poster_name": "Marcus Lambert",
      "poster_handle": "marcus.lambert"
    },
    "time_stamp": "2022-05-06 04:05:43",
    "text": "yes you should be able to filter in the same way using HAS_PROPERTY and the propertyName being the association name/label"
  },
  {
    "poster": {
      "poster_name": "Aitor Muñoz Ortiz",
      "poster_handle": "aitor.munoz"
    },
    "time_stamp": "2022-05-06 05:51:03",
    "text": "Hello team,\n\nLet's see if someone can help us, we are trying to use the non-HubSpot forms, but we are having problems with the tracking system of the forms. Reviewing the documentation it seems that it uses the #formId .class to identify them, but due to the technology we use the classes are not always the same, with each change we lose the tracking in the platform. Is there a less invasive way to track non-forms? maybe html data-xxx?\n\nReferenced link: <https://knowledge.HubSpot.com/forms/identify-a-non-HubSpot-form-with-its-css-selector>"
  },
  {
    "poster": {
      "poster_name": "Jonathan Greene",
      "poster_handle": "j.greene"
    },
    "time_stamp": "2022-05-06 06:47:18",
    "text": "Yo, doing some research around unenrolling a contact from a sequence when a meeting is booked per <https://knowledge.HubSpot.com/sequences/unenroll-from-sequence|this knowledge base article>\nWe are utilizing <https://legacydocs.HubSpot.com/docs/methods/engagements/create_engagement|POST /engagements/v1/engagements> when creating a meeting with a request like\n```{\n    engagement: {\n      active: true,\n      type: 'MEETING',\n      ownerId: some_owner_id,\n      timestamp: start_time\n    }.compact,\n    associations: {\n      contactIds: some_contact_id,\n      companyIds: [],\n      dealIds: [],\n      ownerIds: []\n    },\n    metadata: {\n      title: some_title,\n      body: some_body,\n      startTime: start_time,\n      endTime: end_time\n    }\n}```\nOur understanding is that when this engagement “meeting” is created it should unenroll the contact from any sequence they were added to but are finding that this is not happening via the api calls. Any insight?"
  },
  {
    "poster": {
      "poster_name": "David Welch",
      "poster_handle": "david148"
    },
    "time_stamp": "2022-05-06 13:03:09",
    "text": "Hey all, qq on webhooks: what’s the easiest way to configure HubSpot to webhook us changes on a deal and/or company? Basically just want a ping whenever *any* field changes… notes being made would be a plus too I guess.\n\nLooked at the App webhooks, automation workflows, etc.  Seems like there’s a lot of different ways to get different questions answered, but no “when a field changes, send to this endpoint” option…\n\nAm I missing something?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-07 09:30:44"
      },
      {
        "time_stamp": "2022-05-10 13:47:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-05-06 14:02:30",
    "text": "We have some sample feedback events from the email events API and noticed that the sentby_id and sentby_created_utc is constant across multiple event types, tied to a sent event--do the senby_id and sendby_created_utc represent the message that all of the feedback events are tied to? If not, can you give some clarity?"
  }
]