[
  {
    "poster": {
      "poster_name": "Ghayoor Naqvi",
      "poster_handle": "ghayoor"
    },
    "time_stamp": "2022-05-09 02:50:14",
    "text": "This might help you\n<https://legacydocs.HubSpot.com/docs/methods/engagements/get_associated_engagements>"
  },
  {
    "poster": {
      "poster_name": "Riziq Maulana",
      "poster_handle": "riziq.maulana"
    },
    "time_stamp": "2022-05-09 02:51:16",
    "text": "Thanks, solved"
  },
  {
    "poster": {
      "poster_name": "Lucid Strike",
      "poster_handle": "lucid"
    },
    "time_stamp": "2022-05-09 07:48:57",
    "text": "hi guys! I'm trying to figure out how to make my automation action available to FORM submissions. It works in lists and for contacts; I was wondering if this is related to the #objectTypes  which btw, you have no list of potential values inside your documentation anywhere...",
    "reply_count": 11,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-09 11:48:05"
      },
      {
        "time_stamp": "2022-05-09 12:15:21"
      },
      {
        "time_stamp": "2022-05-09 12:16:57"
      },
      {
        "time_stamp": "2022-05-09 12:20:12"
      },
      {
        "time_stamp": "2022-05-09 12:20:51"
      },
      {
        "time_stamp": "2022-05-09 12:23:44"
      },
      {
        "time_stamp": "2022-05-09 12:44:24"
      },
      {
        "time_stamp": "2022-05-09 12:52:56"
      },
      {
        "time_stamp": "2022-05-09 12:55:23"
      },
      {
        "time_stamp": "2022-05-09 13:24:42"
      },
      {
        "time_stamp": "2022-05-09 13:45:39"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-05-09 07:57:40",
    "text": ":sprocket-dance:As per our previous reminders, today is the day! In a couple of hours we'll be <https://docs.google.com/spreadsheets/d/1fnwCzrYD2fLNPCYP7NNshTJi4gM36vWpHBTU0ALQaSQ/edit#gid=1564945604|archiving or renaming multiple public channel>s in order to make it easier to connect in the HubSpot Developer Slack. :sprocket-dance:\n\nOnce these changes go live, don't hesitate to reach out to me with any feedback. Channels will be archived, still searchable, and always possible to revive should the demand be there. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-05-09 11:48:05",
    "text": "Hey Lucid, what do you mean by “make my automation action available to FORM submissions.” Do you mean you want people to be able to use your action in a workflow that is triggered by a contact submitting a form?"
  },
  {
    "poster": {
      "poster_name": "Lucid Strike",
      "poster_handle": "lucid"
    },
    "time_stamp": "2022-05-09 12:15:21",
    "text": "yes, that's correct. right now i can be triggered by standard automation (mostly about lists). but it doesn't appear in the options upon form submissions."
  },
  {
    "poster": {
      "poster_name": "Lucid Strike",
      "poster_handle": "lucid"
    },
    "time_stamp": "2022-05-09 12:16:57",
    "text": "i thought it could be because I haven't associated it with the correct \"objectType\" as per:\n• objectTypes: which CRM objects this action can be used with.\nbut I can't find the list of allowed objectTypes anywhere. I found DEAL and CONTACT in samples, is there one for FORM ?"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-05-09 12:20:12",
    "text": "Form submissions and lists are things that can _trigger_ a workflow. Your action is something that runs as part of the workflow’s execution. Users should be able to choose whatever triggers they want for their workflow, and then they add your action to the workflow after they make that choice.\n\nRe: your question about `objectTypes`, that defines what types of workflows (contact-based, deal-based, company-based, etc) your action can be used in. If `objectTypes` is empty the action can be used in any type of workflow. It sounds like for your use case you either want `objectTypes` to be empty (all workflow types) or `[\"CONTACT\"]` (only in contact-based workflows)."
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-05-09 12:20:51",
    "text": "&gt; but it doesn’t appear in the options upon form submissions.\nTo make sure we’re on the same page, can you screenshot what you’re talking about here?"
  },
  {
    "text": "This is what I’m referring to. The triggers (where form submissions can be selected) are separate from your action. Once those are selected (actually, you don’t have to select any if you don’t want to), you can click the “+” button to see what actions can be added to the workflow",
    "time_stamp": "2022-05-09 12:23:44"
  },
  {
    "text": "so in one case, I can add my action, I see it. in the other case, I can't; my action isn't available.\n\nI'm not that savvy in HubSpot, I'm the dev who made the integration however. Is there a setting on the form that identifies the contents as a contact and therefore my action becomes available? I'm pretty sure the \"objectTypes\" is set to [\"CONTACT\"]",
    "time_stamp": "2022-05-09 12:44:24"
  },
  {
    "poster": {
      "poster_name": "Lucid Strike",
      "poster_handle": "lucid"
    },
    "time_stamp": "2022-05-09 12:52:56",
    "text": "the one one the left is from the \"Forms\" view, under the 'automation tab'. The one on the right is in the automation view."
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-05-09 12:55:23",
    "text": "Ah, I see what you’re saying now. I think the “automation” tab of the forms tool might only show a subset of all available actions. Let me check with the team about whether that’s configurable."
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-05-09 13:24:42",
    "text": "So it seems like right now that list isn’t customizable. We restrict the workflows that are created as part of form automation to a subset of available actions. There should be a link to take you to the workflows tool, where the workflow that is being managed from the forms tool can be cloned; the cloned workflow will have access to all actions and the full suite of workflow capabilities.\n\nI passed along the feedback about this confusion to the team, and they’ve made a note of it."
  },
  {
    "poster": {
      "poster_name": "Lucid Strike",
      "poster_handle": "lucid"
    },
    "time_stamp": "2022-05-09 13:45:39",
    "text": "oki thanks for the clarification"
  },
  {
    "poster": {
      "poster_name": "Ken Waln",
      "poster_handle": "kenneth.waln"
    },
    "time_stamp": "2022-05-09 19:47:03",
    "edited": {
      "time_stamp": "2022-05-09 19:48:03"
    },
    "text": "How can I get newlines into the text of a task? It seems simple and if I edit in the UI and save I get newlines, but if I send through the engagement (legacy) API it seems to swallow any \\n characters. I just want a crude list with or without bullets. Anyone figured this out? Thanmks!",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-10 02:52:47"
      },
      {
        "time_stamp": "2022-05-10 13:16:53"
      },
      {
        "time_stamp": "2022-05-10 13:22:32"
      },
      {
        "time_stamp": "2022-05-10 13:27:58"
      },
      {
        "time_stamp": "2022-05-11 02:49:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Fanxu Wang",
      "poster_handle": "fanxu.wang"
    },
    "time_stamp": "2022-05-09 23:44:10",
    "text": "hi guys! I'm trying to figure out the difference between prviate app and public apps. The case its we are trying to create company, contact and deals through api for our sales team once new user register from our platform. I have done the integration with test account part, but i'm confused should I use public or praivate apps? It seems public app do need redirect and it not suitable for our business logic. Thank you",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-10 02:44:29"
      }
    ]
  }
]