[
  {
    "poster": {
      "poster_name": "Rahul K G",
      "poster_handle": "kgrahul96"
    },
    "time_stamp": "2022-05-05 02:03:47",
    "edited": {
      "time_stamp": "2022-05-05 02:04:02"
    },
    "text": "Hello, I want to retrieve all conversations from HubSpot chat via api , I already read <https://developers.HubSpot.com/docs/api/conversations/conversations#inboxes> documentation but how to get inboxid and channelid? also I have a developer account with HubSpot, I think before using apis like conversations/v3/conversations/inboxes , do we need to authorize it right? could you please let me know step by step procedure in doing this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-11 07:16:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Julien Pessey",
      "poster_handle": "julien766"
    },
    "time_stamp": "2022-05-05 03:48:16",
    "text": "Hi,\ntrying to use the ‘Enroll a contact into a workflow’ endpoint (<https://legacydocs.HubSpot.com/docs/methods/workflows/add_contact>). I followed the doc but I’m getting an 404 not found even though both my workflow and contact do exists :\n\n`curl --location --request POST '<https://api.hubapi.com/automation/v2/workflows/200381220/enrollments/contacts/julien%2B9@likeo.fr?hapikey=xxx>'`\n\nAnyone who had the same issue or might know what I’m missing ? Thanks in advance !",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-05 07:11:54"
      },
      {
        "time_stamp": "2022-05-05 07:12:51"
      }
    ]
  },
  {
    "text": "from the python client’s README:",
    "time_stamp": "2022-05-05 07:10:52"
  },
  {
    "poster": {
      "poster_name": "Julien Pessey",
      "poster_handle": "julien766"
    },
    "time_stamp": "2022-05-05 07:11:54",
    "text": "turns out the ID given in the url is not the workflowId bu the flowId. Could not find it on the interface, I had to make an API call. If it can help someone one day !"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-05 07:12:51",
    "text": "Sounds like the docs need to be updated."
  },
  {
    "poster": {
      "poster_name": "Maciej Hejduk",
      "poster_handle": "maciej.hejduk"
    },
    "time_stamp": "2022-05-05 07:48:11",
    "text": ":wave: Hello, team!\n\nOur customer request was to build custom forms in the app that we build in and send data (form submission data) to HubSpot so they can manage email sending on form submissions and others.\n\nWe built app in Drupal CMS that has modules for connecting to Hubpot and they work! So we connected to HubSpot successfully so that the forms can be imported in Drupal. The connection is working properly, but the problem occurs when we call the endpoint to save a form submission data. It gives an error:\n\n•  Status: `403` access denied. \n• Error message: `Portal isn't allowed to post submissions` "
  },
  {
    "poster": {
      "poster_name": "Maciej Hejduk",
      "poster_handle": "maciej.hejduk"
    },
    "time_stamp": "2022-05-05 07:49:54",
    "text": "Can anybody help on this one? Any suggestions what I can do wrong? If you need more information please let me know, but I guess it is some well known issue"
  },
  {
    "poster": {
      "poster_name": "Nickolas Constantine",
      "poster_handle": "nickolasconstantine"
    },
    "time_stamp": "2022-05-05 08:10:45",
    "edited": {
      "time_stamp": "2022-05-05 08:11:52"
    },
    "text": "Hello Hubsot Developers,\n\nI am puzzled figuring out if my service should oAuth to Hubsot or vice versa.  Could you please check out these samples and advise how each is produced:\n\n*A).* Reachdesk - The connection setup is triggered on Reachdesk website, the oAuth rountrip goes to HubSpot where scopes are approved and done.\n\n*B)* Google Sheets - This is initiated trough HubSpot, I go to Google oAuth screen, give HubSpot its permissions and then I can use Google Sheets actions\n\n\nHow are these setups different? Are they both available to developers? Are they both not just regular public apps?\n\n Is Google Sheets (or any other app I can select while building the workflow) build by HubSpot itself? Can I build such an app that comes to my oAuth screen and auhtorizez HubSpot for access? Or do I have to go the Reachdesk way where I have to initiate the oAuth and authenticate on HubSpot?\n\nI am building an app that is very similar to Reachdesk, it would get webhooks from HubSpot to send out, let's say flowers. Is it possible to have the authentication flow similar to how Google Sheets does?"
  },
  {
    "poster": {
      "poster_name": "김태수",
      "poster_handle": "cookehwk.hello"
    },
    "time_stamp": "2022-05-05 08:57:30",
    "text": "to_dict() seems to have to import a certain package.\nThere seems to be a to_dict() function in “pandas”, but I tried it, but it doesn’t work..\nIs there no choice but to use to_dict() after converting to DateFrame??"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-05 08:59:05",
    "text": "I believe `to_dict()` is a function in the HubSpot client. I’d have to look at the source code, but I doubt you need to import pandas to use it since their docs say this is the way to convert a response object to a dict with their client. Have you tried using it without pandas?"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-05 09:02:58",
    "edited": {
      "time_stamp": "2022-05-05 09:03:28"
    },
    "text": "honestly, in my experience so far with the HubSpot API, i’ve found it much easier to use the python requests library and to just make http requests, converting that response to a json object using `.json()` instead of the clients. The call you’re making above devolves into this request anyway: <https://github.com/HubSpot/HubSpot-api-python/blob/88e4a97bb6f98d37aecdbf466de8934dbdea21d0/HubSpot/cms/blogs/blog_posts/api/blog_posts_api.py#L912>"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-05-05 09:09:47",
    "text": "and I believe this is the `to_dict` method you would be calling on that response in your screenshot: <https://github.com/HubSpot/HubSpot-api-python/blob/88e4a97bb6f98d37aecdbf466de8934dbdea21d0/HubSpot/cms/blogs/blog_posts/models/collection_response_with_total_blog_post_forward_paging.py#L126|https://github.com/HubSpot/HubSpot-api-python/blob/88e4a97bb6f98d37aecdbf466de8934[…]dels/collection_response_with_total_blog_post_forward_paging.py>"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-05-05 10:34:32",
    "text": "A reminder that on Monday, we'll be streamlining our public channels to make our Dev Slack a more effective community. There should be specific updates in every channel impacted today. If you have any questions or feedback, please don't hesitate to reach out!"
  }
]