[
  {
    "poster": {
      "poster_name": "Demian Levy Polat",
      "poster_handle": "demian"
    },
    "time_stamp": "2022-05-15 06:32:09",
    "text": "Hi everyone! I have the following use case: I need to send emails to contacts with a link to a site where it shows the contact information. The link contains the ContactID, for the site to then query and fetch the contact data but it doesn't seem very safe because anyone would be able to access anyone's information by just trying different numbers as ContactID.\nIs there anyway  to send a hashed version of the ConctactID and a way for querying the API with this id?"
  },
  {
    "poster": {
      "poster_name": "Kohei Kamada",
      "poster_handle": "kamada.math"
    },
    "time_stamp": "2022-05-15 16:55:29",
    "text": "I’m trying to sync HubSpot users with Cognito users. So, I want to get the user’s View via API. Is there an API?"
  },
  {
    "text": "Hi HubSpot devs,\nI have a question about your API for quotes (<https://developers.HubSpot.com/docs/api/crm/quotes>)\nI am looking into syncing quotes from another system to HubSpot.\n\nI have created a dev account and have successfully created a quote via the API to my dev instance.\n\n..But, I can also see that you have a note on the API documentation link above saying that \"Creating and updating quotes is coming soon\".\n\nI'm a bit confused as you have provided API documentation for creating and updating quotes, and the API seems to work, but the note says it does not work.\n\nCan you please clarify if I can in fact use the quotes API to create Quotes?",
    "time_stamp": "2022-05-15 19:31:48",
    "edited": {
      "time_stamp": "2022-05-15 19:35:22"
    },
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-05-18 13:22:40"
      },
      {
        "time_stamp": "2022-05-18 17:06:10"
      },
      {
        "time_stamp": "2022-05-18 17:07:48"
      },
      {
        "time_stamp": "2022-07-22 10:17:24"
      }
    ]
  }
]