[
  {
    "poster": {
      "poster_name": "Daniel Frey",
      "poster_handle": "daniel174"
    },
    "time_stamp": "2020-07-05 05:27:18",
    "edited": {
      "time_stamp": "2020-07-05 05:27:45"
    },
    "text": "<@U011H02FR3Q>\nYes, so “basically asking how can I make my HubSpot website a PWA” this is my question."
  },
  {
    "poster": {
      "poster_name": "Derek Cavaliero",
      "poster_handle": "derek168"
    },
    "time_stamp": "2020-07-05 10:14:12",
    "text": "I'm investigating building a Chatflow for one of our customers that would send data to an API endpoint they have configured to process information for an estimate/quote in real-time. I know I can do this via a custom code snippet in the Chatflow builder - which is great. However, the larger issue I am facing at the moment is that I need to notify the parent window at specific steps in that quote/estimate process to send off events to track conversions to things such as Google Analytics, and Facebook etc... - I cannot figure out how to do this - and its a major roadblock (we can't deploy something that cannot be measured). HubSpot only reporting/measurement is not an option - this data needs to be fed into the specific platforms. The custom code snippet is run server-side via Node 10.X so that won't work.\n\nIs there a way to emit a custom client-side javascript event in a Chatflow?\n\nI am not sure if this is the best location to place this question - so my apologies it if isn't (and please let me know where I should move it if this isn't the correct place).",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-07-05 10:16:35"
      },
      {
        "time_stamp": "2020-07-05 10:17:28"
      },
      {
        "time_stamp": "2020-07-05 10:43:08"
      },
      {
        "time_stamp": "2020-07-06 08:22:01"
      },
      {
        "time_stamp": "2020-07-06 08:22:17"
      },
      {
        "time_stamp": "2020-07-06 10:53:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-07-05 10:16:35",
    "text": "<https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk|https://developers.HubSpot.com/docs/api/conversation/chat-widget-sd>"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-07-05 10:17:28",
    "text": "<https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk#hs_cos_wrapper_module_1582037622193>"
  },
  {
    "poster": {
      "poster_name": "Derek Cavaliero",
      "poster_handle": "derek168"
    },
    "time_stamp": "2020-07-05 10:43:08",
    "edited": {
      "time_stamp": "2020-07-05 10:43:24"
    },
    "text": "Unfortunately I don’t see anything there that would allow me to subscribe to a custom event - all I see is conversation started.\n\nI’ll need multiple events during the duration of a conversation (based off of the API responses happening behind the scenes and returned to the bot)."
  }
]