[
  {
    "poster": {
      "poster_name": "Luis Alba",
      "poster_handle": "work.group831"
    },
    "time_stamp": "2022-02-14 03:10:03",
    "text": "Hi\nHow are you?\nI am new in HubSpot?\nAre there some friends that let me know how to get a deal info on HubSpot template module?"
  },
  {
    "poster": {
      "poster_name": "Christopher Chiha",
      "poster_handle": "christopher051"
    },
    "time_stamp": "2022-02-14 04:12:09",
    "edited": {
      "time_stamp": "2022-02-14 04:14:09"
    },
    "text": "Hello,\nI am currently sending data to Hubdb tables, and everything is working find. The API is always returning status: \"Complete\"\n\nHowever i saw that in the docs that it might return \"Pending\" status sometimes as below :\n```{\n  \"status\": \"PENDING\",\n  \"results\": [\n    {\n      \"id\": \"4099275931\"\n      ….\n  ],\n  \"requestedAt\": \"2022-02-14T10:34:41.632Z\",\n  \"startedAt\": \"2022-02-14T10:34:41.632Z\",\n  \"completedAt\": \"2022-02-14T10:34:41.632Z\",\n  …\n}```\nIn which scenarios does it return status : \"Pending\" ?\nIf it returned \"Pending\", will it impact the data sent to the table ?\n\nrequest used :\n```POST '<https://api.hubapi.com/cms/v3/hubdb/tables/tableid/rows/draft/batch/create?hapikey=apikey>```\n"
  },
  {
    "text": "Hi everybody,\nI created a custom CRM extension and next to the name there is a number (in my case, it's (0) ), and I would like to increment it or remove it but I don't want zero. Can someone help me ?\nThanks a lot",
    "time_stamp": "2022-02-14 04:51:43"
  },
  {
    "poster": {
      "poster_name": "Ignacio Correia",
      "poster_handle": "ignacio"
    },
    "time_stamp": "2022-02-14 05:54:08",
    "text": "Is there any KB (Knowledge-based API)?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-04 06:51:26"
      },
      {
        "time_stamp": "2024-04-10 05:10:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2022-02-14 10:19:10",
    "text": "Looking to get a list of deals on a contact with the API so I can loop through them and find all the ones over X amount. Would the deal list API work for that? (I have never used API stuff before)"
  },
  {
    "poster": {
      "poster_name": "Isaac Smith",
      "poster_handle": "isaac.smith"
    },
    "time_stamp": "2022-02-14 11:52:00",
    "text": "Hello Everyone, \n\nI was wondering if anyone in here has any direct experience with the HubSpot Marketing Email Events API? \n\nWe are currently sending email events data - <https://legacydocs.HubSpot.com/docs/methods/email/email_events_overview> - into our data warehouse and marketing email overview data into our data warehouse. <https://legacydocs.HubSpot.com/docs/methods/lists/marketing-email-overview> \n\nI noticed that on the marketing email overview we are getting email name data getting sent via the API but on the marketing email events data we are not getting email name in the API. \n\nThere also doesn’t seem to be any unique identifier across both of these APIs to link the marketing email overview data to the marketing email events data. \n\nI am trying to build a dashboard in Tableau that lets us select an email by name and look at the performance metrics of the email by associated contact/company properties on recipients with the email. Does anyone have any experience on how to do this or is it possible to get email name in the events API? \n\nI noticed that the API passes in emailgroupid as a unique identifier but I don’t think that is an ID that can be found in the email features within HubSpot either. \n\nIn short: “*Does anyone have any experience on getting marketing email names in HubSpot associated with email event data sent through the AP*I” \n\nI appreciate any responses.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-29 05:34:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Isaac Smith",
      "poster_handle": "isaac.smith"
    },
    "time_stamp": "2022-02-14 12:11:50",
    "text": "Another question. I noticed that certain emails do not have an emailgroupid associated with them. Does anyone know why certain emails do have emailgroupids in the API post and some do not? And is there anyway to see the groupid of an email in HubSpots interface on the email itself? I know how to see the emailid but idk if we can see the emailgroupid"
  }
]