[
  {
    "poster": {
      "poster_name": "Kanav Ahuja",
      "poster_handle": "businessintelligence."
    },
    "time_stamp": "2022-02-15 11:55:54",
    "text": "Hi Everyone! Just wondering is it possible to integrate Ticketmaster API with HubSpot so that i can access Ticketmaster database information directly through HubSpot?"
  },
  {
    "poster": {
      "poster_name": "David Seitz",
      "poster_handle": "david.seitz"
    },
    "time_stamp": "2022-02-15 13:33:27",
    "text": "Hello all, I'm exporting the records of my HubSpot forms using the API, but I'm wondering if there's a way to automate this process. Can anyone help me with a script or something?"
  },
  {
    "poster": {
      "poster_name": "Kanav Ahuja",
      "poster_handle": "businessintelligence."
    },
    "time_stamp": "2022-02-15 15:33:46",
    "text": "Still looking for an answer to this: - Hi Everyone! Just wondering is it possible to integrate Ticketmaster API with HubSpot so that i can access Ticketmaster database information directly through HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Jesús Rodríguez",
      "poster_handle": "jesus431"
    },
    "time_stamp": "2022-02-15 17:08:03",
    "text": "Hi guys, i’m looking to pull  data from multiple companies associated to a deal in a custom quote template, does anyone know if this is possible? i’ve tried doing this with hubl functions but it returns no data, not sure if it has to do with quotes being public? Thanks in advance."
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2022-02-15 17:26:10",
    "text": "hi! I have a client building a bridge from HC1 to HubSpot for a daily sync on active accounts - i see in enterprise the daily call limit is 500k-is that fields, or records or how is each 'call\" estimated? Then-their dev had a question on where the status of the sync is managed. i know in the SFDC connector we manage errors, calls etc there-in custom integrations like this do we still have that view in HubSpot, or is that something they need to build out for us? thanks"
  }
]