[
  {
    "poster": {
      "poster_name": "Som",
      "poster_handle": "smdtt86"
    },
    "time_stamp": "2022-02-10 02:36:26",
    "edited": {
      "time_stamp": "2022-02-10 02:36:43"
    },
    "text": "Hey Everyone,\n\nI’m new to HubSpot. Starting with adding contacts on HubSpot contact listing. I am using “hapikey” api to make a request to HubSpot. But getting this error\n```\"This app hasn't been granted all required scopes to make this call. Read more about required scopes\"```\nWill you please provide your guidance how to set scopes in developer account. I am doing it from my localhost."
  },
  {
    "poster": {
      "poster_name": "Peter Duijnstee",
      "poster_handle": "peter.duijnstee"
    },
    "time_stamp": "2022-02-10 05:42:31",
    "text": "Hey folks,\n\nwe're using the API to fetch changed records and sync those changes to our own system. We use the search endpoint (e.g. /crm/v3/objects/contacts/search) since this allows us to both filter and sort by last-updated-at. This way we can fetch all changes since the last time we polled. Every time a record (contact, w/e) is changed we also poll the associations.\n\nIn general this works well but today I realized that adding or removing an association does not mark an object as \"changed\", so the poller doesn't trigger and the associations are not synced. Only if I also change e.g. the contact's name, the poller finds the updated contact which triggers the association sync.\n\nWhat is the recommended way to fetch recently changed associations?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-02-17 15:08:07"
      }
    ]
  },
  {
    "text": "Should still be there. It is for us.",
    "time_stamp": "2022-02-10 07:20:59"
  },
  {
    "poster": {
      "poster_name": "Robert Gonzalez",
      "poster_handle": "robert"
    },
    "time_stamp": "2022-02-10 07:54:39",
    "edited": {
      "time_stamp": "2022-02-10 07:55:25"
    },
    "text": "Ah, that's a good point. I actually misspoke because while this is within the context of a react application, this is all happening in my connected express server. So I am either sending the POST request directly to HubSpot from Postman (which works) or I am using Postman to hit my app's endpoint which contains a function that sends the same POST request to HubSpot (this does not work). Does that help?"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2022-02-10 08:18:34",
    "text": "I was able to use the Export CTA data from the UI, Question: Is there a way to import into a test portal with UI?"
  },
  {
    "poster": {
      "poster_name": "Will Parsons",
      "poster_handle": "wparsons"
    },
    "time_stamp": "2022-02-10 10:06:38",
    "text": "Hi there - trying to access 'Subscriptions' using the API Key and when we attempt it it says we don't have the '<http://communications-preferences.read/|communications-preferences.read>' permissions can any one help please? HS support has directed us here..."
  },
  {
    "poster": {
      "poster_name": "Harold Muñoz",
      "poster_handle": "harold.munoz"
    },
    "time_stamp": "2022-02-10 11:06:29",
    "edited": {
      "time_stamp": "2022-02-10 11:09:03"
    },
    "text": "Hi there! Please I need some help...\nI Have a chatbot in other platform and I need to send the message of the conversation to hubstop so I can see it like it was in the HubSpot chat.\nthere is a way I can do this?\nThere is an API  where I can send the conversation from this customer and have all the trace in HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Luis Alba",
      "poster_handle": "work.group831"
    },
    "time_stamp": "2022-02-10 13:17:37",
    "text": "Hi there!\nThis is Luis,\nI am new in HubSpot\nI would like to ask something to you. Do you think it would be possible to create a page (HubSpot template)out of deal properties?\n\nOnce a deal has a contract date - that means a customer has purchased the home - at which point we want to create a link for the customer so they can track the progress of the home they purchased\n\nIs that possible to make it?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-10 13:40:56"
      },
      {
        "time_stamp": "2022-02-10 17:24:56"
      },
      {
        "time_stamp": "2022-02-11 06:43:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-10 13:40:56",
    "text": "Hey Luis, if you’re on HubSpot enterprise and/or Ops Hub, there could be a way to automate this via the workflow tool + coded workflow actions to add new rows to a HubDB table (with dynamic pages turned on) based on the deal data."
  },
  {
    "text": "Hello community,\n\nI have a question, how can I change the type of association? In the image it is as _*vehículo_to_contact*_, I would like to change it.",
    "time_stamp": "2022-02-10 16:09:54"
  },
  {
    "text": "Not sure if this is the right channel...\n\nI'm trying to do a simple, routine connection to CallRail... and for some reason, I keep getting THIS error.\n\nI have top permissions on both HubSpot and CallRail, so I'm super confused. Help?",
    "time_stamp": "2022-02-10 16:21:52"
  },
  {
    "text": "<@U032HMTRWKD> for me its showing like this",
    "time_stamp": "2022-02-10 17:07:51"
  },
  {
    "poster": {
      "poster_name": "Luis Alba",
      "poster_handle": "work.group831"
    },
    "time_stamp": "2022-02-10 17:24:56",
    "text": "Aha I am on professional plan"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-02-10 18:46:11",
    "text": "Can you log the actual request instead of the variable name? "
  },
  {
    "poster": {
      "poster_name": "Sudhanshu - MakeWebBetter",
      "poster_handle": "sudhanshukumarrai"
    },
    "time_stamp": "2022-02-10 23:03:33",
    "text": "Are you making api requests directly from browser?"
  }
]