[
  {
    "poster": {
      "poster_name": "Luis Alba",
      "poster_handle": "work.group831"
    },
    "time_stamp": "2022-02-11 06:43:54",
    "text": "Could i make template about deals?"
  },
  {
    "text": "For anyone searching for an answer in the future, it is looking for a string[] in the key \"values\"",
    "time_stamp": "2022-02-11 06:53:51"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vdw"
    },
    "time_stamp": "2022-02-11 07:29:46",
    "text": "Anyone experiencing \"Cannot read property 'getById' of undefined\" error for the */crm/v3/owners/{ownerId}* call?\nLiterally copy pasting it into the custom code block. Other calls work fine.\n<https://developers.HubSpot.com/docs/api/crm/owners>"
  },
  {
    "poster": {
      "poster_name": "Kyle Grover",
      "poster_handle": "kyle943"
    },
    "time_stamp": "2022-02-11 10:14:01",
    "text": "how can a developer test calling using twilio? it says i \"need a sales hub account\". don't i have one as a dev?"
  },
  {
    "poster": {
      "poster_name": "Teresa Hoffman",
      "poster_handle": "thoffman"
    },
    "time_stamp": "2022-02-11 15:43:23",
    "text": "I am integrating with HubSpot and using the API to create Deals and then add Deal associations. I recently saw that HubSpot updated their company associations so that you can no associate multiple companies to a single deal. In this article: <https://knowledge.HubSpot.com/crm-setup/associations-enhancements-beta#opt-in-for-associations-improvements>\n\nthere is a paragraph for \"Manage company associations\" that reads:\n&gt; By default, the first company you associate with a record will be the primary company.\nHowever, in my testing, I noticed that the first company association (via api) is not the primary company. The second company I am associated with the Deal is showing \"primary\" in the UI.  This seems like a bug to me.\nI am hesitant to change my order of operations since, if it is a bug, then when the bug is fixed, my data will be wrong (swapped).\nCan someone confirm if this is indeed a bug with the api, where first company associated deal is not tagged as primary?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-01-25 06:47:23"
      }
    ]
  }
]