[
  {
    "text": "Hello <@U6W3H6YN8>, I tried selecting my Custom Object on the CRM Object Type Dropdown list. But when I am trying to call module.live_object.properties I am getting an error as shown in the image. It shows that the object type \"catapult_live\" could not be found. Yes the error is correct because \"catapult_live\" is the name of the custom object, not the  object type. So, is this an error from the HubSpot side that, On selecting the Required Custom Object in the dropdown list, we are getting a response of the \"name\" of the custom object instead of the \"object type\".",
    "time_stamp": "2021-06-08 12:01:29"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2021-06-08 12:59:55",
    "text": "<@U7P6G42AX> is the issue we have been looking into?"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2021-06-08 15:03:39",
    "text": "Hi there! Yes we are actively working on this now. If it's pressing to get access to the CRM object selector in the page, I recommend manually setting the `object_type` to be the fully qualified name. So if your portal ID is 123 it'd be `p123_catapult_live`"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2021-06-08 15:04:09",
    "text": "just append `p[your portal id]_` to the object name"
  },
  {
    "poster": {
      "poster_name": "Mohit Prasad",
      "poster_handle": "mohit"
    },
    "time_stamp": "2021-06-08 23:29:07",
    "edited": {
      "time_stamp": "2021-06-08 23:55:34"
    },
    "text": "Thank you, <@U7P6G42AX> I understood what you are trying to say. But Can you please help me where can I manually set the object_type to be the fully qualified name. I have created my Custom Object Schema using the api. Do I need to assign the value manually to the object_type while creating the schema?"
  }
]