[
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2023-04-22 13:30:24",
    "edited": {
      "time_stamp": "2023-04-22 13:33:08"
    },
    "text": "Hey all, Has anyone used the custom behavioural event endpoint with Custom Code Actions to <https://developers.HubSpot.com/docs/api/analytics/events#retrieve-event-data|retrieve specific event data> about actions take by the lead so it can be used in a workflow. For example, if a customer has pressed “Premium Package” CTA, so this only send communications about Premium Package prices only. Thanks"
  },
  {
    "text": "by chance is anyone experiencing something with their custom workflow actions where the output fields no longer available to subsequent workflow steps? my workflow action should have like 8 output values. I made no changes to my workflow action. This just started happening.",
    "time_stamp": "2023-04-22 17:51:02",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-04-22 18:57:06"
      },
      {
        "time_stamp": "2023-04-24 09:31:12"
      },
      {
        "time_stamp": "2023-04-24 09:33:42"
      },
      {
        "time_stamp": "2023-04-24 09:34:16"
      },
      {
        "time_stamp": "2023-04-24 09:36:39"
      },
      {
        "time_stamp": "2023-04-26 06:19:09"
      },
      {
        "time_stamp": "2023-04-26 07:22:09"
      }
    ]
  },
  {
    "text": "I think there could be a bug in the new UI for Workflow wrt custom action output fields. Our action has an OBJECT_PROPERTY input field. If I add another instance of our workflow action into a workflow, this UI is able to see the output fields from a previous step.",
    "time_stamp": "2023-04-22 18:57:06"
  },
  {
    "poster": {
      "poster_name": "Scott Hemmeter",
      "poster_handle": "scott362"
    },
    "time_stamp": "2023-04-22 23:05:01",
    "text": "The other option is to respond immediately with a BLOCK response and then asynchronously callback and send the response. "
  },
  {
    "poster": {
      "poster_name": "Scott Hemmeter",
      "poster_handle": "scott362"
    },
    "time_stamp": "2023-04-22 23:06:42",
    "text": "This tends to work better from my experience. We receive the request, put it into a queue on our server, respond with BLOCK. The queue triggers a lambda function that does it’s thing and then calls back into HubSpot to close out the workflow step. It removes the risk of a timeout on a synchronous workflow action. "
  }
]