[
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2022-08-30 05:19:56",
    "text": "<@U03HR644BMX> how would you want to make that group of modules into a row? Like a multi-select on the page itself? Or something in the contents sidebar? Or something else?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-08-30 06:35:52",
    "edited": {
      "time_stamp": "2022-08-30 06:36:14"
    },
    "text": "<@U8THBCFC4> With the page editor drag and drop ideally. You used to be able to, while difficult, if you dragged it to the correct pixel, it would show the border indicator you needed and work, but lately I don't seem to be able to at all. I don't know if I just forgot the trick with it or what."
  },
  {
    "time_stamp": "2022-08-30 08:00:18",
    "text": "Reminder: Did you know we have a <https://www.youtube.com/c/HubSpotDevelopers/videos|developer focused YouTube channel>? We do, and it’s where we post a lot of recordings of our developer events, developer case studies, HubSpot Community Developer Show podcast, and Developer Bytes!"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2022-08-30 08:43:14",
    "text": "Ok cool, that's helpful! Yeah, we've definitely talked about doing a multi select situation so you have more control about where your containers go. The thing we typically get stuck on is allowing multi select in just modules that _could_ actually be a row. So like, do we let you multi select modules in random parts of the page and group them into a container? Or is there a pattern we can use to only multi-select modules that are naturally in a row? So just taking the time to figure that out. I don't think we'll have the bandwidth to address it this year, but hoping it's something we can figure out next year."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-08-30 09:37:18",
    "text": "<@U8THBCFC4> I think even the simple row function that exists when you create a new Section using one of the layouts, if you choose 1/3 2/3 layout, and you add two modules into those columns, it seems logical that they would create a row, with the ability to add more rows below in the same section. This used to work and was very finicky, but I haven't been able to create a row in several months."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-08-30 10:29:37",
    "text": "This content can't be displayed."
  }
]