[
  {
    "poster": {
      "poster_name": "Josh Braner",
      "poster_handle": "braner.josh"
    },
    "time_stamp": "2024-12-10 15:42:19",
    "text": "This ultimately crosses a few lanes of problems, but since I'm trying to pull this data using hubL, I'm going to assume this is the right channel to ask. Fair warning, out of the box creative thinking that may or may not be insane is happening here.\n\nThe long story short, I'm building a process for a product replacement pipeline for a client, after lots of back and forth we ended up on a pretty... creative solution. The user will submit a form with photos of the product needing replacement, then the support team will review the ticket and check off a property that will trigger a workflow to send an email with a programmable email module that pulls all the information from the associated contacts ticket and send it to the vendor responsible for handling that replacement.\n\nAll is well and good, everything was going great, until I ran into a key problem... files submitted via form are private, so I can't simply use the URL that it drops. No problem, I thought, I'd just strip the file ID and then use a handy call to files_by_ids to get a public URL... but no, this seems to error out because the file is not stored in the file manager.\n\nI am officially at a loss on what could be my next step. The end goal is that the email includes public facing links to these photos so their vendor doesn't need to be added to their HubSpot account as that's not something the client feels comfortable doing. Any thoughts? Ideas?",
    "reply_count": 10,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-12 09:17:42"
      },
      {
        "time_stamp": "2024-12-12 09:18:03"
      },
      {
        "time_stamp": "2024-12-12 09:19:56"
      },
      {
        "time_stamp": "2024-12-12 09:21:31"
      },
      {
        "time_stamp": "2024-12-12 09:22:06"
      },
      {
        "time_stamp": "2024-12-12 09:30:30"
      },
      {
        "time_stamp": "2024-12-12 09:31:25"
      },
      {
        "time_stamp": "2024-12-12 09:32:02"
      },
      {
        "time_stamp": "2024-12-12 09:39:14"
      },
      {
        "time_stamp": "2024-12-13 13:01:15"
      }
    ]
  }
]