[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 08:10:55",
    "text": "has anyone tried Open AI’s dumbed down text writing AI? It’s both amazing and terrifying.\n<https://talktotransformer.com/>\n\nHere’s a sample\n\nThe bold text is the only text that I fed it, the rest of the text is completely generated by the software.\n\n&gt; *Jon McLaren a developer at Spin Group, worked with the HubSpot community to build a Chrome Extension and development framework for HubSpot.* In addition to the HubSpot Chrome extension there is also an HubSpot Google Chrome Extension (<https://chrome.google.com/webstore/detail/HubSpot-chrome?>), an Chrome Extension for the HubSpot Google Chrome Browser (<https://chrome.google.com/webstore/detail/HubSpot-chrome/cbcckpkjhcdcbbjhcje>), and a Chrome Extension for the HubSpot Java Runtime Environment (<https://chrome.google.com/webstore/detail/HubSpot-java-runtime-environment?>), a project of HubSpot’s own.\n\n&gt;The HubSpot developer community has had a great deal of help in preparing for this project in the form of bug reports, pull requests, and other projects. We hope that the community will use this extension to help HubSpot users with various types of programming as well as in education and marketing. We hope to see the community use it to develop their own custom HubSpot add-ons.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-05-16 08:13:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 08:13:27",
    "edited": {
      "time_stamp": "2019-05-16 08:15:01"
    },
    "text": "While just slightly incoherent, it’s generating fake links to the chrome webstore, is using correct terminology, and is saying things that are plausible. - my mind is blown, don’t even need to see the full version of this AI, this alone is both amazing AND terrifying… if only I had this back in English class."
  },
  {
    "time_stamp": "2019-05-16 08:22:36",
    "text": ""
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:30:59",
    "text": "this is weird"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:31:21",
    "text": "*Dennis Edson, a developer at Beacon digital marketing,* iced the meeting with a \"good evening\" presentation about the need for transparency in the business world. \"Some people are going to have difficulty making it past an ice bucket challenge or the first meeting they go through. You need to figure out how to do it better,\" Edson said. Edson is a partner at Beacon that helped launch the company's online store."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:32:51",
    "text": "welp.  my day is blown"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:33:58",
    "text": "this random channel is going to get a little weird"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:34:09",
    "text": "*when the man lost his leg*\n\nI saw that\n\nI am the new man. – Dib-dub\n\nA new version of him will come: an actual man\n\nWith a new heart,\n\nAnd the new man becomes known as the savior.\n\nThe man who has gained faith,\n\nThe God who saved me, will return. – Dibdub\n\nA new version of him will come: a man that's no longer born of a woman\n\nBut a man who is born of his own.\n\nThis is the new man.\n\nThe king of kings will become a man.\n\n\"You are the new God, Dib-dub.\"\n\nAnd I will call you God, and you will rule my cities. – Dib-dub,\n\nThe Way to the City (Hail to the King)\n\nTo this extent are we witnessing the true emergence of the new man, the god of the city who is a modern embodiment of godhood. He's the guy who makes people think of religion, of God, of the idea"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-05-16 08:35:35",
    "text": "- a poem, by Dennis"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:36:40",
    "text": "i imagine people will want that printed on a poster"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-16 08:36:59",
    "text": "also, please call me Dibdub"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 08:43:31",
    "text": "hahahah"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-16 09:22:14",
    "edited": {
      "time_stamp": "2019-05-16 09:22:58"
    },
    "text": "Mine is waaayyyyyy off\n&gt;&gt;&gt;*AJ LaPorte is a HubSpot Developer from Chicago IL currently working at Diagram* s - Digital Media &amp; Design. She loves to think big, create and collaborate with others to create amazing experiences. She has started multiple businesses and is often the hub in the HubSpot network of teams to bring together the right people to create great content.\n\n\nIf you have ideas for new products and ideas for this product you can email us at <mailto:tips@HubSpot.com|tips@HubSpot.com>\n\nFor a complete list of resources visit HubSpot's Blog at <http://blog.HubSpot.com>\n\nFor help in troubleshooting any issues try HubSpot's online help center at <http://HubSpot.com/troubleshooting>.\n\nHubSpot is a registered trademark of HubSpot Corporation. Other words/phrases may be trademarks of their respective owners."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 09:24:18",
    "text": "roflmao good to know <mailto:tips@HubSpot.com|tips@HubSpot.com> goes to a female AJ Laporte"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 09:26:32",
    "edited": {
      "time_stamp": "2019-05-16 09:28:32"
    },
    "text": "&gt; *Will Spiro of HubSpot, known for his amazing hair and development skills*, says that the new styling also makes it harder for marketers to distinguish between customers and customers. “Even when they’re just talking in front of a mirror, with a haircut, there’s a difference,” he says. “Even a subtle hair removal can actually have an impact on a brand.”\n\n&gt;When someone walks into a store trying to find a hair replacement, they might see a “wet” style or a braids style or even a wig, but they don’t actually look like anything with their new haircut. For marketers, the beauty of hair removal is that there are so many options and choices available, so it’s really up to the store to go out of their way to be authentic.\n\n&gt;It sounds tricky, but you can even buy products straight from the hair salons themselves as opposed to online — in fact, the products are often better if you wait to see what you like first. “You start with what you want. You don’t have to try at least six different products,” says Spiro. “And you can get something pretty unique\n\n<@U6W3H6YN8> (this is auto generated from the bolded sentence)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 09:29:15",
    "text": "I feel like this is the new version of the google instant game, where you type in something into google search to see the wacky suggestions"
  },
  {
    "text": "FIREFOX IS BETTER THAN CHROME, DAMNIT!",
    "time_stamp": "2019-05-16 14:18:44"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-16 14:19:57",
    "text": "lol"
  }
]