[
  {
    "poster": {
      "poster_name": "Steve Frenzel",
      "poster_handle": "stevefrenzel"
    },
    "time_stamp": "2023-03-31 01:02:18",
    "text": "<@U2H3TT8F2> <@U7SL518D6> The company I work with considers changing to local development using GitHub instead of doing it all in the browser. We tested it and so far it works like a charm! However, the one main concern is:\n\nHow do you sync pages from the live production account with the sandbox account and vice versa? As I understand you'll need to use a third party integration like Zapier or Unito to achieve this, right? Is anyone here using this approach?\n\n• Developing locally on a feature branch with a sandbox account\n• Once approved, changes will be pushed to `main` branch, which is the live production account",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-31 08:54:23"
      },
      {
        "time_stamp": "2023-03-31 10:49:12"
      },
      {
        "time_stamp": "2023-06-21 02:00:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Steve Frenzel",
      "poster_handle": "stevefrenzel"
    },
    "time_stamp": "2023-03-31 01:02:37",
    "text": "This I don't know, sorry :man-shrugging:"
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2023-03-31 01:15:07",
    "text": "That's fine mate. :blush:"
  },
  {
    "poster": {
      "poster_name": "Nathan Dickison",
      "poster_handle": "nate617"
    },
    "time_stamp": "2023-03-31 02:29:18",
    "text": "*Configuring a Custom Font to set in Theme Settings*\n\nHowdy Team!\nI’m new here. I just posted this on the forum and remembered the Slack Channel ( :\n<https://community.HubSpot.com/t5/CMS-Development/Configuring-a-Custom-Font-to-set-in-Theme-Settings/m-p/776511#M33559>\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-03-31 08:54:23",
    "text": "Hey there, I hear ya. In the short term the answer isn’t as great as I want it to be.\n\nYou can clone content between accounts via the HubSpot APIs, aspects of that experience are not perfect right now.\n\nThere are a few good practices I recommend to folks:\n• Create a “styles/kitchen sink” page, this is a page where you put every module (That’s not designed to be in a global partial) on your site onto it. This page never needs to actually be published, the point is it gives you a place to see all of your modules, your CSS styles, your JS all in one place and how it will all interact. Enabling you to ensure everything works great together. It also doubles as a great resource for content creators to look at and go “I want this module for my new page”. For web designers/graphic designers it’s also an amazing way for you the developer and them to get in sync, because if you can commit to “This is how these modules will look everywhere” then for them they can simplify their design process and basically just be indicating “These modules should be used here, here’s some placeholder content. Don’t worry if my mock’s got slightly different px spacing between things - follow the styles page”.\n• If you have access to <https://developers.HubSpot.com/docs/api/account-types#sandbox-accounts|Enterprise Sandboxes> - you can use them to sync CRM content and design manager files. It currently does not support syncing web page content. That said some syncing capability is better than nothing. (CMS Sandboxes do not have built in syncing capability, so any syncing you want to do you’d need to use the API or CLI.)\n• additionally take advantage of the previewing tools built into the design manager. A tip is when you’re working on a template or module locally you can use `hs open dm` to quickly open the design manager for your current default account. Then you can open the preview for the template or module you’re working on.\nLong term we know the state of the dev and staging part of the workflow aren’t ideal and we’re working on improving that experience."
  },
  {
    "poster": {
      "poster_name": "Steve Frenzel",
      "poster_handle": "stevefrenzel"
    },
    "time_stamp": "2023-03-31 10:49:12",
    "text": "<@U7SL518D6> thank you very much for your answer, I will forward it to my team. Have a great weekend! :slightly_smiling_face:"
  }
]