[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2020-07-20 04:05:47",
    "text": "Is there a way to get blog tags to display in a search results page"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2020-07-20 10:17:32",
    "text": "Re: Lists API no longer returning filters… Will a future API version bring filters back? Or is that something that’s going away more or less permanently?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-20 10:38:37"
      },
      {
        "time_stamp": "2020-07-20 10:40:35"
      },
      {
        "time_stamp": "2020-07-20 10:46:23"
      },
      {
        "time_stamp": "2020-07-20 10:57:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2020-07-20 10:38:37",
    "text": "hey <@UMCBG6QK0> yeah, bringing filters back is very much in our plans. We are just in a transition period where we can translate filters from old to new, but not from new to old. once all lists are powered by the new system, that will clear the way for an API that will return filters"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2020-07-20 10:40:35",
    "text": ":+1: Good to know"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2020-07-20 10:46:23",
    "text": "OOC, what do you use the filters returned from Lists API for (if you use them for anything)?"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2020-07-20 10:57:47",
    "text": "I’m not using List filters for anything currently, but having the “internal” data structures exposed has been useful for us in the past with other APIs (like the Workflows API, and with widgets in the CMS Page Publishing API). So, mostly I was asking to feel out if this was just a transitional change or part of a bigger shift."
  },
  {
    "poster": {
      "poster_name": "Jesse Prescott",
      "poster_handle": "jesse.prescott"
    },
    "time_stamp": "2020-07-20 15:02:12",
    "text": "Hey all! I may be a bit lost :stuck_out_tongue: I'm brand new to HubSpot. Looking through the API, but it seems like it's more directed at those trying to make HubSpot apps? We're currently using Jira Service Desk for support tickets and are trying to move over to HubSpot. I need to make a widget where a user can report an issue and it will create a ticket in HubSpot. Seems like it should be a very simple task, but the API is a bit of information overload with all of the options. Is it as simple as just sending a POST request to create a new ticket from my site?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-07-21 12:13:28"
      }
    ]
  }
]