[
  {
    "poster": {
      "poster_name": "Furqan Asghar",
      "poster_handle": "mfa213"
    },
    "time_stamp": "2019-05-07 13:25:59",
    "text": "hey guys, what tools do you use for measuring page speed performance. I've been using GTmetrix but seeing inconsistent results. By that i mean the full page load time when run twice turn out to be different when nothing was changed. Also number of requests also differ almost every time etc. I'm not sure why it's happening. The tool always runs same settings i.e server location, browser and when run multiple times with same settings we see different results.",
    "reply_count": 12,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2019-05-07 13:32:17"
      },
      {
        "time_stamp": "2019-05-07 15:21:09"
      },
      {
        "time_stamp": "2019-05-07 15:22:31"
      },
      {
        "time_stamp": "2019-05-07 15:24:30"
      },
      {
        "time_stamp": "2019-05-07 15:28:02"
      },
      {
        "time_stamp": "2019-05-07 15:32:05"
      },
      {
        "time_stamp": "2019-05-07 15:32:35"
      },
      {
        "time_stamp": "2019-05-07 15:33:24"
      },
      {
        "time_stamp": "2019-05-08 01:03:02"
      },
      {
        "time_stamp": "2019-05-08 01:28:58"
      },
      {
        "time_stamp": "2019-05-08 02:11:35"
      },
      {
        "time_stamp": "2019-05-08 09:20:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Furqan Asghar",
      "poster_handle": "mfa213"
    },
    "time_stamp": "2019-05-07 13:26:13",
    "text": "any one else experiencing the same issues with GTM ?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-05-07 15:31:03"
      },
      {
        "time_stamp": "2019-05-08 03:31:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-07 13:32:17",
    "text": "<@U2H3TT8F2> is kind of a god here.  hopefuly he will bless  you with an answer"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-07 15:21:09",
    "edited": {
      "time_stamp": "2019-05-07 15:23:18"
    },
    "text": "Daww thanks <@UD53A9UUR> best compliment ever.\n\n<@U79N5J2AU> for page speed performance you may see some inconsistent results if you are doing active dev. Chanegs made to CSS files and other attached items like JS need a few moments to be cached/minified. I've noticed some crazy jumps here and there when doing this myself.\n\nFor testing, we've usually used page speed insights (<https://developers.google.com/speed/pagespeed/insights/>) by google. I usually run it twice, once to run it and then run it again in case the cloduflare cdn didnt serve the cached pages."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-07 15:22:31",
    "text": "Likewise, if you are seeing high load time, you can see if it might be anything HubL related by appending `?hsDebug=True` on the url, then in the source (whether you view source or inspect) you'll see some load stats at the bottom of your page"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-07 15:24:30",
    "text": "As an alternate, we also use SEMRush to identify issues on the site (pages loading slow, missing metas, no alt attributes, and a few more SEO related things as well)"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-07 15:28:02",
    "text": "We've also ran general load testing using apache benchmark"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-07 15:31:03",
    "text": "when you say GTM are you referring to GTmetrix? Just making sure as many ppl also call Google Tag Manager GTM"
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2019-05-07 15:32:05",
    "text": "Also, keep in mind that it depends on what you are trying to measure. If you are looking for total page load (DOM, etc), and you want to do that under a load, then you'd want to look at a tool that can run a lot of concurrent requests and each of those requests downloads the related files (CSS, etc). For that type of test, JMeter works great."
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2019-05-07 15:32:35",
    "text": "If you are just looking for raw response times (How long did it take for the HTML of my page to get back to the end user), Apache Benchmark is simple and very effective."
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2019-05-07 15:33:24",
    "text": "If you find yourself having issues with users globally in certain areas (Europe seems slower than North American Users), then you need to look at a cloud load testing solution which can make the requests from different parts of the work. :slightly_smiling_face:"
  }
]