[
  {
    "poster": {
      "poster_name": "Zan Vidmar",
      "poster_handle": "zan.vidmar"
    },
    "time_stamp": "2020-06-04 08:49:32",
    "text": "<@UFBNA9K9A> Thank you. We are currently in HubSpot discovery phase so just the info that is possible is great for now. I have to get more knowledge about HubSpot API first and then I will get back to you if needed."
  },
  {
    "poster": {
      "poster_name": "Zan Vidmar",
      "poster_handle": "zan.vidmar"
    },
    "time_stamp": "2020-06-04 08:55:23",
    "text": "<@UFBNA9K9A> another question just popped up.. is it possible to implement tracking of know and unknown users on own CMS (Drupal) via HubSpot API in the same way like Design manager can do? :slightly_smiling_face:\n\nBasically we try to figure it out if we can keep Drupal CMS as the source of truth for all the content while we are implement all benefits of HubSpot."
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2020-06-04 09:29:20",
    "text": "The default HubSpot tracking code should be able to do that for you. For the trackign code it doesn’t really matter if you are on the HubSpot CMS or not, it’s fairly agnostic.\n\nMany customers do choose to use another CMS in conjunction with the HubSpot CRM but personalization will be difficult. Reporting on individual page performance may be little different but you should be able to get all the same information"
  },
  {
    "poster": {
      "poster_name": "Zan Vidmar",
      "poster_handle": "zan.vidmar"
    },
    "time_stamp": "2020-06-04 16:33:15",
    "text": "Thank you for the answer, it helps a lot."
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-06-04 18:46:14",
    "text": "Hi everybody, I ran into a problem today with the Owners API... it doesn't give you all the fields you would really want about your internal users, and the UI and the Quoting system both cheat and use something undocumented... the last forum post seems to be from 2017, has anybody else run into this? <https://community.HubSpot.com/t5/APIs-Integrations/Getting-deal-owner-phone-number-using-API/m-p/232763>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-06-05 17:53:19"
      },
      {
        "time_stamp": "2020-06-08 10:21:08"
      }
    ]
  }
]