[
  {
    "poster": {
      "poster_name": "Daniela Otalvaro",
      "poster_handle": "daniela.otalvaro"
    },
    "time_stamp": "2020-06-19 08:23:38",
    "text": "Hello! Does anyone know how to override or how to customize the HubSpot Tracking Script, so, the SameSite attribute will have None value (SameSite=none)?"
  },
  {
    "poster": {
      "poster_name": "Daniela Otalvaro",
      "poster_handle": "daniela.otalvaro"
    },
    "time_stamp": "2020-06-19 08:46:36",
    "text": "To give more context I created an integration that allows custom forms created to integrate with HubSpot forms. However if the custom forms are embedded on an external site, I get  an error reading this on the form submissions “the cookie needed to link form submissions to existing contacts isn’t being sent. You’ll need to ask your developer to update the integration for this form.” For this reason I would like to change the SameSite attribute to have None value (SameSite=none). Is this possible?"
  },
  {
    "poster": {
      "poster_name": "David F Jones",
      "poster_handle": "david568"
    },
    "time_stamp": "2020-06-19 10:28:15",
    "text": "That makes sense. Thanks"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2020-06-19 11:43:45",
    "text": "importan Q about HS API keys and OAuth, dunno who will know best, maybe you can help to put us in contact <@U7SL518D6> <@U2H3TT8F2>:\nSo we have some automated custom services for clients and we are starting to migrate to a serverless approach, tho several clients don't own enterprise so we are using Google Cloud Platform and I ideally we will migrate from HS API KEY to OAuth but I believe OAuth is limited to published apps within the HS marketplace and as those services are very tailored to each client I don't see this would be the way to go... unless:\ncan we make a \"master\" app that will ask basically for permissions modulariced depends on the internal service that is running (client based)?\nOr can you confirm that the API KEY is good enough and won't be sunset eventually? (even tho feels safer the OAuth so would like to check about it in depth)",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-06-19 15:22:02"
      },
      {
        "time_stamp": "2020-06-20 04:38:06"
      },
      {
        "time_stamp": "2020-06-21 00:52:15"
      },
      {
        "time_stamp": "2020-06-21 02:40:41"
      },
      {
        "time_stamp": "2020-06-22 08:59:50"
      },
      {
        "time_stamp": "2020-06-23 10:09:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-19 15:22:02",
    "edited": {
      "time_stamp": "2020-06-19 15:23:05"
    },
    "text": "It’s down to you to define that I guess.\n• How many clients will use the app?\n• Do you need some audit trail? If so you’re best off going with oAuth\n• Will you need webhooks? Important for performance and reducing your API requests (so you dont hit rate limits) <https://developers.HubSpot.com/docs/api/usage-details>\nI would go with oAuth ;)"
  }
]