[
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2023-06-28 01:21:33",
    "text": "Hi everyone :slightly_smiling_face:\nis there a way to put second email field in the HubSpot form? I want users to be able input two different email addresses",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-06-28 02:22:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 02:22:12",
    "text": "I don't think that is possible. You could just add the second email to a custom field and check if there is a way to do this with the API or workflows (or manually) after the submission came in."
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-06-28 02:48:19",
    "text": "Hello, I made a module with a calculator inside of it. I want to add the option to send these calculations to the email. what would be the right approach?\n\nadd a form to it and add the values of the calculation to it using javascript and hide the fields?\n\nor is there a different approach?\n\nplease let me know",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-06-28 02:51:44"
      },
      {
        "time_stamp": "2023-06-28 03:37:02"
      },
      {
        "time_stamp": "2023-06-28 04:45:44"
      },
      {
        "time_stamp": "2023-06-28 05:34:12"
      },
      {
        "time_stamp": "2023-06-28 05:45:26"
      },
      {
        "time_stamp": "2023-06-28 08:07:56"
      },
      {
        "time_stamp": "2023-06-28 08:10:04"
      },
      {
        "time_stamp": "2023-06-28 08:11:15"
      },
      {
        "time_stamp": "2023-06-28 08:12:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 02:51:44",
    "text": "There is a form endpoint you could send the info to without including a proper HubSpot form.\n\nThis endpoint does not require authentication with HubSpot so they are recommending using the other one (because that would then have to happen in the backend without exposing too much).\n\n<https://legacydocs.HubSpot.com/docs/methods/forms/submit_form>"
  },
  {
    "text": "Hello everyone, I'd like to know if there's a way to set up a custom code or workflow for this: I have an apartment (custom property) for 2 different deals, and I'd like to be able to display the apartments whose deal 1 end date is equal to deal 2 start date.\n\n\nthank you for your help",
    "time_stamp": "2023-06-28 03:25:35"
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-06-28 03:37:02",
    "text": "Thank you for your quick response I am going to look in to it :+1:"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 04:45:44",
    "text": "Just make sure that you have the target form setup in the backend. (Thats the formGuid that you will have to include in your call anyways)"
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-06-28 05:34:12",
    "text": "Yes, I Almost got it just the content is not getting pushed but the emails are being sent. Is it not just easier to make a form and show it but hide the fields and fill the fields with javascript? or would this not be a relaible approach?"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 05:45:26",
    "text": "I guess it depends on where you feel more comfortable. Filling fields with javascript sometimes creates problems if you dont properly update the fields, thats why I personally would opt for the suggestion I gave you.\n\nBut if you are already getting to the emails getting pushed, can you check what you are actually submitting to HubSpot from the Frontend? Just seems like you are not far away from the final solution."
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-06-28 08:07:56",
    "text": "<@U04UF7BNBK4> I got it with the API now. could there be a potention securitry risk when the portalid and the FormID is in this?\n\nI got this in the module in the script. in the html section.\n\nbecause else me button click function did not work."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 08:10:04",
    "text": "Nobody can access your system just with the portalId and one formID. That being said, the worst that can happen is someone spamming you but HubSpot usually does a good job of filtering through something like that."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-06-28 08:11:15",
    "text": "At least that is my view on it - not a HubSpot Employee, just a freelance dev that does various things with HubSpot on a daily basis."
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-06-28 08:12:14",
    "text": "Thanks, then I will leave it like this I think. I was thinking the same but justen wanted to be sure hahaha.\n\nThank you for your help!"
  },
  {
    "poster": {
      "poster_name": "Yusleidi Serje",
      "poster_handle": "yus"
    },
    "time_stamp": "2023-06-28 09:21:26",
    "text": "Hello everyone. We recently acquired <http://hyros.com|hyros.com> which is a platform for ROI tracking and channel attribution. I am trying to integrate it natively with HubSpot for Meetings, but it shows me the message:\n\n*Unfortunately, HubSpot currently does not support tracking for other types of forms, only Marketing forms. In these cases, we recommend that you ask for an email before the form is displayed, on a page where the Hyros Universal Script is present. The collected email can be stored and used to autocomplete forms once they are displayed, and also do redirects after the form is submitted.*\n\nWhat the Hyros team tells us is that we would need to send the email field as a UTM parameter in the scheduling URL after the click for Hyros to recognize and read it. Today, this form is with round-robin within HubSpot and redirects to a thank-you page in CF 2.0. This process is known as calendar pass-through, which we need to execute. Can you help me to do it or understand how to do it?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-06-28 09:49:19"
      },
      {
        "time_stamp": "2023-06-28 10:36:30"
      },
      {
        "time_stamp": "2023-06-28 12:08:32"
      },
      {
        "time_stamp": "2023-06-29 07:09:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-06-28 09:48:41",
    "edited": {
      "time_stamp": "2023-06-28 10:12:29"
    },
    "text": "Hey Developers! I have an `Inbound 2023 General Admission - Tier Two` for $700. Instead of going to inbound, I plan to met my third child on September 9, 2023! :smile: I’ll probably name the child Sprocket!\n\n*DM me to purchase.*"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-06-28 09:49:19",
    "text": "<@U05EG28V686> are you using the meeting link or an embed meeting link?"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-06-28 09:55:22"
  },
  {
    "poster": {
      "poster_name": "Dinesh",
      "poster_handle": "dinesh.r"
    },
    "time_stamp": "2023-06-28 10:31:38",
    "text": "In order to connect forms with my web application, I added the embed code to index.html. I added a couple target rules to the forms. I activated the login page's forms. After logging in, some of the pages disabled the forms. However, it persists after logging in. When I refresh the page, it is gone. I added this rule to the form's target rules. My application is a single-page application (React)."
  },
  {
    "poster": {
      "poster_name": "Yusleidi Serje",
      "poster_handle": "yus"
    },
    "time_stamp": "2023-06-28 10:36:30",
    "text": "<@U03REFNRMB3> embed meeting link"
  },
  {
    "poster": {
      "poster_name": "Bo Høirup Pedersen",
      "poster_handle": "bohoirup"
    },
    "time_stamp": "2023-06-28 10:37:45",
    "edited": {
      "time_stamp": "2023-06-28 10:38:21"
    },
    "text": "Hi\n\nWe have som complex features and flows setup when people create deals and other things and we need to be able to test these flows on production data but in a safe enviroment.\nFuthermore we have some integrations pending implementation and here we also need to do a lot of testing before pushing to production.\n\nRight now we have a HubSpot sandbox enviroment setup, but unfortunately this enviroment is not even close to our production enviroment, making it very difficult end prone to errors to do any testing etc. in the sandbox. Out users is not synced to sandbox, linked data, properties and flows does not seem to be synced either..\nCan someone please tell me how i make the sandbox enviroment af exact copy of my HubSpot production enviroment?\n\nBesides this it seems not possible to move a workflow from the sandbox enviroment to the production, is this right? or could someone explain to me how to do this",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-06-28 10:48:31"
      },
      {
        "time_stamp": "2023-06-28 10:49:14"
      },
      {
        "time_stamp": "2023-06-28 10:49:36"
      },
      {
        "time_stamp": "2023-06-28 10:50:00"
      }
    ]
  },
  {
    "text": "There is a settings &gt; account setup &gt; sandboxes &gt; set up sync to sandbox option but there are some limitations:",
    "time_stamp": "2023-06-28 10:48:31"
  },
  {
    "poster": {
      "poster_name": "Jacob Jennings",
      "poster_handle": "jacob550"
    },
    "time_stamp": "2023-06-28 10:49:14",
    "text": "```Keep in mind: Your sync might overwrite work you've done in your sandbox.\nSyncs are based on what's currently in production. Meaning, if you have assets that you've previously synced from production to this sandbox, any new syncs of that asset will overwrite the changes you've made in your sandbox with its production version. Only sync assets that won't negatively affect ongoing work in your sandbox.```"
  },
  {
    "poster": {
      "poster_name": "Jacob Jennings",
      "poster_handle": "jacob550"
    },
    "time_stamp": "2023-06-28 10:49:36",
    "text": "Also I don’t think it’s possible to move a workflow from a sandbox to production."
  },
  {
    "poster": {
      "poster_name": "Bo Høirup Pedersen",
      "poster_handle": "bohoirup"
    },
    "time_stamp": "2023-06-28 10:50:00",
    "edited": {
      "time_stamp": "2023-06-28 11:03:05"
    },
    "text": "Yes this is what we are using but this does not give us a copy of our production enviroment"
  },
  {
    "poster": {
      "poster_name": "Christina Augurusa",
      "poster_handle": "christina732"
    },
    "time_stamp": "2023-06-28 11:45:33",
    "text": "Hi! Club property on form question -\n\nWhat merge field would I use for setting up location? For example, lead fills out form with a location, and for the email to generate with that location on it. Tried 'Club Property' and not working. Am I missing a step?"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-06-28 12:08:32",
    "text": "There’s a way to catch the meeting scheduler event from the embed meeting code to then trigger other events (like FB pixel event, GA event, etc..)\n\nDoes Hyros have a way to submit events via Javascript when a specific action is performed (liked booked) before the page redirect?"
  },
  {
    "poster": {
      "poster_name": "Anup Sharma",
      "poster_handle": "anup626"
    },
    "time_stamp": "2023-06-28 15:42:55",
    "text": "HI,"
  },
  {
    "poster": {
      "poster_name": "Anup Sharma",
      "poster_handle": "anup626"
    },
    "time_stamp": "2023-06-28 15:42:58",
    "text": "This contact was created from Offline Sources from Integration"
  },
  {
    "poster": {
      "poster_name": "Anup Sharma",
      "poster_handle": "anup626"
    },
    "time_stamp": "2023-06-28 15:43:41",
    "text": "this thing how it work in HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Anup Sharma",
      "poster_handle": "anup626"
    },
    "time_stamp": "2023-06-28 15:45:09",
    "text": "And how to capture Offline Sources and Online Sources in Marketing contacts"
  }
]