[
  {
    "poster": {
      "poster_name": "Jeppe Wienziers Stenbæk",
      "poster_handle": "jeppe.stenbaek"
    },
    "time_stamp": "2023-06-30 02:34:57",
    "text": "<@U02F2QPB4P8>, I think you are already in dialogue with <@U03FJQPSC0Y>"
  },
  {
    "poster": {
      "poster_name": "Magnus Foldager",
      "poster_handle": "magnus"
    },
    "time_stamp": "2023-06-30 02:40:35",
    "text": "Yeah <@U03FJQPSC0Y> timeseries / graphs have been something we’ve been very interested in for a long time.\nWe’ve considered iframing a simple Google Charts HTML/JS/CSS setup, but would love to have it within the native UI."
  },
  {
    "text": "Hey guys, the documentation on crm card actions is a little hazy, anyone created actions, both on each crm card and on the general. According to this: <https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards>\n\nYou can create in both places as seen in the image below. But I can figure out how to do that",
    "time_stamp": "2023-06-30 04:16:10"
  },
  {
    "poster": {
      "poster_name": "Hassan Ismail",
      "poster_handle": "hassan325"
    },
    "time_stamp": "2023-06-30 05:26:09",
    "text": "Hello all, I am using the HubSpot feedback survey in a single-page application, with the basic configurations, but it's not appearing for all users, do you have any API that I can call to force the survey to appear?\ncc: <@U05D46RTFL2> <@U05CJ1EKL7R>"
  },
  {
    "poster": {
      "poster_name": "l mw",
      "poster_handle": "lmw576jiada"
    },
    "time_stamp": "2023-06-30 06:23:05",
    "text": "Hello all, I am using HubSpot workflow to send webhook to call our own API, may I know the HubSpot outgoing IPs? We need them to set up HubSpot outgoing IPs in our Cloudflare IP whitelist, for HubSpot to call our own API. Please kindly help, thanks in advance."
  },
  {
    "poster": {
      "poster_name": "Amanda Asberry",
      "poster_handle": "mandy662"
    },
    "time_stamp": "2023-06-30 07:32:08",
    "text": "Hey everyone, looking for someone who could take a peak at a landing page and heelp me get a form over a graphic instead of just an insert, would take CSS work i'm assuming",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-06-30 10:56:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-06-30 09:20:35",
    "edited": {
      "time_stamp": "2023-06-30 09:23:47"
    },
    "text": ":sprocket: :surfer: Heads up HubSpot Devs!:sprocket: :surfer:\n\nWhile this Developer Slack is a peer to peer networking and discussion space and *not* a HubSpot support space, we still wanted y'all to be aware that, in our commitment to long-term success and prevention of burnout...\n\nHubSpot is taking our *<https://community.HubSpot.com/t5/Announcements/It-s-Almost-Time-for-HubSpot-s-Global-Week-of-Rest-July-3-7-2023/ba-p/810324|annual week of rest next week>*, so getting in touch with us from *EOD today until July 10th will be extremely limited*.\n\nThis is especially relevant to anyone working on any betas through this Slack, but we wanted you all to be generally aware as well. Our support team will course be available for any emergencies or mission critical issues that may arise (*knock on wood)* but next week will not be business as usual. See all the specifics <https://community.HubSpot.com/t5/Announcements/It-s-Almost-Time-for-HubSpot-s-Global-Week-of-Rest-July-3-7-2023/ba-p/810324|here>.\n\nPlease continue to support each other as you do so well in this community while we're out -  and we're looking forwarding to connecting with you all again, refreshed and renewed, for the 2nd half of 2023, on July 10th!"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-06-30 10:56:33",
    "text": "Thanks, Magnus. We are actively considering charts"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-06-30 10:56:40",
    "text": "Hey Amanda, if you’re looking to hire someone to assist here, I might post this in <#CBNDYJJAZ|jobs> "
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-06-30 11:05:13",
    "edited": {
      "time_stamp": "2023-06-30 11:05:14"
    }
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-30 12:30:50",
    "text": "love it, anything thoughts on a custom styled plotly js chart?"
  },
  {
    "poster": {
      "poster_name": "RanJ",
      "poster_handle": "randy.okelly"
    },
    "time_stamp": "2023-06-30 22:19:22",
    "text": "Hey Hub-Devs:flywheel:! Hoping this awesome community can provide some advice on HubSpot capabilities with Kafka..\n\n:mario_question:: Does HubSpot have the capability to publish events and/or leads directly to Kafka?\nIf so, could anyone share docs/articles or some bullets of how this works?\n\nUse case: We’re having leads generated in HubSpot and the idea is to have a framework which listens to kafka topics for incoming leads, then HS can publish the leads directly into Kafka"
  }
]