[
  {
    "text": "Hi everyone; if i'm using a module on some existing pages, and i want to copy that module into a new theme (within the same portal)... will the ID value copied along with the modules JSON cause conflict issues? Cloning the module still creates the same ID values for the module. Just need to know if the IDs will cause problems or not as they'll be the same across 2 modules (1 within theme, 1 outside of theme). Hoping someone can clarify :crossed_fingers:",
    "time_stamp": "2022-12-01 04:56:22",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-01 05:45:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2022-12-01 05:45:33",
    "text": "No you'll be fine"
  },
  {
    "poster": {
      "poster_name": "Ruarri Serpa",
      "poster_handle": "rserpa"
    },
    "time_stamp": "2022-12-01 08:01:04",
    "text": "Hello all, Is there anyway to configure a domain to use a specific theme? Our main/national brand should use Theme A on one domain, and all the other domains we run use Theme B. Both themes are child themes of the same parent/base theme. When creating a page on any domain, the editors have to make the appropriate theme active so they can select the correct template, and that changes the active theme for the whole organization.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-01 08:11:51"
      },
      {
        "time_stamp": "2022-12-01 10:43:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-12-01 08:11:51",
    "text": "unfortunately, there isn't a way to set the theme at the domain level yet.\n\nthe only workaround I have found is to create all new pages in content staging, where clicking create new page takes you to Choose a theme first and doesn't make you click the change default - the flow is just better, choose theme, choose template, build page."
  },
  {
    "poster": {
      "poster_name": "Ruarri Serpa",
      "poster_handle": "rserpa"
    },
    "time_stamp": "2022-12-01 10:43:58",
    "text": "Thanks for that info, Jennifer"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2022-12-01 11:25:44",
    "edited": {
      "time_stamp": "2022-12-01 13:19:58"
    },
    "text": "i asked this a while back and can’t find my thread. i’m setting up a child theme using these instructions <https://developers.HubSpot.com/docs/cms/building-blocks/themes/child-themes#create-a-child-theme-with-the-cli>.\nit uploads to HS just fine.\nthe theme directory and theme.json are in the design manager.\nbut unless i upload templates (which, isn’t that completely contradictory???), i can’t select the theme in the page editor. it’s like it doesn’t exist."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2022-12-01 13:19:29",
    "text": "it’s literally not finding anything from the parent theme, even though it accepts my extends path (the CLI will reject upload if the extends path isn’t correct)"
  }
]