[
  {
    "text": "Hi Tyler,\n\nThis code example is rather long (attached) and has a lot of stuff you can ignore but maybe it will help you with some ideas.  This is a function I wrote in one of my apps so every time I need to get associations after a search I can just call the function with the search data and the from and to object types and it will get the associations all at once for me using batches.  I have a custom module I wrote to do the actual HubSpot API calls and you'll see calls to this HubSpotCRMService controller to get the API data.  The basic function of looping to get all the associations is in here which is the main focus for you (this routine batches them in limits of 50 at a time - I remember having trouble with 100 for some of the object types).  It also works currently for only a few types (deals, quotes, line items) but more could be added.  Hope this gives you some ideas.",
    "time_stamp": "2024-04-11 06:14:15"
  },
  {
    "poster": {
      "poster_name": "John Michealson",
      "poster_handle": "johnm"
    },
    "time_stamp": "2024-04-11 07:31:34",
    "text": "Good morning.  We're implementing the HS support module.  Either I'm missing something or I've found a technical challenge in workflows.   I can't seem to get a trigger based off a simple email domain working? Meaning, if something comes in from another support system (partner ticket system) shouldn't we be able to start routing from there?   <mailto:support@support.domain.com|support@support.domain.com> = trigger?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-11 08:40:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Michealson",
      "poster_handle": "johnm"
    },
    "time_stamp": "2024-04-11 08:40:56",
    "text": "Thus far we're using exchange routing rules to send to a HS processing inbox, and custom code routing from there.  Seems kludgy. Is there a better method?"
  },
  {
    "poster": {
      "poster_name": "Dario Panev",
      "poster_handle": "dario274"
    },
    "time_stamp": "2024-04-11 15:03:48",
    "text": "Hey HubSpot Developers i have suggestion for you:\nToday i started creating a workflow in which i want:\n1. Contact who filled a form older than 3 months\n2. Clear Property Data `Contact Owner`\n3. Send to my recruiters who are 17 users.\n4. Send for example 3 contacts per day per Recruiter\n5. I have 15 000 contacts older than three month who fill the criteria.\n6. You still dont have option to limit contact enrolls per day per user.\nA think that would be perfect to have it on HubSpot"
  }
]