[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-08 04:17:46",
    "text": "Does anyone have any suggestions on how to handle a scheduled workflow with custom actions, that keeps getting 'delayed' issues on the custom-coded actions? Is there a limit in HubSpot on workflow enrolments...?\n\nOther workflows work totally fine and I can enrol 10,000 + contacts into them without issue. The moment there is a custom-coded action making an API call it seems to cause issues when bulk enrolling either manually or via schedule.\n\nFor reference, the first 100 or so seem to work OK and then the rest have a delay which eventually don't work at all and throw an error.",
    "reply_count": 9,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-04-08 06:49:55"
      },
      {
        "time_stamp": "2024-04-08 06:51:04"
      },
      {
        "time_stamp": "2024-04-08 06:52:53"
      },
      {
        "time_stamp": "2024-04-08 08:59:40"
      },
      {
        "time_stamp": "2024-04-08 12:08:33"
      },
      {
        "time_stamp": "2024-04-09 02:39:35"
      },
      {
        "time_stamp": "2024-04-09 07:58:17"
      },
      {
        "time_stamp": "2024-04-09 08:08:09"
      },
      {
        "time_stamp": "2024-04-09 08:14:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-08 06:49:55",
    "text": "Maybe you are hitting the API call limit per 10 seconds in your custom code in workflow?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-08 06:51:04",
    "text": "Interesting... does the API limit in HS apply to custom coded actions even if they are just making POST requests to an external API...? There are no errors in the logs on the workflow at all about hitting the limit but that could totally make sense..."
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-08 06:52:53",
    "text": "API limit is for HubSpot API."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-08 08:59:40",
    "text": "Got it. So that is not the case for me then, as my custom coded action is just making a request to a third party software via standard API post/get method in JS. I'm then using the standard HubSpot workflow options to retrieve the data and update various properties.\n\nIs there anything else that could be causing this? Has anyone experienced anything similar with workflows with custom coded actions that appear to be delayed/timing out?\n\nIt's frustrating as I would understand if it happened on ALL enrolled contacts that something else could be wrong. The fact that it's working for an initial batch and then starting to get delayed which I can't figure out.\n\nOr is there a better way that I hadn't considered, of getting data from an external software via API and pulling the data onto individual contacts once a day...?"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-04-08 12:08:33",
    "text": "Hi Stacy, is it at all possible that you are hitting rate limit errors from the 3rd party providers API endpoint? What language are you writing this in? You might try a bit of error handling in your request to the endpoint."
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-04-08 20:10:09",
    "text": "Hi Carlsson, you ever get this worked out?"
  }
]