[
  {
    "text": "hi all, was directed by HS support to give this slack channel a try. :slightly_smiling_face:\nI am building a custom code workflow with the intention of automatically associating activities, deals and contacts from a Partner company object to a partner custom obj.\n\nI have a workflow trigger which says if Company Type = Partner, then take all associations done to that company and associate to the Partner Custom Object done via custom code.\n\nThe workflow code has no errors and is running smoothly, however, the changes are never made in HubSpot after the company enrolls and when the Company completes the workflow enrollment.\nThe code is returning no errors and i've checked that it's returning the correct values.\n\nBelow is the code.... I'm stumped, any help would be greatly appreciated! :fireworks:",
    "time_stamp": "2024-04-22 02:23:21",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-23 11:38:25"
      },
      {
        "time_stamp": "2024-04-24 02:21:58"
      },
      {
        "time_stamp": "2024-04-25 10:42:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Koehn",
      "poster_handle": "tony641"
    },
    "time_stamp": "2024-04-22 12:50:39",
    "text": "Hello,  I am needing to use workflows to create a webhook and then take the results of the webhook and use it to create a task.  I have successfully been able to make the webook work but I am not sure how I can take the results of the webhook and use them in when creating a Task.  Can someone shed some light on this subject.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-22 13:02:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-22 13:02:26",
    "text": "Well, I don't know what payload your webhook carries and what in there will let you know what task you want to create, but to do so here is the docs on using the Tasks API  <https://developers.HubSpot.com/docs/api/crm/tasks>"
  }
]