[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-09 02:39:35",
    "text": "Hi Bill - thanks for the idea!\n\nI actually reached out to the 3rd party API and i've found the issue, which unfortunately leads me no closer to a solution.\n\nThe 3rd party API must have the login/auth + subsequent get request from the same IP address. The only way I could see to do this is to have the custom coded action do both requests in the same code. fine so far... right?\n\nThe problem is that i'm spamming the 3rd party API with multiple login attempts at the same time when i'm mass-enrolling contacts into the workflow, all from different IP addresses (as this is just how HubSpot works i guess) and as they are happening concurrently the login requests and token is being overwritten in their back-end each time causing anything not happening in 'order' to fail.\n\nThey have asked me try and get a static IP from HubSpot or a list of IP addresses so they can whitelist them - as far as i've read online, this seems currently not possible?\n\nIf so... any suggestions on work-arounds...? :melting_face:"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-04-09 07:58:17",
    "text": "hmmm…. Is it at all possible they have a different flavor of endpoint where you could queue a bunch of data and batch it? This would mean you hit their API less often with more data?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-09 08:08:09",
    "text": "A different flavor :sweat_smile: I've actually messaged them with the HubSpot signature validation bits to see if they can use this instead, as that was HubSpot's recommendation... Otherwise I am going to explore either a private app where i can specify the IP, or even potentially a reverse proxy. Both way above my experience level but I'll get some help as needed!"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-04-09 08:14:00",
    "text": "This is a really interesting project though. If you need help please let me know, happy to troubleshoot it with you!"
  }
]