[
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-04-30 11:43:36",
    "text": "<@U05R380MLMC> I just wanted to say thank you for your advice here on a Friday evening! And no, the workflow editor doesn’t seem to give me access to the response data once the invoice was created (this is exactly what I was hoping it would do). And, turns out, one of my clients signed up for a free trial of Ops Hub Pro, hence my ability to fire a webhook. Sigh…"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-30 11:45:36",
    "text": "I'm determined to find a path forward.\n\nYou don't really need invoices to be created the moment a quote is sent and/or signed.\n\nWhat if you had an external service checking for signed quotes and handling the invoice creation?"
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-04-30 11:48:58",
    "edited": {
      "time_stamp": "2024-04-30 11:49:30"
    },
    "text": "Well, the invoice _creation_ isn’t the issue. It’s being able to pull the invoice number that was created so that I can locate and update the QBO invoice. The purpose is to edit the invoice so that it reflects 50% due of the invoice total. From my understanding, HubSpot doesn’t support deposits on Quotes."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-30 11:53:03",
    "text": "Using the native Quickbooks integration in HubSpot is creating the issue, right?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-30 11:53:15",
    "text": "It's not flexible enough for your use case"
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-04-30 11:54:54",
    "text": "Yes, using the QBO native integration to create the invoice and pull the invoice number. If I had the invoice number included in a POST, I could upgrade their account to Ops Pro and fire a webhook to Zapier. I can do all the updates in QBO there.\n\nExactly what I was concluding about the native integration! That’s often how native integrations go."
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-04-30 11:56:06",
    "text": "I find it sort of crazy that HubSpot quotes don’t support a 50% deposit use case. That’s so common among my clients, and a reason for me to ditch HubSpot Quotes and go to something like PandaDoc."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-30 11:57:04",
    "text": "Yeah - that's a bummer.  Ops Pro really enables you to build whatever you want.  Going the PandaDoc route is cheaper though."
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-04-30 11:59:24",
    "text": "The workaround, if they don’t want to pay to have everything fully automated, is for the initial invoice (with 100% of the total reflected) drafted w/ the HubSpot QBO integration. and then they’d simply open up the invoice and update it before sending it out.\n\nBut darn, I want the whole thing to be easily automated, lol. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-30 12:06:52",
    "text": "Yeah - I think there are options but requires use of external tools along with development."
  }
]