[
  {
    "poster": {
      "poster_name": "Kaushik",
      "poster_handle": "kaushik.abhicenation"
    },
    "time_stamp": "2024-06-17 03:28:06",
    "text": "Hello @all\nHow can I post Image in HubSpot File using API,\nI have upload file in local form input type file and value is *C:\\\\fakepath\\\\Academic hat icon.png,* how can I upload this image in HubSpot File using API.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-18 19:26:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-06-17 03:43:33",
    "text": "You could also just add the vars as data attributes to the main div/section tag of your module, then in the module.js\n\nYou would add an each (in case the module get’s added more than once)\nAnd then get the vars from the data attributes.\n\nSo long as there’s not too many vars or they’re not too long/complicated this is a good solution to keep a nice module.js layout\n\n\nI often do a similar thing with css vars too, but this time just set the css var in the style tag, (this has the benefit of being able to set hover/psuedo element styles inline"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-06-17 03:46:23",
    "edited": {
      "time_stamp": "2024-06-17 03:46:40"
    },
    "text": "html+hubl\n```<div class=\"my-module\" data-somevar=\"{{module.foobar}}\">...Module...</div>```\nmodule js (just done jquery to keep it super short)\n```$('.my-module').each(function(){\n  let somevar = $(this).data('somevar');\n  //Do your js\n});```"
  },
  {
    "poster": {
      "poster_name": "Sabina Iurascu",
      "poster_handle": "sabina240"
    },
    "time_stamp": "2024-06-17 06:46:37",
    "edited": {
      "time_stamp": "2024-06-17 06:46:47"
    },
    "text": "Posting HubSpot support team's response to this, in case anybody else is looking for a solution:\n\n> _Thank you for your patience here. I was able to flag this to the team internally & they were able to confirm that Forms API & events are not part of the beta at this time. In the future this may change but at the moment it isn't included so this is functioning as desired._ \n> \n> _It is important to keep in mind that because this is in beta functionality is limited however, the good part about beta is that they are still in the growth phase so there is remove for changes and improvements._"
  }
]