[
  {
    "poster": {
      "poster_name": "Jacob Flender",
      "poster_handle": "j.flender"
    },
    "time_stamp": "2024-06-11 08:13:24",
    "text": "So, I ran into a problem I cannot fix:\nI created a module for my HubSpot page. The Module alternates text blocks left then right then left and so on. This works fine. So far so good. Now I wanted to wrap the actual text of my blocks in &lt;p&gt; tags so that it predefines the blocks as paragraphs inside of HubSpot. Also worked like a charm for the text blocks that are generated when adding the module. If I however want to add in a new item to the module (a new text block) the styling is not automatically on paragraph. Obviously it is because i only wrapped the description text of my text blocks in my &lt;RepeatedFieldGroup ...&gt; tag in &lt;p&gt; tags. So it will only automatically set their styling to paragraph. Is there an easy approach to fix this?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-06-11 12:32:38",
    "text": "A bit late to the party, but confirming that you can no longer update contact properties via the `identify` event except on legacy accounts.\n\nCurrently, my team’s best workaround to get the same functionality has been to create Custom Events that collect the contact properties, then use a workflow to map them to the Contact record.\n\nIt’s a lackluster solution, but I still haven’t found anything that looks like an “intended” replacement for this functionality."
  },
  {
    "poster": {
      "poster_name": "Lujan Quintero",
      "poster_handle": "lujan.quintero"
    },
    "time_stamp": "2024-06-11 13:32:14",
    "text": "Hey, I have a js bug on my website and don’t know where it is coming from. A non displayed image is showing and its a gif from a G2 tracker code, I have already removed the google tag and disabled the tracking from G2 but it is still showing. I was told to check Javascript settings, as when I disable JS on chrome it disappears. How do I get to see Javascript settings on HS? This tag is not inside any .js file, how is it being generated?",
    "reply_count": 14,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-12 06:15:15"
      },
      {
        "time_stamp": "2024-06-12 06:17:24"
      },
      {
        "time_stamp": "2024-06-12 06:29:39"
      },
      {
        "time_stamp": "2024-06-12 06:35:39"
      },
      {
        "time_stamp": "2024-06-12 06:36:25"
      },
      {
        "time_stamp": "2024-06-12 06:37:17"
      },
      {
        "time_stamp": "2024-06-12 06:38:06"
      },
      {
        "time_stamp": "2024-06-12 06:38:23"
      },
      {
        "time_stamp": "2024-06-12 06:39:50"
      },
      {
        "time_stamp": "2024-06-12 06:40:06"
      },
      {
        "time_stamp": "2024-06-12 06:40:23"
      },
      {
        "time_stamp": "2024-06-12 06:40:36"
      },
      {
        "time_stamp": "2024-06-12 06:42:31"
      },
      {
        "time_stamp": "2024-06-12 06:54:31"
      }
    ]
  }
]