[
  {
    "poster": {
      "poster_name": "Aleksandar Perisic",
      "poster_handle": "fizikaneri"
    },
    "time_stamp": "2024-12-12 07:23:16",
    "edited": {
      "time_stamp": "2024-12-12 07:32:50"
    },
    "text": "I don't remember HTML in JSON templates (old legacy templates with drag and drop)\n• can you just replace HTML with Rich text \n    ◦ add all code into Rich text > Advanced > Source Code \n        ▪︎ HUBL should work there as normal\n(my guess is that you want to place some code + module in that top part)\n\nI can't remember but I had issues when I created a new theme and uploaded *theme.json* \n• did you recently maybe add that to the new theme? try to rename and re-check if it worked the week before"
  },
  {
    "text": "Hi there! HubSpot CMS newbie here. I'm trying to edit one of our Act3 templates in the design manager. It has a 4-column DND section that I'm trying to repurpose to add both images and text, but they don't wrap nicely on medium screens with the current code (first image). Our theme developer does provide basic HTML to have a 4 column section convert to 2 columns on medium screens and 1 column on mobile, but I'm not sure if there's a way to incorporate this code into the DND setup. Thanks in advance for any help!",
    "time_stamp": "2024-12-12 08:24:11",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-12 08:28:51"
      },
      {
        "time_stamp": "2024-12-12 08:31:44"
      },
      {
        "time_stamp": "2024-12-12 08:35:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-12-12 08:28:51",
    "text": "Sadly the HubSpot dnd system just take into considerations two breakpoints, so desktop and mobile, you basically just can control column width on desktop, on mobile they just stack one below the other (you also can't reorder columns on mobile) one of the biggest limits of HubSpot cms, if you need something like that the best thing you can do is to create a custom module for this section"
  },
  {
    "poster": {
      "poster_name": "Katrina Marschner",
      "poster_handle": "katrina"
    },
    "time_stamp": "2024-12-12 08:31:44",
    "text": "Thank you for your quick response <@UV23JHEJY>! If I build a custom module with the HTML example I sent from our theme developer, would I be able to add the DND modules within each column?"
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-12-12 08:35:11",
    "text": "Sadly no, you need to rethink how this section work as you can't nest modules in modules or add dnd tags inside a module, you have to manage this section with module fields (so for example creating a repeater group called \"column\" with fields like width desktop, width tablet, width mobile, content, title, etc)"
  }
]