[
  {
    "poster": {
      "poster_name": "Sabrina Fowler",
      "poster_handle": "sfowler"
    },
    "time_stamp": "2024-08-19 11:54:51",
    "edited": {
      "time_stamp": "2024-08-19 11:59:21"
    },
    "text": "Hello <#CJ5DN6RKP|email-development> members! I was wondering if anyone had any ideas on how to assign tags to the different email fields to show types (work, personal, etc) - I created a custom field for \"work email\" and we were going to utilize the main HS email field for all other types - The only problem is when you send out a form - it only looks at the main HS email field and then creates duplicates. We also have a marketing team that wants to send out emails for certain people by their email type. Any ideas would be appreciated!",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-19 14:04:20"
      },
      {
        "time_stamp": "2024-08-19 14:35:51"
      },
      {
        "time_stamp": "2024-08-19 14:39:51"
      },
      {
        "time_stamp": "2024-08-19 14:44:39"
      },
      {
        "time_stamp": "2024-08-19 14:45:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2024-08-19 14:04:20",
    "edited": {
      "time_stamp": "2024-08-19 14:04:42"
    },
    "text": "I'm not sure this is possible as HubSpot uses their default Email contact property as the primary key.\n\nYou may need 1 contact profile per email address, and then use a custom contact property to \"tag\" them as the type of the email they are - rather than storing the alternate email address. This would allow for creating lists looking for a specific value of that tag, i.e. create an active list of all contacts with the tag \"work email\".\n\nAs well you'd probably want a custom contact property to link multiple profiles together, perhaps through some unique alphanumeric identifier.\n\nOr maybe there is some other way via API? But I am not sure.\n\nMaybe someone else has ideas!"
  },
  {
    "poster": {
      "poster_name": "Sabrina Fowler",
      "poster_handle": "sfowler"
    },
    "time_stamp": "2024-08-19 14:35:51",
    "text": "Thanks. Unfortunately, multiple accounts for the same individual, won't fly. But I appreciate you responding with the idea! Why can't we just label the email fields with a type class? Ugh... :stuck_out_tongue:"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2024-08-19 14:39:51",
    "text": "You could still end up with folks having multiple contact profiles, if they're not always providing the same email. i.e. someone provides their work email at one point, and then their personal email another time. This would create two separate contact profiles. People also change email addresses.\n\nHow many different types of email addresses are you utilizing?"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2024-08-19 14:44:39",
    "text": "I found this help article that does explain you can have multiple emails associated to 1 contact, but 1 of the emails has to be marked as the primary. I'm not sure how you'd tag them, though. <https://knowledge.HubSpot.com/records/add-multiple-email-addresses-to-a-contact>"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2024-08-19 14:45:55",
    "text": "Looks like this has also been requested but not currently planned: <https://community.HubSpot.com/t5/HubSpot-Ideas/Marketing-emails-to-secondary-email-addresses/idi-p/199557>"
  }
]