[
  {
    "text": "Yeah I had the same issue, and the HubL functions for formatting dates doesn't work for the programmable beta it seems. I had to split the string manually and replace the months through an IF branch to convert my dates from \"*31/08/2024*\" to \"*Start date: 31 Aug 2024*\"\n\nThis is how I did it while developing a custom programmable email module:",
    "time_stamp": "2024-08-26 05:03:44",
    "edited": {
      "time_stamp": "2024-08-26 05:05:01"
    }
  },
  {
    "poster": {
      "poster_name": "Rachel",
      "poster_handle": "rachel.alders"
    },
    "time_stamp": "2024-08-26 08:16:17",
    "text": "I appreciate the feedback and insights!"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-08-26 15:49:04",
    "text": "Anyone got any tips on splitting a list in HubSpot to create two balanced lists called A and B for the purposes of A/B testing where we don’t use HubSpot’s built-in function? Use case is that we want to test sending an email on different days and HubSpot’s A/B test function doesn’t do that.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-26 16:01:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-08-26 16:01:41",
    "text": "I’m needing to create my own split list for the purposes of an A/B test. It’s been a while since I needed to do this so I was wondering what everyone’s approach would be? Easy approach would be to just take the second half of the original list and mark them as ‘B’. But that doesn’t take into account historical engagement so I’m gonna end up putting my finger on the scale.\n\nSo then what’s the better approach? Sort all contacts by most engagements in the last 90 days, and then alternate A/B/A/B/A/B until I reach the end?\n\nThe other alternative is being as truly random and hands off as I can be by utilizing HubSpot’s “Create a random split list” feature. I don’t see any published criteria for it, so I can only assume it’s truly just as random and impartial as a small piece of code can make it."
  }
]