[
  {
    "poster": {
      "poster_name": "Ace Hedger",
      "poster_handle": "ace"
    },
    "time_stamp": "2024-08-22 08:13:59",
    "text": "Thank you."
  },
  {
    "poster": {
      "poster_name": "Rachel",
      "poster_handle": "rachel.alders"
    },
    "time_stamp": "2024-08-22 08:52:52",
    "text": "Hi team! We're trying to understand our options when it comes to adding video into our custom email templates. After chatting with a few folks from support, it sounds like the best (and fastest) option is to simply overlay a play button on top a screenshot/image and link out to a landing page (or YouTube) that hosts the video.\n\nThat said, to cover all our bases - wondering if there's other options we can explore, i.e. embedding the video into our templates so that it autoplays, etc.\n\nThanks in advance!",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-22 08:59:26"
      },
      {
        "time_stamp": "2024-08-22 08:59:59"
      },
      {
        "time_stamp": "2024-08-22 12:04:22"
      },
      {
        "time_stamp": "2024-08-22 12:18:09"
      },
      {
        "time_stamp": "2024-08-22 15:27:10"
      },
      {
        "time_stamp": "2024-08-22 15:36:27"
      },
      {
        "time_stamp": "2024-08-26 08:16:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-08-22 08:59:26",
    "text": "Hi <@U07HHJ1LS78>,\nwhile you could technically put a video into a email - I don't recommend it since most email clients doesn't support videos in emails.\n<https://www.caniemail.com/search/?s=video>\n\nThe safest way is still to put a playbutton image over a screenshot/image inphotoshop/designtool-of-your-choice, put this image into the mail and link it to the LP/YouTube link"
  },
  {
    "poster": {
      "poster_name": "Rachel",
      "poster_handle": "rachel.alders"
    },
    "time_stamp": "2024-08-22 08:59:59",
    "text": "OK thank you for confirming!"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-08-22 12:04:22",
    "text": "You could consider making that image a GIF that features a short clip from your video for some wow factor."
  },
  {
    "poster": {
      "poster_name": "Rachel",
      "poster_handle": "rachel.alders"
    },
    "time_stamp": "2024-08-22 12:18:09",
    "text": "Good idea!"
  },
  {
    "text": "Hi there! I am working on a plain text full width email in HubSpot's marketing email tool and am finding that email does not render with any of the normal padding on Apple Mail that is expected with a regular plain text email. I've attached screenshots of what I'm talking about. Does anyone know any tricks to resolve this?",
    "time_stamp": "2024-08-22 15:15:41"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-08-22 15:27:10",
    "text": "Just a UX tip:\nWhile adding a GIF to an email might be a wow factor it might lead to following results:\n• the reciever sees the GIF and thinks \"ohh nice\" - reads further\n• the reciever sees the GIF and clicks on it - the page/video opens in browser and the reciever doesn't read the mail\n• a GIF can take up a lot more data than an image which might lead to email cut-off (especially in GMail)\nWhile you could add a text below the GIF like \"click on the gif to see full video\" - the human eye and brain are focusing on motion(goes back to a time when humans lived in caves). Therefore I'd always recommend to use a \"playbutton\" instead of something moving - especially in emails"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-08-22 15:36:27",
    "text": "Image weight has no bearing on Gmail cutting off the email. That function of Gmail is entirely influenced by the total code weight of the message. That said, do be mindful of the GIF weight because it can be easy to create something that’s 10mb or larger which can be an issue for recipients on slow internet connections. Knowing what kind of audience you have will help you here. And a good designer can create you a good looking, looping GIF that’s optimized for good loading times.\n\nAs a point of reference, big brands like HBO regularly use GIFs in their emails to promote their content. It’s not uncommon for them to weigh as much as 6-8mb. If you can, aim lower than that though.\n\nAlso, my personal take, depending on the type of mail you are sending there’s nothing wrong with the recipient clicking on your GIF and never reading your email. Most (but not all) marketers are trying to drive engagement with their newsletters (especially those trying to increase revenue). And so the sooner you can engage a click and get your contacts out of their inbox and onto your website the better. Your landing page should be as good as or better than your email at conveying the message you want to share. If it is, then I don’t see the problem.\n\nSo I’d recommend driving traffic to a landing page you control with the video embedded (via YouTube or whatever). Stay away from sending them directly to YouTube unless your business model relies on YouTube channel engagement."
  }
]