[
  {
    "poster": {
      "poster_name": "Ilich Padilla",
      "poster_handle": "ilich.padilla"
    },
    "time_stamp": "2024-08-29 07:48:00",
    "text": "ok following up the above issue, I could determined that the \"hr\" in the enabled_features was the cause of the problem"
  },
  {
    "poster": {
      "poster_name": "Louis Chaussé",
      "poster_handle": "lchausse"
    },
    "time_stamp": "2024-08-29 14:48:49",
    "text": "Hi Community,\n\nI hope you are doing well.\n\nI have a specific case in mind and I am wondering if it can be done with a programmable email module.\n\nI need to set up a workflow to send an email to a parent containing information about one of his children. e.g. \" Hi {{parent name}}, we want to tell you XYZ about your child {{chlid's name}}...\"\n\nThe problem I face is, if I enroll the parent's contact in my workflow, it would only allow me to include parents token, and if I enroll the child then the problem is the same in an opposite way.-\n\nI have a same-object association label Parent&lt;&gt;Child set up on the contact object. So I can see how I can use the crm_associations function to get the information of the other contact in the email, but the problem I face is a parent can have multiple children associated with and I need to make sure we don't get the wrong child information in the email. The best way would be if the programmable email module could be informed of the exact record ids of the parent and the child.\n\nSo, my question is : Is there a way to pass context from the workflow to the programmable email? The workflow can get me the ids of the parent and the child, but I don't know how to pass them to the programmable email module.\n\nIf you have any other ideas on how I can achieve this, that would be nice.\n\nThanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Nolan Evans",
      "poster_handle": "nolane"
    },
    "time_stamp": "2024-08-29 16:28:32",
    "text": "Hi Community,\n\nI am wondering if it is possible to create a link as follows in HubSpot's email system:\n\n```click &lt;a href={{someDyanmicUrl}}&gt;here&lt;/a&gt; to learn more```\nwhere the dynamic URL is coming from a contact or custom record in the HubSpot CRM and varies per person I send the email to. I can't figure out how to do this, we are currently on the HubSpot pro tier.\n\nThanks, I tried to figure out how to do this but was unable to.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-29 16:32:50"
      },
      {
        "time_stamp": "2024-08-30 09:48:42"
      },
      {
        "time_stamp": "2024-09-05 13:53:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rodrigo Apetito",
      "poster_handle": "rodrigoapetito"
    },
    "time_stamp": "2024-08-29 16:32:50",
    "text": "Hi <@U05TTKQ4G3Z>\n\nI'm not the expert with HubSpot but I'm also trying to do something almost like that but I'm using workflow to generate the link (custom code on workflow), isn't working to me, but looks like is some wrong setting on my scenario.. maybe you can try and works on your scenario :wink:"
  }
]