[
  {
    "poster": {
      "poster_name": "Mirko Di Serafino",
      "poster_handle": "mirko.diserafino"
    },
    "time_stamp": "2020-09-04 01:57:13",
    "edited": {
      "time_stamp": "2020-09-04 03:03:14"
    },
    "text": "Hi everyone,\nhope that some of us can help me. The company where I work has a datalake infrastructure on AWS. We'd like to export once a week the HubSpot CRM dataset (in particular contacts, companies, deals, line_items, products) on our datalake for deep analisys and to have the opportunity to mix them with other sources but I don't find a real solution on how to perform this export according with HubSpot api rate limit.\n\nSome of us has a similar scenario? How do you solve it?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-04 10:59:14"
      },
      {
        "time_stamp": "2020-09-04 11:43:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Elkins",
      "poster_handle": "ryan.elkins"
    },
    "time_stamp": "2020-09-04 08:53:50",
    "text": "I'm looking to build out a two way sync between HubSpot and my own database. Are there any articles which go over best practices or recommended approaches, especially with the new API that recently came out? Should I be looking at a push vs pull model, and how do api limits potentially impact either approach?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-04 10:59:54"
      },
      {
        "time_stamp": "2020-09-04 11:07:14"
      },
      {
        "time_stamp": "2020-09-09 11:00:20"
      },
      {
        "time_stamp": "2020-09-09 11:00:40"
      },
      {
        "time_stamp": "2020-09-09 11:00:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-09-04 10:59:14",
    "text": "Need more detail about the amount of content you are looking to export. It has a huge effect on a rate limiting related question."
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-09-04 10:59:54",
    "text": "This is going to require some careful work. Can you talk more about the use case / expected behavior?"
  },
  {
    "poster": {
      "poster_name": "Ryan Elkins",
      "poster_handle": "ryan.elkins"
    },
    "time_stamp": "2020-09-04 11:07:14",
    "text": "At a high level, we basically have an application that allows users to interact directly with CRM related objects like companies, deals, and contacts. We keep this data synced with our customer's CRM. So if data is modified on the CRM, we want to be able to reflect that in our app, if data is changed in our app, we want those changes persisted to the CRM. We store our own version of the data, so it's not just a direct link to the CRM. We do a lot of work with SFDC and MS Dynamics and would like to add support for HubSpot. Some systems use a push model for this, others a pull model. I don't know if HubSpot has a preferred approach for these kinds of two way data syncs."
  },
  {
    "poster": {
      "poster_name": "Mark Kofman",
      "poster_handle": "mark027"
    },
    "time_stamp": "2020-09-04 11:43:52",
    "text": "this problem might be better solved with existing solutions instead of building your own API connector. <https://app.HubSpot.com/ecosystem/509078/marketplace/apps/marketing/data-management>"
  }
]