[
  {
    "poster": {
      "poster_name": "Eric Song",
      "poster_handle": "esong"
    },
    "time_stamp": "2024-06-27 09:31:07",
    "edited": {
      "time_stamp": "2024-06-27 09:32:01"
    },
    "text": "Hey everyone, we're excited to officially kick off the Mobile Chat SDK Beta! The instructions and resources below will help you integrate HubSpot’s chat widget into your mobile apps, so you can offer your customers the stellar in-app support experience they deserve.\n\n*Step 1: Confirm Access to Beta*\nAt this point, your portal should already have access to the Beta. To confirm your enrollment, please navigate to `Automations > Chatflows > Create Chatflow` and check that you see an option to select `Mobile` (see screenshot in the thread). If you don't see the `Mobile` option or would like to request Beta access to additional portals (e.g. your sandbox portal), please let us know in this Slack channel.\n\n*Step 2: Create Your First Mobile Chatflow*\nCreate your first mobile chatflow by navigating to `Automations > Chatflows > Create Chatflow > Mobile`. For a detailed walkthrough, please check out this<https://www.loom.com/share/a3849a3d008e4d0f8b93e1038922953c?sid=a1fec7e1-ac26-482c-9133-b5717b3292f0| demo video>.\n\n*Step 3: Implement the SDK into Your Mobile App*\nThe mobile chat product consists of iOS and Android SDKs. Please note that if your mobile app is built on a hybrid framework (React Native, Flutter, etc.), you will need to build your own hooks to the iOS/Android APIs.\n\n• iOS Documentation: <https://developers.HubSpot.com/docs/api/integrate-the-HubSpot-mobile-chat-sdk-into-your-ios-app> (password: `Conversations_156963`)\n• Android Documentation: <https://developers.HubSpot.com/docs/api/integrate-the-HubSpot-mobile-chat-sdk-into-your-android-app> (password: `Conversations_156963`)\n• iOS Source Code: <https://github.com/HubSpot/mobile-chat-sdk-ios> \n• Android Source Code: <https://github.com/HubSpot/mobile-chat-sdk-android>\nAnd... that's it for now! We will follow up shortly with additional resources on how to leverage HubSpot's extensive reporting tools to track mobile chat analytics. In the meantime, please don't hesitate to reach out to us via this channel if you have any questions or feedback. Excited to see what you all build!\n\n_(Please note that we will be slow to respond throughout next week as it is a company holiday. We will be back to normal operations starting July 8.)_",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-27 09:32:57"
      },
      {
        "time_stamp": "2024-06-30 18:41:46"
      },
      {
        "time_stamp": "2024-06-30 20:21:38"
      },
      {
        "time_stamp": "2024-06-30 20:23:17"
      },
      {
        "time_stamp": "2024-07-01 08:00:33"
      }
    ]
  },
  {
    "text": "Below is what you should see when you navigate to `Automations &gt; Chatflows &gt; Create Chatflow` if your portal has been successfully granted access to the Beta.",
    "time_stamp": "2024-06-27 09:32:57"
  },
  null,
  null
]