[
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-01 11:24:48",
    "edited": {
      "time_stamp": "2019-07-01 11:30:46"
    },
    "text": "Here's the context... We're SUPER bullish on our own HubSpot CMS (have 80+ full-time people directly working on it - that's a LOT of people and doesn't account for the many HubSpotters indirectly working on it (Ex: developer customer service team)).\n\nBut, there are sooooome scenarios where WordPress is a better fit for the  solution that needs to get built. Also, there are many folks on WP who aren't ready to swap CMS tools quite yet, but do need Marketing/Sales/CRM/Service tools that are tightly integrated with their  website.\n\nWe want to solve for ALL customers ... and that includes WP customers tool. So we're setting up these partnerships and now have 4.5 full time people building the WP plugin to make sure in those scenarios where someone's using WP, they are getting a good experience too.\n\nHopefully once more WP people start using HubSpot's other tools... it will open their mind to considering HubSpot CMS in future redesigns/CMS tooling changes."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-01 11:26:14",
    "text": "<@UCH1L597V> the HubSpot WP Plugin is open to any WP user to use - regardless if they are using WPEngine or not. :slightly_smiling_face:\n\nThe WP Engine partnership basically has the HubSpot WP Plugin baked into all WPEngine theme's by default + HubSpot CRM + HubSpot Free Tools."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-01 11:28:17",
    "text": "Lol might want to send the half person to the hospital(refering to 4.5 people)"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-01 11:29:34",
    "text": "lol :rolling_on_the_floor_laughing::joy::rolling_on_the_floor_laughing::joy::rolling_on_the_floor_laughing::joy::rolling_on_the_floor_laughing::joy: I thought  about that when I wrote it... but it was the easiest way to explain. haha. The Designer on the WP plugin is a shared resource between two teams = 0.5 person's time :stuck_out_tongue:"
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2019-07-01 11:58:28",
    "text": "That's good news for us, is there any internal development plans for wp plugin <@U22PKFRU5>,  I'm a WordPress plugin developer and love to contribute if any opportunity out there."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-01 12:01:48",
    "text": "They have leadin. (May have changed names)"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-07-01 12:08:53",
    "text": "The URL is still LeadIn <https://wordpress.org/plugins/leadin/> but it is now the HubSpot plugin for all intents and purposes"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-01 12:22:21",
    "text": ":point_up_2: This is HubSpot's WP extension and what's bundled in the WPEngine themes now. It's essentially HubSpot CMS+Free packaged directly into WP interface. If you have ideas on what else we should do in the WP world or would like to collaborate - DM me! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-01 12:36:05",
    "edited": {
      "time_stamp": "2019-07-01 12:36:22"
    },
    "text": "or dm <@UL3QS9ASJ>"
  },
  {
    "poster": {
      "poster_name": "David Ly Khim",
      "poster_handle": "dkhim"
    },
    "time_stamp": "2019-07-01 12:37:30",
    "text": ":wave::skin-tone-4: Hey team. David here. I’m heading up the product development and strategy for our WordPress plugin. Catching up o this thread and it’s great to see that there’s interest in the plugin and what we’re doing with WordPress. Let me know if you have any further questions."
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2019-07-01 22:57:59",
    "text": "Thank you <@U22PKFRU5> <@UL3QS9ASJ>!!\n\n<@UL3QS9ASJ> can we make our plugin compatible with some of the common plugin of wordpress, like budypress, bbpress, or its good to use them as separate plugin like our <https://wordpress.org/plugins/hubwoo-integration/>"
  }
]