[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-07-18 07:39:26",
    "text": "Howdy devs! Who is interested in local development on the HubSpot CMS? Join <#CLJJXGTC0|local-development> for more details on a new beta local development workflow, allowing you to utilize version control, your favorite text editor and various web development technologies when developing on the HubSpot CMS.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-07-18 07:40:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-07-18 07:40:57",
    "edited": {
      "time_stamp": "2019-07-18 07:41:04"
    },
    "text": "<https://HubSpotdev.slack.com/archives/CLJJXGTC0/p1563457134002700>"
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-07-18 08:00:05",
    "text": "This may already be possible but was wondering with this update if I wanted to have my HubSpot blog post appear in WP is that possible? Should I be worried about this type of duplicate content?"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-07-18 08:21:39",
    "text": "It’s not.  For exactly the reason you mention, duplicate content.  The blog should be in either HubSpot or Wordpress, but not both"
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-07-18 08:30:29",
    "text": "So search engines are not smart enough recognized this? I saw this resource linking HS to WP but this would not work?<https://wordpress.org/plugins/connect-HubSpot-blog/#description>"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-07-18 08:31:52",
    "text": "I mean there are things you can do to tell Search Engines about intentional duplicate content, there is a meta tag for that but in general it’s not worth the extra plication.  For the record, that’s not a plugin done by HubSpot so it’s not supported by us"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-07-18 10:56:59",
    "edited": {
      "time_stamp": "2019-07-18 10:58:12"
    },
    "text": "You can create modules in WP that display blog feed via RSS feed... when someone clicks to \"read more\" it would take them into the HubSpot Blog <@UEZJ74UN8>\n\nIf you want it ALL housed in WP... I would just use WP for everything and not use the HubSpot Blog. Not sure the advantages of this, but that's what you'd need to do."
  }
]