[
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2024-08-30 02:07:34",
    "text": "Can anyone please confirm, I'm having a hard time finding any documentation on this.\n\nWith the Business Unit addon: Is it possible to use a completely separate theme (different modules, styles etc), for the website pages?\nOr do we have to go with parent/child-theme and enter override-hell?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-30 02:10:58"
      },
      {
        "time_stamp": "2024-08-30 02:19:54"
      },
      {
        "time_stamp": "2024-08-30 13:54:22"
      },
      {
        "time_stamp": "2024-09-02 01:46:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-08-30 02:10:58",
    "text": "You can select a different theme for each page regardless of business units"
  },
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2024-08-30 02:19:54",
    "edited": {
      "time_stamp": "2024-08-30 02:21:53"
    },
    "text": "I know, but when you've already selected a theme, and create a new page, that theme will be selected by default for the next one. So the editor needs to be very observant when creating new pages, to \"Change theme\" and then select the template. And this goes back and forth constantly, being a point of errors.\n\nWe basically want to sandbox this, just like the other features in BU is sandboxed. So the editor doesn't need to make a choice, or be vary of using the correct theme.\n\n And I'm not finding documentation on this specifically."
  },
  {
    "text": "Hey, I have an client account with like 10 business units and just tested this. It does seem to work, when I select the domain here it default to the theme assigned to that business unit\n\nyou can assign a theme to the business unit in brand kit settings",
    "time_stamp": "2024-08-30 13:54:22",
    "edited": {
      "time_stamp": "2024-09-02 05:21:08"
    }
  }
]