[
  {
    "poster": {
      "poster_name": "Aby Jacob",
      "poster_handle": "aby.jacob"
    },
    "time_stamp": "2023-11-19 10:09:05",
    "text": "Hi,\nUsing the backend data, I'm trying to find all metrics related to marketing emails. For e.g., the number of emails delivered, number of emails that got a reply, number of link clicks and so on.\n1. I see the OBJECTS_MARKETING table with all the high level marketing email info and there are other EVENT objects such as EVENTS_MTA_DELIVERED_EMAIL_V2 and EVENTS_OPENED_EMAIL_V2. How do I join these information together so that I can get all the event information associated to marketing emails?\n2. OBJECTS_ENGAGEMENTS has all the 1-to-1 email interactions, but it looks like it's missing the first time someone contacted us.\nFor e.g., if someone contacted us regarding an issue and there are 100 back and forth replies in that email chain, I could find the 99 emails starting with the first reply, but could not find the first email sent by the customer to us in ENGAGEMENT_OBJECTS. Where do I find that?\n3. Looks like the metrics such as PROPERTY_HS_EMAIL_SENT_COUNT, PROPERTY_HS_EMAIL_CLICK_COUNT, PROPERTY_HS_EMAIL_OPEN_COUNT and PROPERTY_HS_EMAIL_REPLY_COUNT in the OBJECTS_ENGAGEMENTS are not accurate for INCOMING_EMAILS(the numbers are just getting duplicated from the SENT emails). How do I find the similar metrics for INCOMING_EMAILS?\nAny help/direction is appreciated.\nThanks,\nAby Jacob"
  },
  {
    "poster": {
      "poster_name": "Dirk van der Giesen",
      "poster_handle": "dvandergiesen"
    },
    "time_stamp": "2023-11-20 00:26:03",
    "text": "Ah ok thanks Bob, so if i make the name field unique, it should show up in my dynamic slug drop dropdown"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2023-11-20 00:26:51",
    "text": "If you set it to only allow unique values, yes"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2023-11-20 00:27:03",
    "text": "It's not about the name, it's about the values inside of the field :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Dirk van der Giesen",
      "poster_handle": "dvandergiesen"
    },
    "time_stamp": "2023-11-20 00:29:55",
    "text": "Obviously thanks again Bob, from a tool like HubSpot (all out on marketing etc) you'd expect they make a point out of using the name property value in a url right... instead of a SKU or id?"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2023-11-20 00:31:21",
    "edited": {
      "time_stamp": "2023-11-20 00:31:29"
    },
    "text": "I dunno I get it from a dynamic page perspective that they need values to be unique, but from a Product perspective I can understand why you'd not always want the Name property to be unique."
  }
]