[
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2023-01-10 01:31:54",
    "edited": {
      "time_stamp": "2023-01-10 01:39:48"
    },
    "text": "<@UQNEXHW14> Thanks for the update. I would wish that HS became more open and transparent in regards to providing feedback other than using the quite dead upvote system (for the CMS part, don’t know about the other platforms) and poking ‘random’ HS staff on Slack.\n\nProvide CMS partners somewhere to input frustrations, wishes and dreams in a form which isn’t a popularity contest and directly to the CMS dev team at HS.\n\nThen, from that, make a roadmap available to partner devs, so we can see what you pick up on and what you are planning to do in the future. Doesn’t have to be set in stone either.\n\nI (and many others) have raised concerns with the performance issues and HTML bloat in the forums and tagged the people that seems to be HS devs. However, every time the subject is something large and critical there’s no real answer or conclusion.\n\nBy now, I suspect the mentioned people doesn’t have the answers and it’s quite sad that constructive criticism is met with silence and/or no resolve. Personally I don’t think that’s a good look for HS at all.\n\nFor the record I’ll repeat that the above is not with ill intent. I TRULY want this ship to blast into outer space :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2023-01-10 01:49:48",
    "text": "By the way, try looking at what the team at Midjourney (AI) are doing in regards to engaging with customers on Discord and their “Office Hours” open live discussions."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-01-10 07:34:15",
    "edited": {
      "time_stamp": "2023-01-10 07:34:26"
    },
    "text": "<@U03MU3H35R6> HubSpot is a publicly traded company, so it's a little hard to share the vision for the future of HubSpot (from a product standpoint at least) in the same way that a private company can. You have to be really careful about the type of information you're sharing and who you're sharing it with (do they have an NDA), etc etc. Also HubSpot does provide a place for partners to take part in the future planning of HubSpot, it's called the <https://www.HubSpot.com/company-news/HubSpot-announces-2022-partner-advisory-council-members|Partners Board>: \"The 2022 PAC regional groups will hold virtual meetings every quarter to discuss strategic topics that will help shape the future of the partner program. The quarterly meetings will serve as an opportunity for PAC members to provide feedback on product betas, partner tools, and partner engagement. In addition to the PAC, HubSpot solutions partners are also encouraged to provide feedback through community engagement, biannual surveys, and ongoing conversations with HubSpot leadership and members of our internal partner program teams.\" There's a similar board for HubSpot customers called the HubSpot <https://www.HubSpot.com/company-news/HubSpot-announces-2022-customer-advisory-board-members|Customer Board>. HubSpot also has Office Hours which is open to whoever wants to join and is a great way to interact with the HubSpot team, you can find all HubSpot events and Office Hours here: <https://events.HubSpot.com/events/#/list>. I think the \"*CMS for Marketers Office Hours - January 26th*\" could be a particularly good fit for you."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-01-10 07:54:36",
    "text": "Love the conversation here — I have a simple solution! An email that goes out that sends new ideas and ones with traction. A biweekly email that can go out to users. This solves the imaginary issue about engagement. (I say imaginary because the people that want things to change look through these, they write these, and they send them out to others) — however an email would def help this out.\n\nIf we are going to spend dev hours on something, I think that would be the most beneficial. Offer it to partners, developers, etc."
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2023-01-10 08:20:34",
    "edited": {
      "time_stamp": "2023-01-10 08:21:13"
    },
    "text": "<@U01QVR44MEY> Thanks man, I will definitely look into it. Also i am talking about my wishes, but I hope to make some of it manifest itself. Cheers man"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-01-10 08:22:01",
    "text": "100% man"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2023-01-11 00:33:59",
    "edited": {
      "time_stamp": "2023-01-11 00:36:11"
    },
    "text": "<@U01QVR44MEY> Just following up on your latest message.\n\nThere’s no way to apply to join the Partner Board, so I assume you’d have to be selected for it - and I have my suspicion that spots are based/offered based on yearly revenue results. I could be wrong though. Anyway, I reached out to <@UQNEXHW14> asking about how to get considered and hope we will eventually be able to assist in propelling the CMS platform forward.\n\nThe event on the 26th seems to run by an external partner so while I have signed up for it, I doubt I’m able to get any answers to the subjects we’re focused on. But we’ll see.\n\nAs always, thanks for being helpful. I wish you were actually a HS employed dev :wink:"
  }
]