[
  {
    "poster": {
      "poster_name": "Mike Thomas",
      "poster_handle": "mike542"
    },
    "time_stamp": "2024-02-16 03:19:48",
    "text": "I was excited to watch this video about Commerce Hub going international.\n\n<https://www.youtube.com/watch?v=y3CLtckxT10|Commerce Hub Goes International | HubSpot Admins HUG | 02.06.24>\n\nThere’s some really useful stuff in there and having it available in the UK is a good thing.\n\n<@U04U9UFTKNJ> draws attention to the difference between B2B and B2C here, and goes on to explain that they haven’t really seen “carts” being a feature that is in much demand or on the roadmap. Now - maybe it’s the luck of the draw of clients and projects - but most HubSpot + ecommerce solutions I’ve either worked on or seen cross our path at least, have wanted some way of automatically configuring a payment link or quote with line items based on a users’ actions and choices. Eg, a cart in all but name.\n\nOur experience at least, is that clients expect that HubSpot can figure this out before someone in Sales needs to get involved to manually communicate with a customer to generate a quote/payment link etc.\n\nI understand that B2C wont be a focus for HubSpot, but I’d like to just get my voice out here and say - please - when it comes to the API - letting developers create and manage payment links at least, could be an absolute game-changer. With the ability to do that alone, it’s reasonably trivial for developers to then facilitate a cart-like functions using a combo of HubSpot Memberships, Custom Objects and/or Local Storage.\n\nGive us that - and I think we would never need to darken our days with the likes of Shopify ever again.\n\nReally exciting to see this update though. I think what’s been done with recurring payments/subscription features etc is going to be huge. :+1:"
  },
  {
    "text": "Future change for the Blog Author Bios: My team would love to be able to edit/add a field to the Author bio template.\nThey want to be able to add a \"title\" field that will appear on the Author Detail pages. I'm sure other fields would be handy to have as well.",
    "time_stamp": "2024-02-16 07:53:57"
  }
]