[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-02-29 06:09:34",
    "text": "{% dnd_section\n    class=\"my-custom-section-class\"\n%}"
  },
  {
    "poster": {
      "poster_name": "Matthew Howe",
      "poster_handle": "matthowe85"
    },
    "time_stamp": "2024-02-29 06:45:00",
    "text": "That works but I would need to create a new template for a one-off page and it's just extra work and confusing for people who aren't developers. If I could just add a custom class to a section I could style native HS modules for that section only really quickly instead of having to create a new template for that section. I would also be able to save that section and re-order where it appears without having to do to much."
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-02-29 06:48:17",
    "text": "It sounds like a custom module that applies the custom class to the section with JS might best fit your needs, until HubSpots provides some other easier way to apply custom classes"
  },
  {
    "poster": {
      "poster_name": "Matthew Howe",
      "poster_handle": "matthowe85"
    },
    "time_stamp": "2024-02-29 06:51:12",
    "edited": {
      "time_stamp": "2024-02-29 06:51:28"
    },
    "text": "That is how I have been getting by. Just feels like extra steps to do something simple. I have a repo of custom modules that are just HS modules with the ability to add a class, or just custom modules that are entire sections that could have been made using native modules"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-29 07:00:18",
    "text": "Are there any plans to expand the workflow automation so we can enrol deals via API and not just contacts? :crossed_fingers:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-11 06:07:01"
      },
      {
        "time_stamp": "2024-03-11 10:17:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Amy Andrews",
      "poster_handle": "aandrews610"
    },
    "time_stamp": "2024-02-29 08:50:08",
    "text": "Yes to this! I would love to also be able to add both a background image and background color within native HS DND sections out of the box. Right now it is either or…"
  }
]