[
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-16 09:13:30",
    "text": "Hey guys, loving the dev extension. One piece of feedback that would be awesome. Is it possible to make the cache buster change the number with each refresh if it exists in the url? Thanks for all your hard work everyone",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-08-16 09:16:52"
      },
      {
        "time_stamp": "2018-08-16 09:18:02"
      },
      {
        "time_stamp": "2018-08-16 09:20:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-16 09:16:52",
    "text": "Thanks for the interesting suggestion, I haven’t researched it but I think we’d have to require the “tabs” permission to do that, which would show the scary sounding warning to users “this extension can view your browsing history” or something like that.\n\nWe do have something in the works that might achieve a similar effect to what you want though.\n\nWe’re working on adding Keyboard shortcuts, and one of them is specifically the cache buster one."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-16 09:18:02",
    "text": "That however only solves your issue if you use the keyboard shortcuts to refresh your page (you’d have to substitute your normal cmd+r or cmd+shift+r  for a new shortcut(you will have the ability to set a custom shortcut))"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-16 09:20:27",
    "text": "no official eta on the keyboard shortcuts, I would love to have them in before Inbound but I don’t think it’s gonna happen. crazy busy with work stuff and prepping for Inbound."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-16 09:21:58",
    "text": "<@U2H3TT8F2> you win the award for best review of the extension lol “I worked on a computer last night that didn’t have this extension and nearly cried.”"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-16 09:22:43",
    "text": "lol its the truth, i clicked the contacts menu so many times thinking it was the dev menu"
  },
  null
]