[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-15 06:48:59",
    "edited": {
      "time_stamp": "2018-08-15 06:50:44"
    },
    "text": "little update to the extension’s icon/logo just want to hear what people think before I actually change it.\n<https://spin.d.pr/kd5COg+>\nGoals:\n• Make the icon more easily standout when displayed at a small size like the extension’s button.\n• Make the D stand out more to prevent confusion of similarity to HS logo.\n• Remove the HubL brackets - they’re impossible to see at small size and they don’t look great.\n• Remove white glow behind icon(it was intentionally hardly noticeable, it was there to make the logo more visible on certain screens but I don’t think it’s necessary in the new design.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-08-21 08:17:57"
      },
      {
        "time_stamp": "2018-08-21 08:18:00"
      },
      {
        "time_stamp": "2018-08-21 08:19:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-15 06:51:57",
    "text": "The D by the way is a FiraCode D as an homage to the fact this is a developer tool. The previous D was a using the Hack Font, I felt while it was clean and worked good for code it wasn’t as stylish as the FiraCode one."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-15 13:26:40",
    "text": "Well, was expecting people to have opinions and such but seems like a fairly consistent approval. I’ll move forward with updating the icon to the new one (will likely happen in the v1.04 update) beta users should see it before v1.04 gets to everyone."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-15 19:02:47",
    "text": "I actually went ahead and pushed this branding update to everyone both stable and beta. The fact that the icon simply wasn’t showing in some areas was not a great experience. The updated version fixes this."
  }
]