[
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-02-14 10:53:03",
    "text": "Not directly design-tools related, but can we request more detailed descriptions or help text for the new Users &amp; Teams settings tool, or just get a developers role that gives us access to all content / template related tools? It seems like I'm asking for access to something every week because the people in control of the rights don't know what turns off what. For example, I had an intern that only deals with template-level tasks who did not have CTAs in his menu, and we had no idea what toggle that required.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-02-14 12:49:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-02-14 12:49:19",
    "text": "I strongly approve of this. My team we try to make good use of the permissions giving people only the rights they need. In my case however every time we do a new project since the permissions update, They keep accidentally leaving out permissions that I need. They’re not doing it intentionally, it’s just not obvious to them what permissions to give.\n\nLike Mark suggested, it’d be awesome to have some presets they can use. It’s getting annoying having to go back to the people setting up the projects - hey can you make sure to give me the permissions I need."
  },
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-14 15:48:27",
    "edited": {
      "time_stamp": "2018-02-14 15:48:54"
    },
    "text": "for comments, is there a way we can get an identifier for when the commenter is the author or the article or a team member? I'm trying to figure out a way to basically highlight author comments in the blog. (posting this here because i havent found a way and also could be an idea if not one)"
  },
  null,
  null,
  null
]