[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-02-04 20:24:14",
    "text": "User permissions per HubSpot ID/account suggestion - It would be great if we could create Permissions Presets that are saved to our user accounts - to be used when adding people to sites. Or a way to copy a team from one HubSpot account to the next, with all existing permissions. \n\nUse case/reason this is needed: I work for an agency and we do probably 2-3 sites a month, on top of that I maintain 40+ other HS sites. I’m finding with the new permissions system that rolled out that often the people who add me to a new project accidentally forget to give me certain permissions. They always have the same permissions to give me, it doesn’t change. It’d be fabulous if they could create presets or something that would carry over between all HubSpot accounts, then they could have a preset for example with my name or “developer” and select that when inviting me to the HS site. That way I don’t discover down the road that “hey I need this permission” then have to  keep going back and bugging people to update my permissions.\n\nAlso a bug report - I’ve found a lot of the times when you don’t have permission to do something there’s either no pop-up message saying you don’t have permission, or the implementation is fairly buggy and you can still see and access screens you’re not explicitly given permission to see.(can’t take action on them)\n\nFor example on the site I’m working on now, they accidentally didn’t give me permission to create pages. I was still able to get to the screen where I pick a template for the new page and get to the point where I enter the name of the new page. It breaks there because I don’t have the permission but doesn’t say anything."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-02-04 21:42:32",
    "text": "Design Manager v2 idea - when there is only 1 item in a repeater field - show that items contents or have the ability to toggle whether it shows the items contents by default when someone drops in the module."
  }
]