[
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-01-11 05:30:18",
    "text": "No"
  },
  {
    "poster": {
      "poster_name": "Deksia Developers",
      "poster_handle": "developers217"
    },
    "time_stamp": "2024-01-11 07:08:43",
    "text": "Hello brilliant people! I am new to this channel so apologies if this is not the appropriate place, I will redirect it promptly if someone can guide me.\n\nBut here is my issue. My client has a HS site that is integration with Commerce7 (a wine merchant platform)\nsite url = <https://www.williamchriswines.com/>\n\nThe original developer is no longer reachable, so, we are trying our best to inspect their code and update a variable that is used for the API header known as the Tenant ID (from C7)\n\nWe are fairly confident we are looking for the following code that was published on all pages - per instructions from C7 &gt;&gt; <https://design-docs.commerce7.com/docs/home#:~:text=%22stylesheet%22%3E-,Javascript,admin.platform.commerce7.com/%2C%20the%20tenantID%20is%20jason%2Ddemo%2Dsite,-HTML|see here>\n\nHere is the script we need to identify and change\n&lt;script type=“text/javascript” src=“<https://cdn.commerce7.com/v2/commerce7.js>” id=“c7-javascript” data-tenant=“william-chris-vineyards”&gt;&lt;/script&gt;\n\nI cannot find this code in any of the footer folders in the design files.\n\nWhere else might the dev put this if they wanted to make sure it was global? Any ideas are welcomed",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-11 11:32:28"
      },
      {
        "time_stamp": "2024-01-11 16:23:42"
      },
      {
        "time_stamp": "2024-01-11 16:25:16"
      },
      {
        "time_stamp": "2024-01-11 16:25:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2024-01-11 11:32:28",
    "text": "I’d pull the code down locally and do a keyword search - I use vscode, though I’m sure most other editors allow for the same. That’s what I’ve done when I’ve found myself under similar circumstances in the past.\n\nIf that’s not possible for whatever reason - I’d try looking in layouts -&gt; base.html."
  },
  {
    "poster": {
      "poster_name": "Ankit",
      "poster_handle": "ankit188"
    },
    "time_stamp": "2024-01-11 12:10:15",
    "text": "Hi, All\nCan you suggest me? I have some functional changes in the theme, but it is used live.\nI want to change some features on the live site, but there is login functionality; after logging in, it will redirect us to the main site. Is there any way I can change that functionality in testing mode, like the sanbox type?"
  },
  {
    "poster": {
      "poster_name": "Amanda",
      "poster_handle": "afisk"
    },
    "time_stamp": "2024-01-11 15:22:14",
    "text": "Could you walk me through the steps? I feel like I am missing something. :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2024-01-11 16:23:42",
    "text": "Also - have you checked the global site settings too? Under Website? Website -&gt; Pages and check all domains."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2024-01-11 16:25:16",
    "text": "One note though - you may want to shift that stylesheet further down the page, and/or only load it on pages that it's needed on - it's pretty big and will block the entire page load!"
  },
  {
    "text": "",
    "time_stamp": "2024-01-11 16:25:25"
  }
]