[
  {
    "poster": {
      "poster_name": "Dinakar Sathyamoorthy",
      "poster_handle": "dinakar"
    },
    "time_stamp": "2024-12-02 04:54:26",
    "text": ":wave: Hello, team!"
  },
  {
    "poster": {
      "poster_name": "Christophe Perez",
      "poster_handle": "christopheperez1"
    },
    "time_stamp": "2024-12-02 10:10:53",
    "text": "Hi Tanya, I identified the source of the problem. The CLI commands were blocked by Zscaler, a security solution that my company's IT department installs on all computers. I asked them if they could edit the Zscaler settings to allow the HubSpot CLI commands to pass through, but they haven't provided a satisfactory answer so far. However, I was able to log off the Zscaler app on my own, and that solved the issue. I can work with the HubSpot CLI in the VS Code terminal or with another CLI tool as long as I'm logged off Zscaler."
  },
  {
    "poster": {
      "poster_name": "Sebastian Fairchild",
      "poster_handle": "sebastian207"
    },
    "time_stamp": "2024-12-02 11:16:51",
    "text": "<@U056ZR8LVJQ> I also want to migrate a public app. Are there any dangers to migrating that we should consider before we just go ahead and do it?"
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-12-02 11:31:09",
    "text": "We havent encountered any yet that I am aware of, but if you prefer to test beforehand you can use the `hs project clone-app` CLI command to see what the expected output would be in a new app."
  },
  {
    "poster": {
      "poster_name": "Sebastian Fairchild",
      "poster_handle": "sebastian207"
    },
    "time_stamp": "2024-12-02 11:32:49",
    "text": "Thanks for the quick response. I've tried that but it's a brand new app so it's not quite the same. :sweat_smile: Ok, just need to get psyched up to send it I guess"
  },
  {
    "poster": {
      "poster_name": "Jonathan McCann",
      "poster_handle": "jonathan776"
    },
    "time_stamp": "2024-12-02 22:05:51",
    "text": "Hey all :wave:\n\nI've built a react app using the CTI sdk that handles making outbound calls. It works great when you click the call button on a contact in HubSpot - it loads my app in an IFrame, makes the call, etc.\n\nHowever, when a user has a task list of calls, and they are cycling through their tasks - There is no event firing telling me they have changed tasks (gone to the next contact) so my UI becomes stale:\n\n1. Create a task list with &gt; 1 contacts to call\n2. Click the call button on Contact 1. Opens the call UI in my app, but doesn't immediately dial (you have to push one more button to confirm the dial in my app)\n3. Click \"Skip\" on the task, so you proceed to contact 2.\n4. App is still loaded in an IFrame based on the externalID/phone number of contact 1.\nBasically, there doesn't seem to be any kind of \"onNavigate\" event that fires when you go toy the next task. I thought `onNavigateToRecord` may do this, but it doesn't seem to.\n\nAny guidance/ideas on how we can detect a task or URL has changed from within our IFrame app, so we can get the externalID of the new contact and ultimately can get the proper phone number would be great!"
  }
]