[
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-12-10 01:23:03",
    "text": "Hey everyone, could it be that the scopes \"crm.objects.users.read\" and \"settings.users.teams.read\" are not available for the Personal Access Key?  Because in hs project dev mode I'm getting errors because the app hasn't been granted all required scopes and in normal production the calls are working. Furthermore I can't see that those scopes can be selected when creating the personal access key. I's this a mistake by HubSpot, am I doing something wrong or is it supposed to be like this?"
  },
  {
    "poster": {
      "poster_name": "Christophe Perez",
      "poster_handle": "christopheperez1"
    },
    "time_stamp": "2024-12-10 09:04:05",
    "text": "Hi everybody, could you please tell me how to stop watching a directory using the HubSpot CLI? The documentation is clear about the command to use for watching a directory (eg, `hs watch my-theme my-theme`), but I can't find out how to stop the watch so that files are no longer uploaded to HubSpot on save. Thanks!!!"
  },
  {
    "poster": {
      "poster_name": "Sal Hernandez",
      "poster_handle": "pcbkiller123"
    },
    "time_stamp": "2024-12-10 09:42:50",
    "text": "disregard, I was running the development server on my laptop, but logged into HubSpot on a vm.  All is well."
  },
  {
    "poster": {
      "poster_name": "Jason Ko",
      "poster_handle": "jason620"
    },
    "time_stamp": "2024-12-10 18:02:28",
    "text": "Hey everyone! :wave:\n\nI’m trying to figure out how to add global CSS that applies to all modules in the dev server (`@HubSpot/cms-dev-server`) at `<http://hslocal.net:3000/>`.\n\nI want the global CSS to only be applied in the development server environment and not impact the deployed HubSpot modules. Specifically, I’m wondering:\n1. How can I import a CSS file (e.g., `global.css`) to be applied globally across all modules during development?\n2. Where is the entry point (like `App.js` or `index.js`) in the dev server setup? I’ve searched but couldn’t find it, so I’m not sure where to include global styles.\nIf anyone has insights or suggestions, I’d really appreciate it. Thanks in advance! :blush:"
  }
]