[
  {
    "poster": {
      "poster_name": "Shamash Athoraya",
      "poster_handle": "shamash.athoraya"
    },
    "time_stamp": "2018-08-30 06:15:48",
    "text": "I don’t know if anybody has brought this up already but when you clone a field group that contains fields with display conditions, these conditions remain as they are instead of referring to the new field group variables.\n\nSo if I have a group with a choice field and then 10 different fields that display depending on which choice you made, and I want to clone that group, I need to update the display options for each of the 10 cloned fields to refer to the new choice field clone.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-08-30 07:48:15"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-08-30 07:48:15",
    "text": "Thanks for reporting this Shamash! Definitely an oversight on our part, I'm going to open an issue for this and have someone from our team take a look"
  },
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-30 09:29:07",
    "text": "Anyone else having issues where content added to the \"Additional Markup before &lt;/body&gt;\" does not actually get added to the template?"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-08-30 13:02:46",
    "text": "Hey AJ - yes this is on purpose that we strip any HTML that does not have text content in the rich text editor. I'd recommend putting this code into a custom module instead since even if we did not strip this out for rich text it would be an invisible icon when editing rich text content"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-08-30 13:03:08",
    "text": "Also just FYI there is now an icon field available for custom modules! It uses fontawesome as well"
  },
  null,
  null
]