[
  null,
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2018-12-13 03:26:44",
    "text": "Can anyone familiar with the oAuth2 authorization for integrations using HubSpot guide me on an issue that I cannot seem to figure out. So I’ve followed this quickstart <https://developers.HubSpot.com/docs/methods/oauth2/oauth2-quickstart> it’s really easy to follow and get up and running. In the documentation it says it will give me access token AND refresh token. Yet I only keep on getting only the access token. So is the refresh token something that is not needed / not given because of chosen scope(s) / something I’m doing wrong with this or what is happening with this? :scream:",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-12-13 13:29:28"
      },
      {
        "time_stamp": "2018-12-13 13:30:03"
      },
      {
        "time_stamp": "2018-12-13 13:33:43"
      },
      {
        "time_stamp": "2018-12-13 23:16:18"
      },
      {
        "time_stamp": "2018-12-13 23:18:05"
      }
    ]
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Tim Joyce",
      "poster_handle": "tim"
    },
    "time_stamp": "2018-12-13 12:30:04",
    "text": "<@U7WV8C5LN> - be sure you're not skipping a step. The authorization code is *not* the same as the access token. The authorization code needs to be passed to get the access token. Once you get that access token, go ahead and refresh and you should receive back a new access token. I believe the refresh token is the *persistent* token that you store on your end. Keep passing that to the HS refresh endpoint to keep getting new access tokens whenever the old ones expire",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-12-13 23:13:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2018-12-13 13:29:28",
    "text": "Your resource token does not expire , your access token does after 60 days, you need your refresh token to get a new access token valid for 60 more days"
  },
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2018-12-13 13:30:03",
    "text": "you only use your refresh token to request a new access token when it expires"
  },
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2018-12-13 13:33:43",
    "text": "<https://developers.HubSpot.com/docs/methods/oauth2/get-access-and-refresh-tokens>"
  },
  null,
  null,
  null,
  {
    "text": "Thank you for your answer <@UDC5GRX6E> What I meant was that following the quickstart oAuth2 guide in the documentation it says it would give out access token and refresh token. Yet I only get an access token out of it when I install an application into a HubSpot portal. So I wondered if that refresh token is even needed to get an app from developer portal working in a regular portal.",
    "time_stamp": "2018-12-13 23:13:55"
  },
  {
    "text": "Sorry for probably asking silly questions but basically the main issue I got is that when I follow the oAuth2 quickstart guide and install an app to a regular portal I get only an access token out of it even though it says I would get also the refresh token in the documentation of that quickstart guide.",
    "time_stamp": "2018-12-13 23:16:18"
  },
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2018-12-13 23:18:05",
    "text": "So I guess the main question that I got is that is the refresh token even needed to get an app running in a portal at first? Is it something that I will get notified “Hey your app needs to refresh the authentication” or something. If the nature of the app has any meaning we basically are simply trying to get a private app working into one regular portal to get a solid grip out of this oAuth2 flow with HubSpot apps"
  },
  null
]