[
  {
    "poster": {
      "poster_name": "Dharmendra Joshi",
      "poster_handle": "dharmendra.joshi"
    },
    "time_stamp": "2024-10-10 05:33:50",
    "edited": {
      "time_stamp": "2024-10-10 05:34:39"
    },
    "text": "Hi <@U07R2A7GW03>\n\nWe have extensive expertise in HubSpot CMS website development, using both theme-based drag-and-drop templates and module development.\n\nAs a *HubSpot Platinum Partner*, we are confident in customizing your HubSpot CMS to meet your website redevelopment needs.\n\nOur approach will ensure your website is optimized for performance, user experience, and integrates seamlessly with your marketing, sales, and customer service processes.\n*Website Migration to HubSpot:*\n• We will begin by analyzing your current website's structure, design, and functionalities to ensure a smooth transition to HubSpot CMS.\n• The migration process will include:\n    ◦ Redesign (if needed)\n    ◦ Redevelopment of necessary web pages in HubSpot\n    ◦ Migration of all page content, blog posts, and media assets from WP existing website\n    ◦ Integration of forms, pop-ups, and CTAs with HubSpot to capture leads directly into your CRM\n    ◦ Ensuring the design is fully responsive and mobile-friendly\n    ◦ Implementing HubSpot tracking to accurately capture visitor data for analytics\n    ◦ Setting up HubSpot’s SEO tools to maintain or improve search engine rankings.\nFeel free to check some of our recent projects on HubSpot CMS:\n\n1. <https://www.infinity.co/uk/>\n2. <https://www.upgrad.com/sg/>\n3. <https://www.troygroup.com/>\n4. <https://moorgateandrology.co.uk/>\n5. <https://www.drakestar.com/>\n6. <https://www.sptlabtech.com/>\n7. <https://www.propertyloop.co.uk/>\n8. <https://www.fedco-usa.com/>\n*Visit website*\n<https://www.dotsquares.com/HubSpot-consulting-services>\n\nI will be happy to schedule a quick call to discuss further."
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-10-10 09:49:01",
    "text": "Hey <@U07R2A7GW03>,\nwelcome to HubSpot content hub!\nA few tips if you're just getting started:\n• HubSpot websites are build upon thmees(kinda similar to WordPress themes). Each theme has theme-specific modules but you can also use the default HubSpot building blocks called modules. \n• When it comes to themes you basically have 3 options\n    a. 1. use the boilerplate or use one of the preinstalled/default themes of HubSpot. \n    ◦ Benefits: \n        ▪︎ it's cheap\n        ▪︎ it's fast\n    ◦ Downsides:\n        ▪︎ Those options require quite a lot of development work to match the look&amp;feel of any existing website\n    b. 2. Go with a marketplace theme. There are a ton of good ones out there. From my experience I'd recommend to choose a premium one that has a lot of modules/functions that are somewhat matching your existing functions since it'll be cheaper to modify. \n        i. Benefits:\n            • more and better functionality than in the boilerplate/default themes\n            • most premium theme developers offer custom development service\n            • come with a wide variety of functions\n        ii. Downsides:\n            • higher starting cost\n            • not everything matches your desired outcome from the start\n            • come with a wide variety of functions\n    c. 3. custom development. Being a *HubSpot Solution Provider* and *Theme Developer myself,* I most times will recommend this approach since it will give you a tailored design&amp;functionality.\n        i. Benefits:\n            • tailored experience\n            • completely custom development and functionality possible\n        ii. Downsides:\n            • most likely more expensive\n            • Depending on developer&amp;your requirements it will take longer to ramp up compared to the previous options\nAnd just a sidenote: There are a ton of freelancers/Agencies out there and being a HS developer for 6-7 years, I've seen almost everything. <@UF6MG8UH1> is a great dev who I can highly recommend working with."
  },
  {
    "poster": {
      "poster_name": "Akash deep Shakya",
      "poster_handle": "akash316"
    },
    "time_stamp": "2024-10-10 14:40:20",
    "text": "Thanks everyone"
  }
]