[
  {
    "poster": {
      "poster_name": "Alice Easter",
      "poster_handle": "aeaster"
    },
    "time_stamp": "2021-10-08 09:42:17",
    "text": "Does anyone know if you can fetch pages by template type? I'm looking to compile a resources page that brings in references to every page of a few different page types"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-10-08 14:14:19",
    "edited": {
      "time_stamp": "2021-10-08 14:34:20"
    },
    "text": "--SOLVED--\n\nIs there a unique page id associated with dynamic pages? Im finding that content.id returns the same page for all of my dynamic pages. Im trying to generate Active lists based off of forms filled out on the dynamic detail pages. These forms are not HS forms though so I am using the zappier, a necessity in this case, to zap the form data over to HS. Passing content.id through as the pageId seems to associate all of the forms as being filled out on the listing page.\n\nHow do I grab the page id for the individual detail pages?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-08 14:34:02"
      },
      {
        "time_stamp": "2021-10-13 08:24:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-10-08 14:34:02",
    "text": "Figured it out. <@U7SL518D6> I dont think there is any documentation on this. But I was able to back into the right id config by searching through developer info. I found this `dynamic_page_id.` variable which I dont think is accessible in hubl at all. At least not through content. any hubdb entry points so I backed into the correct formulation for this value which is `hubdb-{{content.id}}-{{dynamic_page_hubdb_table_id}}-{{row.hs_id}}` If I pass that through to the forms api as the page Id then the form is attributed to the correct page and contacts will sync properly into the correct active list based off of form submissions.\n\nMight save folks a bit of time if this is somewhere in the docs — even though it’s kind of a far out use case."
  }
]