[
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-04-21 02:36:03",
    "text": "What type of workflow is this? Is there a custom object triggering a WF that then sends an email to the associated contact?"
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 10:10:02",
    "text": "Yes <@U9KA594Q3> we are triggering the workflow off a custom object and using a contact filter among other custom object enrollment triggers, which then sends to the associated contact. <@UKGV272KS> we are not using the drag-n-drop editor, but instead a custom-built template."
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 10:10:53",
    "text": "<@UKGV272KS> I have only been able to find them after they've been sent and see a list of them under the Internal HubSpot ID under email details, but there is no clear way to map which ID (as there are many) maps to which workflow. I plan to use the same email for two workflows."
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-04-21 10:11:54",
    "text": "So you want to pull the object associated with the recipient contact into the email? I left a comment on the community post you linked above showing how to do that"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-04-21 10:12:26",
    "text": "But it would be like\n```{% set contact_id = contact.hs_object_id %}```\ninstead to pass into `crm_assosiations`"
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 10:17:49",
    "text": "It's really the inverse, so we want to pull the value of an associated contact from the Contacts, but we're triggering the workflow and personalizing with a custom object. How would I write the logic in this case to obtain the email value 'email' from the contacts table?"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-04-21 10:42:21",
    "text": "When you trigger an email send action based on a custom object it is sent to the associated contact"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-04-21 10:59:57",
    "text": "Automated emails list which workflows they are associated with on the email performance page. To the right of the subject line under “Email Type” is “Workflows”."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-04-21 11:01:36",
    "text": "So if 1 email is used in 2 workflows, the email will show those 2 workflows listed, and it shows with coloured icons if the workflow is active or not."
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 11:01:56",
    "text": "I see the workflows listed, but I don't see which email campaign ID is attached to which workflow."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-04-21 11:02:15",
    "text": "As far as I know it would be the same email ID for both."
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 11:02:29",
    "text": "We have determined this was not the case in response API testing"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-04-21 11:02:47",
    "text": "Maybe <@U9KA594Q3> knows?"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-04-21 11:38:45",
    "edited": {
      "time_stamp": "2022-04-21 11:40:55"
    },
    "text": "The internal email ids (emailCampaignIds) are only ~associated to the email after a send has happened~ shortly after the WF is published. They are unique to the workflow. They are added to the email in order that they happen. What are you trying to achieve?"
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 11:55:17",
    "text": "I'm trying to identify the exact email campaign ID that matches with the workflow. Right now, I only see a list in the email details, and there is not a clear way for me to map them to the respective workflow."
  },
  {
    "poster": {
      "poster_name": "Janelle Houser",
      "poster_handle": "jrosengreen"
    },
    "time_stamp": "2022-04-21 11:57:24",
    "text": "Yes, I also need to use a personalization token from the contact object, which is not available in the custom object. How can I write my personalization token so that it pulls correctly? Here's the current token language I tried to use that is not working: {{ p7099483_<http://contact.email/|Contact.email> }} -- according to the support ticket, there is a way to reference a different object but we need that object ID (the ID of the contact object table, not individual contact record). I'm trying to figure out how to re-write this personalization token so I can pull in the value for the associated contact's email address."
  }
]