[
  {
    "poster": {
      "poster_name": "Erik Johansson",
      "poster_handle": "erik.johansson"
    },
    "time_stamp": "2020-04-08 07:06:04",
    "text": "What setting controls the language used for the manage subscription and unsubscribe pages/templates? Where have everything set to Swedish, but still those pages end up in English. I can see `&lt;html lang=\"en\"&gt;` attribute is being generated in the in source as well.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-11 00:11:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2020-04-08 14:43:53",
    "text": "When setting up a new email sending domain, it asks you to create the 2 DKIM and 1 TXT DNS records. That part makes sense, as you need to know that the user adding the domain is authorized to edit that domain in general. How does it know that the domain is capable to recieving email on behalf of that domain? For example, lets say I want my email to come from <mailto:info@example.com|info@example.com>. I could add <http://example.com|example.com> as an email sending domain, add those 3 DNS records and validate it.... but if I tried to send an email as <mailto:info@example.com|info@example.com> and sent it to an address that doesn't exist (where a bounce would occur), since I don't have MX servers accepting that mail, wouldn't there be a bounce loop and would the domain be seen as a spammer?"
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2020-04-08 14:45:33",
    "text": "Convincing a client that need to configure an MX server (SMTP) to accept that email even if they are only planning on blasting out marketing materials or sending email confirmations and aren't expecting or want responses back. They are thinking if they just set a reply to (rather than the from), that gets them around it... but I'm still thinking this would be a spam issue."
  }
]