[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2020-02-24 06:56:29",
    "text": "I’ve used this in the past\n<https://designers.HubSpot.com/en/docs/hubl/hubl-supported-functions#content-by-ids>\n\nIn a module I use a repeater with the URL field as can select pages and get the ID from the URL field, You then get the contents of the pages that have been selected, It’s quite a laborious process though!"
  },
  {
    "poster": {
      "poster_name": "Dawid Karczewski",
      "poster_handle": "d.karczewski"
    },
    "time_stamp": "2020-02-24 08:21:02",
    "edited": {
      "time_stamp": "2020-02-24 08:21:59"
    },
    "text": "Hello! I have a basic CTA module that will be reused on multiple pages. Those pages are split into categories and for each category CTA text will be different, but it will be the same for all pages across the same category. Is there a way to create multiple ready to go instances of a module that’ll include default field values, but still retain a connection to base module for styling etc.?\nThis is what a hierarchy im trying to achieve:\n• base module (field configuration, styling etc.)\n• category modules (multiple modules based on base modules with prefilled field)\n• page with category module"
  },
  {
    "poster": {
      "poster_name": "Laxmi Rawat",
      "poster_handle": "laxmi15rawat"
    },
    "time_stamp": "2020-02-24 10:23:11",
    "text": "Content.id get all content of the pages as a json formet"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-02-24 14:52:01",
    "text": "<@UK01K86CB> Have you tried this?"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2020-02-24 15:59:37",
    "text": "first time I have run into this, but is there a way to set the portal as a variable you are in? using the CTA embed code in the markup and trying to use the field in the the custom module, but I noticed it also has the portal id # in there and I am switching back and forth between a sandbox and prod portal"
  }
]