[
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-05-02 12:07:49",
    "edited": {
      "time_stamp": "2024-05-02 12:08:00"
    },
    "text": "<@U05R380MLMC> - if you can believe it, I actually got this to work without an upgrade to Ops Hub Pro or any custom dev. When testing this today, it actually started giving me the invoice number in subsequent steps. (My client had an issue with their QBO subscription that started kicking an error in the middle of my testing last week. Not sure if that was contributing to not getting the invoice #, but I suppose it’s possible).\n\nIn case you’re curious, here’s how it’s designed:\n\n• HubSpot Automation:\n    ◦ Quote enrollment trigger > quote approval status is any of Approval not needed or Approved (basically, it triggers when a HubSpot Quote is published) >\n    ◦ Create a Quickbooks Invoice (Native QBO Integration) >\n    ◦ Delay 5 minutes >\n    ◦ Send internal email notification. Subject line, “QBO Invoice #1077 Created” >\n• Zapier\n    ◦ I can set up an automated email/filter forward in Gmail based on this subject line that forwards to a Zapier Email Parser mailbox. In Email Parser, I parse the subject line from the email.\n    ◦ A new email in this Email Parser mailbox triggers a Zap to start.\n    ◦ Using a series of formatter steps, I parse the invoice number, and then find that invoice in QBO. I do all kinds of math in more formatter steps that divides the line items by 2, calculates two payment amounts, inserts a message on the invoice, and finally, updates the invoice to reflect 50% of the total line items. Voila!"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-05-02 12:32:14",
    "text": "That's dope!  Congrats!"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-05-02 12:32:27",
    "text": "Thanks for sharing"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-05-02 12:32:48",
    "text": "Do you think the delay is what helped?"
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-05-02 12:33:17",
    "text": "No, because I always had that delay step built in to give the automation time to complete and sync."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-05-02 12:33:24",
    "text": "Or the fact your client fixed the subscription"
  },
  {
    "poster": {
      "poster_name": "Christina Savage",
      "poster_handle": "christina107"
    },
    "time_stamp": "2024-05-02 12:34:16",
    "text": "That’s the only thing that changed, so I bet that had to do with it."
  }
]