[
  {
    "poster": {
      "poster_name": "Gayanath Shanuka",
      "poster_handle": "gayanath"
    },
    "time_stamp": "2024-05-15 03:50:12",
    "text": "Hi everyone\nI've set up a workflow to capture invoice payments and trigger a webhook to our platform backend. However, we're facing a challenge in identifying the products purchased by customers from the invoice data received through the webhook. We typically add products to the invoice as line items during the creation of the invoice. Is there any way to ensure that the product data is included in the webhook response when it is triggered?"
  },
  {
    "poster": {
      "poster_name": "Topher",
      "poster_handle": "chris269"
    },
    "time_stamp": "2024-05-15 06:22:35",
    "text": "You just want to concat a string? Why not use a calculated field?"
  },
  {
    "poster": {
      "poster_name": "Topher",
      "poster_handle": "chris269"
    },
    "time_stamp": "2024-05-15 06:22:45",
    "text": "```concatenate(\"<http://www.hello.com/>\", number_to_string([properties.hs_object_id]))```"
  },
  {
    "poster": {
      "poster_name": "Rowan Hale",
      "poster_handle": "rowan215"
    },
    "time_stamp": "2024-05-15 15:27:48",
    "text": "Hi all, I'm running into a problem right now with setting up an automation workflow triggered by a HubSpot webhook. Essentially, I want to listen for updates to a specific contact property, then fire off a request to our app's webhook API so that we can process this contact and some of their properties. We need more data than just what's captured in a `contact.propertyChange`, so I need to grab some extra fields from the contact object.\n\nI was able to do this with our sandbox account by setting up a HubSpot private app webhook, and having it trigger an automation workflow that fired off the request to our webhook API in our app. But when trying to replicate this setup on our prod account, I ran into issues with setting up the HubSpot private app webhook, as it errors out saying `Target URL has a local host of <http://api-na1.hubapi.com|api-na1.hubapi.com>. Use an external host and try again.` . Is this sort of HubSpot -&gt; HubSpot trigger not allowed in production accounts? Is there some other way to accomplish this task of taking a base `contact.propertyChange` event and adding on more contact data before firing off a request to an external webhook API?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-09 15:21:26"
      }
    ]
  }
]