[
  null,
  {
    "poster": {
      "poster_name": "Paul Dominik",
      "poster_handle": "paul178"
    },
    "time_stamp": "2019-01-12 09:29:55",
    "text": "Hi guys! I got introduced to HubSpot last year. To be honest, I did not like the divitis done in the templating system. I had time to revisit it today and it's still the same. I was trying to work around the grid system which is really archaic being 2 major versions back of what's current.\n\nRight now, I can easily override the layout CSS but it really feels awkward. Your stripped-down grid system is powering thousands of templates but to me, it's unpleasant (divitis is bad, you want as little HTML elements when possible). Is there no plan to even allow one to modify how the module group generates the parent divs? What's possible is to work with the .html files but it provides no incentives as I can't even submit a Template as they require the use of the Design Manager. I can do so, but again, I will have to override the layout.css and be totally indifferent with the divitis.\n\nAgain, having too many divs is poor design and we already learned that through years of web design and should move on. The experience of merging Bootstrap 4, Material or any modern framework will be more pleasant if we can at least change the behaviour of the Group module. Who's the best person to reach out to regarding this concern? Should it be a feature request?",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-01-12 09:51:46"
      },
      {
        "time_stamp": "2019-01-12 10:05:42"
      },
      {
        "time_stamp": "2019-01-12 10:07:24"
      },
      {
        "time_stamp": "2019-01-12 10:08:44"
      },
      {
        "time_stamp": "2019-01-12 10:23:13"
      },
      {
        "time_stamp": "2019-01-12 10:51:09"
      },
      {
        "time_stamp": "2019-01-12 11:04:25"
      },
      {
        "time_stamp": "2019-01-13 01:22:15"
      },
      {
        "time_stamp": "2019-01-13 01:36:53"
      },
      {
        "time_stamp": "2019-01-13 01:42:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-12 09:51:46",
    "edited": {
      "time_stamp": "2019-01-12 10:06:19"
    },
    "text": "They are working on finding a more future proof solution to the class names. But really you can do a ton without being affected by that grid anyways. Most of us have our own frameworks we use that completely solve this issue. \nI would disagree on the Divi-itis. They're walking that line pretty well right now. Theyre enabling us to create better experiences for the marketers. Yes it can add some work or require us to know more but we just charge more, problem solved.\n\nIf your clients don't want to have the drag n droppy features just use static templates. \n\nThose features exist because its what marketers and business owners want, that isnt going to go away because you want it to. That's why nearly every CMS is moving this direction.\n\nUnless you can prove to the ones funding web development that not being able to edit their sites themselves is a good thing, we're going to keep heading this direction.\n\nCMS's will continue to get more and more complicated in this fashion, making our work require more specialty and knowledge to produce better quality products for our clients.  Meaning we can charge more for that specialization "
  },
  {
    "poster": {
      "poster_name": "Paul Dominik",
      "poster_handle": "paul178"
    },
    "time_stamp": "2019-01-12 10:05:42",
    "text": "Hi Jon, thank you for replying.\n\nActually, I'm trying to see who to best reach out for in their team. I don't think this requires a massive change. Right now, the module group is simply wrapping with .row-fluid and .span12. Adding a facility to modify the default behavior in the module itself should be fairly easy and will not break anything at all.\n\nI found nothing for the default divs in the body, header and footer, but those can be easily CSS overridden.\n\nAgain, right now, I can do it. I'm able to do bootstrap 4 and the recent grid system approach in my templates, at the same time being able to use the drag and drop UI for it. But still, I'm patching something that should easily be fixed/updated by them in the first place.\n\nAlso, when you are working with just simple pages, divites, is negligible. But if you're trying to make something great on top of HubSpot, like using AMP on pages, this makes development feel awkward. I'm simply trying to make pages performant and ready for new tech, but I have to be blind on the raised concern."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-12 10:07:24",
    "text": "You know that HubSpot handles amp for you right?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-12 10:08:44",
    "edited": {
      "time_stamp": "2019-01-12 10:09:34"
    },
    "text": "Yes right now you dont have full control over the amp experience but they are working to improve that. The amp shortcut in the chrome extension is going to get way more powerful and useful."
  },
  {
    "poster": {
      "poster_name": "Paul Dominik",
      "poster_handle": "paul178"
    },
    "time_stamp": "2019-01-12 10:23:13",
    "text": "Hey Jon, I didn't know HS has something for AMP already. But from quick reading, it's for blogging only. Thanks for sharing."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-12 10:51:09",
    "text": "At the chicago dev meetup it was revealed theyre working on it for pages too and it looks like us devs will have a lot of control"
  },
  {
    "poster": {
      "poster_name": "Paul Dominik",
      "poster_handle": "paul178"
    },
    "time_stamp": "2019-01-12 11:04:25",
    "text": "Cool! Thanks again for sharing, I'm just jumping in (started last week learning about the HS way of building pages and modules) so obviously I need to know a lot. I think I'm on good track starting mastering their templating system."
  }
]