[
  {
    "poster": {
      "poster_name": "Eric Robinson",
      "poster_handle": "errobinson"
    },
    "time_stamp": "2021-05-06 03:34:21",
    "edited": {
      "time_stamp": "2021-05-06 05:07:32"
    },
    "text": "Hi All. Im a new PM on the Conversations team and had a question for the developers in here. We are creating more third party APIs so that developers can add more communication channels into the Inbox. What specific channel capabilities are most important to you, if you were adding a channel in Inbox?",
    "reply_count": 8,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2021-05-06 03:42:08"
      },
      {
        "time_stamp": "2021-05-06 04:28:03"
      },
      {
        "time_stamp": "2021-05-06 08:03:03"
      },
      {
        "time_stamp": "2021-05-07 07:55:39"
      },
      {
        "time_stamp": "2021-05-07 08:04:45"
      },
      {
        "time_stamp": "2021-05-07 08:26:13"
      },
      {
        "time_stamp": "2021-05-13 16:13:41"
      },
      {
        "time_stamp": "2021-06-07 17:35:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rahmona Henry",
      "poster_handle": "rhenry"
    },
    "time_stamp": "2021-05-06 03:42:08",
    "text": "<@UB1TT8UAE> it would be great to get your thoughts on this!"
  },
  {
    "poster": {
      "poster_name": "Angelo Públio",
      "poster_handle": "angelo"
    },
    "time_stamp": "2021-05-06 04:28:03",
    "edited": {
      "time_stamp": "2021-05-06 04:46:41"
    },
    "text": "Sure, <@UFBDBKQ1H>! <@U01B4DHEJ9L>, here my thoughts:\n\n```- Set a time window that the HubSpot user can send a message in the inbox for a conversation. For example, HubSpot users can only reply to a message that lasts 24 hours after the last inbound message received from a contact.\n- The possibility to include input fields, like enumerations, getting values using options URL (type definition), with a boolean visibility parameter (show inside a session/show outside session). When a HubSpot user chooses an option, this will make an HTTP request. It can be helpful to send a \"special message\" that needs to include parameters of the conversation/contact id in an URL in a message (survey, payment links, forms).\n- The conversations should support media files (images: JPG, JPEG, PNG\n/ Audio: MP3, OGG, AMR / Documents: PDF / Video: MP4)\n- Include \"comments\" messages inside the inbox to the HubSpot user. For example: if audio is received, we can include a comment in the chat with the audio transcription.\n- Show \"details\" about the conversation that we can show to the HubSpot user more info that we have of the contact for that conversation (source contact name, sentimental analysis, timezone, etc.).\n- when a HubSpot user marks a conversation as closed, we receive an HTTP request.\n- The possibility to set if the closed conversation can be reopened or not\n- The Service Hub surveys send the survey by email. It is interesting to generate a survey link assigned to a conversation that we can send this link from a \"special message\" via API or when the HubSpot user marks the conversation as close because the companies want to know the satisfaction of the contact of the conversation.```"
  },
  {
    "poster": {
      "poster_name": "Angelo Públio",
      "poster_handle": "angelo"
    },
    "time_stamp": "2021-05-06 08:03:03",
    "text": "<@U01B4DHEJ9L> <@UFBDBKQ1H> When a HubSpot user sends a message, pass the HubSpot user info (like user it, email, and first name/last name) in the HTTP request. It can be helpful to check if the user has a license to do this operation. In some enterprise call center operations, it is necessary to include the agent name at the beginning of the message. So, if we receive this info in the request, we avoid doing a HubSpot call API to get this."
  },
  {
    "poster": {
      "poster_name": "Christian",
      "poster_handle": "christian.petersson"
    },
    "time_stamp": "2021-05-06 08:08:03",
    "text": "Has anyone done a Exchange Rate Update script for HubSpot? If not I was thinking of to create a open source docker/k8s container that update the values for Exchange Rate between our company main currency and our currencies that we are using in different quotes.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-06-02 16:59:14"
      },
      {
        "time_stamp": "2021-06-02 18:02:25"
      },
      {
        "time_stamp": "2021-06-08 01:10:55"
      },
      {
        "time_stamp": "2021-06-08 01:11:28"
      },
      {
        "time_stamp": "2021-06-08 01:13:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Keith Muenze",
      "poster_handle": "kmuenze"
    },
    "time_stamp": "2021-05-06 08:48:11",
    "text": "perfect. The new docs say the batch api supports 10 at a time on the overview but the increase for reads must be specified in the batch read api call."
  },
  {
    "poster": {
      "poster_name": "Keith Muenze",
      "poster_handle": "kmuenze"
    },
    "time_stamp": "2021-05-06 08:48:21",
    "text": "Thanks for the correction!"
  },
  {
    "poster": {
      "poster_name": "Zach Klein",
      "poster_handle": "zach880"
    },
    "time_stamp": "2021-05-06 08:49:04",
    "text": "<@UNDQNU056> No problem Keith :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Alexandre Nunes",
      "poster_handle": "alexandre473"
    },
    "time_stamp": "2021-05-06 10:55:32",
    "text": "Hi there!\nI'm new developing to HubSpot. I am trying to create a \"hello world\" (a test app only) and list in HubSpot Marketplace. It would be something like a button in contact to send a message or something like that, but I could not find anything explaning how to do that. The only thing I found was how to connect/authenticate my app to HubSpot.\n\nCould any of you help here?\nThanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-06 18:34:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-06 18:34:22",
    "text": "<https://developers.HubSpot.com/docs/api/listing-your-app>\n\nJust a heads up we’re not likely to approve an app integration that doesn’t do something useful in the marketplace.\n\nAside from publishing to the marketplace, if you’d like to learn how to build an app that integrates with HubSpot here’s a tutorial you could follow: <https://developers.HubSpot.com/en/docs-beta/idea-tracker-tutorial-part-1>"
  }
]