[
  {
    "poster": {
      "poster_name": "Jordan",
      "poster_handle": "jtdilapo"
    },
    "time_stamp": "2022-12-07 06:56:53",
    "edited": {
      "time_stamp": "2022-12-07 07:13:36"
    },
    "text": "Hey everyone, my apologies if this was already answered. I’ve been searching around and I can’t quite figure out how to turn my Vue.js app into a custom module for HubSpot. It consists of main.js, App.vue and Map.vue (leaflet interactive map) and is a single page application (full screen map). When I use HubSpot CLI to upload it, the vue files don’t upload. What’s the best way to convert the vue files into something HubSpot can use as a custom module to drag and drop into my website or am I thinking about this the wrong way? Just trying to find the simplest way to add this vue app to my website. Thank you!",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-07 08:19:23"
      },
      {
        "time_stamp": "2022-12-07 08:20:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jonathan Duncan",
      "poster_handle": "jonathanduncanr"
    },
    "time_stamp": "2022-12-07 08:19:23",
    "text": "<https://www.npmjs.com/package/vue-to-js>"
  },
  {
    "poster": {
      "poster_name": "Jonathan Duncan",
      "poster_handle": "jonathanduncanr"
    },
    "time_stamp": "2022-12-07 08:20:21",
    "text": "you can add that to your deploy automation and reference the JS files instead"
  },
  {
    "text": "Hello, anyone has a workaround for the meetings rolling weeks limitation? we would like to limit that only for the next two days.\nmaybe some front-end script we can use to control this?\n\nThanks",
    "time_stamp": "2022-12-07 08:24:01"
  },
  {
    "poster": {
      "poster_name": "T. Roberts",
      "poster_handle": "direstardb"
    },
    "time_stamp": "2022-12-07 09:25:51",
    "text": "Hi I have an issue where a HubSpot form won't load on Incognito or when I first try on a new browser.  When I refresh it shows up.  I'm seeing this error in the console: Uncaught TypeError: hbspt.forms is undefined   Any thoughts?  Has anyone else ever experienced this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-07 09:29:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jonathan Duncan",
      "poster_handle": "jonathanduncanr"
    },
    "time_stamp": "2022-12-07 09:29:08",
    "text": "It looks like your javascript is not loading in the correct order, it should load and run AFTER the page loads, so that it can detect the form.\n\nWithout looking at the code I could not tell you how to fix it, but here is an <https://knowledge.HubSpot.com/forms/why-doesn-t-my-externally-embedded-HubSpot-form-work|article> that should be useful."
  }
]