[
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-29 06:49:35",
    "text": "Hey Sabrina, it really depends on what type of software you’re looking into."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-29 06:49:57",
    "text": "What and how are you looking to integrate?"
  },
  {
    "poster": {
      "poster_name": "Sabrina Fowler",
      "poster_handle": "sfowler"
    },
    "time_stamp": "2025-01-29 08:03:45",
    "text": "We are looking for the best platform (and not super expensive) to handle a Live Auction and allow that informatoin to directly flow into HubSpot. I know there are event platforms that integrate - just trying to get a good recommendation."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-29 08:08:16",
    "text": "An event platform that easily integrates (and is built for HubSpot) is <http://SimpleEvents.io|SimpleEvents.io>\n\nFor the auction site, <@U03REFNRMB3> I know you once built this from scratch, have you seen anything that integrate with HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2025-01-29 08:16:19",
    "text": "<@U074F8QLF3Q> oooh bring back some memories!! Live Auctions!\n\nWhat information are you wanting to flow into HubSpot. The more specific the better Carter and/or myself could guide you!"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2025-01-29 08:17:22",
    "text": "<http://SimpleEvents.io|SimpleEvents.io> is a great tool (PS, I created it) for handling registration and attendance for a live auctions.\n\nAre they in-person or virtual auctions?"
  },
  {
    "poster": {
      "poster_name": "Sabrina Fowler",
      "poster_handle": "sfowler"
    },
    "time_stamp": "2025-01-29 08:21:31",
    "edited": {
      "time_stamp": "2025-01-29 11:24:56"
    },
    "text": "<@U03REFNRMB3> <@U01QVR44MEY> I appreciate you both hopping on this... unfortunately building from scratch isn't an option with the time (always last minute and immediate need! LOL) . There are two aspects - An in-person auction for items, and then a fund-in-need paddle raise. So we were thinking looking to do a registrant page w/in HubSpot... so I'll need to have those registrants that \"won\" the auction, and did a paddle raise flow over from whatever platform we choose (and connect with the registrants). We would also want to have a payment option available.\n\nNow that I'm typing this up - I'm thinking we may need to do the registrant page in the event platform (to allow for the payment for ticket purchase) and house the CC info for the auctions..."
  }
]