[
  {
    "poster": {
      "poster_name": "Valentine Onah",
      "poster_handle": "valentine.onah"
    },
    "time_stamp": "2023-02-02 07:10:03",
    "text": "Hello everyone,\nOn my page template, I have a custom code that allows me to pre-fill the user's details in HubSpot form embed in our page if they're logged in on our website.\nThe code below has been working for us but somehow it just stopped working and throws an error \"_Error:Missing required input parameters. Object id or query is mandatory for crm_object function._\"\n\nThe Object id is there which is \"contact_vid\" but still indicates it's missing.\n\nAny suggestions will be appreciated, thanks in advance.\n\n{% set membership_contact_string = crm_object('contact', request.contact.contact_vid, 'email, firstname, lastname') %}\n\n{% text \"membership_contact_email\", value= \"{{ membership_contact_string.email }}\", overrideable=False, export_to_template_context=True %}\n {% text \"membership_contact_firstname\", value= \"{{ membership_contact_string.firstname }}\", overrideable=False, export_to_template_context=True %}\n {% text \"membership_contact_lastname\", value= \"{{ membership_contact_string.lastname }}\", overrideable=False, export_to_template_context=True %}",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-02 07:26:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-02 07:26:43",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1675344864103189>"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2023-02-02 07:32:51",
    "text": "Is there a way to get the section row number a module is inserted inside of. That way you can create a scoped CSS class to just that section? Or Js the only way?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-02 07:34:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2023-02-02 07:34:20",
    "text": "Users are adding section background images and the  large images are causing lcp errors."
  },
  {
    "poster": {
      "poster_name": "Ciara Maher",
      "poster_handle": "cmaher"
    },
    "time_stamp": "2023-02-02 10:15:06",
    "text": "Hi all, any thoughts on this? We’re trying to set up our theme so that we can automatically assist the users with WCAG (when they pick a dark background color the text will change to a light color).\nThis works very well on a module level, but since every time you drag a module into a drag &amp; drop area it wraps a Section around it.\n\nThe issue is that the section doesn’t seem to be customizable - do we have no way to add/remove fields on Sections? (see attached image for module vs section)\nWe can customize Sections on a template level, but that doesn’t help when it doesn’t apply when the users drag in new modules beyond what we defined in templates.\nThat leaves us currently with them using our background-dropdown in modules, but then presented with a ‘default color picker’ when setting background on the Section.\n\nIs it possible to ‘ignore’ sections and have modules go full-width if it’s no way to add custom fields to Sections?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-02 11:37:38"
      },
      {
        "time_stamp": "2023-02-02 11:44:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-02-02 11:37:38",
    "text": "It looks like the image you’d meant to attach is missing! That extra context may be helpful. :)\n\nWith regards to your questions — the broad answer is that your options for modifying or controlling parts of the page builder grid (areas, sections, rows, columns) are quite limited.\n\nThe two main options you have are:\n1. Adding classes to `dnd_area`s on a template level.\n2. Adding classes to section templates.\nIf you’re clever with your CSS patterns _(I’m partial to using custom property inheritance for this sort of stuff)_, you could likely use section templates to implement this sort of functionality within those particular sections. However — it would be limited to templated sections.\n\nAs soon as a user adds a section from the “Layouts” tab, it’s almost completely out of your hands. There isn’t really a good way to dynamically respond to an ancestor having `style=\"background-color: #ff0000\"` set on it, short of some intensive runtime JS."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-02-02 11:44:19",
    "text": "With regards to full-width modules, the I think you’re looking at <https://developers.HubSpot.com/docs/cms/building-blocks/templates/drag-and-drop-areas/sections|section templates> as your potential workaround again.\n\nIf you’re providing the module in the modules sidebar, there’s no way to prevent a user from placing it in an inappropriate layout. However, if you *don’t* provide the module in the sidebar, you can create a section template that includes the module in its intended configuration.\n\nTheoretically, that wouldn’t stop users from adding that section template, then grabbing that module out of it and misusing it. However, there’s only so far you can reasonably go to protect users from themselves — especially with the tools (arbitrary color picker and font selector) that HubSpot provides to editors."
  }
]