[
  {
    "poster": {
      "poster_name": "mathes waran",
      "poster_handle": "matheskrishna"
    },
    "time_stamp": "2023-02-15 08:41:21",
    "text": "HI @channel\n\nI have a use-case like,  When the page loads, I am fetching the data through a GET API call, and store in a variable. Now, in my variable, I have JSON data.  Now how could I process the JSON data in HUBL.? Like I need to loop in cards, and accordion components.\n\nTIA",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-02-15 09:01:49"
      },
      {
        "time_stamp": "2023-02-15 09:07:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-02-15 09:01:49",
    "text": "Hubl is a server side language so it's impossible for you to pass data you get from a GET request client side, you could maybe integrate the module with react/vue to display that data easily (and make sure that data you're trying to display is not important SEO wise, otherwise this approach is not the best)"
  },
  {
    "poster": {
      "poster_name": "mathes waran",
      "poster_handle": "matheskrishna"
    },
    "time_stamp": "2023-02-15 09:07:40",
    "edited": {
      "time_stamp": "2023-02-15 09:07:51"
    },
    "text": "Oh ok thanks"
  },
  {
    "text": "<@U01QVR44MEY> Yeah at first it works fine! I set it as the highest priority as well, so it shows up first as the search results. It works fine at first, but after a few minutes, it just disappears overall? It's confusing.\n\nOptima vt is the product page. I am directing the HubSpot url to the shopify one.\nSecond image is the settings. Any idea where I went wrong?\n\nBoth pages are published.",
    "time_stamp": "2023-02-15 12:15:25"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-15 12:46:03",
    "text": "Honestly I have no idea why it would disappear, you might want to contact HubSpot support and see if they know why"
  },
  {
    "poster": {
      "poster_name": "Jess",
      "poster_handle": "jessica230"
    },
    "time_stamp": "2023-02-15 12:46:51",
    "text": "Thanks, yeah they will email us back tomorrow hopefully. I thought I might have overlooked an option"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-15 12:47:27",
    "text": "Yeah it's definitely possible, but I don't see anything that you've missed"
  }
]