[
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2024-08-21 06:56:37",
    "edited": {
      "time_stamp": "2024-08-21 06:59:33"
    },
    "text": "hellllllllp in my local dev i keep getting `<e> [HubSpotAutoUploadPlugin] A RequestError has occurred. Error: ESOCKETTIMEDOUT` on almost every upload.\n\ni'm on the most current version of the CLI, even updated yesterday, and still this happens ALL THE TIME.\nthis happens at home and also on my super fast connection at my office.\n\ni'm on a tight deadline and this is not helping. sometimes re-saving helps, sometimes i just have to wait it out, and those 30-60 second turnarounds really add up!\n\nany ideas, other than updating the CLI? updating is all i've really found out there in the forums",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-21 07:59:21"
      },
      {
        "time_stamp": "2024-08-21 11:09:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-08-21 07:59:21",
    "edited": {
      "time_stamp": "2024-08-21 08:00:44"
    },
    "text": "Hi <@UDEASNWEB>,\n\nIt's quite likely that you may be hitting the HubSpot API limit, either because you are making too many requests within a given period or the payload of your request is a tad too large.\n\nIt's worth trying to split your uploads down into smaller chunks and also leaving an appropriate amount of time between them, roughly 5 minutes I've found usually does the trick for me.\n\nYou can find the API usage guidelines and restrictions here:\n<https://developers.HubSpot.com/docs/api/usage-details>\n\nHope this helps!"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2024-08-21 11:09:34",
    "text": "hmmmm, okay. i'm only compiling and pushing one or two files at a time, but i'm in active front end development so (since HubSpot doesn't have a locally-based CMS environment available) i'm uploading CSS/HTML changes way more often than every 5 minutes. guess i'll keep waiting it out. thanks."
  }
]