[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2021-12-13 02:43:29",
    "text": "Glad you got it sorted! Hope you had a good weekend! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Alex Bennett",
      "poster_handle": "alex911"
    },
    "time_stamp": "2021-12-13 08:15:23",
    "text": "Hey, wondering if it's possible to build a bespoke \"meeting scheduler\" rather than using the embedded iframe option. I have seen I can retrieve and update meetings via the API but wanted to sense check the idea before I press on with prototyping",
    "reply_count": 10,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-12-13 09:01:14"
      },
      {
        "time_stamp": "2021-12-13 11:52:05"
      },
      {
        "time_stamp": "2021-12-13 11:54:24"
      },
      {
        "time_stamp": "2021-12-13 12:07:08"
      },
      {
        "time_stamp": "2021-12-13 12:11:00"
      },
      {
        "time_stamp": "2021-12-13 12:12:20"
      },
      {
        "time_stamp": "2021-12-13 14:09:56"
      },
      {
        "time_stamp": "2021-12-13 14:27:47"
      },
      {
        "time_stamp": "2021-12-13 14:30:21"
      },
      {
        "time_stamp": "2024-09-30 11:16:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-12-13 09:01:14",
    "text": "I love this idea. I’m not sure the engagements api is really going to work for what happens in the meetings. To build this out I believe you’d also need access and to integrate with a calendar api. I’m not sure though."
  },
  {
    "poster": {
      "poster_name": "Alex Bennett",
      "poster_handle": "alex911"
    },
    "time_stamp": "2021-12-13 11:52:05",
    "text": "the calendar render part isnt the tricky bit, it's ensuring the data from HubSpot can be used to populate, as long as I get dates/times I can build out a component for our frontend (vue)"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-12-13 11:54:24",
    "text": "I wasn’t speaking so much of the calendar render, let me explain a bit differently.\n\nYou need to be able to access a person’s availability to have the data for meetings. That isn’t available in the HubSpot API."
  },
  {
    "poster": {
      "poster_name": "Alex Bennett",
      "poster_handle": "alex911"
    },
    "time_stamp": "2021-12-13 12:07:08",
    "text": "ah this is what I was wondering, so say we had a \"person\" - actually setup as a place, using the embed current as a book an appointment in 30min intervals. The available slots is what I'm after per day from the API."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-12-13 12:11:00",
    "text": "That is not to my knowledge available as part of the api. There is no meeting endpoint only an engagements endpoint\n\nIf I was tasked to build this out I would either scrape the content from the actual meeting embed page or create a calendar integration to get that data. \n\nEffort wise the scraping would be less, building out this module you would have a meeting link page for that person as a fillable field and then you'd need to do an on page request to scrape the data and then fill it on your module. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-12-13 12:12:20",
    "text": "That would allow you the same content, which you manipulate. Not sure how that would work with different days or what is accessible on that page and that would need to be investigated as well"
  },
  {
    "poster": {
      "poster_name": "Alex Bennett",
      "poster_handle": "alex911"
    },
    "time_stamp": "2021-12-13 14:09:56",
    "text": "ok thanks for the input Nicholas I appreciate it, seems a shame to not include meetings as an endpoint though, could build some fun stuff with it"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-12-13 14:27:47",
    "text": "did you know that the engagements api has been broken out? (doesnt really offer much help here, but thought you might like to know :wink: )\n<https://developers.HubSpot.com/docs/api/crm/meetings|here is the meetings endpoint overview>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-12-13 14:30:21",
    "text": "yeah, that is good for creating meeting, but no availability. I had looked at it briefly and remembered it being there, but yes, my terminology was wrong, there there is a meetings api, just not what we all want it to do"
  }
]