[
  {
    "poster": {
      "poster_name": "Fabian Glaw",
      "poster_handle": "fabian643"
    },
    "time_stamp": "2021-12-01 01:11:03",
    "edited": {
      "time_stamp": "2021-12-01 01:18:32"
    },
    "text": "Thank you for your reply Mark. Sounds like the only way to get rid of the old jquery library is to not use the img gallery model. Can somebody from HubSpot confirm this please?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-12-01 08:09:54",
    "text": "if you look at your inspector, you should see this\n```&lt;!-- jQuery was added because it is required by the Gallery module. --&gt;```\n"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-12-01 08:12:24",
    "text": "<@U029WCYHMDL> only other suggestion I would have would be to clone the default image gallery module using the CLI and modify it to eliminate that dependancy."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-12-01 08:13:04",
    "text": "looks like it is using slick which requires jquery"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-12-01 08:21:30",
    "text": "asked around and looks like we will be reviewing that module in 2022 and removing jquery dependency"
  },
  {
    "poster": {
      "poster_name": "Gabriela Payano",
      "poster_handle": "gp"
    },
    "time_stamp": "2021-12-01 14:26:28",
    "edited": {
      "time_stamp": "2021-12-01 14:29:04"
    },
    "text": "Hello, Is there a way we can run our third-party JS inside of the HubSpot form? We have a recording script that we can use to track events in fields. I was given this article: <https://legacydocs.HubSpot.com/docs/methods/forms/advanced_form_options>",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-01 14:29:29"
      },
      {
        "time_stamp": "2021-12-01 14:45:17"
      },
      {
        "time_stamp": "2021-12-01 16:15:41"
      }
    ]
  },
  {
    "text": "The following code returns a 403",
    "time_stamp": "2021-12-01 14:29:29"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-12-01 14:45:17",
    "text": "A couple of things…\n\n1) it’s going to depend on how the form is rendered. In general, if you’re using the style options, the form is going to render in an iFrame, which obviously is going to limit what you will be able to do.\n\n2) I usually recommend using <https://legacydocs.HubSpot.com/global-form-events|global form events> for this kind of use-case, as I think it’s a bit more organized compared to modifying the embed code.\n\n3) Know that HS forms are backed by React and have their own state, and trying to get creative with form manipulation via JS can take significant trial and error depending on what you’re trying to do in order to ensure the submission data comes through correctly."
  },
  {
    "text": "I've been testing this out. I am getting a 400 and 403, which I believe is on the client side. If the &lt;form&gt; was embedded in an iframe we would want this to run on the source. We are trying to use this in our own <https://go.mouseflow.com/partners|form> for now. We would like our recording script to run inside the form. _onFormReady_ seems appropriate for the recording script to capture/record the form field events after the form is loaded and visible in the DOM. I just want to make sure that HB will allow Mouseflow's third-party JavaScript so we can record the form.",
    "time_stamp": "2021-12-01 16:15:41"
  }
]