[
  {
    "text": "Hi all! I'm working on creating a custom workflow action and have two questions:\n1. The custom step looks pretty weird, as it includes the ID in both the `name` and the `content` of the step (see screenshot). I did specify the necessary labels in the POST request - has anyone also experienced this?\n2. In the HubSpot docs, it stated that all (un)published workflow actions can be viewed in the developer portal. I've looked everywhere but I can't find it. Does anyone know where I can find these actions?\nThanks in advance!",
    "time_stamp": "2025-01-23 09:03:00",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-23 09:08:01"
      },
      {
        "time_stamp": "2025-01-23 09:08:14"
      },
      {
        "time_stamp": "2025-01-23 09:12:27"
      },
      {
        "time_stamp": "2025-01-23 09:14:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-23 09:08:01",
    "text": "Hey Steven, so workflow actions are kinda funny, they run through a i8 translation tool that takes forever to get the label to show up after first publishing the action. In a bit (up to 1 hour, I've seen) it will show the actual label"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-23 09:08:14",
    "text": "Are you checking in the developer test accounts? or just the dev account?"
  },
  {
    "text": "Thanks, Carter! I'm just now re-reading the docs and I see that they actually mention it. But appreciate the reply!\n\nThis action is in a workflow I have built in the developer test account. The second question was relating this part of the docs about workflow actions. But knowing that the labels will show up and I can make updates using the API, it's not that necessary anymore haha",
    "time_stamp": "2025-01-23 09:12:27"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-23 09:14:10",
    "text": "of course, definitely let me know if you run into any other issues. Happy to help"
  },
  {
    "poster": {
      "poster_name": "James Elmer",
      "poster_handle": "jameselmer"
    },
    "time_stamp": "2025-01-23 13:34:09",
    "text": "<@U060JS28BNJ> So glad to hear about this! Thank you for resolving this issue!"
  },
  {
    "poster": {
      "poster_name": "James Elmer",
      "poster_handle": "jameselmer"
    },
    "time_stamp": "2025-01-23 13:34:53",
    "text": "Sorry I did not respond sooner. Vacation/Sickness really put me behind."
  }
]