[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-31 02:32:35",
    "text": "So i’m creating a theme to be used for different clients, so using the font field in themes which automatically adds the google font link in the header, however it will only add the weight that you selected but if for example you select for body text - roboto normal, only roboto normal is imported and strong tags don’t work properly, So basically the font field is flawed."
  },
  {
    "poster": {
      "poster_name": "Soumi7",
      "poster_handle": "soumibardhan10"
    },
    "time_stamp": "2022-01-31 02:40:33",
    "edited": {
      "time_stamp": "2022-01-31 02:41:29"
    },
    "text": "Hi, I was using the HubSpot theme editor. However it does not let me publish the changes in test mode. Can anyone let me know how to publish my changes? <@U021H3TV338>",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-31 03:05:44"
      },
      {
        "time_stamp": "2022-01-31 03:23:19"
      },
      {
        "time_stamp": "2022-01-31 03:26:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2022-01-31 03:05:44",
    "text": "I am not sure what you are changing but if you want to change colors and default configuration,\nyou can change from setting &gt; website &gt; themes"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-31 03:23:19",
    "edited": {
      "time_stamp": "2022-01-31 03:23:27"
    },
    "text": "Yeah best way is to go from the site settings, or in the page editor hit the design tab,\nbut if you are in test mode it will have &amp;test_mode=true in the url just remove that and load"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-31 03:26:54",
    "text": "(just a caution if you’ve made changes in test mode once you reload the page you will loose the changes, test mode is more for debugging to make sure the theme works with all the modules etc)"
  },
  {
    "poster": {
      "poster_name": "Caitlin Siegrist",
      "poster_handle": "csiegrist"
    },
    "time_stamp": "2022-01-31 13:35:46",
    "text": ":wave: Hi everyone! I'm <https://www.linkedin.com/in/caitlinsiegrist/|Caitlin Siegrist> and I run HubSpot's Accelerator programs. We have piloted a Theme Accelerator which went well so we'd like to open up the opportunity to more providers like you. The Accelerator's objective is to fill our Asset Marketplace with high quality, affordable themes. In addition to 1:1 technical guidance &amp; marketing support, you will be eligible for compensation. If you're interested, please complete <https://forms.gle/zZznM9QUrTT7vWpa6|this form> &amp; I'll add you to the interest list for our next program kickoff (likely kicking off late February). Any questions, feel free to message me directly. Thanks!"
  }
]