[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-20 07:32:09",
    "edited": {
      "time_stamp": "2022-01-20 07:32:23"
    },
    "text": "Do marketplace themes have a file size limit? I don’t see anything about it in the guidelines."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2022-01-20 07:58:00",
    "text": "I’ve looked at the boilerplate but the font modules didn’t appear to have what I was looking for. Unless I’m just looking in the wrong spot.\n\nI’ll see if I can find the growth theme and see it’s code."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2022-01-20 10:47:22",
    "text": "So I think I was going about handling fonts the wrong way.\n\nDo I need to set the default fonts in the theme.fields.json file and then set those in a theme_overrides.css file?\n\nMy current issue is that when trying to edit the font for a text module, the font doesn’t change. The color/size are dynamic. Just not the fonts."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2022-01-20 10:49:09",
    "text": "I’m handling the color and sizing within a main.css file that targets h1 tags and the fields are being set in the fields.json file."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-01-20 10:50:54",
    "text": "Are you changing the font in the module styles tab? Is it possible it's being overriden by master stylesheet? I would inspect in developer tools to see if it is even there."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2022-01-20 10:56:29",
    "text": "I’m working on the dev practicum, specifically this piece.\n&gt; _The theme must have at least 2 theme fields to control the font and the accent color used in the header and footer_\nSo to test this, I am editing the theme settings within the CMS but font for the text does not change. Color and sizing changes if a content editor were to change those values."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2022-01-20 11:24:12",
    "edited": {
      "time_stamp": "2022-01-20 11:25:14"
    },
    "text": "I figured it out, there was a\n```*{\n   font-family: Helvetica; \n}```\nWhich was preventing it from being updated. :face_with_rolling_eyes:"
  }
]