[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-28 03:09:58",
    "edited": {
      "time_stamp": "2022-01-28 03:54:25"
    },
    "text": "I’ve come up against a couple of issues using google fonts in the theme,\n\nFirstly if I select a google font for my site, if I add bold text in one of my modules, the bold weight is not loaded and I just get a fake bold added by the browser\n\nSecondly to overcome the first I was going to have a repeater group in my fields.json that let you select all the required font weights so you can load them all in, However repeater groups appear to work in the UI but don’t actually work when you try to print out the information",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-28 06:18:23"
      },
      {
        "time_stamp": "2022-01-28 12:26:19"
      },
      {
        "time_stamp": "2022-01-31 02:32:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-28 04:16:25",
    "edited": {
      "time_stamp": "2022-01-28 04:17:25"
    },
    "text": "Also since I can’t use a repeater group i’m trying to just add a few fields but then hide them with display conditions so a new field only appears when you selected a font in the previous field, but does anyone know how to make the field display if the font exists, do I need to use some custom regex to find out if the font=null?\nI’ve already tested is not empty which doesn’t work as it still returns stuff if no font is selected",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-28 04:44:19"
      },
      {
        "time_stamp": "2022-01-28 06:17:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dawid Kokoszka",
      "poster_handle": "dawid.kokoszka"
    },
    "time_stamp": "2022-01-28 04:29:22",
    "text": "Hi,\n\nI'm preparing a theme for the marketplace and am currently building a demo of the whole site.\n\nIs there any way to copy the content (content, modules, sections dnd, etc.) of a page created on the builder?\n\nI need to prepare presets for individual pages and I'm looking fast way to do this"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-28 04:44:19",
    "text": "I found this but it doesn’t seem to work with the font dictionary\n<https://community.HubSpot.com/t5/CMS-Development/Display-condition-based-on-URL-Image-or-any-Complex-module-field/m-p/380738/thread-id/19228>"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-28 06:17:11",
    "text": "I managed to get it to work eventually, it seems when it’s empty it’s not empty but I don’t think there’s any text there, so I did some regex to match anything containing the word font, despite a pprint showing it’s not empty so was very confusing"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-01-28 06:18:23",
    "text": "Thirdly you can’t select italic with a google font meaning that the browser just slants the letters rather than using the designed italic font"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2022-01-28 12:25:11",
    "text": "yes. you can prebuild the entire thing.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-28 12:28:48"
      },
      {
        "time_stamp": "2022-01-28 12:35:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2022-01-28 12:25:41",
    "text": "<https://developers.HubSpot.com/docs/cms/building-blocks/templates/drag-and-drop-areas/sections>"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-01-28 12:26:19",
    "text": "Are you using the `variant` parameter to declare your font weight? Google fonts are treated slightly different than web fonts in that different font weight values may be supported across each.\nI recommend declaring the google font family, determining which font values are supported in that family, and using the `variant` parameter to declare the font weight you want to use."
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-01-28 12:28:48",
    "text": "I _think_ that <@U01C8C0DAAC> is asking if there’s a way to take content from a page that was built and copy it as the template’s default values.\nIf so, there isn’t a quick and easy way to achieve this to my knowledge. It could be reverse engineered using the ‘Developer info’ - <https://developers.HubSpot.com/docs/cms/developer-reference/debugging-and-errors#developer-info>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-28 12:31:15",
    "edited": {
      "time_stamp": "2022-01-28 12:33:02"
    },
    "text": "I may try to build a generator for this soon to convert drag-n-drop html page markup to drag-n-drop HubL template markup, at least one that coincides with the HubSpot boilerplate format. Seems like it would be fairly easy."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-28 12:35:12",
    "edited": {
      "time_stamp": "2022-01-28 12:36:12"
    },
    "text": "Yeah, I'll probably try to create a generator for this, unless someone already has one, because I think that would be nice and save the monotony of having to manually create one every time."
  }
]