[
  {
    "text": "Howdy from Austin, Texas y'all!\n\nWe're building a Custom Object in HubSpot for the purpose of tracking commissions to our various sales team members. We are struggling with how to set the owner of each individual object though.\n\nThere is nothing in the Object UI that reflects the owner so we thought we'd be smart and create a HubSpot user field in the object schema, that we would then create an automation that would copy that property to the owner field. Although automations allow us to do that for HubSpot native objects (screenshot), the automations for the custom objects do not display an Owner field as a property that we can set either (see other screenshot)\n\nIn the API when we query these objects we see a `hs_user_ids_of_all_owners` field, but that JSON contains a value that does not correspond to any of our users in the application (see json)\n```\"hs_user_ids_of_all_owners\": {\n  \"value\": \"9414222\",\n  \"timestamp\": 1605088011178,\n  \"source\": \"CRM_UI\",\n  \"sourceId\": null,\n  \"updatedByUserId\": 6328837\n}```\nThe value of the `updatedByUserId` reflects the individual who created the object in the UI and we would assume that an owner field should reflect the same value.\n\nSo even though there are permissions for Custom Objects referenced in the users &amp; teams section, we appear to be unable to set the owner through any mechanism. Given those permissions are available, I'm assuming that we are missing something obvious.\n\nIf anybody has feedback I'd really appreciate it.",
    "time_stamp": "2020-11-11 09:40:28",
    "edited": {
      "time_stamp": "2020-11-11 09:41:46"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-12 07:19:01"
      },
      {
        "time_stamp": "2020-11-12 07:58:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kim Dang",
      "poster_handle": "kim383"
    },
    "time_stamp": "2020-11-11 16:24:05",
    "text": "<@UFBDBKQ1H> Do you have to have your cookie policy set to “notify visitors that site uses cookies?” I’ve been trying to get the HubSpotutk value but the function keeps returning ‘false’"
  },
  {
    "poster": {
      "poster_name": "Kim Dang",
      "poster_handle": "kim383"
    },
    "time_stamp": "2020-11-11 16:31:16",
    "text": "<@U01D23EQ7DX> Hi Matt! I’m new to HubSpot api. I’ve been blocked on how to get the get HubSpotutk value for my API form for the longest time. Do you have any tips?"
  }
]