[
  {
    "text": "Hello everyone, I've developed some Zendesk apps before, but I'm only starting with HubSpot. First of all I'd like to know, if it is possibel to customize this area(Image attached) of HubSpot. If it is possible, whic course from the HubSpot academy should I watch to learn how to do it?",
    "time_stamp": "2022-05-17 09:07:15",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-17 15:13:08"
      },
      {
        "time_stamp": "2022-05-27 03:12:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2022-05-17 09:14:02",
    "text": "entirely up to you, if you're a new HubSpot developer though then I'd recommend the boilerplate"
  },
  {
    "poster": {
      "poster_name": "Ghalib Mustafa",
      "poster_handle": "ghalib.mustafa"
    },
    "time_stamp": "2022-05-17 09:57:11",
    "edited": {
      "time_stamp": "2022-05-17 09:57:30"
    },
    "text": "Hi <@U03FSSFFKT4>\nIt is not possible in HubSpot CRM. You can only show fields data or relationships in this area (CRM Cards).\nTo learn how to create these cards, you can go through the following documentaion.\n<https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards>"
  },
  {
    "poster": {
      "poster_name": "Maia Torell",
      "poster_handle": "maiatorell123"
    },
    "time_stamp": "2022-05-17 09:58:02",
    "text": "Ok :) especially wanted to know what other people usually do."
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2022-05-17 12:39:05",
    "text": "So odd issue I’m working in the editor after about 10 min I get a message there was an error and chrome goes into a frenzy eating up memory until it crashes about a minute later. Thoughts?"
  },
  {
    "poster": {
      "poster_name": "Nelson Steven Sanabio Maldonado",
      "poster_handle": "nelson.sanabio"
    },
    "time_stamp": "2022-05-17 15:13:08",
    "text": "Native objects such as contact, business, company, etc; cannot be modified, but you can create custom cards by using a developer account and following these <https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards|guidelines>"
  },
  {
    "poster": {
      "poster_name": "Barry Grennan",
      "poster_handle": "barry"
    },
    "time_stamp": "2022-05-17 18:20:03",
    "edited": {
      "time_stamp": "2022-05-17 18:49:45"
    },
    "text": "Weird one here. I'm making a child theme for the first time. My client has Neambo Act 3 and wants some changes to the blog layout (specifically the header overlap).\nThe weird part is that any partials that are called in the child theme (header and footer) revert to factory default.\nWhen you create the child theme, it creates _base.html automatically. This contains {% global_partial path=\"{{ '../partials/' ~ theme.components.header.default_header }}\" %}\nExamining the generated HTML I noticed that the wrap on the header had a data-global-resource-path of \"Act3 Child/partials/header-05.html\"\n\nWondering if this was at issue I changed the global partial path to {{ '@marketplace/Neambo/Act3/partials/' ~ theme.components.header.default_header }}.\n\nThat throws up a warning \"Using asset (@marketplace/Neambo/Act3/partials/header-05.html) outside current theme (Act3 Child)\" but, sure enough, it works, calling the existing site header, my thinking is that the ~ theme.components.header.default_header is trying to call something in the child theme that isn't set. But surely this should be reverting to the parent theme anyway?\n\n<#C22PU4LV8|general>  <#CSFGKSHT7|themes>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Rowe",
      "poster_handle": "nick820"
    },
    "time_stamp": "2022-05-17 22:11:55",
    "text": "Hi all, sorry not sure where my question is relevant.\n\nI’m trying to build a search filter with hubdb data. Does anyone have any references or themes or github repos that can help guide me in the direction for this?\n\nMy use case will be pretty simple, just handling input and then returning content based on a search query with some filters.\n\nThanks :slightly_smiling_face:"
  }
]