[
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-05-27 02:45:15",
    "text": "Custom Objects are defined only via API. Basically you just need to make one POST request to `<https://api.hubapi.com/crm/v3/schemas?hapikey=YOUR_HubSpot_API_KEY>` and add basic properties to body part of the request. There is an example in documentation. After that you can modify and add more properties in the settings. Read more from here: <https://developers.HubSpot.com/docs/api/crm/crm-custom-objects>"
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-05-27 02:54:40",
    "text": "We made a workaround to this: Custom module for showing brands and making “group level name” `{{ site_settings.company_name }}`  visually secondary and grey :smile:\n\nBut yeah… the business unit is the right place. Also Marketing Enterprise customers can add multiple addresses in the email settings page."
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-05-27 03:05:48",
    "text": "I have seen couple clients buying themes from Marketplace but they have faced multiple limitations because themes have had issues or they have been too heavy (because of flexibility). I think themes are used by small companies or agencies without developers.\n\nMy ex-agency recommended heavily to create own theme. It’s much more flexible and fills the needs better.\n\nI have developed own skeleton theme with webpack and basic css. But if you haven’t code HubSpot themes earlier, the boilerplate is good place to start."
  },
  {
    "poster": {
      "poster_name": "Pam Halligan-Sims",
      "poster_handle": "pam.halligansims"
    },
    "time_stamp": "2022-05-27 03:07:04",
    "text": "Hi all, I am trying to use AWS pipelines for  CI/CD of my companies HubSpot theme but have been unable to publish from the build stage, does anyone have any experience with this?"
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-05-27 03:12:47",
    "edited": {
      "time_stamp": "2022-05-27 03:13:49"
    },
    "text": "Also you can create custom objects that will be shown here. I think you can select which properties are visible in the right sidebar."
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-05-27 03:23:12",
    "text": "Here is another example <https://support.happysignals.com/> You can see the similarity"
  },
  {
    "poster": {
      "poster_name": "Andrey Zaytsev",
      "poster_handle": "andrey.zaytcev"
    },
    "time_stamp": "2022-05-27 03:43:43",
    "text": "Hi everyone! I'm trying to associate a new contact with `HubSpotutk` without using js API on the frontend. From the <https://developers.HubSpot.com/docs/api/events/tracking-code|documentation>, it seems like it's possible to do so just by pushing an even that will contain contact's email, so I was wondering if it's possible to do so from the backend? I've seen <https://developers.HubSpot.com/docs/api/crm/timeline?_ga=2.225347482.1440487384.1653641349-612625710.1650614987|the docs on events>, but I cannot find the \"all apps\" section under my development account. The closest app section there is \"integration &gt; private apps\", but it's different from what I see in the docs.\nCould you please help me understand what changes in the environment setup should I make to be able to push events directly? Thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Shruti Rathi",
      "poster_handle": "shruti.rathi"
    },
    "time_stamp": "2022-05-27 04:09:18",
    "text": "Hi everyone.. I wanted to some help with images in HubSpot template.. I am new in hubl code template building.. my requirement is to move the image on page to extreme right, In plain html i have tried to achieve this using \"object-position\" property but not sure how to achieve the same in HubSpot. Can anyone please help with this."
  },
  {
    "poster": {
      "poster_name": "Nirmal Kumar",
      "poster_handle": "nirmal.kumar"
    },
    "time_stamp": "2022-05-27 05:53:18",
    "text": "Hello all, am facing an issue while trying to connect a form from our app to create contacts in HubSpot api\nAccess to XMLHttpRequest at '<https://api.hubapi.com/crm/v3/objects/contacts?hapikey=[SECRET]><https://api.hubapi.com/crm/v3/objects/contacts?hapikey=[SECRET]'>; from origin '<http://localhost:3000>' has been blocked by CORS policy: Response to preflight request doesn't pass access control check: No 'Access-Control-Allow-Origin' header is present on the requested resource.\nthis is the error. i am using axios to send the request"
  },
  {
    "poster": {
      "poster_name": "Nirmal Kumar",
      "poster_handle": "nirmal.kumar"
    },
    "time_stamp": "2022-05-27 05:54:26",
    "text": "i have tried adding Access-Control-Allow-Origin : * in my request header"
  },
  {
    "poster": {
      "poster_name": "Jan Kammerath",
      "poster_handle": "jan472"
    },
    "time_stamp": "2022-05-27 07:57:45",
    "edited": {
      "time_stamp": "2022-05-27 07:59:17"
    },
    "text": "Hello Everyone,\n\nI am trying to get started moving our website from Contentful on AWS to HubSpot on whatever. Besides a truckload of videos (Sorry, I'm not into cinema), I couldn't find the documentation and reference manual.\n\nCan anyone please help me find the following:\n• Template/theme language reference manual\n• Reference on the file structure for the theme package\n• Information on underlying infrastructure (We're from the EU)\nIs there any way that I can build the theme without having to use the CLI?\n\nMany thanks, Jan"
  }
]