[
  {
    "poster": {
      "poster_name": "Patrick O'Donoghue",
      "poster_handle": "patrick.odonoghue"
    },
    "time_stamp": "2022-05-20 02:49:24",
    "edited": {
      "time_stamp": "2022-05-20 02:52:15"
    },
    "text": "Unfortunately I don't think this is available yet dude. Here's a community article where someone mentions that HubSpot are working on updating the email preferences center - <https://community.HubSpot.com/t5/GDPR/Add-email-preference-link-to-CTA/m-p/189036>.\n\nMy understanding is that HubSpot attach a unique slug to the URL when you navigate to the Subscription Preferences page from email, so that the preferences can be linked to the user's email. So I guess it's quite difficult to achieve this on a website page. let's hold thumbs and wait"
  },
  {
    "poster": {
      "poster_name": "Thuthukani Dube",
      "poster_handle": "tdube0007"
    },
    "time_stamp": "2022-05-20 06:25:35",
    "text": "Hey All, does anyone have any knowledge of how I can export chats into an API or the process? The end goal is to export the chats/responses from the WhatsApp Business Chatbot into an API that I will then integrate with another app."
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-05-20 06:41:15",
    "text": "only way would be to create a CSS file and implement it across the site with your styles like a traditional site. unfortunately the interface won’t do what you want it to."
  },
  {
    "poster": {
      "poster_name": "Furqan Asghar",
      "poster_handle": "mfa213"
    },
    "time_stamp": "2022-05-20 06:52:03",
    "edited": {
      "time_stamp": "2022-05-20 06:52:16"
    },
    "text": "i need to know what’s the nodjs custom action client api end-point to retrieve a list by ID. Appreciate any help"
  },
  {
    "poster": {
      "poster_name": "Furqan Asghar",
      "poster_handle": "mfa213"
    },
    "time_stamp": "2022-05-20 06:53:02",
    "text": "for context, i am trying to calculate number of contacts in a list in my workflow using custom code action step"
  },
  {
    "poster": {
      "poster_name": "Imar Krige",
      "poster_handle": "imarkrige"
    },
    "time_stamp": "2022-05-20 08:23:05",
    "text": "Hi. Why would my live site have a trailing ? On each URL?"
  },
  {
    "poster": {
      "poster_name": "Sean Smith",
      "poster_handle": "ssmith"
    },
    "time_stamp": "2022-05-20 09:24:07",
    "text": "Hi All, I am in need of guidance on a project I'm working on. I implemented JavaScript onto one of my webpages to create a multistep form to go into a custom object and only a custom object. The issue I'm experiencing is it creates a new record for every page of the form (Each page is a separate form). Within JS, I carried over the \"email address\" custom object property into a hidden field on each subsequent form. There may be an issue when I created the object property via schema and didn't select \"require each value to be unique\". I am stuck and would like guidance where to go from here."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 12:03:56",
    "text": "Heartfelt congratulations to the dozens who earned the CMS for Developers certification during <https://twitter.com/hashtag/HubSpot?src=hashtag_click|#HubSpot>’s World Certification Week! You not only proved your development skills but also earned money for charity. <https://t.co/8XRkMcYbyi|See the full impact of World Certification Week.>"
  }
]