[
  {
    "poster": {
      "poster_name": "Martin Carlin",
      "poster_handle": "martin264"
    },
    "time_stamp": "2022-05-16 02:08:25",
    "text": "do you need a `,` before or after this block in the json maybe?"
  },
  {
    "poster": {
      "poster_name": "Chris",
      "poster_handle": "chris.till"
    },
    "time_stamp": "2022-05-16 04:45:32",
    "edited": {
      "time_stamp": "2022-05-16 04:46:28"
    },
    "text": "@channel Does anybody know if we have to manually change the domain for each page after we launch the production website? I’ve updated my local hosts file to point at the CMS to test it’ll all work but each page url seems to still want to use the old HubSpot domain unless I manually change it. (We’re using the revese proxy method if that makes a difference)"
  },
  {
    "poster": {
      "poster_name": "Ken Walker",
      "poster_handle": "kenwalker833"
    },
    "time_stamp": "2022-05-16 05:12:26",
    "edited": {
      "time_stamp": "2022-05-16 05:16:02"
    },
    "text": "Hi All,\nHope you are doing well!"
  },
  {
    "poster": {
      "poster_name": "Ken Walker",
      "poster_handle": "kenwalker833"
    },
    "time_stamp": "2022-05-16 05:14:34",
    "text": "We are facing issue when creating new list by using API endpoint\n\nWe are using the below API endpoint to create a new list in our HubSpot account.\n- <https://legacydocs.HubSpot.com/docs/methods/lists/create_list>\n\nPreviously this API endpoint was creating a new list in our HubSpot account successfully but now it's returning a response like the below when creating a new list:\n*- list_permission_issue*\n\nWe have shared this in the community but we couldn't get a solution.\n\nCould you please help us to resolve this issue?"
  },
  {
    "poster": {
      "poster_name": "Louis TONNEVY",
      "poster_handle": "louis.tonnevy"
    },
    "time_stamp": "2022-05-16 07:11:24",
    "text": "Hey, quick question. I'm making a custom card and was wondering: how do you chane the max size of the propreties, to avoid the \"view more\" when the customer sees the card? The max number for now is 3 and i got 4, so kind of a close call. Is this in the Json? hanks for your time!"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2022-05-16 07:24:03",
    "text": "Hello Team,  I have a security issue and a security recommendation that I’m not sure how to implement. They are recommending to implement: Set this header: *X-Content-Type-Options: nosniff,* \nHow can this be done in a HubSpot website?\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2022-05-16 07:28:53",
    "text": "Hi everyone, is it expected behavior that when I <https://developers.HubSpot.com/docs/cms/building-blocks/templates/drag-and-drop-areas/sections#copy-section-hubl|copy the section HubL> that I do not get any of the content set in the module that is in my section?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-16 07:34:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-05-16 07:34:16",
    "text": "That has been my experience so far"
  },
  {
    "poster": {
      "poster_name": "Rodrigo",
      "poster_handle": "rodrigo.castro"
    },
    "time_stamp": "2022-05-16 07:38:18",
    "text": "I’m still wondering what’s the difference between having a dev account with a certain theme and creating a sandbox from a live account… You have to replicate everything on the latter one! I don’t see any benefit compared to a dev account :shrug:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-16 08:00:04",
    "text": "<https://www.linkedin.com/posts/mclarenjon_HubSpot-HubSpotcli-HubSpottipsandtricks-activity-6848272264757178368-iKve?utm_source=linkedin_share&amp;utm_medium=member_desktop_web|If you can use FTP, you can use the HubSpot CLI.> If you’ve put off learning the CLI, I recommend diving in now. It’s only getting more and more powerful and is filled with things that will save you time and energy."
  },
  {
    "poster": {
      "poster_name": "Maia Torell",
      "poster_handle": "maiatorell123"
    },
    "time_stamp": "2022-05-16 12:17:23",
    "text": "Hello! I'm pretty new to HubSpot development and wanted to know: is it usual to use themes from the marketplace (free and bought) to build from, I'm guessing with a child theme, using existing and making own templates and modules for clients? Or do you always start with the boilerplate?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-05-17 09:14:02"
      },
      {
        "time_stamp": "2022-05-17 09:58:02"
      },
      {
        "time_stamp": "2022-05-27 03:05:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2022-05-16 13:20:46",
    "edited": {
      "time_stamp": "2022-05-16 13:23:53"
    },
    "text": "I am now managing 5 different themes, all of which share about 80%+ similar codebase, mainly differing in the modules, sections and templates each one ships with - and I looking for a better version control system.\n\nFor example: I need to be able to make updates that are relevant to all themes (eg: a bugfixs or global module updates) but also need to be able to manage theme specific features + updates that may not pertain to the other themes (eg: updates to a module that exists in Theme 3, but not in Theme 1 or Theme 2)\n\nI'm exploring the idea of using a single repo with branches for each theme, or multiple repos for each theme that all form a type of \"boilerplate\" - but haven't really found a system that feels 100% right just yet.\n\n*Can anyone share a version control system* they've implemented which works well for managing multiple ( themes | sites | projects ) that all share mostly the same codebase? Or if anyone else is looking to solve the same issue and has some good ideas I'd be happy to brainstorm."
  },
  {
    "text": "kewl",
    "time_stamp": "2022-05-16 14:30:52"
  }
]