[
  {
    "poster": {
      "poster_name": "Ebrahim Abu Laban",
      "poster_handle": "ebrahim"
    },
    "time_stamp": "2022-05-09 07:08:40",
    "text": "Hi All, we would like to enable the option to create a ticket directly in HubSpot from our portal, I create a development account and an app , but still cannot figure out how I need to do the authentication , please advise."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-05-09 07:57:00",
    "edited": {
      "time_stamp": "2022-05-09 07:57:25"
    },
    "text": ":sprocket-dance:As per our previous reminders, today is the day! In a couple of hours we'll be <https://docs.google.com/spreadsheets/d/1fnwCzrYD2fLNPCYP7NNshTJi4gM36vWpHBTU0ALQaSQ/edit#gid=1564945604|archiving or renaming multiple public channel>s in order to make it easier to connect in the HubSpot Developer Slack. :sprocket-dance:\n\nOnce these changes go live, don't hesitate to reach out to me with any feedback. Channels will be archived, still searchable, and always possible to revive should the demand be there. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Caitlin Siegrist",
      "poster_handle": "csiegrist"
    },
    "time_stamp": "2022-05-09 08:12:07",
    "text": ":wave::skin-tone-2: Calling all Developers! HubSpot's next App Accelerator program kickoffs off exactly one week from today. If you'd like to learn more about the program &amp; see if it's a good fit for your organization, please sign up <https://docs.google.com/forms/d/e/1FAIpQLScyKYwYgQ5ra1nN70Od8Vm5amqkgF8zFloxGWgsdW7UWQE5Ng/viewform?usp=sf_link|here>.\n\nIn this iteration of the program, we'll be solving for known customer demand gaps in the CRM &amp; Sales Hub products. In addition to conceptual guidance, technical support &amp; go-to-market assistance, program participants are eligible to receive a potential cash investment from HubSpot that ranges from $50k USD - $150k USD. Feel free to ping me with any questions!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Rowe",
      "poster_handle": "nick820"
    },
    "time_stamp": "2022-05-09 08:40:39",
    "text": "Hi all,\n\nLet me explain my issue and if you can help me understand the problem.\n\n_*The scenario…*_ :scream:\n\n• We have a live website, which we have cloned the theme and created a new staging domain. The new theme looks at this new domain\n• We have multiple developers working on the same project and theme inside HubSpot\n• We use github for our version control and use this as the main source of truth of our codebase\n• We use PR in to the main branch to release new versions of the theme/website\n• However, when we create new custom modules via HubSpot (in the backend) this creates new module files, such as json, html etc\n• This then becomes out of sync from our version control if we use hs fetch command\nHowever the issue is that when we run the hs watch command, any changes we make will update the code base.\n\nTherefore when you create a pull request and it merges to the main branch the changes will already be there.\n\nSo technically its not the only source of truth as running hs watch will also change/ update code in the theme.\n\nAny thoughts folks? This is for multiple devs wanting to collab on a HubSpot theme.",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-05-09 09:57:49"
      },
      {
        "time_stamp": "2022-05-09 12:34:48"
      },
      {
        "time_stamp": "2022-05-09 22:23:00"
      },
      {
        "time_stamp": "2022-05-10 10:27:36"
      },
      {
        "time_stamp": "2022-05-11 07:10:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2022-05-09 09:57:49",
    "text": "I am very interested in this as well. I have been thinking out the best way to use github for version control. My thought is that each developer would pull data from the github hosted theme and then work on them in their own, independent developer account. That way hs watch would not override anything on the main theme. Then they would do a pull request on the github theme for code review. Once the review is done there would be a merge and workflow to push the code to the live theme."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-05-09 10:43:54",
    "text": "Hey, all. One of our clients created a new HubSpot instance and want to move everything from one portal to the other. Is moving all things CMS (pages, CTAs, etc.) from one portal to another portal a manual process? Or are there tools for a more efficient method?",
    "reply_count": 9,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-05-09 11:19:58"
      },
      {
        "time_stamp": "2022-05-09 11:27:25"
      },
      {
        "time_stamp": "2022-05-09 11:29:18"
      },
      {
        "time_stamp": "2022-05-09 11:31:33"
      },
      {
        "time_stamp": "2022-05-09 11:38:38"
      },
      {
        "time_stamp": "2022-05-09 11:48:11"
      },
      {
        "time_stamp": "2022-05-09 12:14:21"
      },
      {
        "time_stamp": "2022-05-09 12:18:40"
      },
      {
        "time_stamp": "2022-05-11 08:04:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-05-09 11:19:58",
    "text": "Hey dude, most CMS objects can be “moved” (read from the source portal and recreated in the new portal) from portal to portal via API, but some, including CTAs and DND Email Templates, have to be recreated manually."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-05-09 11:27:25",
    "text": "Right on. Thanks, Mark! Hope you’re doing well. Does that include website/landing pages and their content too?"
  },
  {
    "poster": {
      "poster_name": "Alexis Rodriguez",
      "poster_handle": "arodriguez"
    },
    "time_stamp": "2022-05-09 11:29:18",
    "text": "<@UB690RZA7> Hey Tony! HubSpot SE here. The content itself will not migrate but the templates will. We do also have some apps in our marketplace that can facilitate portal migrations like <https://ecosystem.HubSpot.com/marketplace/apps/marketing/data-management/HubSpot-to-HubSpot-migration|this one>. It just depends on exactly what they want to migrate between portals."
  },
  {
    "poster": {
      "poster_name": "Alexis Rodriguez",
      "poster_handle": "arodriguez"
    },
    "time_stamp": "2022-05-09 11:31:33",
    "text": "<https://knowledge.HubSpot.com/design-manager/copy-a-template-or-theme-to-another-HubSpot-account|Here’s> a helpful knowledge base article around copy templates/themes from one portal to another."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-05-09 11:38:38",
    "text": "Thanks, all. So it appears some CMS objects can be migrated over easily, but there’s a bit of manual work as well."
  },
  {
    "time_stamp": "2022-05-09 11:45:15",
    "text": "clean up clean up",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-09 11:45:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-05-09 11:45:29",
    "edited": {
      "time_stamp": "2022-05-09 11:45:40"
    },
    "text": "HubSpot server admins today ^"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-05-09 11:48:11",
    "text": "<@UB690RZA7> you can actually use the pages APIs to create pages, apply the migrated templates, and apply the same content. I haven’t done that since the DND editor was introduced though, so if the source portal is using that then I’d dig in deeper to ensure it’s still possible"
  },
  {
    "poster": {
      "poster_name": "Nick Verwymeren",
      "poster_handle": "nick759"
    },
    "time_stamp": "2022-05-09 11:58:32",
    "text": "Thanks <@U26BLKGE4> I’ll give that a try"
  },
  {
    "poster": {
      "poster_name": "Daniel Pires",
      "poster_handle": "daniel.pires"
    },
    "time_stamp": "2022-05-09 12:07:50",
    "text": "Hey all, first message here,\n\nDoes anyone ever implemented an order-to-cash process with HubSpot and any ERP?\n\nThank you so much"
  },
  {
    "poster": {
      "poster_name": "Vivian Lumbley",
      "poster_handle": "vlumbley"
    },
    "time_stamp": "2022-05-09 12:14:21",
    "text": "it’s inconsistent as far as DND content in pages goes; i did a migration like this a couple of months ago, some pages with DND content carried over while some didn’t. :confused: it’s either inconsistent or i didn’t notice the differentiator(s)."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-05-09 12:18:40",
    "text": "I love surprises! :smile: Lol. Thanks, Vivian. I hope you’re doing well too."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-05-09 12:28:38",
    "text": "I wonder how you guys are cleaning up the server and choosing which channels to axe. I just picture all of the HubSpot staff in a serious, congressional-like conference room, “All in favor of archiving the channel ‘#new-to-HubSpot-cms’, say aye….. The ayes have it.”",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-09 12:48:13"
      },
      {
        "time_stamp": "2022-05-09 12:53:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tim Loden",
      "poster_handle": "tim.loden"
    },
    "time_stamp": "2022-05-09 12:34:48",
    "text": "This is how we currently manage our repo, each dev has a portal and they use feature branches for their changes. We dont allow any module creation in HubSpot to prevent the syncing issue you referenced, all modules are created via cli."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-05-09 12:34:49",
    "edited": {
      "time_stamp": "2022-05-09 12:50:39"
    },
    "text": "Fellow developers, how are your guys’ skylines looking so far this year? <https://skyline.github.com/dperolio/2022> Reply with yours.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-09 12:49:59"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-05-09 12:48:13",
    "text": "It was data driven based on various factors like noise:response ratio, channel topic relevance, and date of last post... but there was indeed a meeting (over Zoom, not in congress) where we yay-ed and nay-ed. All in the hopes y'all could get the answers and networking you need from the Dev Slack :)"
  },
  {
    "text": "",
    "time_stamp": "2022-05-09 12:49:59"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-05-09 12:53:10",
    "edited": {
      "time_stamp": "2022-05-09 12:58:36"
    },
    "text": "Yeah, good work, I definitely think there were too many channels and it’s a much-needed cleanup. Especially when Slack hasn’t implemented channel categories, it can be pretty overwhelming."
  },
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2022-05-09 21:40:48",
    "text": "Has anyone ever integrated a WhatsApp business conversations into the conversation inbox?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Rowe",
      "poster_handle": "nick820"
    },
    "time_stamp": "2022-05-09 22:23:00",
    "text": "Thanks both, <@UPJ8FNPTK> &amp; <@UDPA7JFHA>\n\nI think the problem I’m having is that my team are working on the same portal account and theme, so when they use hs fetch command they are bringing in new changes outside of git (from the design editor)\n\nDoes everyone who works on a team, use a separate sandbox outside of the same portal/theme?"
  }
]