[
  {
    "text": "Has anyone come across this warning in your Chrome Console related to the DEV TOOLS???\n\nThe warning reads:\n`DevTools failed to load source map: Could not parse content for <https://cdn2.HubSpot.net/hub/507386/hub_generated/template_assets/41345400478/1655842500519/CLEAN-theme/CLEAN-6-1-theme/css/modules/global-header-v2.css>: Unexpected token . in JSON at position 0`\n\nI'm not sure what I need at position 0 to remove this warning.\n\nAny ideas are SUPER appreciated.",
    "time_stamp": "2022-06-21 14:20:22",
    "edited": {
      "time_stamp": "2022-06-21 14:23:53"
    },
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-06-21 14:34:38"
      },
      {
        "time_stamp": "2022-06-21 14:35:09"
      },
      {
        "time_stamp": "2022-06-21 14:46:41"
      },
      {
        "time_stamp": "2022-06-21 14:48:51"
      },
      {
        "time_stamp": "2022-09-05 03:39:41"
      },
      {
        "time_stamp": "2022-09-13 07:19:27"
      },
      {
        "time_stamp": "2022-09-13 07:51:22"
      },
      {
        "time_stamp": "2022-09-13 07:54:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-21 14:34:38",
    "text": "It’s effectively not a real issue. It’s just saying it’s not seeing the source map (a tool which helps your dev tools hook up to the unminified version of the code for debugging).\n\nYou’re not using a build tool to generate the sourcemap, We’re generating the minified file for you, and if you have the “enable JavaScript Source maps” feature on in chrome dev tools you’ll see it. We don’t generate a source map because there isn’t a point for it on HubSpot, you just view the page with `hsDebug=true` and you get the unminified version. So for us to actually generate source maps would just add bytes to the download time of your themes for no benefit."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-21 14:35:09",
    "text": "You can disable the JavaScript source maps feature to make chrome stop trying to find a source map."
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2022-06-21 14:46:41",
    "text": "<@U7SL518D6> what's up dude! Really appreciate you chiming in and letting me know.  I'll quit banging my head on the keyboard since it's a non-issue. One of those things I had been curious about.  If it's a non-issue, awesome!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-21 14:48:51",
    "text": "Not much, just still doing what I do.\n\nNo prob on this. It really isn’t an issue in your code or ours it’s just literally a feature specifically designed for developers, and it’s just being noisy because it doesn’t know sourcemaps are kinda pointless on HubSpot."
  }
]