[
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2022-06-08 10:19:24",
    "edited": {
      "time_stamp": "2022-06-08 10:19:32"
    },
    "text": "MISSING CHILD THEME BUG:  Is anyone else here experiencing errors saying their child theme is missing but it's indeed in your account?\n\nThere is something super funky going on and I'm getting emails from HubSpot customers left and right about it.  <@U2H3TT8F2>, heard anything?\n\nI have added a support ticket about it yesterday (#10164591).",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-08 11:25:50"
      },
      {
        "time_stamp": "2022-06-08 11:29:19"
      },
      {
        "time_stamp": "2022-06-08 12:55:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Atul Jain",
      "poster_handle": "atul.jain"
    },
    "time_stamp": "2022-06-08 10:24:58",
    "text": ":wave: Hello, team!"
  },
  {
    "text": "Hey Kevin, from what I can see, the page (changelog) in question thats missing the template was utilizing the `clean-testing.html` template. This template appears to be in your recently deleted items. This is the reason your are seeing that error in particular.\n\nAs for the child theme not appearing, I am able to see this in the account when I attempted to create a new page and also swap templates from another one:",
    "time_stamp": "2022-06-08 11:25:50"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-06-08 11:29:19",
    "edited": {
      "time_stamp": "2022-06-08 11:29:29"
    },
    "text": "Looks like the issue that was causing it to not show has since been resolved :slightly_smiling_face: the rep should get back to you soon"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2022-06-08 12:55:40",
    "text": "<@U2H3TT8F2> I appreciate you taking a look! Glad this was sorted and good to know about the clean-testing.html issue.  I emailed support back on the same ticket about what happened there if you're curious.  Pretty specific use-case around cloning a template (already attributed to a page) to a child theme, Then renaming the file. All associated pages with that template get the renamed version attributed as opposed to reverting back to the original template in the parent theme.  Then I deleted the testing template which screwed things up."
  }
]