[
  {
    "poster": {
      "poster_name": "Jasper Haynes",
      "poster_handle": "j.haynes"
    },
    "time_stamp": "2022-10-14 02:38:48",
    "edited": {
      "time_stamp": "2022-10-14 02:39:03"
    },
    "text": "Thats a shame, we are now talking to a translating company to see if they can directly translate it in the CMS."
  },
  {
    "text": "Hi everyone, I was wondering if you can help me with two questions about migration of content for a knowledge base.\n\n1. We have some changelogs published <https://developer.infermedica.com/docs/changelog/model-2022-09-09|here> and <https://developer.infermedica.com/docs/changelog|here> on our Developer's Portal that we want to migrate for our new knowledge base in HubSpot, is there any option to avoid manual importation?\n\nAlso, would it be possible to maintain the same tables and graphics used? - attached\n\n2. We would like to have the list of symptoms and conditions being considered in our triage solution and I was wondering if we can have a<https://developer.infermedica.com/docs/v3/available-conditions?cms=published&amp;cms_token=| similar structure to this one> - almost like a dictionary search. Do you know if its possible?\n\nThank you",
    "time_stamp": "2022-10-14 03:49:04",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-20 04:18:21"
      },
      {
        "time_stamp": "2022-11-07 06:24:19"
      },
      {
        "time_stamp": "2022-11-07 06:24:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-10-14 08:42:18",
    "text": "There are some pretty cool tools out there that do a good job imo. I havent played much with them but a client of ours used it and its pretty slick. <https://gtranslate.io/> it is JS based and translates sites on the fly. You can also override specific words in specific languages. Might be worth looking into as well"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-10-14 09:44:30",
    "text": "This channel is intended for discussion around migrations of CMS systems. I'm going to remove this post (as it's been posted in <#CSFGKSHT7|themes> already) but just wanted to comment here to provide clarity on the intended use of this channel. <#C2YGWHDKQ|marketplace> is more appropriate for this message."
  }
]