[
  {
    "poster": {
      "poster_name": "Matt Klein",
      "poster_handle": "mattk"
    },
    "time_stamp": "2022-10-21 08:00:30",
    "edited": {
      "time_stamp": "2022-10-21 08:00:54"
    },
    "text": "Hello, thank you in advance for any help you may be able to provide.\n\nWe have native forms on our website (PHP-based) that push to our current CRM, service ticketing system, and ESP. All of those platforms are being consolidated/replaced with HubSpot. Therefore, we need to migrate all of these forms and need to do so through the API given the nature of the forms and the data they collect. We have a few questions on the best way to approach.\n\nThe first set of forms are sales inquiry forms. These forms currently:\n1. collect lead information\n2. determine the proper sales representative\n3. determine the proper sales representative’s manager\n4. create a new lead in the CRM\n5. assign the lead in the CRM to the sales representative\n6. gather explicit consent for marketing to the user and if they consent adds the user an email marketing list\n7. collects any UTM parameters from the URL and passes these into a custom property in the CRM\n8. sends the form submission details via email to the sales representative and their manager\n*Questions:* \na) Is the Forms API the best overall approach or should we consider using the Contacts API?\nb) For #5 above, if we use the Forms API, do we need to setup a workflow to assign the lead to the sales rep or can we do this programmatically? If its a workflow, then assuming we can just pass the sales rep information in a hidden field to the workflow?\nc) anything other things to consider, look out for? Any tips appreciated!\n\nThanks in advance.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-10-24 11:27:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Daniela Arceo Herrera",
      "poster_handle": "daniela146"
    },
    "time_stamp": "2022-10-21 11:35:20",
    "text": "Hello everyone! Im not sure if this is the correct channel for this but, if you'd had to substitute the functionality of a HubDB table that serves dynamic content to a page in Wordpress, How would you do that? Thanks in advance for any suggestions",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-26 08:45:56"
      },
      {
        "time_stamp": "2022-10-26 08:45:58"
      },
      {
        "time_stamp": "2022-10-31 11:32:17"
      }
    ]
  }
]