[
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 09:52:15",
    "text": "Hi, when doing a sitewide update in the Content Staging area, what is the appropriate way to set up the hyperlinks between the pages? If the staged pages are selected when configuring links, then we are able to test out whether all the links are working properly within the staged proof area. However, once the pages are all published live, the links are no longer valid (presumably since they linked to the \".<http://sandbox.hs-sites.com/|sandbox.hs-sites.com/>\" domain instead of the live <http://company.com|company.com> domain).\n\nIs there a proper method to do this so that we can test that all linked are valid in the staged area, while ensuring that once published those links stay functional?",
    "reply_count": 29,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-12 09:54:14"
      },
      {
        "time_stamp": "2022-10-12 09:57:59"
      },
      {
        "time_stamp": "2022-10-12 10:02:01"
      },
      {
        "time_stamp": "2022-10-12 10:06:14"
      },
      {
        "time_stamp": "2022-10-12 10:14:31"
      },
      {
        "time_stamp": "2022-10-12 10:16:04"
      },
      {
        "time_stamp": "2022-10-12 10:17:25"
      },
      {
        "time_stamp": "2022-10-12 10:18:52"
      },
      {
        "time_stamp": "2022-10-12 10:22:36"
      },
      {
        "time_stamp": "2022-10-12 10:23:10"
      },
      {
        "time_stamp": "2022-10-12 10:24:23"
      },
      {
        "time_stamp": "2022-10-12 10:27:06"
      },
      {
        "time_stamp": "2022-10-12 10:31:21"
      },
      {
        "time_stamp": "2022-10-12 10:31:53"
      },
      {
        "time_stamp": "2022-10-12 10:38:01"
      },
      {
        "time_stamp": "2022-10-12 10:38:30"
      },
      {
        "time_stamp": "2022-10-12 10:39:10"
      },
      {
        "time_stamp": "2022-10-12 11:03:07"
      },
      {
        "time_stamp": "2022-10-12 11:06:59"
      },
      {
        "time_stamp": "2022-10-12 11:09:42"
      },
      {
        "time_stamp": "2022-10-12 11:09:47"
      },
      {
        "time_stamp": "2022-10-12 11:10:50"
      },
      {
        "time_stamp": "2022-10-12 11:46:27"
      },
      {
        "time_stamp": "2022-10-12 11:48:42"
      },
      {
        "time_stamp": "2022-10-12 11:51:40"
      },
      {
        "time_stamp": "2022-10-12 11:52:40"
      },
      {
        "time_stamp": "2022-10-12 11:52:54"
      },
      {
        "time_stamp": "2022-10-12 11:53:06"
      },
      {
        "time_stamp": "2022-10-12 11:53:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 09:54:14",
    "text": "Hi Zachary, if you use the \"Content\" link type where you are connecting the stage pages, the links will update automatically when you move out of content staging.  Similar to how the pages dynamically update in navigation, etc. when you change the URL.\n\nIf you are using manual links, those would have to be updated, usually pre-launch by changing them to the URL for what the live page will be"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 09:57:59",
    "text": "Hi Jennifer, that's what I thought too but I tried using the \"Content\" link to connect the pages but they don't persist once published live.\n\nWhat's interesting is that when using the \"Content\" link, I am able to select both the live page and the staged version of the same page in the dropdown. Which leads me to believe that they won't dynamically change upon publishing?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:02:01",
    "text": "<@U01GW130U66> very interesting, I don't think I have realized this change, it's been many years since I started using content staging and now just page by page. I have noticed the live page can also be selected.\n\nIt looks like the proper process might be using the sandbox links during testing and then scrubbing the pages to change to the live pages? that seems like a massive undertaking.\n\nI'm going to run a test and publish, will see what happens shortly."
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:06:14",
    "text": "Yes it's odd - I actually received that response from HubSpot support, where they told me \"Please keep in mind that when the pages are in that content stage they are using internal links, \"<http://www-company-com.sandbox.hs-sites.com|www-company-com.sandbox.hs-sites.com>\" so it will be necessary to change the domain once you pass the pages from the content stage to the live stage.\"\n\nI agree with you though -- it seems like a massive undertaking, and so it seems there might be a better method that I'm just missing.\n\nThank you so much for taking the time to look into that on your end -- really appreciate it!"
  },
  {
    "text": "You're welcome, no problem, this is really helpful for me to understand also.\n\nI created a test in staging, and confirmed it is using the sandbox domain (first image), <https://4740449-hs-sites-com.sandbox.hs-sites.com/test|here is the link>\n\nOn the page, I linked the first resource box to the same staged page and it shows as the sandbox in the editor (second image)\n\nNow I will publish and see what happens with the page link",
    "time_stamp": "2022-10-12 10:14:31"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:16:04",
    "text": "<https://4740449.hs-sites.com/test|this is the published link>\n\nwith no changes to the page, the link for the first resource works"
  },
  {
    "text": "the URL was updated automatically for the page to the domain (first image) and the page link in the content editor is also updated to remove the sandbox (second image)",
    "time_stamp": "2022-10-12 10:17:25"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:18:52",
    "text": "<@U01GW130U66> based on the testing, the sandbox links should update dynamically like expected. I'm not sure why HS support phrased it that way, the way content staging works is to create a sandbox for the domain you're working on and then automatically convert that over to the live domain."
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:22:36",
    "text": "Oh interesting! It seems it did work exactly as you described. So odd that it didn't work for me. At least I know now that what you did should be the expected behaviour which definitely makes more sense.\n\nHm.. I'll try it again on my end and see if I can figure out what's wrong. I'm quite new to HubL so I wonder if perhaps I implemented the link module incorrectly (the one that enables the front end \"Content\" selector) -- perhaps somehow it's forcing the links to be absolute instead of relative or something, which might be breaking the dynamic conversion when moving over to the live domain. (Just guessing at ideas really...)"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:23:10",
    "text": "Thanks for confirming on your end!\nI'll try to figure this out..."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:24:23",
    "text": "Ah, that is possible, it could be the way the module is coded. Maybe post in the module thread to see if anyone knows how to keep the links dynamic? I would check in with our lead developer, but he is on holiday and this is well outside my area of expertise!"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:27:06",
    "text": "No worries. At least now I know that the dynamic links are possible - the confirmation of that alone is definitely helpful, so at least I know I'm not working towards an impossible solution :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:31:21",
    "text": "BTW, just a quick question if you don't mind - I assume the Power template is a custom one of yours? Just curious if the mega menu navigation is built on top of HubSpot's native menu builder, or if it's coded completely separately, as a standalone module?"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 10:31:53",
    "text": "(The template looks great! Just curious to learn if you happened to know)"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:38:01",
    "edited": {
      "time_stamp": "2022-10-12 10:46:08"
    },
    "text": "POWER was developed by maka Agency before I joined the team, we're a very small team of 4, there was a lot of work put in to the theme by Markus and Ergün to win the first theme competition, it is very carefully crafted theme."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:38:30",
    "text": "The Advanced Mega Menu is part of our global partial for the header."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 10:39:10",
    "text": "To clarify, what do you mean by 'native menu builder' - the advanced navigation settings or the boilerplate code?"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:03:07",
    "text": "Oh, so in Settings &gt; Website &gt; Navigation, I was reading that that's where HubSpot typically intends for menus to be built (assuming they follow a standard dropdown structure). But for more complex mega menus, I wasn't sure if typically people still start with that structure as a baseline, or if it's actually a completely separate global partial that isn't related to the default menu settings altogether."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:06:59",
    "text": "Yes, we still use the navigation menus in our advanced mega menu, it just isn't built as \"one\" menu, it is built as the top level menu, with targets assigned that can pull in other menus to be used within the mega menu."
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:09:42",
    "text": "Ah ok, that makes sense"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:09:47",
    "text": "Thanks again for your help!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:10:50",
    "text": "you're welcome, best of luck with your project!"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:46:27",
    "text": "Hi Jennifer -- I tried it out again, and ran into the same issue... but as I was trying to debug and try a few things, it turns out that after some time the links all updated to the live site! I guess perhaps it was working all this time after all, but perhaps there was some cacheing issues, or it just took some time for the links to automatically update to the live domain.\n\nIn any case, it works just as you originally described now. Just wanted to keep you in the loop since you've helped me out so much!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:48:42",
    "text": "That's awesome, I'm so glad it is working for you! Do you have the unofficial chrome developer tools for HubSpot? If not, I highly recommend for the cache buster alone :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:51:40",
    "text": "Oh, i don't, is it this one? <https://chrome.google.com/webstore/detail/HubSpot-developer-extensi/gebemkdecnlgbcanplbgdpcffpdnfdfo?hl=en>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:52:40",
    "text": "yes"
  },
  {
    "poster": {
      "poster_name": "Zachary Leung",
      "poster_handle": "zachary.leung"
    },
    "time_stamp": "2022-10-12 11:52:54",
    "text": "Amazing, thanks for the tip!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:53:06",
    "text": "it will make debug and everything else much easier once you get used to it being there"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-12 11:53:29",
    "text": "you're welcome!"
  }
]