[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-01-26 08:49:25",
    "text": "Hey folks - any folks here with much experience with efficient workflows between HubSpot and a Gatsby app? The current pain point is that for any simple marketing updates to go through there is a pretty long funnel for any change to go through. Whether it be content or color updates etc., all edits go to the dev team, updated by them, a merge request created in gitlab, and then approved. Is there a better/more creative way to impliment the CMS into the process to give marketers more power to make simple changes when using a js-framework like React/Gatsby? <@U0276HSQAE8> — feel free to comment below if I missed anything!",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-01-26 09:03:26"
      },
      {
        "time_stamp": "2022-01-26 10:20:54"
      },
      {
        "time_stamp": "2022-01-26 10:23:36"
      },
      {
        "time_stamp": "2022-01-26 10:27:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-01-26 09:03:26",
    "text": "found those 3: <https://www.builder.io/m/gatsby>\n<https://gatsby.ghost.org/about/>\n<https://www.sanity.io/gatsby-cms>"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-26 10:20:54",
    "text": "Hey <@UQWGKUEN7>, I’ve kept a close eye on the headless CMS space for a few years now, specifically building side projects with both Gatsby and Next. I’ve played around with using HubSpot at a headless cms, and while it can be an OK solution for the blog portion of the product specifically, I would not recommend it for page management. Additionally, the only benefits you really get from using these platforms are 1) you’re writing your code in React instead of HubL and 2) PWA/SPA page navigation.\n\nNow, could you leverage HubSpot as a quasi-headless CMS for the things you’re talking about (branding etc…)? Possibly. I could see tying your theme settings to a JSON file for Gatsby consumption and mapping those values to some CSS properties or other CSS-In-JS variables, but then you also need to build the marketer experience for that tool (the live preview) in a way that works for them. Gets messy quick.\n\nIn terms of other headless CMSs, Contenful is the big player (with a pricetag to match). Otherwise, I would suggest looking into either using WordPress in a headless method using the WP REST (or GraphQL via a plugin) API and/or Strapi in a simple implementation that works for your content editors.\n\nNo matter your decision, ultimately the reason I don’t recommend headless implementations for most marketing teams right now is because most configurations are too individual from site to site depending on the editors and complexity of the site. They’re great solutions for teams with internal development talent (like SaaS startups) where they can reuse portions of their existing codebase (if they want to share components between their apps and site, for example), but from a marketer experience standpoint I always recommend HubSpot because of how opinionated and standardized it is."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-01-26 10:23:36",
    "edited": {
      "time_stamp": "2022-01-26 10:24:40"
    },
    "text": "<@U0276HSQAE8> :point_up_2:<@U26BLKGE4> is a much better resource on this topic than me"
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2022-01-26 10:27:46",
    "text": "thanks everyone!"
  }
]