[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-15 08:56:35",
    "text": "clarifying some things here.\n\nA child theme - inherits all of it’s code from the parent unless you provide a file with the same name in your child theme. In that situation your child theme’s file will override the parent.\n\nAs for CSS there are several ways you can load custom CSS using a child theme to add it where necessary is the most future-proof solution if you need it to apply to specific templates or your whole theme.\n\nCloning a theme creates a literal copy of the whole theme but with the caveat that if it’s a marketplace theme - you lose the updates from the theme provider. If you want to retain updates from the theme provider just like WordPress you’d want to use a child theme."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-15 09:00:20",
    "text": "Regarding adding CSS, if you only need your CSS to apply to 1 page, you can add a css file through the page settings advanced options in the page editor.\n\nAdditionally an option though not the ideal solution - if you need the stylesheet to apply to your whole website, you can add stylesheets to apply site wide through website settings.\n\nThe ideal way for a developer though is using a child theme as that gives you the most control."
  },
  {
    "poster": {
      "poster_name": "Asad Razzaq",
      "poster_handle": "web073"
    },
    "time_stamp": "2021-12-15 11:41:34",
    "text": "```form fieldset {\n\t\tmax-width:100% !important;\n        display: inline-flex;}\n\tinput.hs-button.primary.large {\npadding: 10px 50px;\n  background-color: dodgerblue;\n  border: 1px solid #ddd;\n  color: white;\n  cursor: pointer;\n   width:33.33%;\n    \n\t}\n\t\n\tform .hs-form-field input{\n\t   vertical-align: middle !important;\n  margin: 5px 10px 5px 0;\n  padding: 10px;\n  background-color: #fff;\n  border: 1px solid #ddd;\nwidth:66.666%;\n\n\t}```\nHi Everyone I am trying to achieve inline form with CSS but no success I am doing something wrong? Embed Form link <https://wh904543.ispot.cc/1/HubSpot-form/>"
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony.perez"
    },
    "time_stamp": "2021-12-15 13:02:21",
    "text": "Does anyone have any issues when trying to fetch your design files from the CMS? I usually don’t fetch all of the files. I don’t see any errors in the terminal neither, so I’m not sure why it doesn’t retrieve all of the files",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-12-15 17:16:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-12-15 17:16:34",
    "text": "Can you give us some examples of what isn't being fetched."
  }
]