[
  {
    "poster": {
      "poster_name": "James Davies",
      "poster_handle": "james"
    },
    "time_stamp": "2018-04-13 01:00:25",
    "text": "Quick one guys, Just wondering how many of you guys build clients websites in HTML and the add the HubL code in for the modules or do you build it all in the modules?"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-04-13 03:16:33",
    "text": "We use the design manager when ever possible. Solves for the client beyond our relationship"
  },
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2018-04-13 03:20:09",
    "text": "Hey I used to create custom module to build a template :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-13 06:40:02",
    "text": "Due to client “wants” almost all of the HS sites I build I build drag n drop, I built a framework we use internally for drag n drop templates, now I prefer drag n drop because I can just add class names to modules/groups in the drag n drop and get a site 80% of the way. I haven’t done it just yet, but I plan to one day build a whole html email template as a custom module - I want to have control of the html and let the marketers have a basic flex column like system in the emails."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-13 06:41:00",
    "text": "I do use coded templates for some more complex stuff, like routing in different drag n drop templates based on query parameters. It’s just not common"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-04-13 07:05:17",
    "text": "We almost exclusively build in Coded templates with interface elements / settings exposed via custom modules / tags in the Blog Post / Landing Page / Website page Edit view."
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-04-13 07:06:50",
    "text": "It's easier for our flow to have the (mostly non-HubSpot/Hubl) developers build out the HTML/CSS/JS in their flows and have our internal \"integration\" team make the code dynamic and function properly within HubSpot as re-usable \"chunks\" and \"modules\""
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-13 07:18:30",
    "edited": {
      "time_stamp": "2018-04-13 07:19:47"
    },
    "text": "not sure I’m fully understanding your question but maybe this will answer it:\n\nIf you went this method, all clicks to the CTA would look like they were going to the “routing page”. You would not know which page/site people were redirected to.\n\nYou theoretically would see in the referrers for the page the user actually ends up on, the routing page.\n\nIf you need to track those analytics it’s probably worthwhile looking for a tool like this out there. It’s such a simple idea, I’m certain there’s a service that does it."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-04-13 07:37:13",
    "text": "We build everything into custom modules so that we can pull them into multiple templates easily and every custom module has its own scss partial."
  },
  null,
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-13 11:30:27",
    "edited": {
      "time_stamp": "2018-04-13 11:30:29"
    },
    "text": "oh, you’re asking where that text is coming from?"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-13 11:32:33",
    "text": "“MAKE THIS DYNAMIC VIA JAVSCRIPT” is in the meta description of the page settings. It has been replaced with “Place | Property For Sale” in the latest version, but that version has not been published yet."
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2018-04-13 12:52:19",
    "text": "Is anyone else having trouble with HubSpot FTP today? I can connect, but it's not uploading any of my files"
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2018-04-13 12:52:35",
    "text": "I've used it plenty of times before and it's usually fine"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-04-13 12:53:15",
    "text": "Working for me"
  },
  {
    "poster": {
      "poster_name": "Josh Ames",
      "poster_handle": "josh.ames"
    },
    "time_stamp": "2018-04-13 13:43:50",
    "text": "Are there any issues with hosting today? I've noticed both websites hosted on HubSpot and just moving around inside HubSpot portals, things are loading slowly."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-13 14:00:05",
    "text": "Not seeing that issue personally. HS Status doesn’t seem to mention it <https://status.HubSpot.com/>"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-04-13 15:30:01",
    "text": "I was seeing login issues and stylesheet wonkiness earlier, but all appears normal now"
  },
  {
    "poster": {
      "poster_name": "Anthony Hook",
      "poster_handle": "ant"
    },
    "time_stamp": "2018-04-13 21:07:48",
    "text": "Thanks for the pointer on that. Good catch! It would be mighty great if I could have explicit control of those tags please..."
  },
  {
    "poster": {
      "poster_name": "Anthony Hook",
      "poster_handle": "ant"
    },
    "time_stamp": "2018-04-13 21:08:36",
    "text": "Yep, that confirms my approach! Thank you, will look to using the CTA's to track the click but pass out to analytics for the context."
  }
]