[
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2019-04-29 07:27:15",
    "text": "We’ve had a lot of problems with embeding videos in Rich text lately. Especially from Wistia with a responsive option set. It will not render on a page preview or live."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-29 07:27:47",
    "text": "I second the lots of problems with wistia videos due to the HubL video tag"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2019-04-29 07:29:13",
    "text": "We can only do fixed width embeds and avoid the popup altogether at present."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-29 07:29:46",
    "text": "I get the team’s reasoning for making a HubL tag for it, I just think it’s going to be a maintennance nightmare for them because they’re going to have to add a heck of a lot of properties and handle a lot of edge cases.\n\nlike 1 client wanted to use a button to trigger the wistia modal video, it was a disaster because we had no control over the button, the HubL tag changed it to look like a basic link. and we couldn’t style it"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2019-04-29 07:30:22",
    "text": "THIS :point_up_2:"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2019-04-29 07:31:34",
    "text": "The way I’ve been getting around things has also been through custom modules because even the free HTML Module is not handling the video embeds well from Wistia either."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-29 07:32:38",
    "text": "eek, yeah. I  think what I ended up doing was using magnific instead for the popups"
  },
  {
    "poster": {
      "poster_name": "Evan Futterman",
      "poster_handle": "evan"
    },
    "time_stamp": "2019-04-29 15:08:17",
    "text": "With HubSpot branded domains, everything seems to be separated except for email unsubscribe and other email system pages. All of the subscriptions are lumped together and the user is taken to whatever the main domain is. This is a terrible user experience and very confusing to subscribers. Has anybody found a work around for this?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-04-29 17:49:43"
      },
      {
        "time_stamp": "2019-04-29 20:55:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-04-29 17:49:43",
    "text": "Hey <@UAJ6ANLMU> The good news is, work is underway to address this. Bad news is, it’s not ready yet and will be a bit for it is.  A workaround I’ve used in the past is to build a simple landing page for each brand domain that has an iframe in it and that’s it. The source of that iframe will be the actual subscription url.  In each email template for each brand domain, you move the subscription preferences URL to to a query param and the link to the landing page that has the iframe in it. That would looks something like this `<http://www.mybranddomain.com/email-preferences?iframeUrl={{unsubscribe_link}}|www.mybranddomain.com/email-preferences?iframeUrl={{unsubscribe_link}}>`. Then you can have JS on that page to filter out the irrelevant subscriptions.  This is a bit risky as you could accidentally filter out something the user wants to unsubscribe from, but it it can work if you are careful enough."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-04-29 18:01:07",
    "text": "Quick question re: blog authors. What is the best way to add dynamic job titles? is this a job for hubdb?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-04-30 07:04:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evan Futterman",
      "poster_handle": "evan"
    },
    "time_stamp": "2019-04-29 20:55:23",
    "text": "Thank you"
  },
  {
    "poster": {
      "poster_name": "Hassan Zia",
      "poster_handle": "hassan"
    },
    "time_stamp": "2019-04-30 00:09:33",
    "text": "Hi Quick question. I've setup Chatbot for meeting link. when meeting is booked i want to switch chat to live chat. So once meeting is booked, it should say \"Your meeting has been booked, do you have any more questions?\" and whatever user types it should move to a live chat. is that possible?"
  }
]