[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2019-07-04 02:51:36",
    "text": "Can you just use the hubl personalisation tokens on the thank you page? if you add some hidden elements with the personalisation tokes in, and then grab them from there with your JS?\n\nAlso no idea if this will work but the redirect URL is in the value field of the hidden input with named “hs_context” in the big list of JSON, I don’t know if editing it in there would sort out you’re problem",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-07-04 11:05:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marco",
      "poster_handle": "mbevacqua"
    },
    "time_stamp": "2019-07-04 03:35:35",
    "edited": {
      "time_stamp": "2019-07-04 03:35:48"
    },
    "text": "We are working on an updated version of the forms script that will render accessible forms.\nOnce we'll have a stable enough version of it we'll share it with beta customers that are interested in the feature."
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-07-04 03:53:03",
    "text": "To my knowledge you can’t even adjust .htaccess with regards to a HubSpot site, I have however found that a sitemap alluding to non-www links and this domain not being correctly might mean google either see’s it as duplicate or something to auto exclude it but lurking to find more sadly."
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-07-04 04:22:02",
    "text": "Hi does anyone know of something on the market (or built-in if i’ve missed something?) to strip custom module css and minify into a single file to reduce the number of requests?"
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-07-04 05:26:19",
    "text": "Hi Community,\n\nWhen using webhooks api here:<https://developers.HubSpot.com/docs/methods/webhooks/webhooks-overview> how do you get multiple properties to be sent to a url?For example I have it set so lifecycle stage becomes customer sends to another CRM but not sure how to pass the other relevant information for a contact(email, phone number, address,)",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-04 06:40:31"
      },
      {
        "time_stamp": "2019-07-04 06:56:55"
      },
      {
        "time_stamp": "2019-07-04 06:59:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-07-04 05:42:33",
    "text": "Wouldn't be within HubSpot. Was thinking on the root domain if an htaccess file was added. It was a stretch of an idea I know, but that is the only other place I could think"
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2019-07-04 06:40:31",
    "text": "<@UEZJ74UN8> if you create a contact webhook, it will have the contact detail, have you checked the webhook data, or can you please share how you are doing it ?"
  },
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-07-04 06:56:55",
    "text": "*Using Webhook Subscription not webhooks from in workflows\nStep 1 I created a subscription if contact becomes customer then send this information in the webhook url\nStep 2:I changed a contact to customer\nStep 3:I viewed the webhook url and notice it does not show email, phone number"
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2019-07-04 06:59:40",
    "text": "Yes <@UEZJ74UN8> i was supposing webhooks from workflows."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2019-07-04 10:52:02",
    "text": "Not sure which channel this should go in - anyone know why the subscription type \"Marketing Information\" would keep activating itself? We have one we created as are using, so we don't need Marketing Information and it seems to turn on itself after making it inactive..."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2019-07-04 11:05:45",
    "text": "Hey Matt! Thanks for the reply. The thank you page is on a non-HubSpot site so personalization tokens and the JSON don’t exist there. I ended up just manually redirecting the page using the onFormSubmit() function."
  }
]