[
  {
    "poster": {
      "poster_name": "Brendan Gilbert",
      "poster_handle": "brendan251"
    },
    "time_stamp": "2019-07-25 07:17:52",
    "text": ":+1:"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-07-25 08:08:08",
    "text": "is this the correct way to create a HubSpot date field for a custom form?"
  },
  {
    "text": "",
    "time_stamp": "2019-07-25 08:08:18"
  },
  {
    "poster": {
      "poster_name": "Adam Shrum",
      "poster_handle": "adam043"
    },
    "time_stamp": "2019-07-25 08:38:36",
    "text": "So, here's a bug for you HubSpot Dev's. Even though I'm setup as an Admin to manage Users I can't give myself Write access.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-25 08:42:37"
      },
      {
        "time_stamp": "2019-07-25 11:54:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-25 08:42:37",
    "text": "that may not be a bug, that might be a security feature. Many CMS platforms don’t allow a user who has the ability to modify other users, to give any user, including themself abilities that they themself don’t have."
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2019-07-25 08:56:32",
    "text": "Hey! So sorry I've been away."
  },
  {
    "poster": {
      "poster_name": "Florian",
      "poster_handle": "florian.ristl"
    },
    "time_stamp": "2019-07-25 10:12:55",
    "text": "Hi, when I change the name of images, which are already in use on some pages, in files. How can I assure that the new names are used on those pages? Only by manually changing the image one by one? Or is there an automated way?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-25 10:14:37"
      },
      {
        "time_stamp": "2019-07-25 10:22:20"
      },
      {
        "time_stamp": "2019-07-25 10:27:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-25 10:14:37",
    "text": "If the image is linked to using a an image field the image will auto update.\n\nI think HS also replaces references to the old image url in css files as well, or atleast adds a redirect to the new image url. I’m not 100% on that."
  },
  {
    "poster": {
      "poster_name": "Florian",
      "poster_handle": "florian.ristl"
    },
    "time_stamp": "2019-07-25 10:22:20",
    "text": "Thanks for you fast reply :slightly_smiling_face: How can I check if my images are using an image field? My website was migrated by HubSpot and I changed the naming of the images afterwards (in files) but none of them seem to be updated automatically. They all use the old naming and links. I don't fully understand why the old links still work tbh. Shouldn't they at least be redirected?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-25 10:27:32",
    "text": "regarding the redirect - if the images are redirected, you would not see different  `src`’s in the page you would still see the old one. If they replace them that’s a different story.\n\nBy image field Is  - if the image is set using by picking an image in a module’s field. IE.  not hardcoded into the page."
  },
  {
    "poster": {
      "poster_name": "Adam Shrum",
      "poster_handle": "adam043"
    },
    "time_stamp": "2019-07-25 11:54:05",
    "text": "Debatable, but ok thanks for the response"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2019-07-25 12:50:13",
    "edited": {
      "time_stamp": "2019-07-25 12:51:02"
    },
    "text": "Reminder if you are planning on coming(or even attending online) we have a quick survey for you, which will help us create a better event. If you are interested in presenting or volunteering please voice your interest in the survey! *THIS IS NOT THE FORM TO RSVP FOR THE EVENT.*\n<https://forms.gle/BjUgDg25JSxkmz5c7>"
  },
  {
    "poster": {
      "poster_name": "Adam Shrum",
      "poster_handle": "adam043"
    },
    "time_stamp": "2019-07-25 14:35:49",
    "text": "Can someone give me some guidance on how to get started with Shopping Cart Abandonment Emails if our site is not on an ecommerce platform like Shopify? Our company has the Professional Marketing Hub plan only (No Sales Hub). I'm having a hard time finding a template for a pre-built shopping cart abandonment workflow... does this exist out of the box?"
  },
  {
    "poster": {
      "poster_name": "CalypsoNick",
      "poster_handle": "nick585"
    },
    "time_stamp": "2019-07-25 16:12:46",
    "text": "Hi All, question about Lazy loading images.  usually I use a script that requires the image src be left blank and a data-src tag be used instead, which isn't an issue until I have a linked_image widget. normally the template code is just {% linked_image \"linked_image\" %} so the src is set there, I'm wondering if there is a common way to break the fields out of the linked_image and if so how would I wrap it in an if link is set as sometimes the link wouldn't be set.  Alternatively does anyone have a better lazyloading script that works with HS CMS out of box?"
  }
]