[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-10-24 03:35:50",
    "text": "Note: when I do this from a private app using serverless functions it exits without error.  So I am guessing it doesn't like something about my backend with a public app"
  },
  {
    "text": "I’ve looked around but haven’t seen this specific functionality - is there a method to force a refresh of a Sidebar card that displays Associated Objects (that isn’t part of a Custom Extension we’ve built)?\n\nExample use case:\n• We have a pair of custom Objects - Staff Profile,  and Staff Assignments.  \n• Each staff member’s Contact is associated to one Staff Profile record\n    ◦ the Staff Profile is associated to 0 to many Staff Assignment records \n    ◦ Each Staff Assignment is associated to one (and only one) Company record that represents a client\n• We didn’t want to rely on users setting up the associations for all these objects correctly (and for copying certain field values across objects), so we made an Extension that can handle creating objects and making associations that sits on a Staff Profile Record Tab. \nIssue:\n• when the custom extension manages the associated Staff Assignments, the card on the right gets out of sync\nQuestions:\n• Is it possible to force a refresh of a sidebar card that is either default or created by an admin through the ui (either by card name or through the associated object type)? \n• If we make a custom Extension and place it on the sidebar, could we call out to that to refresh (and hide the default card)?  \nif none of this is possible currently,  we wil just hide the card to avoid things being out of sync - but I figured it’d be good to know if that’s an option.\n\nAm I barking up the wrong tree?",
    "time_stamp": "2024-10-24 08:07:34",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-24 11:16:10"
      },
      {
        "time_stamp": "2024-10-24 12:20:58"
      },
      {
        "time_stamp": "2024-10-31 02:52:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Huanling Lai",
      "poster_handle": "huanling"
    },
    "time_stamp": "2024-10-24 08:10:49",
    "text": "*Feature Request/Idea* :bulb:\nIt would be great if the `crmPropertyList` in the UI extension card had a tooltip feature. When users hover over the property, a tooltip could display the property description for better clarity and usability."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-10-24 09:24:10",
    "edited": {
      "time_stamp": "2024-10-24 09:34:23"
    },
    "text": ":speaker: :warning: *Additional scope check needs for UI extensions for private apps*\nWe added additional scope checks for UI extensions for private apps to render cards on the record page based on your `objectType` configuration. Your app needs at least the read scopes for the card to render on that object. We will start warning you about uploading your projects from today, and your project uploads will start failing after November without the right scopes. Your deployed cards will continue working as expected."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-10-24 11:16:10",
    "text": "You could build a custom right side bar card and refresh the data when a property on the primary record changes (like number of associated assignments) but you can't force a refresh on a default card unfortunately"
  },
  {
    "poster": {
      "poster_name": "Aj Dellicicchi",
      "poster_handle": "aj"
    },
    "time_stamp": "2024-10-24 12:20:58",
    "text": "Thank you for confirming <@U01QVR44MEY> that’s a great approach, I forgot we had a calculated field rolling up the associations so I can key off of that. \n:blush: "
  }
]