[
  {
    "poster": {
      "poster_name": "Richard Davies",
      "poster_handle": "richard512"
    },
    "time_stamp": "2024-10-16 03:45:30",
    "text": "I am also interested in hearing how others are handling this situation.\n\nWe are going to start building our own public app shortly, and any suggestions on how to manage environments that allow multiple engineers and QA to work on a project simultaneously would be insightful."
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-10-16 08:05:20",
    "text": "I mentioned this to Jonny in the other thread, but at the moment we do not have support for multiple apps to be deployed separately as part of the same project. If you use GitHub for source code management, you could use separate integrations for multiple long-running feature branches that contain differences between environments and would be deployed when new commits are merged.\n\nFor now, we recommend that most customers who want to share code between apps but have more complicated testing and deployment configurations rely on CI/CD tools to manage these processes.\n\n<https://HubSpotdev.slack.com/archives/C05R599UA12/p1728508759794849?thread_ts=1728395371.238569&amp;cid=C05R599UA12>"
  },
  {
    "poster": {
      "poster_name": "Lew Talon",
      "poster_handle": "ltalon"
    },
    "time_stamp": "2024-10-16 11:29:07",
    "text": "I think the custom cards are a great use for this and even more interactive playbooks (answer questions, have conditional logic, integrate with external data, etc.) \n\nWe’ve built playbooks using the UI extensions and it works really well. It’s much more flexible and connects more easily with other parts of HubSpot or external applications."
  },
  {
    "poster": {
      "poster_name": "Brandon Williams",
      "poster_handle": "brandon.williams"
    },
    "time_stamp": "2024-10-16 20:33:50",
    "text": "",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-14 13:06:11"
      }
    ]
  }
]