[
  {
    "poster": {
      "poster_name": "Casper Kraken (HubDo)",
      "poster_handle": "casper928"
    },
    "time_stamp": "2024-10-29 02:43:40",
    "text": "I hope :pray:"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-10-29 03:39:33",
    "text": "Thank you <@U04HLBUT9QC> and <@U01NMMDTERZ> I was able to work with my IT team and get this resolved!"
  },
  {
    "poster": {
      "poster_name": "Kiara Munz",
      "poster_handle": "kimunz"
    },
    "time_stamp": "2024-10-29 05:23:42",
    "text": "It is not currently possible to add custom cards to UIE, but I would love to hear what you are trying to build to bring it to the team! We have interest in enabling UIE cards for the prospecting workspace!"
  },
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-29 08:57:59",
    "text": "Hi!\nIs there any way to use button to launch a Workflow or when it's clicked it change a specific value?",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-29 09:30:01"
      },
      {
        "time_stamp": "2024-10-29 09:30:23"
      },
      {
        "time_stamp": "2024-10-29 09:32:55"
      },
      {
        "time_stamp": "2024-10-29 09:37:05"
      },
      {
        "time_stamp": "2024-10-29 09:39:03"
      },
      {
        "time_stamp": "2024-10-29 09:39:26"
      },
      {
        "time_stamp": "2024-10-29 09:39:59"
      },
      {
        "time_stamp": "2024-10-29 09:40:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luca Bartoli",
      "poster_handle": "bartoli"
    },
    "time_stamp": "2024-10-29 09:08:10",
    "text": "Hi everyone!\nI'm using a public app, trying to use fetch for creating a line item for a deal.\nFirst of all, I can't find anything about authenticating these calls (is it done behind the scenes?)\nSecondly, I get a 500 error (and no log are shown in the ui extension monitoring).\nWhat am I missing?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-29 09:20:23"
      },
      {
        "time_stamp": "2024-10-29 09:41:30"
      },
      {
        "time_stamp": "2024-10-29 09:52:29"
      },
      {
        "time_stamp": "2024-11-14 13:19:45"
      },
      {
        "time_stamp": "2024-11-15 04:03:08"
      },
      {
        "time_stamp": "2024-11-15 04:05:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:16:54",
    "text": "Hi, we are developing a public app with UI extensions. Perhaps I missed it, but I haven’t seen any tips about this in the documentation. In a private app, I can send requests to the HubSpot API using the provided access token in the serverless functions. In public apps, their own backend handles these HubSpot API calls.\nThis is my current solution to that: The backend of the public app stores the refresh token during the initial OAuth login per account. All UI extension requests coming from this account will then use access tokens provided by this refresh token to interact with the HubSpot API. Is this considered best practice, or is there a better approach?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-29 14:08:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:20:23",
    "edited": {
      "time_stamp": "2024-10-29 09:20:58"
    },
    "text": "You can't access the HubSpot API directly from the frontend code. You use the HubSpot.fetch() function to call your own public app backend to let it call the HubSpot API. To do that, you need an access token in your public app backend. I am not sure, if my solution is best practice, but maybe it helps, if you look at the question I just posted. :wink:"
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:30:01",
    "edited": {
      "time_stamp": "2024-10-29 09:41:42"
    },
    "text": "I guess the way to go here is to use an onClick trigger on the button or use a form submit to call a function in your Javascript code. There you use the HubSpot.fetch() function to call your backend, which then triggers the workflow using the HubSpot API. I don't know much about the workflow feature, but I guess, it should work like that.\nEDIT: This is the way for a public app. As this question was about a private app, see below for the right way."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-10-29 09:30:23",
    "text": "Yes, and I have done this myself.\n\nHave a button which onclick makes an API call to the old workflows api (enrol contact in workflow) using the contact email address.\n\nUnfortunately this only works for enrolling contacts.\n\nFor other objects, onclick it changes a specific property to a specific value, which is the trigger for a workflow. I usually have the last step of the workflow to clear that property so the button can be used over and over as needed and the workflow trigger still works."
  },
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-29 09:32:55",
    "text": "Thanks, have you some documentation or links to get more info?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-10-29 09:37:05",
    "text": "Yes sorry, that would have been helpful of me :melting_face:\n\n<https://developers.HubSpot.com/beta-docs/reference/api/automation/create-manage-workflows/v2#enroll-a-contact-into-a-workflow?uuid=dc23fd11-8a2f-45c7-bad6-d93d911ba207|https://developers.HubSpot.com/beta-docs/reference/api/automation/create-manage-workflows/v2#enroll-a-contact-into-a-wo[…]a2f-45c7-bad6-d93d911ba207>\nThis is the guidance on the 'enrol contact in workflow'.\n\nAs for the button, this should be part of the main UI extensions guidance: <https://developers.HubSpot.com/beta-docs/reference/ui-components/standard-components/button>\n\nIn my scenario I have my normal react card file with the button - making a call to a serverless function onclick, which passes the email as a parameter, and that serverless function makes the API call to the workflow endpoint in the first link above, and calls back a success message in an alert!"
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:39:03",
    "text": "Are you developing a private or a public app?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-10-29 09:39:26",
    "edited": {
      "time_stamp": "2024-10-29 09:40:03"
    },
    "text": "Mine is within a private app (edited to add : sorry realised that may not have been for me, and may have been for Pietro - but hopefulyl helpful incase that changes the use case!)"
  },
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-29 09:39:59",
    "text": "Thanks <@U06H94JKK1P>.\n<@U07RS65ADU7> I'm developing a private app."
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:40:29",
    "text": "Ah, ok, thanks, then ignore my reply above."
  },
  {
    "poster": {
      "poster_name": "Luca Bartoli",
      "poster_handle": "bartoli"
    },
    "time_stamp": "2024-10-29 09:41:30",
    "edited": {
      "time_stamp": "2024-10-29 09:43:12"
    },
    "text": "Makes sense, but in private apps this is possible and this seems like a regression. I understand why it could possibly be like that, but the entire thing is about being able to extend and interact with HubSpot (and external data) without a middleware.\nHaving to proxy all HS to HS requests seems a bit odd.\n\nMoreover, the default public app project contains \"<https://api.hubapi.com>\" in the allowed urls. Why did they added in the example if there is no way of calling HubSpot directly?\nThis is why i thought i was missing something, in the first place\n\nThat said, we have no issues in creating middlewares, but I want to understand if this is still needed by design"
  },
  {
    "poster": {
      "poster_name": "Hannes Korte",
      "poster_handle": "hannes.korte"
    },
    "time_stamp": "2024-10-29 09:52:29",
    "text": "It seems we both have essentially the same question. :slightly_smiling_face:\nI believe the fetch proxy is necessary to avoid using long-term secrets in the frontend for authenticating requests. This approach allows for different handling of frontend-backend authentication. The HubSpot backend proxy can then add the app's client secret to authenticate requests against the external app backend.\nYou are right, it’s odd that `<http://api.HubSpot.com|api.HubSpot.com>` is set as the default allowed URL, especially since it's the only one which must never be set there. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-10-29 11:25:49",
    "text": "Got it, thanks for sharing. While we don't have an official recommendation for this and we're working on it - one idea is that you can transfer images by encoding them to a base64 string, and send that using `hs.fetch()` . There are downsides to this approach, but wondering if that works for you."
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-10-29 11:35:22",
    "text": "Hello, hello:corgi-wave:\nWanted to pick y’alls brain about designing App Cards. We’ve been toying with the idea of providing Design Patterns for App cards. This would essentially be guidance on how to put UI Components together in best HubSpot practices. Example: What are HubSpot forms supposed to look like, what’s our recommended format of empty states, etc.\n\nA couple quick questio\n1. Would something like this be helpful? Why?\n2. What is your preferred format for these patterns? For eg: Figma, code, Storybook, written guidelines, anything else?\n3. What are some design questions you've had when creating app cards? This could be anything you wished you had more of an opinion on.\nHappy to <https://www.HubSpot.com/meetings/aanchal-sheth/11-meeting-link|schedule a call> and talk more if that’s easier. Excited to hear your thoughts :slightly_smiling_face: :thank-you:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-30 15:35:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Connor McPherson",
      "poster_handle": "connor376"
    },
    "time_stamp": "2024-10-29 12:39:27",
    "text": "Potentially. We'll look into it. If you do add new features to HubSpot to support images, where can I go to get update announcements on that?"
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-10-29 12:40:55",
    "text": "We generally have all major updates in the product notifications in the HubSpot app, in addition to in the docs."
  },
  {
    "poster": {
      "poster_name": "Rishav Paul",
      "poster_handle": "rpaul"
    },
    "time_stamp": "2024-10-29 14:08:09",
    "text": "This is the right approach"
  },
  {
    "poster": {
      "poster_name": "Leandro Michelena",
      "poster_handle": "leandro.michelena"
    },
    "time_stamp": "2024-10-29 14:32:20",
    "text": "<@U03FJQPSC0Y> we bumped into this same wall today and noticed that, although it works in local development, importing functions from a helper or utils folder is not possible in production. Please keep us posted if you have any updates on this :slightly_smiling_face:"
  }
]