[
  {
    "poster": {
      "poster_name": "Magnus Foldager",
      "poster_handle": "magnus"
    },
    "time_stamp": "2024-10-08 01:05:13",
    "text": "We’d also love to add our own logo even for Private Projects :wink:"
  },
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-08 04:02:27",
    "text": "Hi Cristobal, I've value and label but I cannot show in custom card"
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-08 07:49:31",
    "text": "Hello everyone :wave:\n\nAt our company we have separate public apps for each environment (Dev, Staging and Production). Is there a way to share UI extension cards across different apps? I want to develop the UI extension card in the Dev app, then use the same card component in the Staging app without copying/pasting the components. Is it possible via CLI?\n<@U05KNCMAE7N> was told you might be able to help.",
    "reply_count": 14,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-08 07:59:31"
      },
      {
        "time_stamp": "2024-10-08 08:03:10"
      },
      {
        "time_stamp": "2024-10-08 08:04:50"
      },
      {
        "time_stamp": "2024-10-08 09:29:45"
      },
      {
        "time_stamp": "2024-10-09 14:44:46"
      },
      {
        "time_stamp": "2024-10-09 14:52:38"
      },
      {
        "time_stamp": "2024-10-09 14:57:53"
      },
      {
        "time_stamp": "2024-10-09 14:59:10"
      },
      {
        "time_stamp": "2024-10-09 15:00:47"
      },
      {
        "time_stamp": "2024-10-09 15:03:18"
      },
      {
        "time_stamp": "2024-10-09 15:09:23"
      },
      {
        "time_stamp": "2024-10-09 15:11:29"
      },
      {
        "time_stamp": "2024-10-09 15:19:19"
      },
      {
        "time_stamp": "2024-10-10 08:07:40"
      }
    ]
  },
  {
    "text": "Good morning!\n\nI have a question about the HubSpot UI extension.\n\nI am developing an integration with a third-party tool, and for the user to use this integration, it is necessary to go through the login process. This process involves obtaining an access token through basic authentication credentials. So far, everything is working correctly. However, I need to store the access token on the client side so that the user doesn't have to go through the login process again.\n\nUnfortunately, when trying to use as many cookies as localStorage, I am experiencing errors stating that both objects are not configured.\n\nMy question is: I really can't store cookies or save something in localStorage? Is there any alternative to get around this limitation?",
    "time_stamp": "2024-10-08 07:55:55",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-08 09:30:02"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-10-08 07:56:36",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-08 08:26:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-10-08 07:59:31",
    "text": "Hi Jonny,\nIf I'm understanding correctly, you'd like to share the UI of your card across different apps is that right? Can you tell me why you have separate public apps for each environment?"
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-08 08:03:10",
    "edited": {
      "time_stamp": "2024-10-08 08:24:31"
    },
    "text": "It is an existing app that didn't have any UI extensions. Not entirely sure how it came to be this way. But the development version of our HubSpot application connects to the Dev version of our app (Grain), the staging version of our HS app connects to the Staging version of our app and so on."
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-08 08:04:50",
    "edited": {
      "time_stamp": "2024-10-08 08:25:06"
    },
    "text": "One alternative that we are exploring is to connect all 3 HubSpot apps, to the same GitHub repo, and associate each HS app to a different branch. In theory this could work with some work, but wanted to exhaust the options before going that route."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-10-08 08:21:20",
    "text": "Thanks! We haven't yet added logos for the new apps built with projects, however, we did add that into footer. I'm curious to know what sort of logos would you want to add to the footer, and what would you get out of it, specially for private apps?"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-10-08 08:21:54",
    "text": "<@U03QW1MF3S6> not yet, although this is on the radar for the team."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-10-08 08:26:27",
    "text": "unfortunately not yet. <https://HubSpotdev.slack.com/archives/C05R599UA12/p1728288777034909>"
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-08 08:55:58",
    "text": "<@U9SDG59T7> I have a similar problem and can give you some context why we want to have multiple apps in the same project.\nOur application (Grain) connects to HubSpot to sync some CRM data from HS to our app. We have this integration for many years now and we've created different public apps in HS for each environment we have (Dev, Staging and Prod). These different HS apps allows us to authenticate with different environments using different redirect URLs.\nNow, we need to develop UI extensions and we want to use the same public app we use to sync info. I started migrating these apps from HS to use Project so I can develop new UI Extensions for them.\nBut, I'm having a hard time migrating all these app into the same project, and also ensure they share the same extensions, since they are basically the same app for different environments.\nAre there any alternatives to solve these issues?"
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-08 09:29:45",
    "text": "I've found a thread where a similar question was asked. So I posted a question there with a bit more context and explanation: <https://HubSpotdev.slack.com/archives/C05R599UA12/p1728399358594949?thread_ts=1696501195.546149&amp;cid=C05R599UA12>"
  },
  {
    "poster": {
      "poster_name": "Randy Segura",
      "poster_handle": "rsegura"
    },
    "time_stamp": "2024-10-08 09:30:02",
    "text": "Hi Hyago, Extensions don't have access to the DOM thus you cannot use localStorage nor Cookies. If you need values to persist, you have to store them somewhere else.\n\nThat being said, I'll take this issue to the team to see if there is anything we can do about in the future"
  },
  {
    "text": ":mega::mega::mega: NEW components hot off the press:bar_chart::chart_with_upwards_trend:\n\n*What's new*:question:We're very excited to introduce our newest *Chart* components. We have two kinds of charts: `LineChart` and `BarChart` (screenshots below). These components help visualize 3rd party data to give your customer a view of their data.\n\n*Why* :question: Today’s world is a data-driven one. Decision makers want insights that they can present quickly and effectively. Charts help synthesize data and view patterns and themes at a glance.\n\n*How* to use them:question: \n• Here are the docs for <https://developers.HubSpot.com/beta-docs/reference/ui-components/standard-components/charts/line-chart|LineChart> and <https://developers.HubSpot.com/beta-docs/reference/ui-components/standard-components/charts/bar-chart|BarChart>. Here is a <https://developers.HubSpot.com/beta-docs/reference/ui-components/standard-components/charts/overview|general overview of Charts>. \n• Dive in with ease with our <https://www.youtube.com/watch?v=5P6WuKyOiDE|YouTube tutorial> to set up Charts:video_camera: \n• Stay tuned - Charts sample project and an asset for Figma is coming soon too\n _P.S: remember to update your npm package to get access to this component. These components are available for public and private UI Extensions._\n\nWe hear you loud and clear about wanting data at a glance and we want you to have tools to make app cards engaging and HubSpot-like. Please do leave any feedback in the thread, or <https://HubSpot.com/meetings/aanchal-sheth/11-meeting-link|schedule a meeting>. We'd love to know your thoughts:star-struck::thank-you:",
    "time_stamp": "2024-10-08 13:35:24",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-21 08:53:26"
      }
    ]
  }
]