[
  {
    "poster": {
      "poster_name": "Stefan Jaeger",
      "poster_handle": "stefanjaeger8305"
    },
    "time_stamp": "2024-10-16 04:37:41",
    "text": "have u looked at the right phone field? we have phone, mobile_phone and company phone"
  },
  {
    "poster": {
      "poster_name": "Mitchell Dodell",
      "poster_handle": "mdodell"
    },
    "time_stamp": "2024-10-16 07:46:36",
    "text": "Hey <@U07QUBNKBCN> - which APIs are you trying to call? Private apps are not supported in developer accounts, so you would need to create a test account as Joe mentioned above.\n\nHowever, test accounts are not true CRM portals and are meant for testing purposes - if you're trying to make API calls for your business use case via a private app, I would recommend creating a standard HubSpot account."
  },
  {
    "poster": {
      "poster_name": "John Mendelewski",
      "poster_handle": "jmendelewski"
    },
    "time_stamp": "2024-10-16 07:46:40",
    "edited": {
      "time_stamp": "2024-10-16 07:47:04"
    },
    "text": "Hi. As you’ve probably figured out, this isn’t currently possible. Within a single project, all the code builds and deploys together. So the only solution we offer for your use case of 2 apps on distinct release cycles is 2 distinct projects.\n\nWe’re interested in understanding how you are thinking about projects and applications.\n\nIdeally, what does a project represent to you? What would having the 2 apps in one project help with or allow, given you want differing release cycles?"
  },
  {
    "poster": {
      "poster_name": "Jonny Andreola",
      "poster_handle": "jonny.andreola"
    },
    "time_stamp": "2024-10-16 08:13:39",
    "text": "Having multiple apps in one project would allow for simpler CI/CD automations. Because I could link one GitHub repo to a project, build that project with 2 apps inside. Deploy that staging app (independently from prod app), run some tests and once I'm good with testing, I would deploy the production app. To me that would be ideal.\nBut currently what I'm doing is to have CI automation to move files around to build/deploy separate projects. So when I push to `develop` CI will ensure the hsproject.json is the one for the dev project, it copies my `extensions` folder, runs `hs project upload &amp;&amp; hs project deploy`. If I push to `staging` branch, it does a similar thing."
  }
]