[
  {
    "poster": {
      "poster_name": "Matt Avero-Sturm",
      "poster_handle": "matt.avero.sturm"
    },
    "time_stamp": "2024-11-19 08:24:06",
    "text": "Hello! I posted a little while ago about this and now I'm actively looking for support, ideally available very soon.\n\nI run Next Stage Consulting, a small consulting business supporting mostly Series A &amp; Series B B2B tech companies. We help them with revops, marketing ops, sales ops, cs ops, and lots of HubSpot. We also support SEO, design, web, paid, etc.\n\nI'm looking for someone who can help me scale the HubSpot and revops / marketing ops / sales ops side of things. Looking for about 15 hrs/week of support now and with the ability to scale up to 20-30 hrs/week. Ideally available to start immediately.\n\nPurely looking for contractor support - this is not full-time or part-time employment: you are your own business, set your own hours, BYO device, pay your own taxes, etc. Fully remote, *must be US and Canada*. Prefer native English speaker or advanced American business English fluency.\n\nLooking for someone who is:\n• US or Canada-based only\n• Excellent written and verbal communicator\n• Excellent with project management and organization\n• Excellent at HubSpot\n• Familiar with basics of revops / marketing ops\n• Familiar with and loves B2B early-stage startups. Our clients are mostly first heads of marketing, first heads of sales, and founders. Yes, there will be changes to projects and no, the right solution may not look like what is best practice for a 1000 person company.\n• Competitive rate (since Next Stage Consulting is an agency and needs the ability to bill on top of your rate)\nWe have great clients and this is an excellent learning opportunity - would love to hear any recommendations of who I should be talking with!\n\nIf you're interested - please fill out this short <https://forms.gle/ETiCrBQTBMAtS1Jr9|form> and I'll find time to talk in the next day or two. Looking forward to connecting!",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-11-19 08:38:29"
      },
      {
        "time_stamp": "2024-11-19 08:40:13"
      },
      {
        "time_stamp": "2024-11-24 18:45:04"
      },
      {
        "time_stamp": "2024-11-24 19:00:47"
      },
      {
        "time_stamp": "2024-11-24 19:37:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "David Sandel",
      "poster_handle": "david664"
    },
    "time_stamp": "2024-11-19 08:38:29",
    "text": "Hey, Matt. I’m sending you a quick question before filling out the form. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Matt Avero-Sturm",
      "poster_handle": "matt.avero.sturm"
    },
    "time_stamp": "2024-11-19 08:40:13",
    "text": "Great - yes, DM me, thanks!"
  }
]