[
  {
    "poster": {
      "poster_name": "Sigvart Andersen",
      "poster_handle": "sigvart"
    },
    "time_stamp": "2023-12-14 06:23:22",
    "text": ":warning: *Is poor page speed performance normal for system domains* when developing a new site?\n\nWill page speed be fixed when we connect primary domain and launch the new site? We noticed there are some errors with DNS and thought it could be the issue - but won't conclude before we have any insight from others.\n\nWe've disabled jquery, made scripts load async, minimized code, load scripts async and elements are cached and prerendered.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-12-14 12:24:43"
      },
      {
        "time_stamp": "2023-12-14 12:51:18"
      },
      {
        "time_stamp": "2023-12-14 12:55:58"
      },
      {
        "time_stamp": "2023-12-19 06:36:36"
      },
      {
        "time_stamp": "2023-12-19 06:37:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-12-14 12:24:43",
    "text": "What particular performance issues are you seeing? I don’t typically notice any degraded performance from the system-provided domains."
  },
  {
    "poster": {
      "poster_name": "Sigvart Andersen",
      "poster_handle": "sigvart"
    },
    "time_stamp": "2023-12-14 12:51:18",
    "text": "Seems like the defering of resources help performance a bit. The main problem seems to be that HubSpot servers seem plain slow, and there is really not much we can do about it, other than discuss with their support. Seems to average around 4-5s for TTFB (time to first byte) for most pages"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-12-14 12:55:58",
    "text": "That’s incredibly unusual. I’m not seeing it on any of my portals, so it’s likely regional or portal-specific — TTFB is sub-50ms on a few that I’ve checked. Possibly more Cloudflare weirdness? Either way, definitely sounds like something to discuss with support."
  }
]