[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-22 06:03:11",
    "text": "I would add the module to a website page and preview it using the regular page preview vs this preview. I don’t trust this preview.\n\nThat being said, the code you posted here has divs that aren’t being closed and looks incomplete, likely because you didn’t paste it all.\n\nI think a better way to look at this is to just remove all the noise. Right? Remove all the code that isn’t necessary. mimic your second loop after your first. Just print out he image url instead of the image.\n\nmake it basic, this way you can see what is going on. Don’t use swiper, don’t use a bunch of other things.\n\nIt is always best to build small iterations and test as you go. Don’t build the whole thing, then you don’t know what went wrong, and when."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-22 06:03:53",
    "text": "what is “However, I cannot get the information of the transaction.”\n\nWhat informaiton can’t you get, can you provide more details that explain what you can’t get?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-09-22 07:31:04",
    "edited": {
      "time_stamp": "2022-09-22 08:33:24"
    },
    "text": "I second what nich says, that preview won't take into account everything from different competing style/style sheets to components that have different types of margins that will affect this module."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-09-22 07:31:46",
    "text": "I think he means the deals"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-09-22 07:32:40",
    "text": "What type of value are you expecting on this line:\n```{% set deal = module.deal.properties %}```"
  },
  {
    "text": "Hello, I'm using Custom Objects to create dynamic pages in our CMS. I have added a Category field and a Sub-Category field to the Object. Can anyone instruct me on how to create a Tree view filter like this one on the listing page? Any help would be appreciated",
    "time_stamp": "2022-09-22 14:32:39",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-23 05:27:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "k.h",
      "poster_handle": "k-hayashi"
    },
    "time_stamp": "2022-09-22 19:21:13",
    "text": "<@U01QVR44MEY>\n\nThe objective is to build a My Page in the CMS membership page. To do this, we need to spit out the information from the CRM object and would like to know how to do this."
  }
]