[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-05 05:57:27",
    "text": "The language switcher default mode only shows when other language pages are available\n\nIt takes care of that for you"
  },
  {
    "poster": {
      "poster_name": "Milan Dodiya",
      "poster_handle": "dev.milandodiya"
    },
    "time_stamp": "2022-09-05 06:27:58",
    "text": "Okay <@U25PYL3Q8>\nThanks for the help. Let me try this way. Hope it'll work as we require :crossed_fingers:"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-09-05 09:40:04",
    "text": "Is there a way to access the HubSpot Subscription API within HubL without sending a key?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-09-05 17:28:14",
    "edited": {
      "time_stamp": "2022-09-05 17:28:51"
    },
    "text": "It looks like we can’t use macros in payload format, like `{% macro do_something ({ name, description, id }) %}`? `{% macro do_something (args) %}` seems to work, but not the former."
  },
  {
    "text": "Anyone know why I am getting this half the time? I have a form field in a module, and then I import a macro in the module.html file that renders the markup into a hidden div, and then I’m loading that module in the global base template, inside another hidden div. Again, it works about half the time…",
    "time_stamp": "2022-09-05 23:41:36",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-06 00:49:43"
      },
      {
        "time_stamp": "2022-09-08 23:39:16"
      },
      {
        "time_stamp": "2022-09-09 00:54:07"
      },
      {
        "time_stamp": "2022-09-09 06:56:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2022-09-06 00:44:56",
    "edited": {
      "time_stamp": "2022-09-06 00:45:15"
    },
    "text": "Hi all,\nI have a request from a customer asking me to display the number of views of blog articles. I have not found a solution in the blog documentation or in the blog API.\nAny ideas on how to respond to this request?\nThanks\n\nGiovanni",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-07 08:41:30"
      },
      {
        "time_stamp": "2022-09-08 23:41:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Miguel de la Rocha",
      "poster_handle": "miguel091"
    },
    "time_stamp": "2022-09-06 00:46:51",
    "text": "Hi guys, can anyone help here please?\n\nW we have a customer who we have created a custom Quote templete and have integrated with PandaDoc to create a simple invoice, that pulls data from  the quote and creates and invoice with contact details, company, line items.\n\nIt all works perfectly except for the discount and tax lines which does not get sent over to PandaDoc. This is a shame because the integration between PD and HS is fantastic.\n\nAfter a lot of testing it seems that the case is that the data is not retained at Product line item level (tax and discount)\n\nThis would mean rebuilding the very large product library, and in any case tax and discount for this customer is set at total level .\n\nThis invoicing solution is only a temporary workaround until they implement SAGE ERP\n\nI thought that if we could put the total, the discount and the tax values in HubSpot properties we can then map these to PandaDoc:.\n\nI thought that it may be possible to write a short piece of code to integrate as a module in the Quote template, rather than building an integration to solve this,\n\nHas anyone had an issue like this before, please share your experience!\n\nThank you, keep well\n\nMiguel",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-08 23:50:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-09-06 00:49:43",
    "edited": {
      "time_stamp": "2022-09-06 00:50:14"
    },
    "text": "Using the JS embed thing instead of the `{% form %}` tag seems to work every time."
  }
]