[
  {
    "poster": {
      "poster_name": "Shubhangi Pawar",
      "poster_handle": "oic_adap_team"
    },
    "time_stamp": "2022-01-11 02:53:14",
    "text": "I'm unable to create schemas through the Oauth API. The HubSpot API claims that I'm missing a required scope but doesn't mention which one it is. I'm only trying to create the schema on my app test account and the docs imply that this should work.\n\n The test account has the following products: \"Sales Enterprise\", \"Service Enterprise\", \"Marketing Enterprise\". Since they all have \"Enterprise\" in the name, they have access or not?\n\n\"App test accounts are free HubSpot accounts that include trials of many enterprise features.\"\n\n I'm guessing that these test accounts don't have access to custom objects. But if that's the case, how do any developers test this feature?\n Can you provide clarity her"
  },
  {
    "poster": {
      "poster_name": "Samer Daknache",
      "poster_handle": "samer.daknache"
    },
    "time_stamp": "2022-01-11 03:20:56",
    "text": "Hello! I am trying to add custom fields to product properties but it seems that feature requires an upgrade and I was wondering if it's possible to have it activated for development purposes?"
  },
  {
    "text": "trying to create or update records in custom module but getting error .please find attached screenshot for error",
    "time_stamp": "2022-01-11 05:38:33",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-11 07:32:14"
      },
      {
        "time_stamp": "2022-01-11 07:32:55"
      },
      {
        "time_stamp": "2022-01-11 21:49:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2022-01-11 07:32:14",
    "text": "what’s the system name of your object? “Member” is the user-friendly name. for example, an object called “Custom Object 1\" would probably have the system name custom_object_1"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2022-01-11 07:32:55",
    "text": "also, i think when i worked with custom objects, i had better results when i used the object ID number instead of the object name"
  },
  {
    "poster": {
      "poster_name": "Shubhangi Pawar",
      "poster_handle": "oic_adap_team"
    },
    "time_stamp": "2022-01-11 21:49:07",
    "text": "Thanks Melinda.I am able get records using fully qualified name or with object_type_id"
  }
]