[
  {
    "poster": {
      "poster_name": "fd",
      "poster_handle": "fuding"
    },
    "time_stamp": "2024-08-07 02:40:31",
    "text": "I tested it through the iOS simulator"
  },
  {
    "poster": {
      "poster_name": "fd",
      "poster_handle": "fuding"
    },
    "time_stamp": "2024-08-07 02:59:29",
    "text": "But I didn't receive any push notifications using TestFlight."
  },
  {
    "poster": {
      "poster_name": "Guy Riches",
      "poster_handle": "guy273"
    },
    "time_stamp": "2024-08-07 03:01:27",
    "text": "Thank you <@U07ARLLF39N> so as a last resort we'd have to redirect users from our web apps to the HS web chat via the devices default browser?"
  },
  {
    "poster": {
      "poster_name": "Jason Connery",
      "poster_handle": "jason.connery"
    },
    "time_stamp": "2024-08-07 04:03:37",
    "text": "HubSpot uses production environment environment - if testing with push console only works in sandbox,  first make sure you can receive production pushes from that apple test portal, using builds configured for production push (AdHoc, testflight, app store, etc)\nHubSpot triggered pushes will not arrive in sandbox / simulator."
  },
  {
    "poster": {
      "poster_name": "fd",
      "poster_handle": "fuding"
    },
    "time_stamp": "2024-08-07 04:23:53",
    "text": "Visitor identification APIs require an email parameter, but users in our system may not have email addresses. Can we pass the user ID? <@U06GS7BG27J> <@U07ARLLF39N>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-07 08:42:44"
      },
      {
        "time_stamp": "2024-08-08 03:51:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "George Kemp",
      "poster_handle": "gkemp"
    },
    "time_stamp": "2024-08-07 08:42:44",
    "text": "Hi, so in HubSpot, an email is used to identify a particular user. The email required as a parameter for the visitor identification API is the email that the contact is referenced by in your HubSpot portal. It's not possible to pass in a userId instead.\n\nI have seen as a workaround for cases where email isn't immediately available, the use of a fake email (i.e. user+{userId}@{yourdomain}.com) which would allow you to create a fake email for the user."
  },
  {
    "poster": {
      "poster_name": "Tucker Trainor",
      "poster_handle": "ttrainor"
    },
    "time_stamp": "2024-08-07 10:54:17",
    "text": "If the Mobile Chat SDK or building your own webview with an inline-embedded iframe aren't feasible, then redirecting to the web might be the next best option."
  },
  {
    "poster": {
      "poster_name": "Florian Combelles",
      "poster_handle": "florian.combelles"
    },
    "time_stamp": "2024-08-08 00:33:25",
    "text": "Hello <@U07ARLLF39N> Would you happen to have any update on this?\n\nAlso adding <@U07FUGVF8F8>, our Head of Mobile in charge of the implementation in our app."
  }
]