[
  {
    "poster": {
      "poster_name": "fd",
      "poster_handle": "fuding"
    },
    "time_stamp": "2024-08-06 01:26:28",
    "text": "How do I get the total number of unread messages? Is there any relevant API? <@U06GS7BG27J>",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-06 08:26:43"
      },
      {
        "time_stamp": "2024-08-06 08:29:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Connery",
      "poster_handle": "jason.connery"
    },
    "time_stamp": "2024-08-06 03:39:15",
    "text": "How are you running the app to test? It needs to run in a production push setup, so deployed with an adhoc cert, a testflight test , or app store release.\nIf you're deploying via xcode, by default its pointed at sandbox push rather than the production push environment that HubSpot is using.\nOne way to confirm would be to send a test push on the production env via apple push console to your token, just to confirm that part works: <https://developer.apple.com/notifications/push-notifications-console/>"
  },
  {
    "poster": {
      "poster_name": "Tucker Trainor",
      "poster_handle": "ttrainor"
    },
    "time_stamp": "2024-08-06 07:54:01",
    "text": "Hi! While it may not be comprehensive, there is a <https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk|chat widget SDK> that would allow you to listen for certain events (such as conversation started) and fire JavaScript calls that would direct users to a new URL. I don't know how easily you could shim additional JS into the Mobile Chat SDK implementations, but as an alternative you could create your own webview and use an <https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk#inline-embed-styling|inline embedded widget> to have a custom chat landing, though you wouldn't have push notifications that the Mobile Chat SDK provides."
  },
  {
    "poster": {
      "poster_name": "Tucker Trainor",
      "poster_handle": "ttrainor"
    },
    "time_stamp": "2024-08-06 07:55:36",
    "text": "Beyond that, I don't know of any good way to trigger a redirect. You could use a bot to provide links to your main website's support page, though in the SDK that would result in opening the device's default browser."
  },
  {
    "poster": {
      "poster_name": "Tucker Trainor",
      "poster_handle": "ttrainor"
    },
    "time_stamp": "2024-08-06 08:26:43",
    "text": "Hi! I'm looking at <https://developers.HubSpot.com/docs/api/conversations/conversations|Conversations inbox and messages APIs> but I'm not seeing that any of those endpoints returning data that would give an unread count or \"has unread messages\" boolean."
  },
  {
    "poster": {
      "poster_name": "Tucker Trainor",
      "poster_handle": "ttrainor"
    },
    "time_stamp": "2024-08-06 08:29:39",
    "text": "The JavaScript-based chat widget SDK has an event <https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk#unreadconversationcountchanged|unreadConversationCountChanged> that triggers when a conversation has a change in unread messages but that might not provide exactly what you are looking for as it's not an API and can only indicate how many conversations have at least one unread message."
  }
]