[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-27 05:59:41",
    "text": "I build all of my modules to be responsive and fairly self contained. In my experience dealing with a short deadline results in a choice for us: \n1. Use HubSpots default modules to get the design right\n2. Build a custom module without caring about reusing it for future projects\n3. Invest the extra time to build the module site agnostically and risk going over budget(with boss's permission to do so). Then next time someone needs a module thats similar you just need to make small tweaks but can quote the same, resulting in a net profit and you get your time back",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-06-27 06:03:25"
      },
      {
        "time_stamp": "2019-06-27 06:04:19"
      },
      {
        "time_stamp": "2019-06-27 06:08:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2019-06-27 06:03:25",
    "text": "I always use threads so people can refer to a single timeline... :wink:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-27 06:04:19",
    "text": "I usually do too. Thread interface just doesnt work qs naturally on mobile"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2019-06-27 06:08:01",
    "text": "Oh right, yeah it's not as good hey"
  },
  {
    "poster": {
      "poster_name": "Ashley Arends",
      "poster_handle": "ashley.hehl"
    },
    "time_stamp": "2019-06-27 13:40:24",
    "text": "Hi, has anyone made a custom email template that successfully removes the unsubscribe link when email is set as transactional in the editor? Not sure how to code this..."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-27 13:43:10",
    "edited": {
      "time_stamp": "2019-06-27 13:45:01"
    },
    "text": "I haven’t though honestly I think that’s still against CAN Spam. double-checked, transactional emails are exempt from most of the CAN Spam rules"
  }
]