[
  {
    "text": "Hi @all\n\nFor some reason the cookie code isnt working for our website, can someone help me with this who works for HubSpot ?\n\nIt just shows up like that on top left hnad corner on the top.\n\nThis is from our web dev\n\nSorry I've just checked this and the code you have supplied to us looks really bad on the site:\n\n\n\n\n\n\nCan you please ask HubSpot to provide you with something cleaner, it is also throwing numerous errors:\n\n\n\nThis is just copy and pasting the code they provided us with, I will disable it again until they send you one that is safe to use, let me know once you have shared the above information with them and had a response\n\nHi Joshua\n\nI can't speak to third parties for you unfortunately, i can only support things within the website itself, I've added the new code provided but again it looks like this:\n\n\n\n\nPlease can you speak with your support at HubSpot and explain to them that this code clearly is not working, I have tried it in the following three positions to see if it helps but it loads the same in all instances\n\n1 - header\n2 - body start\n3 - body end\n\nplease have them advise, it's also worth mentioning you have the HubSpot plugin on your site, so if they can add the cookie banner through that, it might be easier\n\nlet us know once you have spoken with them, for now I will turn off their broken one and keep the cookieyes one in place temporarily until they provide you with a working one\n\nDavid\n\n---\n\n\nDoes anyone have any advice or what we can do to fix it ?",
    "time_stamp": "2025-02-24 05:35:04"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2025-02-24 08:52:59",
    "text": "In the settings Content -&gt; Pages\nYou need to untick the include jquery checkbox.\n\nYou then need to manually add it to page head\nI’d recommend using negative priority to make sure it’s loaded first\n```{%- do require_js('LINK TO JQUERY FILE GOES HERE'), { position: \"head\", defer:true, priority:'-2' }) -%}\n{%- do require_js('LINK TO JQUERY MIGRATE FILE GOES HERE'), { position: \"head\", defer:true, priority:'-1' }) -%}```\nNote you need to find links to the files.\n\nYou may also still find after adding a defer you get some js errors, you might need to also update all your module.meta files to load the js with defer too."
  }
]