[
  {
    "poster": {
      "poster_name": "Josef Roy",
      "poster_handle": "josef.advincula"
    },
    "time_stamp": "2021-01-07 07:45:21",
    "text": "Hi guys. Is it possible to add images to a rich text module and use personalisation tokens to automatically update the src value?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-07 17:08:51"
      },
      {
        "time_stamp": "2021-01-08 00:34:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "emily pasiak",
      "poster_handle": "emily.pasiak"
    },
    "time_stamp": "2021-01-07 14:29:05",
    "text": "Hello all,\n \nI have not seemed to find a solution to my use case and I apologize in advance if there has been a solution posted that I have not come across.\n\nThe site that we are building has a large amount of PDF report files that will be stored in HubSpot files for users to be able to access and download.\n\nWhat we would like to achieve is creating a generic email template to send to our users that will contain the specified download link.\n\nA user will fill out a form or press a download button (if they are already logged in and a known user) which will trigger an email to be sent. Within that email it should contain the download link so that they can access the PDF from the storage files.\n\nSince there will be potentially over 100 PDF files that can be sent it would be ideal if the file ID was some how passed along to the email to be appended to the link.\n\nIn this way we will have only one email template to maintain that can send out any one of these PDF reports that the user is interested in.\n\n\nThank you for any help or advice you can provide!!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-07 17:06:53"
      },
      {
        "time_stamp": "2021-01-08 07:16:06"
      },
      {
        "time_stamp": "2021-01-08 08:35:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2021-01-07 17:06:53",
    "text": "Thinking off the top of my head here... could you use a hidden contact property to pass the value of the file ID, which could then be used as a contact property variable in the email template? Maybe have a delay before the email goes out to make sure the value has passed fully. I haven't done this before and don't know if it would actually work, but it's my first thought for something to test out."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2021-01-07 17:08:51",
    "text": "I think this should be possible with a custom coded email template, but I'm not sure about the rich text module."
  },
  {
    "poster": {
      "poster_name": "Logan Allen",
      "poster_handle": "lallen"
    },
    "time_stamp": "2021-01-08 00:34:27",
    "text": "Hey Josef, you _can_ use personalization tokens to accomplish this, but it would require making changes via the _source code editor_. We would advise *using caution* with this approach because a marketer could easily override the content using the image plugin, and since the src would be “invalid” the content may appear broken in the editor, which could confuse your users.\n\nProviding more effective support for customizing content in Rich Text is definitely on our radar.\n\nHope that helps!"
  }
]