[
  {
    "poster": {
      "poster_name": "Matt",
      "poster_handle": "mtunney"
    },
    "time_stamp": "2021-01-08 03:51:22",
    "text": "Hi All.\n\nDoes anyone use HubSpot email to send out internal comms?\nI’ve had a request to build out a monthly newsletter to go to staff.\n\nI know HubSpot can send these out. I just wonder if HubSpot is the right platform for this.\nI could use sendgrid as an alternative.\n\nThanks",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-08 08:28:33"
      },
      {
        "time_stamp": "2021-01-08 10:24:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "emily pasiak",
      "poster_handle": "emily.pasiak"
    },
    "time_stamp": "2021-01-08 07:16:06",
    "text": "Thanks Courtney!\n\nI had a similar line of thinking and came to the same pros and cons. Ideally I would be searching for a solution that would not require a delay in updating contact’s value.  Though I will most likely explore this option more unless I can find a better alternative!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-01-08 08:28:33",
    "text": "Do people do it - yes.\n\nIs it the right platform for it? like any technical decision really depends what your needs are, and if you already have access to the email tools.\n\nThe employees can exist in a contact list. You can send emails to that contact list.\n\nWhether you want to cleanly separate your employee data from your customer data, that may be a consideration."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2021-01-08 08:35:49",
    "text": "I don't mean a delay updating the contacts value, but a short delay (5 minutes?) before sending the email to ensure the property has a value before the email goes out. You wouldn't want it to go out and the link to be broken. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Matt",
      "poster_handle": "mtunney"
    },
    "time_stamp": "2021-01-08 10:24:52",
    "text": "<@U7SL518D6> thanks for the reply."
  }
]