[
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-08-30 08:39:48",
    "text": "So i think we may have discussed this before in another channel, but can we please have the site tree view back in the website pages area. I was working with support before on an issue where ghost pages were appearing in this view and now after getting a response from them, it doesnt help as its not even there anymore."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-08-30 08:40:41",
    "text": "Also, im working with a site that has 90+ pages so being able to see that in a tree view is very helpful when looking at site structure"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-08-30 08:41:17",
    "text": "honestly, i feel like tree view should be a default view and the current website pages view should be secondary"
  },
  null,
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2017-08-30 15:19:05",
    "text": "Hi AJ. Thanks for the question, and my apologies for the delayed response. We certainly hear you, and have read the feedback here about the Site Tree option being removed. That said, I can say a few things...\n\n1. Please keep this within this room and no further, but according to our internal usage data -- there are about ~50 unique users of the site tree view every week. In the overall scope of users that is minuscule which is a large reason we've removed it.\n\n2. As previously stated by alot of the feedback here -- many people were using it to see their overall site map, or to get visibility into multi-language websites. There are two pieces to this: first, we want to improve the site map so you essentially have this view and don't need the site tree as a way of seeing it. Second, we are actively thinking about how to improve multi-language content management and this is one definite piece of the puzzle. I want to be clear that these don't have timelines associated with them right now so I can't offer any dates, but they are on our radar.\n\nAs we work on improving these we're happy to have you involved as an Alpha or Beta tester. Once that time comes we'll definitely let you, and anyone else here, that is interested know.\n\nIf you have any other feedback definitely let us know."
  }
]