[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-12-08 08:10:29",
    "text": "So the tricky part with adding it as <@U02HBK93SPQ> and <@UMZFZHVUJ> are recommending is that it’s really not so scaleable. From a UX experience on the content editing side youre now talking about including some kind of blockquote selector on every module that includes an RTE. Not to mention a module that may have mulitiple RTE’s. I don’t think that including it as a field is the way to go.\n\nI can imagine <@UBT0AHWLD>’s case being something similar to having multiple blockquote styles. And Something like that should really be set in the RTE itself. It really is no different than a heading. There is already a blockquote style there anyway. It would def be pretty great if a developer could add some custom tabs or tags to the RTE itself."
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-12-08 08:14:37",
    "edited": {
      "time_stamp": "2021-12-08 09:14:21"
    },
    "text": "<@UQWGKUEN7> it’d be ideal solution\nI guess, right now, there is no such option, right?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-12-08 08:16:44",
    "text": "Correct — I think Andreas is getting at is that for the HS theme challenge it’s technically against the rules to add classnames inside of an RTE for a submission to be valid. And if a blog post has multiple styles of blockquote then it would appear that there is no way of displaying those different blockquote styles as an example."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-12-08 09:11:46",
    "text": "<@UQWGKUEN7> yes that is correct i think it would be awesome to be able to have those custom styles , be it to style and Quote, an Info, a Warning, a Tip a Linklist. For those interested, i think this blogpost shows some of the ideas that would be really cool to have in a HubSpot RTE: <https://www.bayer.com/en/sustainability/targets>"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-12-08 09:16:26",
    "text": "I wish we could add modules to blog posts. It’d make life much easier in terms of customization"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-12-08 09:19:40",
    "text": "It would be nice! But man — what a headache for standardizing content and making it easy to grab, on the HubSpot Dev side at least. I can totally understand their reservation on it. But it would be super cool if they figured out a way to make it work and still easy to import/export blogs and pull their data on listing pages etc."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-12-08 09:23:22",
    "text": "we might not need that. If we would be allowed to split the\n```   {{ content.post_body }} ```\nin  multiple parts we could then put our modules etc in between"
  }
]