[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-02-08 05:47:28",
    "edited": {
      "time_stamp": "2021-02-08 05:49:58"
    },
    "text": "Yes, tho keep in mind JS will be cached and won't be updated with page changes. This can give you some headhaches. So don't use that much of \"page based info\" but consider the scope as a global one (for the whole website).\nRequest related vars should be OUT of the JS file and use somewhere else (CMs, templates, page content...)"
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2021-02-08 08:17:44",
    "text": "yo! Is it possible to define 'module_id' within custom modules ? We are trying to do some testing internally with cloning content between portals and that is the main hang up -- the module ID is autodefined and is different per portal",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-02-08 08:18:28"
      },
      {
        "time_stamp": "2021-02-08 10:52:15"
      },
      {
        "time_stamp": "2021-02-08 10:52:23"
      },
      {
        "time_stamp": "2021-02-08 12:51:40"
      },
      {
        "time_stamp": "2021-02-08 14:35:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2021-02-08 08:18:28",
    "text": "cc <@U0189NXRP1U> <@U01GBF9Q1AS>"
  },
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-02-08 10:46:30",
    "text": "Anyone know much about workflows, Im looking to see if its possible to get perform another workflow with the associated contacts from the object in a first workflow.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-02-08 11:03:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-02-08 10:52:15",
    "text": "Do you have to use an ID at all?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-02-08 10:52:23",
    "text": "as opposed to path I mean"
  },
  {
    "poster": {
      "poster_name": "Tracey Rickwood",
      "poster_handle": "tracey.rickwood"
    },
    "time_stamp": "2021-02-08 11:00:43",
    "text": "I'm looking for a HubSpot developer to help streamline some performance issues we have with our site. We need someone who is fluent in jquery, javascript hubl(obvs), HubDB and web best practices when it comes to site performance. I'd really like to be able to sit with this person for a day or two and go through some of the issues weve had to know how to change them for the future. Anyone able to help?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-02-10 08:11:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Caio Donald",
      "poster_handle": "caio"
    },
    "time_stamp": "2021-02-08 11:03:35",
    "text": "You can create a contatc property that is filled out using the primary object\n\nExample:\n\nDeal Workflow &gt; Set contact property X as yes\n\nContact workflow &gt; Trigger: contact property x is yes"
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2021-02-08 12:51:40",
    "text": "Theoretically we could definitely use a path -- that would be the preferred -- but it doesn't look like it is exposed within the data passed by the content ID call?\n\ncc <@U01GBF9Q1AS> -- I'm pulling my teammate Denny into the convo as he is the one actually working on this!"
  },
  {
    "poster": {
      "poster_name": "Denny Hong",
      "poster_handle": "denny"
    },
    "time_stamp": "2021-02-08 14:35:46",
    "edited": {
      "time_stamp": "2021-02-08 14:40:00"
    },
    "text": "Hey <@U26BLKGE4>, we are mainly experimenting with cms pages API. Both the `Gets the current contents of the auto-save buffer` and `Get a Page by ID` endpoints return our module data nested in an undocumented \"section\" key within the JSON response. There's no path returned in the module data, only module_id. This is when a dnd template is used for the page.\n\nUpon further testing, with flexible templates, in which case, it returns our module data nested in the `widget_containers` key, as documented. There is a path property in the module data, as well as module_id.\n\nIn both cases when we use the create page endpoint to create the page in another portal, the references to the custom modules are all broken. Even though the theme structure is the same across two portals. This led us to believe the module_id is the main reference used when cloning pages, which makes sense since the API was origninally designed for manipulating pages within a single portal.\n\nHave you and your team tried to implement something similar that helps automate copying content across portals <@U26BLKGE4>?\n\n\ncc <@UDFTHC6PK>"
  }
]