[
  {
    "poster": {
      "poster_name": "KiriChili",
      "poster_handle": "kirishanth.rajaraj"
    },
    "time_stamp": "2025-01-22 09:17:43",
    "text": "Hi everyone,\n\nWe are facing another issue with HubSpots private content.\n\nOn our website pages/landing pages, whenever we enable \"Access group membership required\" under \"Access Control\" and publish the page, an invitation email gets sent to all people in that access group membership list. Is there a way to disable that? Also an invitation gets sent out whenever a user gets added to that membership list from the dynamic Filter selected in the membership list. We don't want to send out those invitations, but it seems HubSpot is doing that automatically. Is there a way to disable it?\n\nWould be grateful for an answer, thanks alot.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-22 10:14:41"
      },
      {
        "time_stamp": "2025-01-22 10:19:33"
      },
      {
        "time_stamp": "2025-01-29 07:58:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-22 10:14:41",
    "text": "Are you doing this with a new list each time?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-22 10:19:33",
    "text": "So, am I understanding this correct, you have a membership / private content set up in HubSpot.\n\nyou are talking about two separate notifications, so I am trying to make sure I understand each\n\nYou have a list (membershiplist) that is a group of contacts that is a dynamic list. At some point these users get add to a list when they meet certain criteria.\n\nYou have a few pages already built out and your have people logging in and using the system.\n\nre: `we enable \"Access group membership required\" under \"Access Control\" and publish the page, an invitation email gets sent to all people in that access group membership list. Is there a way to disable that?`\nAfter your launch, you have added a new page to this, and when you publish the page, an email is sent out to each of your users (that already have access to the platform via your membershiplist) that invite??\n\nre:`Also an invitation gets sent out whenever a user gets added to that membership list from the dynamic Filter selected in the membership list. We don't want to send out those invitations, but it seems HubSpot is doing that automatically. Is there a way to disable it?`\n\nSomeone is added dynamically to your access control/membership list. You don’t want HubSpot to invite them automatically.\n\nDo you already have some sort of invitation email that goes out for them?"
  }
]