[
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "nikodixon"
    },
    "time_stamp": "2021-01-20 10:09:00",
    "text": "Hi there - does anyone know if there’s a way to add custom fonts to the options when choosing a font in theme settings? Other from the google options.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-01-20 10:28:45"
      },
      {
        "time_stamp": "2021-01-20 10:34:21"
      },
      {
        "time_stamp": "2021-01-21 08:26:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chandanesh",
      "poster_handle": "chandanesh.kc"
    },
    "time_stamp": "2021-01-20 10:28:45",
    "text": "If its for quote ,then you click on the Setting and you will get an option to change the font and colour."
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "nikodixon"
    },
    "time_stamp": "2021-01-20 10:34:21",
    "edited": {
      "time_stamp": "2021-01-20 10:34:55"
    },
    "text": "I appreciate the input! I’m actually trying to add another font to the options as opposed to the ones being loaded in from google fonts. My issue isn’t choosing an option, so much as it is controlling what the options are."
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-01-20 11:56:02",
    "text": "I did some more debugging and I noticed that if I try to get the value of `field C` with HubL, it does contain the correct value. The theme settings is just showing an empty value."
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-01-20 11:56:29",
    "text": "So my bug is actually the following:\n\nIf `field B` inherits from `field A` and `field C` inherits from `field B` and I set the value of `field A` to something, the input of `field B` is updated in the settings. `field C` however shows an empty value. But when I use `field C` (with HubL) in the CSS, it shows the correct value. So the value is saved correctly, but just not showing in the theme settings."
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "nikodixon"
    },
    "time_stamp": "2021-01-20 15:25:48",
    "text": "Another question for those more experienced with theme development than I am:\n\nApparently we can’t add classes to dnd_sections.\n\nWhat’s the right way to handle styling that you want applied to one section - but not necessarily to all others?\nMy specific issue is that I have a background image I want to take up the entirety of a single dnd_section. Of course, it’s going to apply them to all other dnd sections (unless I’m missing some uniqueness in naming between sections) Is best practice to completely modularize the contents of a dnd_section, so bringing in a module that will take care of all of the specific styling I need?\n\nGetting my hand around coding themes and best practices is proving to be a challenge!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-21 08:25:02"
      },
      {
        "time_stamp": "2021-01-21 08:28:44"
      },
      {
        "time_stamp": "2021-01-21 09:21:37"
      },
      {
        "time_stamp": "2021-01-23 08:33:37"
      }
    ]
  }
]