[
  {
    "text": "I've made several custom modules in a custom theme for a client. Many of the modules are fairly simple, so I didn't add any \"Styles\" tab settings. All of those modules have a \"Hide on this breakpoint\" option in the Styles tab which I have not added, I presume it's some default field. For my other modules I have added alignment options under \"Styles\" and because I have done that none of those modules have the \"Hide on this breakpoint\" setting. My client is now asking me to add the Hide option to the modules where it is missing, but I don't know how to. I cannot find JSON example of this field, and no options for meta.json which relates to this field. The only way I can make it appear is to remove the alignment styles options, which I don't really want to do as the way this option is set via icons is quite nice. What am I missing?",
    "time_stamp": "2023-12-27 04:36:31",
    "edited": {
      "time_stamp": "2023-12-27 17:09:53"
    },
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-27 11:13:24"
      },
      {
        "time_stamp": "2023-12-27 17:16:03"
      },
      {
        "time_stamp": "2023-12-27 17:17:42"
      }
    ]
  },
  {
    "text": "This is a known behavior, although it’s never been clarified whether or not it’s a bug. The “Hide on this breakpoint” option in the style tab isn’t a field you can add, and is only visible on modules with no style fields.\n\nIf a module has style fields and you want to hide it on a certain breakpoint, you can toggle visibility by clicking the eyeball icon for that module when viewing it in the content tree view — see the attached screenshot.\n\nAs a side note, I would recommend that you never create a module that doesn’t have _any_ style fields. At the very minimum, you should always include a spacing (margins and padding) field; if you have two custom modules without spacing controls, they cannot be used in direct sequence with one-another.",
    "time_stamp": "2023-12-27 11:13:24"
  },
  {
    "poster": {
      "poster_name": "James H",
      "poster_handle": "jim834"
    },
    "time_stamp": "2023-12-27 17:16:03",
    "text": "Thanks <@U04AQA0QM8E> great info. Could you clarify about the spacing control and using in direct sequence? Our theme has around 40 custom modules, with many of the default ones disabled. We have built the spacing in to each module (to exactly fit the designs) and we use a custom spacer block between modules. None of our blocks have spacing options as that is being set via css and styles as it’s not something our client should need to change. So far we’ve not run into any issues making pages. Is there a dev document about this spacing requirement? "
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-12-27 17:17:42",
    "text": "Ah, sounds like you have it covered via the use of a spacing block module, then — you can totally disregard my comments!"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-12-27 18:40:16",
    "edited": {
      "time_stamp": "2023-12-27 18:40:30"
    },
    "text": "Anyone have any info on the new `hublData.hubl.html` files?",
    "reply_count": 5,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2023-12-28 10:41:58"
      },
      {
        "time_stamp": "2023-12-28 23:08:14"
      },
      {
        "time_stamp": "2024-01-02 10:12:51"
      },
      {
        "time_stamp": "2024-01-03 02:49:57"
      },
      {
        "time_stamp": "2024-01-03 06:17:56"
      }
    ]
  }
]