[
  {
    "poster": {
      "poster_name": "Chris Apfelbeck",
      "poster_handle": "apfelbeck"
    },
    "time_stamp": "2025-02-03 01:20:39",
    "text": "Hi all, I am trying to test sending automated mails in a workflow in a developer test account. However sending the mails always fails with a message like \"Email could not be sent\" (not entirely sure this is the correct English translation). I can't find any more detailed error logs on this. Now I am wondering if it is even possible that mails will be sent from a developer test account? And does anyone know where I could find a more detailed error log? Thank you so much in advance!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-02-06 09:44:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Lefevre",
      "poster_handle": "kevin.lefevre"
    },
    "time_stamp": "2025-02-03 02:00:33",
    "text": "Hi <@U089HHUBS2Y> and thanks for sharing !\nI am not sure the custom code task will automatically continue on next branch in case of auto-retry behavior of HS API.\nBecause it currently properly finishes for all enrolled objects thanks to native exponential backoff retry behavior.\nMy point is more on the “first batch” of the whole objects enrollment -&gt; how can I easily  add some randomness/delay to avoid all objects being in the API calls at the exact same time ?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-02-03 04:40:37",
    "text": "Since the changes to the way that contact objects are merged, is anyone else having issues with workflows?\nIf merging a contact it will either\n1 - re-enrol in the workflow (They've already completed the workflow and i don't want them to go back in from just being merged) or\n2 - un-enrol due to being merged (They were still in the workflow, but I wanted to keep them in a workflow as there were delays until certain actions)\n\nI've contacted HS support but not heard back yet, how is everyone else currently handling retaining workflow membership and 'stage' when merging contacts now?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-13 05:06:39"
      },
      {
        "time_stamp": "2025-02-13 06:20:20"
      },
      {
        "time_stamp": "2025-02-13 06:33:16"
      },
      {
        "time_stamp": "2025-02-13 06:37:07"
      },
      {
        "time_stamp": "2025-02-14 05:25:29"
      },
      {
        "time_stamp": "2025-02-14 05:38:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2025-02-03 11:51:40",
    "text": "<@U06K19BGMNE> that was the workaround I implemented. However, that workaround requires another property and workflow to copy the property the record it to the text property when a deal is created. It's additional time and overhead that could be avoided with support for number fields."
  },
  {
    "poster": {
      "poster_name": "Camille Markentive",
      "poster_handle": "camille.saute"
    },
    "time_stamp": "2025-02-04 00:09:24",
    "text": "Yes, :100: agree !\n\nThough, you don’t need another workflow, just use a calculated property with a simple formula like\n```if(isknown(my_number_ppty),str(my_number_ppty))```"
  }
]