[
  {
    "poster": {
      "poster_name": "Tara Connolly",
      "poster_handle": "tconnolly"
    },
    "time_stamp": "2025-02-24 15:21:33",
    "text": "Hi <@U08C4QDHJ8H> to do this I go to the email and preview as a specific contact. If they have those properties set at the time of looking, they will pull through in the preview for you."
  },
  {
    "poster": {
      "poster_name": "Tara Connolly",
      "poster_handle": "tconnolly"
    },
    "time_stamp": "2025-02-24 15:22:46",
    "text": "Hi everyone, not sure if this is possible with calculated properties or workflows. I'm wanting to populate a property that will give me a count of Deals. I only want it to count Deals that are open on a specific pipeline (Retention), and where the contact has a particular association label (Agent). For example Darren is associated to 10 Deals. On 5 of the Deals Darren has the association label 'Agent'. 2 of those Deals are already closed. I want this property to return 3 (because this is the number of open deals where Darren has that label). Anyone done something similar? There is a 'number of open deals' property on the Company record, but not on the Contact.  can build a report to show the number, but I want to write that number to a property and use it for other things.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-24 15:48:36"
      },
      {
        "time_stamp": "2025-02-24 15:54:11"
      },
      {
        "time_stamp": "2025-02-24 15:56:18"
      },
      {
        "time_stamp": "2025-02-24 15:57:06"
      }
    ]
  },
  {
    "text": "Hey Tara, I don't think you can use Association labels directly in calculated properties but you can do what you are after.\n\nYou will need a rollup property (Screenshot). Where I have \"Record ID\" on the screenshot you will need a new property. Let's call it \"Is Agent - Retention\". Now this property you will need to set via workflow based off your association label. It can be a single checkbox. You will also need to filter in the workflow for the pipeline deals, so set it to true only when it is a Retention Deal.\n\nSo this way every time \"Is Agent\" is true and  \"Is Open (numeric)\" equals 1, the count will go up.\n\nBit confusing but I think achievable.",
    "time_stamp": "2025-02-24 15:48:36"
  },
  {
    "poster": {
      "poster_name": "Tara Connolly",
      "poster_handle": "tconnolly"
    },
    "time_stamp": "2025-02-24 15:54:11",
    "text": "Thanks <@U04CC57CMBP>. I think I understand. Would the 'Is Agent' checkbox be on the Contact object?"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2025-02-24 15:56:18",
    "text": "Nope it is on the Deal <@U07KLARDM6X>"
  },
  {
    "poster": {
      "poster_name": "Tara Connolly",
      "poster_handle": "tconnolly"
    },
    "time_stamp": "2025-02-24 15:57:06",
    "text": "I'll give it a go!"
  }
]