[
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 04:57:48",
    "text": "Can you provide more info about the use case?\n\nIdeally you can try to test the objects within the workflow to see what triggers the workflow. Additionally, you can enrol the contacts for example on a list assuming that it is a contact object workflow."
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 04:58:57",
    "text": "Are you using the native HS WhatsApp or a third party app for this?"
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 05:04:23",
    "text": "Aloha! Sometimes internal errors are temporary.\n\nAttempt to resend the DELETE request after a short interval to see if the issue persists.\n\n<https://developers.HubSpot.com/docs/reference/api/automation/create-manage-workflows/v2|Check this>"
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 05:06:39",
    "text": "You can try implementing if/then branches to filter out merged contacts.\n\ni.e: you can set criteria to exclude contacts based on specific properties or recent activity, ensuring they don't re-enter workflows unnecessarily.\n\nAlternatively, you can also set up a workflow that automatically re-enroll contacts based on specific triggers or properties post-merge."
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 05:08:56",
    "text": "If `inputFields` is returning an empty object, it's possible that the workflow isn't correctly capturing the form submission data.\n\nEnsure that the form fields are mapped to the corresponding contact properties, I would say test it on a sample contact and check whether the properties are captured or not.\n\nTry adding a 1 minute delay as well before you run the custom code."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-02-13 06:20:20",
    "text": "Thanks Ahmed,\n\nMy problem though is that when merging contacts, they completely lose their place in the workflow. It will be hard to find where they were in a workflow that is already heavily branched with delays - where to put them again.\n\nI did hear back from HubSpot support and they said this is the expected behaviour - we just did not have this previously before the way that merging contacts changed. When one merged to the other, it retained placement in workflows. now it merges to a new object ID that place in multiple workflows is lost."
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-13 06:33:16",
    "text": "You're welcome Stacey.\n\nI can see how losing workflow placement after merging could be a major challenge especially in a heavily branched setup. It’s definitely a shift from how things worked before. I've also encountered this issue multiple times before but to ensure the process is controlled I suggest controlling contact merging proactively based on the team roles since it is the best approach to avoid disruptions, particularly when integrations are involved.\n\nHave you considered setting up specific rules or guidelines for when and how contacts should be merged to minimise workflow impact? Is it happening very often that you have to merge contacts?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-02-13 06:37:07",
    "text": "I think you're right... thats problem all we can do at this point to retain workflow placement.\n\nWe have a surprising amount of contacts that need merging because they will email form a secondary email not initially on file. These contacts are not necessarily noticed straight away if emailing outside of HubSpot too...\nFor now, we are manually re-associating the activity to the 'right' contact and moving the email over to a secondary email file, then deleting the duplicate contact. We get around 400 a month so it's quite a task in itself to go through those.\n\nIf we create some merging 'rules' to use internally, that may help things."
  },
  {
    "poster": {
      "poster_name": "Omri Cheikha",
      "poster_handle": "omri"
    },
    "time_stamp": "2025-02-13 06:59:53",
    "text": "U can generate 2 different lists with the same filters and workflow enrollment filter if the trigger was set to work \"from now on\" and not retroactively"
  },
  {
    "poster": {
      "poster_name": "Omri Cheikha",
      "poster_handle": "omri"
    },
    "time_stamp": "2025-02-13 07:02:00",
    "text": "Hey guys, do you have any idea how I can reach ad properties using workflow *actions*? I want to webhook this info..\nTnx!"
  },
  {
    "poster": {
      "poster_name": "Teddy TH Digital",
      "poster_handle": "hello249"
    },
    "time_stamp": "2025-02-13 17:21:57",
    "text": "<@U0623BNGR5H> thanks and <@U076WJKFC7L> too for responding. Using lists is actually a good option, thanks for the recommendation!"
  }
]