[
  {
    "poster": {
      "poster_name": "Laura Atkins",
      "poster_handle": "latkins"
    },
    "time_stamp": "2022-01-19 05:48:17",
    "edited": {
      "time_stamp": "2022-01-19 05:48:25"
    },
    "text": "Did you get it to work? If you still need to troubleshoot maybe send some screen shots of your email/smart rule setup/test setup"
  },
  {
    "poster": {
      "poster_name": "Stephanie Stix",
      "poster_handle": "stephanie.stix"
    },
    "time_stamp": "2022-01-19 07:47:08",
    "text": "Hi everyone,\n\nI’ve encountered a problem with the DND editor in combination with custom e-mail modules.\n\nOutside of DND e-mails our module works (tested on Litmus, etc.) fine but when I drag it into my DND mail, some things don’t work anymore - the mobile breakpoint on Android/Gmail for instance.\n\nWithin Coded Templates the module works fine as well.\nAfter some analysis, I found that the DND editor generates additional containers and code for columns outside the module which seems to collide with the custom module CSS on certain clients on Android (iOS works).\n\nIs there any way use custom modules in DND mails at full functionality?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-01-19 08:08:26"
      },
      {
        "time_stamp": "2022-01-19 09:29:38"
      },
      {
        "time_stamp": "2022-01-19 09:57:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Broeders",
      "poster_handle": "cgb"
    },
    "time_stamp": "2022-01-19 08:08:26",
    "text": "Hi Stephanie, not sure how your code looks - but for me it has worked if I put a lot of the code as inline style - or with important tags in the header CSS.\n\nAll the divs and tables need to have its own class or ID so that you can specify the styling and overwrite the HubSpot default css"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-19 09:29:38",
    "text": "Hey Stephanie, lack of mobile specific styles is a limitation of the product in its current state. There are a few workarounds sometimes, but certain things like responsive font sizes are not."
  },
  {
    "poster": {
      "poster_name": "Sergio Ramos",
      "poster_handle": "sergirams"
    },
    "time_stamp": "2022-01-19 09:55:43",
    "text": "Hi everyone, right now I'm using Segment (CDP) to trigger emails (we were using Iterable for email automation) our plan for Q1 is migrate our email delivery to HubSpot, my question is, what do you recommend for better metrics? Integrate SMPT API in our app or send emails with workflows triggering events from segment, we can generate the same analytics? either ways we can capture all user activity (clicks, email opened, etc)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-21 09:38:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-01-19 09:57:27",
    "text": "DND doesn't have a way to edit/add responsive CSS unfortunately. Whatever custom module is used needs to work without that."
  }
]