[
  {
    "poster": {
      "poster_name": "Mike Thomas",
      "poster_handle": "mike542"
    },
    "time_stamp": "2020-11-24 05:40:13",
    "text": "Greetings. I'm new to HubSpot, so please be gentle with any of my assumptions.\n\nOur clients sometimes to come to us post HubSpot Migration. Seem like a super quick service, and I see where the value comes from. However, it seems that the process enables the HubSpot stock jQuery option in Settings, in order to achieve some of the requirements of the site. That's great - but it's version 1.7.1, which is 9 years old, and then becomes a bit of a blocker when staging a new site (since you can't turn it off and load your own without disabling the live site's instance).\n\njQuery 1.7.1 has unsurprisingly got a few known vulnerabilities, and it seems a little counterintuitive to bundle it in, when more recent versions are available.\n\nA few questions.\n\n1. Can the HubSpot Migration service use something a little more modern?\n2. Alternatively, does anyone have any good strategies in terms of staging workflows to get rid of it?\n3. Why are HS continuing to offer an insecure library in the settings?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-24 07:16:49"
      },
      {
        "time_stamp": "2020-11-24 08:10:41"
      }
    ]
  },
  {
    "text": "Hi Everyone,\nI was working on HubSpot-Salesforce Integration and facing an issue with field mapping. I wanted to map country/region in HubSpot to respective Salesforce field but as soon as the integration happened, it was already mapped to another field by default with different property. Tried creating a custom mapping to override the standard one but I'm not able to edit nor delete the standard mapping. I'm new to HubSpot so kindly advise and correct me If I'm wrong. Thanks.",
    "time_stamp": "2020-11-24 06:12:26"
  },
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2020-11-24 07:16:49",
    "text": "I can't answer 1 and 3, but they have an article here on updating it: <https://developers.HubSpot.com/cms/guides/jquery/upgrade>"
  },
  {
    "poster": {
      "poster_name": "Mike Thomas",
      "poster_handle": "mike542"
    },
    "time_stamp": "2020-11-24 08:10:41",
    "text": "Thanks - that might help :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Rodrigo",
      "poster_handle": "rodrigo.cunha"
    },
    "time_stamp": "2020-11-24 15:43:26",
    "text": "Hi everyone, new here... This isn't necessarily a technical issue (hopefully) but is there a way to duplicate a production environment into an existing sandbox account or copying the production account into another? I find it very strange that HubSpot doesn't provide a staging environment that mirrors production and that we would need to be mirroring ourselves manually. Any help would be greatly appreciated."
  }
]