[
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 12:21:15",
    "text": "I see landing pages are by default not included in the sitemap.xml. Is there a way to do this in bulk vs manually one URL at a time? Lets say the majority should be indexed and a handful of thank you pages should be set to not indexed?",
    "reply_count": 11,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-10-27 12:45:45"
      },
      {
        "time_stamp": "2021-10-27 12:51:57"
      },
      {
        "time_stamp": "2021-10-27 13:05:51"
      },
      {
        "time_stamp": "2021-10-27 13:24:22"
      },
      {
        "time_stamp": "2021-10-27 13:27:31"
      },
      {
        "time_stamp": "2021-10-27 13:33:56"
      },
      {
        "time_stamp": "2021-10-27 13:42:58"
      },
      {
        "time_stamp": "2021-10-27 13:49:48"
      },
      {
        "time_stamp": "2021-10-27 13:49:54"
      },
      {
        "time_stamp": "2021-10-28 03:45:51"
      },
      {
        "time_stamp": "2021-10-28 06:43:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-27 12:45:45",
    "edited": {
      "time_stamp": "2021-10-27 12:46:54"
    },
    "text": "Landing pages are not just excluded from the sitemap but also marked \"noindex\". Landing pages from an SEO point of view are the marketing pages a website uses to drive paid, email marketing etc. traffic. These pages tend to be duplicate pages, thin on content, etc and are kept away from search engines because they would see them as low quality pages. If you have pages in the landing page section that you want indexed I would suggest moving them to webpage. Once you are done you can generate a sitemap using a tool such as Screaming Frog and submit it through your Google Search Console."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 12:51:57",
    "text": "Thanks Thomas. But I just looked at the source code and I don't see a noindex tag. I also don't see an error when adding a URL to google search console. So I think they are just not in the sitemap.xml but still indexable if found via a link or social. <https://offers.HubSpot.com/social-media-content-calendar>"
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-27 13:05:51",
    "text": "That is interesting I thought there was one but I know we have thousands of landing pages and I crawl and audit our site every year and never once seen a landing page. I crawl using not just a site map but also implement Google Search Console API. Give me a moment to do a little research I'm curious now. Also you don't need a sitemap to be indexed all the sitemap does is makes it easier for search engines to find a page. If you link to it on your site search engines will find it."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 13:24:22",
    "text": "ebooks and webinars with lead gen forms are super common. I suspect a lot of marketers don't know what happens behind the scenes and expect pages like that to be indexed. Anything for lead generation should be indexed to get as much exposure as possible."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 13:27:31",
    "text": "\"to be requested to be indexed\""
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-27 13:33:56",
    "edited": {
      "time_stamp": "2021-10-27 13:35:29"
    },
    "text": "We have a lot of duplicate content from pages that we duplicate for similar offers and would never want that seen by search engines. Our ebooks and such are all regular webpages. Sorry for the miss information I looked it up and even in the HubSpot community forum people were talking about how it wasn't indexed. And I thought I had seen it in the code years ago and we probably were adding it manually before I took over. I called them though and verified they do index it. Looks like our intern is going to be busy."
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-27 13:42:58",
    "text": "What really makes me scratch my head is why would they separate webpages and landing pages when the only difference is they don't put it in the sitemap and why would you not? Anyway sorry for the rant"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 13:49:48",
    "text": "no its fine"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-10-27 13:49:54",
    "text": "I am confused also"
  }
]