[
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2020-04-15 05:29:54",
    "text": "Do you still have on your roadmap to make it possible to add drag and drop areas to coded email templates, allowing developers to create custom templates that incorporate the drag and drop functionality? Think there was talks about it a long time ago :slightly_smiling_face:",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-04-15 05:39:14"
      },
      {
        "time_stamp": "2020-04-15 06:18:47"
      },
      {
        "time_stamp": "2020-04-15 07:19:28"
      },
      {
        "time_stamp": "2020-04-15 07:23:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Serhat",
      "poster_handle": "serhat"
    },
    "time_stamp": "2020-04-15 05:39:14",
    "text": "<@U4W2EG8RY>,\n\nJust a related question;\nIf we want to have a D&amp;D feature on the email templates, the only option that we have is to use the D&amp;D template and add custom email modules to it, correct?\n\nThe limitation on this regard is that we cannot apply our own template level CSS to a D&amp;D template.\n\nThanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-15 06:18:47",
    "text": "Yes we are still actively working on this. It's not a small change and a lot of care and attention is going in to make sure we get it right. \n\nYes currently building modules to be used in D&amp;D emails is currently the only way developers can influence that type of email right now."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-04-15 07:07:21",
    "text": "Morning. I'm checking in on the progress on making drag and drop email templates. Right now my workflow is to create a new drag and drop email, name it something like *Newsletter [Template]*, and save it as a draft. Then the client will clone that draft to create a new email with the same styling applied. This is a bit clunky as clients are most familiar with using the Create Email button at the top right of the email dashboard, then selecting a template. If there was a way to add new templates to the drag and drop tab, that would be beautiful.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-04-15 07:20:11"
      },
      {
        "time_stamp": "2020-04-15 07:20:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2020-04-15 07:19:28",
    "edited": {
      "time_stamp": "2020-04-15 07:21:20"
    },
    "text": "Ok, thanks for the update <@U7SL518D6> :+1: Eagerly anticipating this feature as it would solve soooooo many hassles we have in our client work and allow us to create templates that better fit our clients' needs. Do you have any rough idea of the timeline for this feature? Q3? Q4? 2020? 2021? Soon™? :smile:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-15 07:20:11",
    "text": "Hi Tony, fully understand the desire to be able to do that. As someone who previously built a lot of email templates, and knows the value this would provide, I too am eager to see it implemented. We’re working on it, no timeframe to announce right now. Appreciate the feedback.\n<https://HubSpotdev.slack.com/archives/CES6JU0RY/p1586953127021300?thread_ts=1586950194.020700&amp;cid=CES6JU0RY>"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-04-15 07:20:53",
    "text": "Thanks, Jon."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-15 07:23:05",
    "text": "I don’t have a time frame to share right now. This is a big feature/functionality change and a lot of care and attention is going into making sure it provides a good experience for both developers and content creators."
  }
]