[
  {
    "poster": {
      "poster_name": "Chris Knowles",
      "poster_handle": "chris618"
    },
    "time_stamp": "2019-10-25 02:39:13",
    "text": "Wouldn't it be great if users with Design Tools access could click to open up custom modules right from the page builder interface rather than faffing around going in and finding it?",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-10-25 03:00:16"
      },
      {
        "time_stamp": "2019-10-25 03:03:06"
      },
      {
        "time_stamp": "2019-10-25 07:41:16"
      },
      {
        "time_stamp": "2019-10-25 07:48:29"
      },
      {
        "time_stamp": "2019-10-25 07:49:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2019-10-25 03:00:16",
    "text": "The most annoying is the new global modules which when you hover over them say click to edit... But clicking does nothing at all..."
  },
  {
    "poster": {
      "poster_name": "Chris Knowles",
      "poster_handle": "chris618"
    },
    "time_stamp": "2019-10-25 03:03:06",
    "text": "I think I discovered that functionality during a client training session :joy:"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-10-25 07:41:16",
    "text": "Hey Chris, in your thoughts on this, would the edit link be freely open for anyone to see or would only certain people be able to see this link?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-10-25 07:48:29",
    "text": "Also, where would this link reside? Would it be in the module listing of the page on the left sidebar or would it be inside the options for that module once you clicked into it?\n\nAlso, if you could create this as a new idea in our forum and then also post a link back here so folks can upvote it, that would be awesome :slightly_smiling_face:\n<https://community.HubSpot.com/t5/forums/postpage/board-id/HubSpot_Ideas>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-25 07:49:03",
    "edited": {
      "time_stamp": "2019-10-25 07:49:34"
    },
    "text": "just back-filling past conversations on this. The primary concern with doing this was that for non-developers having this functionality would result in confusion. Possibly even causing marketers to make breaking changes to custom modules.\n\nAt one point I had pushed to make this work through the developer extension, but was stuck because data I needed to make it happen wasn’t available.\n\nThere may be a community thread on this already so it’s worth a look there."
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2019-10-25 08:49:54",
    "text": "Smart content hasn’t gotten a lot of love over the past few years, but we should have some resources to do a bigger overhaul in 2020!"
  }
]