[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2018-07-17 06:07:14",
    "text": "I disabled Jon’s chrome extension and the cursor problem went away. I’ll do that from now on before reporting any problems. Killer extension Jon!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 06:54:44",
    "text": "If you close and re-open google chrome the bug has been fixed.(closing and reopening should cause google chrome to update)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 06:58:48",
    "edited": {
      "time_stamp": "2018-07-17 08:31:30"
    },
    "text": "The issue was with the cursor on hovering the IDE - on Macs the cursor becomes nearly impossible to see on Mac screens, the extension inverts the color of the cursor when hovering the IDE(only for Macs) - there ws a positioning bug that was not caught immediately and unfortunately got publsihed. The fix was simple and is rolling out to everyone. \n\nSorry about the inconvenience, in the next update all UI tweaks we make will be toggle-able within the extension. So should any conflicts with HubSpot’s code ever occur there will be an easy way to toggle that off without losing the rest of the functionality of the extension.\n\nAlso as a precaution we are beta testing the next version of the extension, it adds numerous new features and we want to be sure no bugs make it through.\nIf you are interested in testing it out I’ll post a link below:\nThe new update adds a developer menu to the HubSpot Nav, Spanish support, and a lot of improvements to the dark theme and adds security to the extension by stripping out the need for certain extension permissions, by using more restrictive api’s. Also the toggle to disable the developer nav and all UI tweaks the extension makes.\n\n<https://github.com/williamspiro/HubSpot-Developer-Extension/releases/tag/v1.03-beta-3>"
  },
  null,
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2018-07-17 08:27:14",
    "text": "that’s awesome <@U7SL518D6>!"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-07-17 08:27:54",
    "text": "Thanks Jon!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 08:30:49",
    "text": "again very sorry about the cursor issue, the feature shouldn’t have been released without more testing on my end.\n\nAlso as I said we’re making it so all future UI tweaks are toggle-able to prevent future conflicts."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-07-17 08:42:55",
    "text": "Ain’t no thang"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 10:03:09",
    "text": "would be nice if when using copy snippet on a simple menu in a custom module, that it would include the attribute `orientation='horizontal'` even if someone intends for it to be vertical it makes it easier to see how to change that"
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 15:06:59",
    "text": "Something weird appears to have happened to the revisions of a file on a site I have"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 15:07:22",
    "text": "all the ones older than a certain date are all identical"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 15:07:29",
    "text": "there’s no way that’s the case."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 15:08:41",
    "text": "I’m in a particularly weird spot because there are some styles that appear to be wrong on this site, and I can’t figure out what happened because I can’t dif against older versions of the file (because they’re all weirdly identical, which is near impossible.)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-17 15:17:01",
    "text": "well while someone should do some investigating of the revision history because it seems like it’s not really working right. The actual problem the site is experiencing might be that someone accidentally deleted an image that was used in multiple module on the site.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-07-18 13:42:50"
      },
      {
        "time_stamp": "2018-07-18 13:43:14"
      },
      {
        "time_stamp": "2018-07-18 13:43:27"
      }
    ]
  },
  null,
  null
]