[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 08:16:01",
    "text": "in DM2 when clicking on a module or group in a drag n drop template then hitting delete on the keyboard it takes awhile for the deletion to kick in.\n\nWhen it comes to deleting things it makes me nervous if it takes awhile because If I hit the button again thinking it didn’t delete the first time, I might accidentally delete more stuff",
    "reply_count": 11,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-07-13 09:51:18"
      },
      {
        "time_stamp": "2018-07-13 09:53:48"
      },
      {
        "time_stamp": "2018-07-13 09:58:56"
      },
      {
        "time_stamp": "2018-07-13 10:04:51"
      },
      {
        "time_stamp": "2018-07-13 10:07:42"
      },
      {
        "time_stamp": "2018-07-13 10:36:15"
      },
      {
        "time_stamp": "2018-07-13 11:10:09"
      },
      {
        "time_stamp": "2018-07-13 11:40:27"
      },
      {
        "time_stamp": "2018-07-13 12:00:39"
      },
      {
        "time_stamp": "2018-07-18 16:07:51"
      },
      {
        "time_stamp": "2018-07-19 12:43:34"
      }
    ]
  },
  {
    "text": "Having a hard time editing repeating fields to set the defaults in Design Manager because of the overlays of the revert to old DM and the help button. Sidebar doesn't allow me to scroll any further down.",
    "time_stamp": "2018-07-12 13:19:09"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 13:24:53",
    "text": ":thinking_face: is this a job for the extension……could maybe make the toggle button peek off one of the corners and on hover come into view better."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 13:26:50",
    "text": "ultimately maybe the better design choice is for those buttons to be located in the actual bottom panel thing next to hubl reference"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 13:33:46",
    "edited": {
      "time_stamp": "2018-07-12 13:34:08"
    },
    "text": "If people think that’s a good solution what I can do is issue a hot “patch” to the extension tonight after work which moves those buttons into the bottom bar, and makes them  like small squares, then on hover reveals more what they are or something. Make the help button stay that color but show a :question: when not hovered, and make the box for the revert button smaller and in that bottom panel."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 17:17:50",
    "text": "Extension update is rolling out, the buttons are now moved to the bottom nav.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-07-13 01:50:09"
      },
      {
        "time_stamp": "2018-07-13 06:12:16"
      }
    ]
  },
  {
    "text": "There was conversation in here last week I think about wishing there was an easier way to allow users to choose between an internal HubSpot page or an external URL. While I was creating a CTA today I noticed this in the CTA tool. It'd be awesome if the page selector module was updated to allow all of these options so we wouldn't have to code in choice modules to display the page selector or a text field for external links, etc. Much better user experience IMO.",
    "time_stamp": "2018-07-12 19:20:00"
  }
]