[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-06-12 07:20:47",
    "text": "Hey friends, Node v16 has reached it’s end of life September 11th, 2023. To ensure reliability and security the HubSpot CLI now requires Node v18 or higher. This is especially important to note for users of the GitHub Deploy Action - you will need to increment your GitHub Deploy action’s version number before September 10th 2024, to ensure it continues operating.\n<https://developers.HubSpot.com/changelog/cli-requires-node-v18-or-higher>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-06-12 07:30:19",
    "text": "Additionally HubSpot is going to be enforcing some long-standing limits in HubL. Enforcing these limits helps to improve the performance and reliability of all websites on HubSpot. Most of you are likely unaffected because you would already have seen warnings in the design manager if you were over these limits. These limits also have been in the documentation for years. All net-new HubSpot accounts since June 10th and those not already over the limits have had the enforcement enabled. All accounts that currently exceed the limits and are older than June 10th have until November 4th, 2024 to update their code to stay within the limits.\nWe understand that not all customers may be able to fix their issues right away and are offering a temporary extension.\n\nFor more detail see the changelog itself:\n<https://developers.HubSpot.com/changelog/long-standing-hubl-limits-will-now-be-properly-enforced>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-12 14:42:29"
      },
      {
        "time_stamp": "2024-06-12 18:50:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2024-06-12 14:42:29",
    "text": "Jon, is there an easy way to see if any of your templates are impacted?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-06-12 16:36:37",
    "text": "I know you were wondering and I am here to reassure you.  Jon will be live streaming again this friday.\n<https://youtube.com/shorts/UTI5I4NYccM|here is a lil clip from the last stream>\nsee you at 12:30 pm EST",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-12 23:03:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-06-12 18:50:04",
    "text": "The current easy way is to open templates in the design manager, see if you get the warning indicating that you’re over the limits. We’re discussing if we can make it easier to identify in other ways but don’t yet have a solution.\n\nFor most of these functions it’s rare that folks actually go over them.\n<https://legal.HubSpot.com/HubSpot-product-and-services-catalog?_ga=2.115861638.1808389881.1718026610-662733982.1718026610&amp;_gl=1*1aknn9z*_ga*NjYyNzMzOTgyLjE3MTgwMjY2MTA.*_ga_LXTM6CQ0XK*MTcxODIzOTUyOS4xNi4wLjE3MTgyMzk1MjkuNjAuMC4w#:~:text=10%20invocations%20per%20page%20load%20for%20the%20following%20functions%3A|https://legal.HubSpot.com/HubSpot-product-and-services-catalog?_ga=2.115861638.180838[…]*_ga_LXTM6CQ0XK*MTcxODIzOTUyOS4xNi4wLjE3MTgyMzk1MjkuNjAuMC4w>\n\n10 invocations of the function and technically it’s 10 unique invocations.\n\nSo for example if you were doing a hubdb_rows call in your code you’d be needing to do that to 10 different HubDB tables to hit the limit.\n\nOr another example: 10 different menus called using the menu() function. It’s exceedingly rare for pages to have more than 3 separate menus (header, footer, and sometimes folks do a sidebar or a breadcrumb menu)"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-06-12 23:03:22",
    "text": "I missed the last one, but it's still on my to-do list this week. Thanks for launching this series of live streams :pray:"
  }
]