[
  {
    "poster": {
      "poster_name": "Jim Komara",
      "poster_handle": "jkomara"
    },
    "time_stamp": "2023-10-20 12:39:06",
    "text": "Hello! I am working on a document access solution that needs to work within a workflow. I created the custom object but I'm having a hard time connecting the dots between logged-in user list membership and giving that list access to specific rows in the db. Has anyone done this or can point me in the right direction? I am pretty new to hubl and am from the .NET world where I would typically have another routine that determined user access before rendering the list from my db. So far I'm lost doing this with HubSpot cms."
  },
  {
    "poster": {
      "poster_name": "Jim Komara",
      "poster_handle": "jkomara"
    },
    "time_stamp": "2023-10-20 12:40:03",
    "text": "My object will have attachments - those attachments are the actual pdf docs that will be displayed. Everyone on the 'Boeing' list will see Boeing related documents."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-10-20 14:39:16",
    "text": "Hi Kevin, this is a misleading error, if I am right about the cause. And we are aware of it. The missing scopes are not the app scopes but the scopes for personal access key..\nCan you deactivate your personal access key and recreate it, do the auth with new key and try again?"
  },
  {
    "poster": {
      "poster_name": "Kevin-C",
      "poster_handle": "kevin285"
    },
    "time_stamp": "2023-10-20 14:40:32",
    "text": "Hey <@U03FJQPSC0Y>\nWorking with support we've actually tried that and creating an all new CRM card. We are still getting the same error :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Kevin-C",
      "poster_handle": "kevin285"
    },
    "time_stamp": "2023-10-20 14:41:18",
    "text": "Ticket #13574883"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-10-20 14:41:20",
    "text": "Okay. I will check on my end. Btw <#C05R599UA12|ui-extensions>  is where you can find better response on this"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas689"
    },
    "time_stamp": "2023-10-20 14:57:36",
    "text": "has anyone figured out / is it possible to send a variable like a contact ID to a graph ql query from a email template?"
  }
]