[
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "s.hennig"
    },
    "time_stamp": "2021-03-30 02:47:10",
    "text": "The :is() pseudo is a great thing. But unfortunately it’s still not supported by all browsers. Some don’t support it at all, some only support the depricated former version :any() and some only support the former version -webkit-any:(). So yes, great way to keep ones css clean, but unforunately not really usefull yet. At least if you want to support most commonly used browsers."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-03-30 06:07:06",
    "edited": {
      "time_stamp": "2021-03-30 06:12:31"
    },
    "text": "Sharing for awareness: <https://www.wordfence.com/blog/2021/03/php-compromised-what-wordpress-users-need-to-know|https://www.wordfence.com/blog/2021/03/php-compromised-what-wordpress-users-need-to-know>\n\nThis does not impact HubSpot hosted sites. I know though many in the community also develop wordpress websites which do rely on PHP.\n\nUpdate: evidently the code didn't make it to production so no need to panic.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-03-30 06:17:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-30 06:17:53",
    "edited": {
      "time_stamp": "2021-03-30 06:18:29"
    },
    "text": "wow, thats worrying! - I think technically even if it did make it to production it would’ve only impacted people building from source - which isn’t a small thing, but most people are generally using apt-get/yum which is pegged in most cases to stable versions.\n\nBut it’s fantastic talking point - PHP is used by a significant portion of the web. A parallel to draw is that a lot of people on HubSpot will be using CDN’s to include things like jQuery and libraries from cdnjs, etc.\n\nMake sure you’re pulling these libraries locally. Checksums/integrity do work but not on all browsers. These CDN services are high reward targets for hackers (even state sponsored) and it’s incredibly simple to just remove that dependency."
  }
]