[
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-04-20 09:23:36",
    "text": "Is anyone else having issues with global modules not correctly handling defaults? Anytime I create a global module such as my header and footer, I always have to go into the global module editor and add all the correct values into the fields before they show at all. Additionally, and this maybe happening with regular modules as well sometimes, when I change the field name on a repeating field (not full tested with non repeating fields) the system doesn't register the change. Everything shows the field names correctly (developer tools, calling the parent variable to see its children, etc.) but it just wont print out the data with the change."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-04-20 09:26:30",
    "text": "A lot of the time, external JS and CSS doesn't pull into the previewer. Try adding the module to a page and test it there. If it still isn't working then it is probably just a bug in the code itself. I generally use  <https://inorganik.github.io/countUp.js/|CountUp.js > When I need a counter."
  },
  {
    "poster": {
      "poster_name": "Ilya Nizev",
      "poster_handle": "ilya.nizev"
    },
    "time_stamp": "2022-04-20 10:05:29",
    "text": "Weirdest thing is happening, I have this code to show a module with editable content after the fifth blog post on every page.\n```{% for content in contents %}\n  {% if loop.index == 4 %}\n    {% module \"Module name\" path=\"../../modules/module-name.module\" %}\n  {% endif %}\n{% endfor %}```\nThe issue is that it only works if I make it global, otherwise it doesn’t update the content of the module and it always shows the default values for the fields.\nOf course, if I move it away from the loop – it works, but I need it inside of the loop. Does anyone know why?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-20 10:20:37"
      },
      {
        "time_stamp": "2022-04-20 11:27:17"
      },
      {
        "time_stamp": "2022-04-20 12:13:42"
      },
      {
        "time_stamp": "2022-04-21 04:53:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-04-20 10:20:37",
    "text": "So it is showing the fields on the page editor while it's in the loop, it just won't let you update them?"
  },
  {
    "poster": {
      "poster_name": "Ilya Nizev",
      "poster_handle": "ilya.nizev"
    },
    "time_stamp": "2022-04-20 11:27:17",
    "text": "Exactly, I can see fields, but it won't update them "
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-04-20 12:13:42",
    "text": "Gotcha… I'm not sure why it's happening or a real fix without exploring the code and debugging myself but I can give you a work around. You can use “export to template context” to add fields directly to the template instead of using a module. It's a bit messier but it works. Then you just move the html and css from the module into the template and access those fields where you need them. "
  }
]