[
  {
    "poster": {
      "poster_name": "Hans Bulder",
      "poster_handle": "hans"
    },
    "time_stamp": "2022-04-07 02:18:06",
    "edited": {
      "time_stamp": "2022-04-07 02:22:16"
    },
    "text": "Hello,\n\nI'm moving blogs to a new template.\nThe new blog template has some extra modules where some new content can be loaded. For example a quote.\nThis is going to be used in all new blogs post, and might be added to the current blog posts.\nThese modules are only displayed when the module contains content.\nWe have set some default content for these modules.\n\nNow here is the challenge:\nWhen I change the template of the blog, these modules are loaded and show the default text.\nI do not want this, because for the current blogs, the content is not relevant.\nI can of course remove all the default content from each blog, but there are quite a few.\n\nSo my idea was to remove the default content from the template. Then change the template for the blogs. And restore the default content.\nBut unfortunately, that default content is loaded again.\n\nIs there a way to set the modules to an \"edited\" state, in order for them to not load the default data, after I restore the default data in the template\nOr is anyone having another great idea?\n\nWith kind regards,\nHans",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-07 08:51:20"
      },
      {
        "time_stamp": "2022-04-08 01:40:47"
      },
      {
        "time_stamp": "2022-04-08 13:45:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2022-04-07 08:51:20",
    "text": "Could you maybe add a Boolean field somewhere for \"Show module\" and have it default to unchecked? Then the user can enable it on each post when they go to update it.\n\nThen wrap the module in a condition \"If show module\". You could probably even remove it in the future if they've populated all the posts with content."
  },
  {
    "poster": {
      "poster_name": "Nicole Lawrence",
      "poster_handle": "nicole.lawrence"
    },
    "time_stamp": "2022-04-07 13:41:47",
    "text": "Hello,\nI am currently trying to calculate estimated read time for my blog articles using the following HubL code, which is working fine. However, my template includes additional content within some custom modules that I have created. Is there a way to include estimated read time for the blog post content PLUS the content within those custom modules?:\n```{{ content.post_body|wordcount|divide(300) }} min read time```",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-07-26 19:07:22"
      }
    ]
  }
]