[
  {
    "poster": {
      "poster_name": "Dan Stillgoe",
      "poster_handle": "dan126"
    },
    "time_stamp": "2020-01-03 01:10:06",
    "text": "I seemed to have this error a few times, when actually all of the staged pages were published fine - could be a bug?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-01-03 06:37:59",
    "text": "Yeah, seems like a bug to me Dan! <@U2H3TT8F2> how do I go about reporting this?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-01-03 07:15:51",
    "text": "I would submit this to support. I'll also pass this along internally but opening a support ticket on this will allow for better tracking. Just send me the ticket number when submitted."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-01-03 07:18:47",
    "text": "Ticket number: *#2977126*"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-01-03 07:19:04",
    "text": "thanks AJ!"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2020-01-03 08:32:44",
    "text": "hey, I have images that are not resizing, anyone else?"
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2020-01-03 11:27:04",
    "text": "For those that work at agencies, what is your agency’s policy for response time for any emergency website issues that occur outside of business hours (site goes down, something else is appearing incorrectly, etc.) ? Do you have a standard turnaround time for response and resolution? Do you keep employees “on call” at all times? How do you handle holidays if any/all of those specialists become unavailable? Thanks in advance!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-01-03 13:09:13"
      },
      {
        "time_stamp": "2020-01-03 13:13:01"
      },
      {
        "time_stamp": "2020-01-04 10:35:35"
      },
      {
        "time_stamp": "2020-01-04 11:06:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-01-03 13:09:13",
    "text": "This is usually setup during the sales process, if they need a specific type of engagement/support\n\nThat being said, if an issue on a website is preventing business from happening (key landing page down, home page blown up) -- we will look into this in the first 24 hours and communicate that we are looking into it.  )\n\nHolidays - unless someone is being paid double time to work, it is ignored until next business day\n\nDays off that aren't holidays. (company outing, extra days off for christmas) - We would set up \"on call\" -- manager handles any incoming issues, determines if it is necessary, if they can't solve or determine a problem, then it is passed off (if an emergency) ot the on call person.\n\nNON BUSINESS CRITICAL issues -- they are put in a queue with work and we try to get them in a few days"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-01-03 13:13:01",
    "text": "Depending on the client, we would change some of these in our service agreement.\n\nI no longer work for a large agency, but I do work for like 12 different agencies. I worked on christmas because there was an emergency that was business critical. I also knew making an update on christmas eve would cause this. so I handled it"
  },
  {
    "poster": {
      "poster_name": "Steven Ward",
      "poster_handle": "steve308"
    },
    "time_stamp": "2020-01-03 17:20:54",
    "text": "Hello everyone. I was wondering, do you think there would be value in an identity verification app? This would include photo ID verification and knowledge based authentication quizzes to prove age and identity of consumers."
  }
]