[
  {
    "poster": {
      "poster_name": "Giovanni Todorevic",
      "poster_handle": "giovanni.todorevic"
    },
    "time_stamp": "2023-07-07 02:05:11",
    "text": "Already solved it"
  },
  {
    "text": "Hey folks,\nI want my Git tool (GitKraken) to show me the differences between what I have on 'my local branch' compared to what I'm fetching from the HubSpot account (Design Tools).\n\nLets say I just did a fresh upload to the account so that what I have locally on my machine is 1:1 with what's in the Design Tools theme folder.\n\n*What I expected*: if I change code lines inside Design Tools and press \"Publish changes\" I should be getting those changes if I run `hs fetch`, and those changes would appear in GitKraken as \"unstages changes\"/new/changed stuff.\n\n*What actually happens*: I modify code lines in the Design Tools, but when I fetch I don't get those changes. No changes picked up in GitKraken and no trace of the modified code lines locally in the file in question.\n\nThe documentation only claim to fetch files or directory with child folders/files, and it doesn't overwrite files without using the `--overwrite` flag.\n\nIssue is that using the `--overwrite` does the overwriting, but in the act it also provide its own take on formatting... which to a Git tool looks like 'everything' has changed. Making it impossible to determine what changes was done directly inside the Design Tools compared to what I have locally.\n\nAnyone tried something similar?",
    "time_stamp": "2023-07-07 03:21:57"
  },
  {
    "text": "Hi everyone, I'm working with the cms-react-boilerplate and trying to integrate the MUI library.\nFollowing all the installation steps it works perfectly, but i found an issue. When trying to load a particular component in react from the mui library (specifically the TextField component) it wont upload the files to HubSpot and throws a validation error (see screenshot).\n\nI really appreciate any help/suggestion!",
    "time_stamp": "2023-07-07 07:44:04"
  },
  {
    "text": "here is that line, seems like a comment\nmaybe the \"}}\" has something to do with it failing the validation...?",
    "time_stamp": "2023-07-07 07:53:10",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-07-07 10:04:29"
      },
      {
        "time_stamp": "2023-07-07 10:05:34"
      },
      {
        "time_stamp": "2023-07-07 10:21:00"
      },
      {
        "time_stamp": "2023-07-08 06:52:28"
      },
      {
        "time_stamp": "2023-07-08 06:54:43"
      },
      {
        "time_stamp": "2023-07-17 12:30:22"
      },
      {
        "time_stamp": "2023-07-17 12:31:40"
      },
      {
        "time_stamp": "2023-07-17 12:38:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jacob Jennings",
      "poster_handle": "jacob550"
    },
    "time_stamp": "2023-07-07 10:04:29",
    "text": "did you try commenting everything with `//` instead of `/* * * * * * */`"
  },
  {
    "poster": {
      "poster_name": "Jacob Jennings",
      "poster_handle": "jacob550"
    },
    "time_stamp": "2023-07-07 10:05:34",
    "text": "It doesn’t seem to like the `*` so worth a shot ¯\\_(ツ)_/¯"
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2023-07-07 10:21:00",
    "text": "Seems like a legit idea but unfortunately this is compiled code from the library so I don't really have access, maybe there is a package that converts comment styles :stuck_out_tongue:"
  }
]