[
  {
    "poster": {
      "poster_name": "Lukas Kahwe Smith",
      "poster_handle": "lukas.smith"
    },
    "time_stamp": "2022-09-21 00:42:16",
    "text": "I am trying to make sure we no longer get blocked by our enterprise customers and while setting up DMARC reporting I noticed that a lot of emails are send via `<http://bf03.eu1.HubSpotemail.net|bf03.eu1.HubSpotemail.net>` and not our personalized recommended HubSpot SPF. I contacted support and got the following response from HubSpot support and this leaves me quite puzzled. Any advice? We are also using Mailjet but it doesn't seem possible to easily just move all email sending to Mailjet while keeping the convenience of the HubSpot UI.\n```* The team have shared that this is expected behaviour currently to not see full SPF alignment\n\n* This is because when sending from shared IPs HubSpot marketing emails are actually being sent out by a domain which is going to be some variant of <http://HubSpotemail.net|HubSpotemail.net>, rather than customers' specific domain.\n\n* The only way to achieve full alignment is with the Dedicated IP add-on service which allows us to set a custom return-path.\nHowever, full alignment is not required to pass DMARC or for SPF verification.\n\n* All that is needed to simply pass DMARC is to connect your email sending domain for DKIM verification and add the SPF record for SPF verification.\n\n* So even if the <http://HubSpotmail.net|HubSpotmail.net> address isn't passing DMARC in the external tools, your email sending domain likely will pass it, and again if we cannot see any error in-app (in HubSpot) then all should be working correctly.```",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-21 08:49:51"
      },
      {
        "time_stamp": "2022-09-21 08:51:41"
      },
      {
        "time_stamp": "2022-09-21 11:36:07"
      },
      {
        "time_stamp": "2022-09-21 11:37:41"
      },
      {
        "time_stamp": "2022-09-21 11:38:05"
      },
      {
        "time_stamp": "2022-09-21 11:40:07"
      },
      {
        "time_stamp": "2022-09-21 11:41:00"
      },
      {
        "time_stamp": "2022-09-21 11:41:22"
      },
      {
        "time_stamp": "2022-09-21 11:41:33"
      }
    ]
  }
]