[
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 13:18:11",
    "text": "What a joke.  Who  the heck cares, besides the egos in HubSpot, how you developed your design system?  What a joke to not release it.\n\nIs HubSpot’s design system more precious than…\nSalesforces Lightening????\n<https://www.lightningdesignsystem.com/>\nIBM’s Carbon?<https://www.carbondesignsystem.com/>\nVMWare’s Clarity?\n<https://clarity.design/>\nFoundation?\nBootstrap?\n\nIs HubSpot really based in the Cambridge MA? I’d expect better from the great developers in MA."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-28 13:47:46",
    "edited": {
      "time_stamp": "2020-10-28 15:59:02"
    },
    "text": "Hi <@U01BJAF94KT> not really sure why you’re upset by this, hopefully you can clarify so I can help better.\n\nThe design system site was publicly released actually because we talk about design systems in some of our materials for marketers. This gives folks a glimpse into how we approached it so we’re not just talking about something that can’t be seen.\n\nDesign systems are indeed very popular and lots of big businesses use them. We are not claiming ours is better than others. Ours is used by HubSpot exclusively. It is not competition to foundation, bootstrap etc.\n\nFor other companies we encourage using our boilerplate, which is NOT Canvas, and is a bare-bones starting point for building  sophisticated websites on the CMS.\n<https://developers.HubSpot.com/docs/cms/building-blocks/themes/HubSpot-cms-boilerplate>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-28 13:50:02",
    "text": "The Canvas system is built specially tailored for HubSpots use-cases. It’s also pretty stylized. It would not make sense to use for other sites."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:17:01",
    "edited": {
      "time_stamp": "2020-10-28 15:18:41"
    },
    "text": "Just because I tell you that your software is a lame doesn’t mean I’m upset.  I charge by the hour and am very happy many clients will need to fill in holes left by the HubSpot.\n\nLet me see if I understand.  “We talk about design systems in some of our materials for marketers” so you published some doc on the design system without the actual design system, right?  What value did you get from the marketers from this effort?\n\nWhat value would your CUSTOMERS get if you published it?  More.  A lot more. Same thing with the OpenAPI that you use internally in generating code but don’t publish.  Maybe it’s just too good for anyone else to see?  Again, huge value to your customers if you care to part with the jewels (which, compared to other design systems are gumball rings).\n\nI am making an iframe in an installed app CRM card.  My client wants the iframe to look like the rest of HubSpot.  Can the CMS Boilerplate be used for an App Integration?  I’m thinking it’s not because it uses HubL."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:31:13",
    "edited": {
      "time_stamp": "2020-10-28 15:31:26"
    },
    "text": "<https://github.com/HubSpot/cms-theme-boilerplate/tree/master/src/css>\n“The CSS for the boilerplate is written using HubL+CSS.”"
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:31:54",
    "text": "And that CSS is a small portion of what you documented."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-28 15:33:18",
    "edited": {
      "time_stamp": "2020-10-28 15:33:59"
    },
    "text": "To clarify the marketing materials I was referring to were about why we created a design system for our own use, and why other businesses should consider creating their own. Our published canvas pages show an example of what it looks like.\n\nNot “we have an awesome design system everyone should use ours.” The purpose was never hey you should use our design system. That would defeat the purpose.\n\nWe’re also not guarding this design system because it’s proprietary - releasing all of the code for this design system would cause folks outside the company to potentially use it. That would undermine the brand identity purpose of Canvas. More importantly though Canvas is frequently iterated on and we carefully manage how those changes are rolled out within HubSpot.\n\nIf the design system is used by third parties, we can no longer move quickly. Any changes we make to it, would affect everyone using it.\n\n\nRegarding your feedback around creating CRM Cards that look good I’ll relay that feedback there’s probably some guidance we can provide."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:34:09",
    "text": "I should not make my own if the UI appears within HubSpot’s UI.  I should use HubSpots’s system so it looks the same."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:35:16",
    "text": "Yes, design systems have to be carefully engineered for release to the public.  Or released internally. :slightly_smiling_face: You have a hack you can’t release."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:36:42",
    "text": "Thank you, I’m sure I’m not the only one wanting this feature.  Right now CRM cards all look different from the HS UI?  That’s not what users expect."
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-28 15:37:59",
    "text": "I’m not actually wanting to style the CRM Card, that’s already sytled by HS. I want an action in a CRM Card to open an iframe and have my iframe be styled like HS too."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-28 15:56:58",
    "text": "&gt; I should not make my own if the UI appears within HubSpot’s UI. I should use HubSpots’s system so it looks the same.\nAgain I’ll relay this feedback with the team in charge of CRM cards. I hear you.\n\nThis could potentially be an intentional decision, or just a result of wanting to give developers more freedom quickly and easily (iframes being that mechanism instead of a very strict limited integration).\n\nI would think though the end-user should know whether the functionality is built-in or coming from an integration. The user should know if something isn’t working, whether to go to HubSpot support or the integration’s support.\n\nYou being able to have your own design helps solve for that. You get credit for your integration’s cool functionality. The integration is a reminder of the service you are providing. It also silos your creation in it’s own environment meaning our iterations to our design system do not break your app."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-28 16:02:41",
    "edited": {
      "time_stamp": "2020-10-28 16:07:42"
    },
    "text": "&gt; “The CSS for the boilerplate is written using HubL+CSS.”\nJust wanted to respond to this part, I apologize for making an assumption here - until your messages about CRM cards I interpreted what you were saying as if you wanted to use the Canvas design system within your own CMS Hub website. I was not thinking about the CRM card use-case.\n\nThis is why I was asking why another company would want their brand identity to look like HubSpot."
  }
]