[
  {
    "poster": {
      "poster_name": "Julia Soto",
      "poster_handle": "julia"
    },
    "time_stamp": "2020-10-30 04:30:47",
    "text": "The same happen to me. :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Michael Bushe",
      "poster_handle": "michael125"
    },
    "time_stamp": "2020-10-30 11:37:26",
    "edited": {
      "time_stamp": "2020-10-30 11:38:59"
    },
    "text": "Well, if the app is good enough, we’d consider putting it on the App Marketplace eventually.  This is really unique?  The api to open an iframe is there.  Am I the rare person willing to take the leap?  Agreed it involves advanced dev skills. Do apps in the Marketplace create iframes in the HS UI often? When they do do the iframes have different styling than HS?\n\nI took a shot at using the css that comes with HS but that’s 19,000 lines long with no doc and even getting a simple font right isn’t easy (my strong is normal and my normal bold, for example).  I’m thinking about making an open source project for HS React components to fill this gap but it’s so silly to do the work that’s already been done by HS.  It would be a total hack no matter how it’s done without coordination with HS.  If y’all can release the design system then I could make the React components for it.  Or maybe HS can release their components as well. :slightly_smiling_face: Thanks again."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-30 11:47:51",
    "edited": {
      "time_stamp": "2020-10-30 11:51:19"
    },
    "text": "&gt; This is really unique? The api to open an iframe is there. Am I the rare person willing to take the leap?\nNo, what I meant is for example say you were eventbrite or a service like that, you’d want your eventbrite branding instead of HubSpots that way you are not limited to the input types and styling HubSpot provided you. If you have a better mechanism for say managing events in eventbrite, you should be able to provide that. Customers should also be clear that it’s your integration offering the feature. That gives you credit for your tool is doing. Reinforcing it with folks who may not have been the one to  install the integration. It then also creates awareness of your integration that can lead to more sales/users since more folks will know “hey an integration exists for this” instead of thinking it’s something that came out of the box with HubSpot. This is kind of the trade off of giving you an iframe vs say a  limited UI tool where you can only use a subset of our components and only have those components like buttons do things we accounted for.\n\nNot exactly certain what code you’re referring to on the “CSS that comes with HS” but for example the boilerplate is meant for building sites on the CMS, and NOT meant for emulating HubSpot’s UI. So that could be a source of some confusion. Again sorry if my prior confusion between what you were trying to do caused that."
  }
]