[
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-01-28 05:26:38",
    "text": "What is the function of the  `smart_type` variable in the meta.json of a custom module?"
  },
  {
    "poster": {
      "poster_name": "Dana",
      "poster_handle": "do481"
    },
    "time_stamp": "2021-01-28 11:40:08",
    "text": "Hello, I'm able to use the HubSpot cli to watch templates and modules no problem. But the css/js are located in the the file manager and are included via `{%- set asset_id=\"filename\" -%}`  in templates. I'm styling in my local editor by editing scss/js files and then I would compile them and upload via `npx hs filemanager upload` . This method keeps me from previewing my styles in the sandbox as I test things. Has anyone had a workflow like this and has found a solution to \"watching\" assets so they would upload to the file manager without having to manually compile and upload them to see a preview?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-01-28 15:29:17",
    "text": "Just out of curiosity, how often would you say you’ve run into that issue of content editors pasting in content from other apps and having the underlaying html/format that is carried over be problematic?"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-28 15:43:31",
    "text": "Quite often… our copywriters all work in Word, so our content editors are almost always pasting from it.  It’s an easy fix as long as that the content editor recognizes the problem, but often times they don’t pick up on the extra markup throwing off spacing so it doesn’t get noticed til down the road in a design review."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-28 15:48:32",
    "text": "Also I was thinking I could use regex to validate the content as a safeguard, but looks like that’s not an option for rich text, only for plain text fields?"
  }
]