[
  {
    "poster": {
      "poster_name": "David Duymelinck",
      "poster_handle": "david.duymelinck"
    },
    "time_stamp": "2019-11-18 01:11:24",
    "text": "For php developers. I love the Ryan Winchester API library, which is now taken over by HubSpot. But I feel like it already is showing its age. There are also somethings that could be better, like switching to a new API version. I started this weekend on a library of my own, <https://github.com/xwero/HubSpot-psr7>.  It is build around the PSR-7 standard recommendation. All comments are welcome.",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-11-18 08:14:50"
      },
      {
        "time_stamp": "2019-11-18 08:36:45"
      },
      {
        "time_stamp": "2019-11-18 08:39:10"
      },
      {
        "time_stamp": "2019-11-18 08:43:16"
      },
      {
        "time_stamp": "2019-11-18 08:58:51"
      },
      {
        "time_stamp": "2019-11-18 09:00:50"
      },
      {
        "time_stamp": "2019-11-25 01:34:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Igor",
      "poster_handle": "igor253"
    },
    "time_stamp": "2019-11-18 04:07:03",
    "text": "Thanks.. I’ll take a look"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-11-18 08:14:50",
    "text": "Hey <@UKQP9KM8A>, thank you for putting so much work into something others can use. I’m starting to think about what HubSpot’s role in the open source community should be.  In the case of Ryan’s library, he didn’t feel he had time to maintain it and transferred ownership over to us since we have some resources to put behind it.  In the meantime would you be willing to chat about what you want to see out of a client library and what you think HubSpot’s role should be?"
  },
  {
    "poster": {
      "poster_name": "David Duymelinck",
      "poster_handle": "david.duymelinck"
    },
    "time_stamp": "2019-11-18 08:36:45",
    "text": "A client library should be future proof, that is why I'm using PSR-7. It should have all the endpoints that are available, with all options. It should be able to switch between API versions to check for changes."
  },
  {
    "poster": {
      "poster_name": "David Duymelinck",
      "poster_handle": "david.duymelinck"
    },
    "time_stamp": "2019-11-18 08:39:10",
    "text": "As for HubSpot's role the one thing I miss is API version changes. What is removed, what is added, what is changed."
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-11-18 08:43:16",
    "text": "That makes a lot of sense. Have you seen <https://developers.HubSpot.com/changelog>?  This is where we are trying to communicate all those types of changes."
  },
  {
    "poster": {
      "poster_name": "David Duymelinck",
      "poster_handle": "david.duymelinck"
    },
    "time_stamp": "2019-11-18 08:58:51",
    "text": "I wasn't aware of that page :thumbsup:  But i was more thinking about this kind of page, <https://www.php.net/manual/en/migration74.php>"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-11-18 09:00:50",
    "text": "Gotcha, I think we will end up putting together something like that. We are working on more structured versioning for our APIs since right now changes occur on a more of a rolling basis but we’ve found that’s not always the ideal way to introduce new features or change responses. I like the idea of a page that lists the differences between versions"
  }
]