[
  {
    "poster": {
      "poster_name": "Felipe Flores-Requeno",
      "poster_handle": "felipe.flores-requeno"
    },
    "time_stamp": "2023-05-10 01:31:58",
    "text": "Hello team and thanks for providing this resource.\nI am a developer trying to implement a POC for a HubSpot App integrating with my company product.\nIn a gist we want to be able to trigger some actions from HubSpot accounts (workflows) that would create some settings in our product.\nWe would like to limit the data needed to only a handful number of fields (perhaps using only Company OAuth scope) and only when mapped by the user in a workflow step to the fields of our workflow action.\nThe question I have is _how could we uniquely identify/map the HubSpot customer/account to our App customer’s account?_\nOn the OAuth handshake we get a code, but that code is for us pulling the data from HubSpot, but what could we use when receiving data from HubSpot? Do we need to ask access to perhaps another scope? something that shares the HubSpot account id and ask for it in our action as well?  or do we really need to sync the data from HubSpot into our app (eg sync Company data using the OAuth tokens and marry/map their ids)?\nI hope this makes sense. Thanks for reading and for any advice that you could provide.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-10 10:21:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Eric Goldman",
      "poster_handle": "eric732"
    },
    "time_stamp": "2023-05-10 10:21:22",
    "edited": {
      "time_stamp": "2023-05-10 10:23:15"
    },
    "text": "Hey <@U056V3VCMQE>\n\nA couple thought here:\n1. You’ll need some unique identifier to map your HubSpot `customer` with your app’s `user` / `account` - you can do this using the email? Or you need to store either the `user_id` in HubSpot.\n2. A sync might be the best way to do these lookups. We built a product to help → <http://sequin.io|sequin.io>. I’d be happy to talk with you more about how it could work"
  },
  {
    "poster": {
      "poster_name": "Megan Legge",
      "poster_handle": "mlegge"
    },
    "time_stamp": "2023-05-10 12:13:05",
    "text": "we're taking a look <@U02BW35KW7J> thanks for reporting!"
  }
]