[
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2024-12-19 10:33:53",
    "text": "Hi, i have a subscription based product where clients get certain information inside of their company records, currently in the legacy crm cards. I'm moving to the UI extensions and placing some of the data in crm cards and some as crm.record.tab in the center. Now this ui extension shown in the record tabs, I only want to show to certain subscription levels and not all. Is there a way, if I check the subscription level on the backend, to only show the ui extension if it has certain permissions?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-24 11:47:18"
      },
      {
        "time_stamp": "2025-01-05 11:54:31"
      }
    ]
  },
  {
    "text": "<@U04EJHVD8FM> <@U01NMMDTERZ> Hi! We're seeing an issue on our CRM extension cards.\nA modal that is opened from a side-panel is now causing the card to crash and display the following message:\n\nThe first error is when running from the deployed project. The second is in local development.\nOn the console logs:\n```hook.js:608 [Modal] Modals cannot be nested\noverrideMethod\t@\thook.js:608```\nThis error is new. The panels where these modals are being triggered are not. Their files haven't changed.\nApparently every modal that is called from a side-panel is causing this issue.",
    "time_stamp": "2024-12-19 11:53:10",
    "edited": {
      "time_stamp": "2024-12-19 11:54:51"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-20 07:15:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Raphael Varieras",
      "poster_handle": "raphael692"
    },
    "time_stamp": "2024-12-19 13:15:48",
    "text": "Hey <@U05KNCMAE7N> - not really that relevant for me anymore because so many of the features I was using are now available as UI options. Mostly I think I was trying to display text with bulleted list in a tab driven by the CRM development tools. These days I mostly just use property display widget in custom tabs."
  },
  {
    "poster": {
      "poster_name": "Sriya Mitra",
      "poster_handle": "sriya.mail"
    },
    "time_stamp": "2024-12-19 20:52:59",
    "text": "Thanks a lot <@U05KNCMAE7N> for the help. I will try that and get back to you if I have any follow up questions"
  }
]