[
  {
    "text": "Hi all!\n\nI am trying to achieve something similar like the screenshot in my custom crm card.\nWhat I am trying to do is render the &lt;StatusTag&gt; component as a Label option inside of the options attribute that a Select component has.\n\nIs this possible? It seems the Select component only takes a string as a valid label inside of an option. Thanks in advance!",
    "time_stamp": "2024-12-04 07:09:32",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-04 07:22:40"
      },
      {
        "time_stamp": "2024-12-04 07:38:18"
      },
      {
        "time_stamp": "2024-12-04 07:40:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-12-04 07:22:40",
    "text": "Hi,\nYou're right in that its not possible today. One hacky way of getting around this is to add a string with a colored emoji next to it to indicate the status :large_green_circle::red_circle::large_yellow_circle: I know its not ideal but will note your feedback and will let you know if we make any changes here"
  },
  {
    "poster": {
      "poster_name": "Purusothaman K",
      "poster_handle": "pk"
    },
    "time_stamp": "2024-12-04 07:30:04",
    "text": "We have integrated our UI extension on the Deal Record page and are currently using fetchCrmObjectProperties to retrieve data from the current deal record, such as the name.\n\nTo fetch the most recent associated contact property (email) directly from the Deal object, we initially attempted to use a formula custom property. However, formula custom properties are only supported in the Enterprise and Professional editions and are unfortunately not available in the Starter edition.\n\nGiven this limitation, we need to explore an alternative solution to reliably fetch the most recent associated contact property (email) directly from the Deal object in our UI extension."
  },
  {
    "poster": {
      "poster_name": "Robert F. Hoekstra",
      "poster_handle": "roberthoekstra"
    },
    "time_stamp": "2024-12-04 07:38:18",
    "text": "Thanks for the quick response! I figured we could do it the 'hacky' way. We'll stick to that solution. But we would love to see it becoming a feature! Thank you for your time and effort :smiley:"
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-12-04 07:40:29",
    "text": "100% heard. Thanks for bringing this up!"
  },
  {
    "poster": {
      "poster_name": "Sriya Mitra",
      "poster_handle": "sriya.mail"
    },
    "time_stamp": "2024-12-04 10:26:04",
    "edited": {
      "time_stamp": "2024-12-04 10:27:35"
    },
    "text": "Hi we are trying to build Public APP CRM Card that users can download and install in a Deal Object and uses OAuth.However I am stuck on the GUI part of the UI extension as I am not sure how to render the Action = HOOK for the CRM App card for the public app as I am unable to attach any action to the button ( I was checking in the app Settings Section of the App Card in the HS Developer Portal) . The preview is unable to load. Also I am unable to install it in the test account. Can some one please guide ?"
  }
]