[
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2024-12-16 05:30:25",
    "text": "Thanks <@U01NRM1BS3A>! I had not done one of those rollups before. That's exactly what I was looking for! I can definitely get the count using that. It'll be perfect. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2024-12-16 06:39:19",
    "text": "Interestingly, it looks like the rollup properties don't directly trigger `onCrmPropertiesUpdate` to run. However, whenever I change the value of another property, the rollup value displays its updated value. So I'll have to figure out another way to trigger the change. But I think it's a step in the right direction!"
  },
  {
    "poster": {
      "poster_name": "Pete Nicholls (HubDo)",
      "poster_handle": "pete970"
    },
    "time_stamp": "2024-12-16 06:47:03",
    "text": "Agreed. Writing up all the “Add CRM Card” steps in the user guide, is “friction, not delight”"
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2024-12-16 15:08:49",
    "text": "Do CRM action components provide for callbacks? The buttons are great, but I want the extension to trigger another action once the first is done. For instance, I want to add a new custom object, and then display the number of associated custom objects in the card (very simplified example).\n\n<@U01NRM1BS3A> suggested using a rollup property to increment the number of associated objects, however, it looks like `onCrmPropertiesUpdate` isn't getting triggered by a change to the rollup property."
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-12-16 20:30:16",
    "text": "<@UTYRPALSZ> very good callout, sorry for the confusion! I will check on this and someone from the team will get back to you."
  }
]