[
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-07-27 02:15:53",
    "text": "cc <@UCJANAW1Y>"
  },
  {
    "poster": {
      "poster_name": "Jack Smith",
      "poster_handle": "jasmith"
    },
    "time_stamp": "2022-07-27 04:42:38",
    "text": "Can you dm me a link to an example?"
  },
  {
    "poster": {
      "poster_name": "Fiona Tang",
      "poster_handle": "fiona.tang"
    },
    "time_stamp": "2022-07-27 12:15:18",
    "edited": {
      "time_stamp": "2022-07-27 12:16:06"
    },
    "text": "I posted this in the <#CSFGKSHT7|themes> channel but thought it’d be worth it to post here as well:\n\nHello, I am trying to recreate a Learning Center module in a new theme that I’m using.\n\nI cloned the original module and placed it into the relevant folder so that it can be dragged/dropped via the theme’s editor. Then, I copied the `module.html` (HTML + HubL) and the `module.css` files to the recreated module.\n\nThe HTML elements are rendering on the page, so I know it’s hooked up properly, but many of the styles are still broken because the original module was relying on a different global stylesheet. Is there a way I can “include” or “import” that stylesheet into the module itself? It’s a fairly complex module, with filters and search, since it’s one that requires the use of a HubDB (hub database).\n\nThank you. Happy to jump on a call, too, if it’s easier to explain/screenshare.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-27 13:53:57"
      },
      {
        "time_stamp": "2022-07-28 05:41:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-07-27 13:53:57",
    "edited": {
      "time_stamp": "2022-07-27 13:56:01"
    },
    "text": "You could add the CSS file as a dependency to the module, or you could do `{{ require_css(get_asset_url('../path/to/file.css')) }}` at the top of the module HTML file. I wouldn’t really recommended either option though, especially if it’s a large global CSS file. Your best bet would be to cherrypick the styles you need and add them to the module CSS, but if that’s not really an option or you just want the quickest way, the other 2 options should work."
  },
  {
    "poster": {
      "poster_name": "robert sampang",
      "poster_handle": "imjackfrost1997"
    },
    "time_stamp": "2022-07-28 00:05:59",
    "text": "Hi, I'm trying to filter my data from my HubDB using \"Choice Field - Select\" on my Custom Module. Is this feasible?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-07-28 08:35:19"
      }
    ]
  }
]