[
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Jenny Sowyrda",
      "poster_handle": "jsowyrda"
    },
    "time_stamp": "2018-12-11 12:34:30",
    "text": "Hey team! Does anyone have any advice to help this user show related articles based on campaign for their blog: <https://community.HubSpot.com/t5/Content-Design-Questions/Show-the-List-of-quot-Related-articles-quot-based-on-the/m-p/220256>. Any tips, tricks or thoughts would be greatly appreciated!! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-12-11 12:41:03",
    "text": "I can try to answer later today/tomorrow unless someone else wants to go at it"
  },
  {
    "text": "Hi HubSpot Community,\nI received this error message when trying to connect to my account via zapier. I'm an admin to the account. Am I missing something here?",
    "time_stamp": "2018-12-11 13:44:08"
  },
  null,
  {
    "poster": {
      "poster_name": "Tim Joyce",
      "poster_handle": "tim"
    },
    "time_stamp": "2018-12-11 14:27:56",
    "text": "from my post here: <https://integrate.HubSpot.com/t/oauth2-error-you-do-not-have-correct-role-to-grant-these-permissions/11469>"
  },
  {
    "poster": {
      "poster_name": "Tim Joyce",
      "poster_handle": "tim"
    },
    "time_stamp": "2018-12-11 14:28:19",
    "text": "You might notice that a Super Administrator of a portal can successfully connect to your integration and an admin or regular user with the right permissions would receive this error.\n\nThat's because Super Admins can install any app into any portal, no matter the scope requirements.\nHowever, if the portal doesn't support one of your scopes, then any other user than Super Admin will receive this error.\n\nHere's an example:\n\nMy integration requires the content scope\nA super admin of a HubSpot free plan can successfully Auth into my integration, even though HubSpot free accounts don't come with Landing Pages or Websites. This should make the scope permissions for a super administrator invalid, but it doesn't... they can connect anyway because scopes are ignored on the super admin level\nNext, a user for the same portal with ALL permissions turned on but not a super admin, will reach this error. This is because the scopes are failing because the portal configuration doesn't allow for the content scope\nBottom line is: Super Admin can install any integration they want, without worrying about scope. Any other user needs to have the correct scope.\n\nIt's important to remember that just because all the permissions of a user are turned on to give them access, doesn't mean they have the right scopes. The portal configuration needs to be considered as well."
  },
  null
]