[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 07:33:41",
    "edited": {
      "time_stamp": "2018-04-05 07:34:33"
    },
    "text": "getting a weird issue I’ve never seen before. when trying to download jpgs in google chrome It’s asking me to save them as webp. and if I try changing the file extension, it says the image is corrupt.\n\nHere’s the wacky bit. the images file extension definitely says jpg.\n\nThe images are hosted on HS, when viewed on chrome saving them results in the mentioned webp format, if viewed in firefox it gets jpg.\n\nAnyone know if HubSpot is doing something or if Chrome is being ridiculous?\nI mean if HS is converting images to webp for chrome users I’m all for it, I just want to know"
  },
  {
    "poster": {
      "poster_name": "Bradley Haveman",
      "poster_handle": "bradley"
    },
    "time_stamp": "2018-04-05 07:36:05",
    "text": "I've seen this before, as far as I know it is Chrome, when I saved the same image on Firefox it was fine"
  },
  {
    "poster": {
      "poster_name": "Bradley Haveman",
      "poster_handle": "bradley"
    },
    "time_stamp": "2018-04-05 07:36:33",
    "text": "Could be HubSpot doing it just for Chrome"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-05 07:43:00",
    "text": "yes, images are optimized and converted to webp at delivery time if they can be served more efficiently and the browser supports webp"
  },
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2018-04-05 07:47:59",
    "edited": {
      "time_stamp": "2018-04-05 07:48:07"
    },
    "text": "<@U7SL518D6> I ran into that as well. It's a Chrome thing: <https://developers.google.com/speed/webp/>\n\nWhile the extra compression is great, it's a shame that there isn't an easy way in Chrome to access the original format (since that is available on the server for other browsers anyway). But if you paste the image URL into Firefox you'll be able to save the image as the original format.\n\nThere are few other ways to save as png/jpg, but I haven't tried them out yet\n<https://www.howtogeek.com/325864/how-to-save-googles-webp-images-as-jpeg-or-png/>\n<https://beebom.com/how-save-webp-images-jpg-png-chrome/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 07:49:50",
    "text": "well, I’m familiar with webp. The issue is that the images I’m dealing with show as .jpg, but can only be downloaded in chrome as .webp\n\nSo I’m not even converting the images, they’re litterally jpgs and Chrome just wants to convert them."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 07:53:21",
    "text": "Here’s the issue: I’m seeing which is beyond bizzare to me: <https://spin.d.pr/ya0qu3>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 07:54:47",
    "text": "Ever seen that weirdness?"
  },
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2018-04-05 07:55:40",
    "text": "Yeah I see that as well."
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2018-04-05 07:56:46",
    "text": "Just because the URI at the end is `.jpg` doesn't mean the file is `.jpg` format. I am guessing chrome is autodetecting the file's format"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-04-05 07:59:56",
    "text": "whoa, didn't know HubSpot is doing that now. awesome!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 08:00:00",
    "edited": {
      "time_stamp": "2018-04-05 08:00:31"
    },
    "text": "it’s weird though, you’d think if HS is converting jpgs to webp(Which I’m totally cool with) it’d change the file url to include webp as well even if they’re going to make it “filename.jpg?format=webp” . I mean they’re already changing the file urls to add query parameters for the sizes.\n\nI’m guessing it’s a recent change because I haven’t noticed this before on any other HS sites."
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-04-05 08:16:25",
    "text": "is there anything special you need to do in order to enable webp images?"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-05 08:19:13",
    "text": "the conversion is done at the time the request is served. To serve converted images with .webp extensions, we’d have to redirect to a new URL which would slow down the response"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-04-05 08:50:12",
    "text": "So it just works is what your saying?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 09:32:50",
    "text": "So can it not be done when requesting headers for the html page, and then change the URLs at that time, instead of when the image itself gets requested?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 09:34:09",
    "text": "see: Server-side content negotiation via Accept headers\n\n<https://developers.google.com/speed/webp/faq>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 09:41:54",
    "text": "I could be speaking completely out of my butt - the server side magic isn’t my department.  just thought it might be possible that when the the page hit happens that it’d be possible at the server side to see the accepts webp header, go:cool beans change the image urls to webp for the ones that are supported.\n\nInstead of doing the header check when each image is called(which seems redundant because it would then likely check again for every image on the site). \n\nAgain not my area of expertise, so I apologize if my own understanding of the wizardry isn’t up to snuff."
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-05 10:13:27",
    "text": "changing the server HTML would mean that the page would have to be cached differently for browsers that support webp and those that do not"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-05 10:38:58",
    "text": "ahh, makes sense. understood.\n\nAppreciate that you guys added the feature, it’s pretty boss. Now I feel kinda dumb for having used some webp images in the past on HS sites."
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-04-05 11:31:17",
    "text": "you’re free to use webp images independently as well."
  },
  null,
  null
]