[
  {
    "poster": {
      "poster_name": "George Grigorita",
      "poster_handle": "george.grigorita"
    },
    "time_stamp": "2023-09-01 03:54:52",
    "text": "I would like to expand a bit on the conversation from above. <@U044BTK3EGP> wrote about making API calls client-side and using GraphQL to GET and POST data both to HubSpot CRM and to other third-party apps. Right now what is the preferred (or “default”) method for working with external APIS (GET data) and the HubSpot API (POST data in the CRM)?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-09-01 03:57:45"
      },
      {
        "time_stamp": "2023-09-01 07:05:40"
      },
      {
        "time_stamp": "2023-09-01 07:18:38"
      },
      {
        "time_stamp": "2023-09-01 08:05:03"
      },
      {
        "time_stamp": "2023-09-01 08:17:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "George Grigorita",
      "poster_handle": "george.grigorita"
    },
    "time_stamp": "2023-09-01 03:57:45",
    "edited": {
      "time_stamp": "2023-09-01 16:28:05"
    },
    "text": "For example, it would be very helpful (and cool) to be able to use GraphQL to both get data from an external API and then post data in the HubSpot CRM.\n\nThe use case here (for my current usage) would be a form where you get default values from an external API, then the user fills in other details and onSubmit you post the data to the CRM."
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-09-01 07:05:40",
    "text": "George, this is great feedback. Here's a PR to our examples documentation around the subject of data fetching <https://github.com/HubSpot/cms-js-building-block-examples/pull/26/files>"
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-09-01 07:18:38",
    "text": "As it states in the PR there is sort of a matrix of data fetching needs\n\nHubSpot data server side\nHubSpot data client side\nExternal data server side\nExternal data client side\n\nIn addition to as you suggest the ability to update CRM data (or other HubSpot data).\n\nI'll start with what is most clear in that GraphQL will be the go to for server side data fetching relative to JS Building blocks (and within HubL ideally). We are working to expands the types of data you can fetch this way.\n\nAs far as GraphQL from and external API, likely that will take the form of a flexible way to do some async operation at render time and have the results in our Component props. I'm not sure I think there's a sane path for exporting an arbitrary X query for Y GraphQL service. The developer would be responsible for creating the query string and making the call with whatever GraphQL client.\n\nI very much appreciate the feedback around making updates. I'm interested in your take on what that would look like... Currently you might build a serverless function and hit it from the browser based on some user interaction."
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-01 08:05:03",
    "text": "Serverless functions would be great but they're only available in enterprise :) That's what I was thinking about since they seem to be the official way to deal with these scenarios in HubSpot but we're not ready to make the jump yet (we're in Professional). Also, in the Projects documentation on the HubSpot website it's unclear who has access to what license-wise. They mostly show Sales and Service enterprise but projects can also be used for the CMS at the Professional level. Some clarifying would help a lot there."
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-09-01 08:17:22",
    "text": "Arrigo - great callout around Projects. Currently access to JS Rendering Beta provides access to projects for the purposes of building the \"CMS Asset\" Project Component type."
  }
]