[
  {
    "poster": {
      "poster_name": "Jeff W",
      "poster_handle": "jwaterfall"
    },
    "time_stamp": "2023-09-12 14:45:57",
    "text": "Any suggestions on rendering `hsvideo2`  player?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-13 09:31:07"
      },
      {
        "time_stamp": "2023-09-13 10:18:23"
      },
      {
        "time_stamp": "2023-09-13 10:19:02"
      }
    ]
  },
  {
    "text": "Hi team,\n\nAs I'm implementing a production website, I'm hitting some significant issues:\n\n1. I've sent a build which somehow corrupted the entire website, leading to some kind of infinite loop, see the screenshots attached.\n2. Because JS rendering is only available to people who opted into the beta, I cannot spin up a staging environment in a separate CMS portal, leading to this kind of problem.\n3. I am consistently getting \"Module path must end with module name\" errors in the projects view, see other screenshot. I don't know why and what they mean.\n4. In general, error handling is very hard to deal with and it's not clear what went wrong when things do go wrong. I think this is crucial for a good experience.\n5. Currently, the theme and project workflows are very disjointed, leading to impossibilities of understanding how modules are behaving in the theme.\n    a. Also, either in the projects view or theme view in HS portal, there should be a way to see module fields in a UI, same as traditional modules.\n6. Builds require you to re-build the entire project structure again and again from my understanding. Isn't there a cache that can ignore already-built modules and only build those with changes made to them? This would speed up development significantly.\nThese are all major issues that I am experiencing as I try to build a real-world website.\n\nI'm a bit disappointed to see most of the pages on the website wiped out after just a small additional build.\nFortunately I have saved most of the copy that I had written if it's lost, but doing the work of recreating pages again is clearly not great.",
    "time_stamp": "2023-09-12 23:54:28",
    "edited": {
      "time_stamp": "2023-09-12 23:54:49"
    }
  },
  {
    "text": "Forgot to upload what happened with the modules.",
    "time_stamp": "2023-09-12 23:55:13"
  },
  {
    "text": "As you can see here, even a simple template with just header and footer just doesn't work anymore.\nThis is exactly the kind of stuff I was worried about when I asked if the beta was stable.\n\nI have just done 1 build this morning, and this happened throughout the website.\nI'll try to debug this but please let me know how to avoid this in the future.",
    "time_stamp": "2023-09-12 23:59:03",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-13 10:08:16"
      },
      {
        "time_stamp": "2023-09-13 10:18:44"
      }
    ]
  },
  {
    "text": "Another thing, is there any place where I can read what the \"platform version\" means?\nCurrently I am on 2023.1 and I read somewhere that we put this to ensure that no issues arise with incompatibilities in newer versions.\n\nHowever it would be good to have a changelog to understand what's going on over time, apart from PRs.",
    "time_stamp": "2023-09-13 00:14:15",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-09-13 07:43:26"
      },
      {
        "time_stamp": "2023-09-13 08:24:22"
      },
      {
        "time_stamp": "2023-09-13 10:29:24"
      },
      {
        "time_stamp": "2023-09-13 10:32:19"
      },
      {
        "time_stamp": "2023-09-13 10:32:51"
      }
    ]
  },
  {
    "text": "I've spent some time debugging, I've even created a new project, nothing has worked so far.\nWhen I open the footer module, I get the attached error in the console.\n\nTried searching for it on Google, nothing shows up.\nI will stop for a few hours as I have other things I'd like to do, but this is very urgent for me.\n\nI literally haven't changed anything from 1 day to the other and everything broke.\n\nThank you for all the help in advance!",
    "time_stamp": "2023-09-13 00:42:08",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-13 01:52:02"
      }
    ]
  }
]