[
  {
    "text": "<@U02CS2Q38QG> ask and you shall receive!\n\nEverything is built using module fields, so everything that's on the website can be edited from the page designer.\n\nI make heavy use of repeated field groups to iterate over things like features, pricing tiers, logos, etc. so you basically create a collection of objects within the module.\n\nEach template is made up of around 3 sections, and each section is made up of around 3 to 5 modules.\n\nEach module is inserted in its own DnD row to allow for padding and margin adjustment on the fly.\n\nThe only thing that I don't make use of are side by side DnD columns because I find them hard to create responsive designs with. With Tailwind it's easy.",
    "time_stamp": "2023-09-19 05:44:56",
    "edited": {
      "time_stamp": "2023-09-19 05:45:36"
    }
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-19 05:47:07",
    "edited": {
      "time_stamp": "2023-09-19 05:47:13"
    },
    "text": "The idea of breaking things down like this is that creating a new page from scratch will only take you adding 3 sections, or you can mix and match sections however you want. Sections have default layouts, paddings, etc. so marketers don't have to fiddle with settings and can write copy ASAP."
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-19 05:47:40",
    "text": "<@U02CS2Q38QG> If you want I can share some of the code with you :slightly_smiling_face: Whatever you need to get your own website up, I'm happy to help."
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-19 05:48:35",
    "text": "I was also able to use SWR to load data from a third-party serverless function that I used as a proxy to hide the environment secrets."
  },
  {
    "text": "",
    "time_stamp": "2023-09-19 07:31:28"
  },
  {
    "text": "What happened to the js rendering option? I don't see it anymore.",
    "time_stamp": "2023-09-19 19:32:43",
    "reply_count": 6,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2023-09-19 19:35:06"
      },
      {
        "time_stamp": "2023-09-19 19:36:09"
      },
      {
        "time_stamp": "2023-09-19 19:37:34"
      },
      {
        "time_stamp": "2023-09-20 00:09:07"
      },
      {
        "time_stamp": "2023-09-20 06:49:51"
      },
      {
        "time_stamp": "2023-09-21 13:02:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-09-19 19:35:06",
    "text": "You no longer need to opt in to JS rendering to start using it (broader announcement coming tomorrow)"
  },
  {
    "poster": {
      "poster_name": "Sasha Sosin",
      "poster_handle": "sasha"
    },
    "time_stamp": "2023-09-19 19:36:09",
    "text": "Hmm. Ok thanks. Couldn't get it to work in a sandbox module on a developer account earlier. Should js components be able to render in a module previewer?"
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-09-19 19:37:34",
    "text": "I believe so - were you able to successfully upload your components as a project in that account?"
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-20 00:09:07",
    "text": "<@U04DVL5T2TE> since JS rendering will be publicly announced, it would be good to have the documentation on the official CMS docs or project docs. I find it jarring having to look at the GitHub and then being redirected to VitePress when I could go where I usually get the rest of the information :slightly_smiling_face:"
  }
]