[
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-24 04:25:09",
    "text": "Hi everyone,\n\n<@U05CAJG8D98> <@U02CS2Q38QG> since you had asked, I have made a repository with the various modules I've built:\n<https://github.com/sagewillcom/HubSpot-js-components-starter>\n\nA few things to note:\n\n1. I've had to remove all styling in class names because I am using a licensed product and cannot re-propose it publicly.\n2. Although the modules do make up a fairly complete theme, I wouldn't use this for your own projects, it's very opinionated and not flexible enough for a marketer to use without significant compromises to the editing experience.\n3. Some things are handled badly, like importing tailwind styles in each module or using SWR for loading blog post previews.\nFor now I've added only the JS blocks directory, soon I will add the theme directory as well.\n\nRight now, this repo is meant for reference / learning only.\nIt's akin to the JS examples HubSpot provides, but I wouldn't straight clone it.\n\nHowever, there is a lot more use of the modules here, and especially repeated field groups which I find essential.\n\nLet me know:\n\n• If you'd like a JS-powered theme that can be simply installed and used like any other theme, free and with unlicensed code.\n• If it's very important for you to see how the theme directory is structured to work with JS modules correctly.\nHonestly, I'm quite keen on just making a free theme and get it out there for people to use.\nBut I have other priorities with my startup right now and can't spend a lot of time on it :slightly_smiling_face:\n\n<@UCY83QS6Q> <@UAYBXDG4U> <@U04DVL5T2TE> <@U03U053QC72>\n\nIs it already possible to sell JS-powered themes on the HubSpot marketplace?\n\nI'd be interested in looking into it in the near future.\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2023-09-24 04:28:05",
    "text": "Also, I've noticed during the editing experience that when I duplicate sections or add new ones, the React code isn't immediately rendered but rather I have to refresh the editor to see the full section. Not a great experience for marketers creating the pages.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-25 07:06:00"
      },
      {
        "time_stamp": "2023-09-25 07:15:13"
      },
      {
        "time_stamp": "2023-09-25 07:17:11"
      }
    ]
  }
]