[
  {
    "poster": {
      "poster_name": "Joanna Emma",
      "poster_handle": "joanna.emmaofficial"
    },
    "time_stamp": "2023-07-28 04:47:20",
    "text": "Okay! Thanks for the response!"
  },
  {
    "poster": {
      "poster_name": "Pop Petru",
      "poster_handle": "ppop"
    },
    "time_stamp": "2023-07-28 08:06:28",
    "text": "Yes. I can help you"
  },
  {
    "poster": {
      "poster_name": "Sillena Ajala",
      "poster_handle": "sajala"
    },
    "time_stamp": "2023-07-28 08:33:31",
    "text": "<@UATE4ATHP> Thank you! This isn't really my lane so I appreciate the help."
  },
  {
    "poster": {
      "poster_name": "Ericsen Wrice",
      "poster_handle": "ericsen.wrice"
    },
    "time_stamp": "2023-07-28 10:06:14",
    "text": "Hi all!\n\nWhat is the best way for us to have current customers seamlessly request to add more seats or add to their subscription? We have a specific pipeline  along with a specific email that helps distinguish the pipeline is for additional seats requested but if I'd like to have them either access a bot that identifies their Company ID or have some email parsing tool that will connect through HubSpot API and highlight \"We'd like to add 5 seats\" and automatically associate all of this into the deal where we then review and accept or alter the deal. Let me know if anyone has any ideas that work for this sort of automation.."
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-07-28 11:05:45",
    "edited": {
      "time_stamp": "2023-07-28 11:05:47"
    }
  }
]