[
  {
    "text": "Hi everyone, I made multiple custom modules in HubSpot CMS. They work perfectly on website pages &amp; landing pages, but they are unavailable on Blogs. Actually, I do not even see the \"Add\" tab there and based on the error in the terminal, they seem to be unsupported in the Blog. I found this post on Community forum -&gt; <https://community.HubSpot.com/t5/HubSpot-Ideas/Drag-amp-Drop-functionality-for-Blog-Posts/idi-p/408909>\n\nWhile it also suggests that currently, it is not possible, I got confused by this message there -&gt; *The only way to achive this right now is a custom module with all possible content types and pre-defined layouts and a repeater function.*\n\nWhat does it mean? :face_with_raised_eyebrow:",
    "time_stamp": "2021-10-04 06:06:12",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-04 06:52:24"
      },
      {
        "time_stamp": "2021-10-04 07:10:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-04 06:52:24",
    "edited": {
      "time_stamp": "2021-10-04 06:54:34"
    },
    "text": "You can use custom modules in blog post templates, which can be edited  at the post level. You can't however use dnd areas in blog post templates at this time.\n\nThat the module is there for all posts. What folks commonly will do is use the custom module to change the html and CSS of the post to different layouts if their posts need to look significantly different from each other."
  },
  {
    "poster": {
      "poster_name": "Martin Hlavacka",
      "poster_handle": "mhl"
    },
    "time_stamp": "2021-10-04 07:10:23",
    "text": "Understood, thanks"
  },
  {
    "time_stamp": "2021-10-04 08:00:29",
    "text": "Reminder: Welcome to our developer community. If someone helps you out by answering a question. please pay it forward by helping someone else out in the community - when you know an answer. Ask questions in the relevant channels, our community is very active and will see it. We have a chatbot that can answer commonly asked questions, feel free to reach out to it by DMing `@DevHelp`\n"
  },
  {
    "text": "Hi Everyone, I have a problem on hs init command, when page opens to generate personal access key and when I submit, page just reloads, and in network I am getting 401 Unauthorized, I dont know how it happens since I am Superadmin. Can anyone help please?",
    "time_stamp": "2021-10-04 09:07:22"
  },
  {
    "poster": {
      "poster_name": "Shannon Walker",
      "poster_handle": "swalker"
    },
    "time_stamp": "2021-10-04 12:50:49",
    "edited": {
      "time_stamp": "2021-10-04 12:51:05"
    },
    "text": "I'm having an issue setting up my local development. When I enter a unique name to reference my account, I get the following two errors:\n1.  RequestError  Error: self signed certificate in certificate chain\n2. A TypeError has occurred. Cannot destructure property 'accountId' of '(intermediate value)' as it is undefined."
  },
  {
    "text": "I even deleted and re-created my developer account and still get the error.",
    "time_stamp": "2021-10-04 14:13:10"
  },
  {
    "poster": {
      "poster_name": "varun doharey",
      "poster_handle": "varundoharey"
    },
    "time_stamp": "2021-10-05 00:39:27",
    "text": "<@UTQQ4TXCH> any help here pls"
  }
]