[
  {
    "poster": {
      "poster_name": "Stuart McInnes",
      "poster_handle": "smcinnes"
    },
    "time_stamp": "2023-07-26 04:29:30",
    "text": "Feedback from the crew:\n\nThe problem is that we need multiple env. for development purposes:\n• Acceptation, for client delivery and beta testing (current enterprise sandbox of plan)\n• Staging, for internal QA\n• Local, for every developer to work on locally\nAcceptation is linked with Github actions (HS best practices), this makes is not suiteable as a live development env. because every code change needs a github push in order to become available on the HS. Imagine sending an email for every text line you type on slack .\n\n*Is it not possible to open up those permission for at least the local env. of the B/E dev working on this module?*"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-07-26 04:34:54",
    "text": "So what I can tell you is that you can create test portals with a HubSpot developer account. Especially if you are using the HubSpot CLI tool, you can authorize with multiple portals. This means in your HubSpot yaml file you can have a reference to each portal that you work with and deploy to each portal individually."
  },
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-07-26 06:45:04",
    "text": "<@U04UF7BNBK4> thanks for the input. Do I understand correct that we can link multiple dev-sandbox accounts to 1 HubSpot enterprise account (what is needed for the permissions to be ok)?"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-07-26 07:10:28",
    "text": "A portal has its on set of available features, and depending on the permissions of the user you can use more features.\n\nA sandbox shares the same available features as the actual portal. A testportal has more features activated so that testing is easier."
  }
]