[
  {
    "poster": {
      "poster_name": "Alex Ratiu",
      "poster_handle": "alex.ratiu"
    },
    "time_stamp": "2024-02-23 01:04:43",
    "text": "Adding a new field property on the company just to determine if is part of an enrollment or was enrolled in the past is more like a workaround, it should work indeed if you refer to this approach. But not sure if I can do this retroactively for all the companies already enrolled in the past in some workflows.\n\nI was just looking to HubSpot request from the application and this is how I get to this endpoint <https://app.HubSpot.com/api/automationapps/v1/history?portalId=x> it does exactly what I need but cannot be accessed without being logged in HubSpot App (csfr + some HubSpot cookies)"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2024-02-23 07:14:23",
    "text": "Did you find anything on your issue?"
  },
  {
    "poster": {
      "poster_name": "Facundo Lopez",
      "poster_handle": "consultasfacundo322"
    },
    "time_stamp": "2024-02-23 13:00:03",
    "text": "Hi, I'm new here and I've been searching and reading the documentation on how to associate conversations with contacts that don't have a conversation linked, using the HubSpot API. I've tried using the conversation's ThreadID, but it doesn't seem to work; the API response for associations is a 207 HTTP error indicating that the ID doesn't exist. Thank you in advance to anyone who knows how to do this! Much appreciated!"
  },
  {
    "poster": {
      "poster_name": "Fahad Sheji",
      "poster_handle": "fahad604"
    },
    "time_stamp": "2024-02-23 15:05:27",
    "text": "Hey all, I have a very specific use case am not sure can be done on HubSpot but I'll ask anyway.\n\nIs there a way I can check if, the next open slot on a specific meeting link is 7 days away = Notify team"
  },
  {
    "poster": {
      "poster_name": "Jared Majewski",
      "poster_handle": "j.majewski"
    },
    "time_stamp": "2024-02-23 16:34:15",
    "text": "Hi, I'm currently getting contact list membership by calling\n```/crm/v3/lists/{ILS List ID}/memberships```\nthen searching the list for the contact's ID. Is there a property or search param way to call the contacts api and get the individual contact's memberships back or another more efficient way to retrieve this info for a single contact? Thank you much"
  }
]