[
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-01 03:16:00",
    "text": "hi everyone, I'm new here, hope you are doing good. I have one question, i would like to add some responsive custom css to my drag and drop email template or my custom modules, but can't figure out how to do it, is there a workaround to achive this ? Thanks a lot in advance",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-02-01 05:23:15"
      },
      {
        "time_stamp": "2022-02-01 05:24:33"
      },
      {
        "time_stamp": "2022-02-01 07:29:20"
      },
      {
        "time_stamp": "2022-02-01 07:38:50"
      },
      {
        "time_stamp": "2022-02-01 10:02:12"
      },
      {
        "time_stamp": "2022-02-01 10:36:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-01 05:23:15",
    "text": "Hey Denis, unfortunately this is not possible on the current version of the tool. :confused: For anything more complicated/responsive, I strongly suggest using the coded email templates."
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-01 05:24:33",
    "text": "Thank you for your feedback, but when i will use coded email templates, we can have de drag and drop features ?"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-02-01 07:29:20",
    "text": "Coded emails don't have drop and drop. Do you want the ease of drag and drop or the customization of coded? You basically have to choose one or the other."
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-01 07:38:50",
    "text": "I want to give the possibility to my client to use my template and drag and drop, remove, add modules, and in that template i would like to add custom css for mobile display, but don't think this is possible atm"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-02-01 10:02:12",
    "text": "There are ways to make a custom coded template that a client can use without touching code, but it won't be drag and drop. You can use a module with a repeater for X number of sections, and then they can choose the type of layout they would want for each section, and fill out the content. Because it's using a repeater they can re-order the sections, but they won't be dragging and dropping content blocks/elements into the email. You'd need to build in the flexibility to show/hide elements, etc. in the module."
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-01 10:36:09",
    "text": "Thank you for all this tips, will see what i can do :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jose Nunez",
      "poster_handle": "joseenrique0595"
    },
    "time_stamp": "2022-02-01 12:04:06",
    "text": "Hi all! I’m uploading “email modules” from local to my portal, these modules belongs to emails but when I already uploaded, the modules on the emails are blank. What could be the issue? missing references?\nThanks!"
  }
]