[
  {
    "poster": {
      "poster_name": "Scott Moyse",
      "poster_handle": "scott.m"
    },
    "time_stamp": "2024-04-25 02:11:34",
    "text": "Hi Team, this is a very interesting new feature and I'm stoked to see local development support. However, we use Bitbucket to manage all of our code. It appears you only support GitHub currently, is Bitbucket on the roadmap?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-25 08:20:26"
      },
      {
        "time_stamp": "2024-04-25 17:32:04"
      },
      {
        "time_stamp": "2024-04-25 17:32:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Moyse",
      "poster_handle": "scott.m"
    },
    "time_stamp": "2024-04-25 02:22:25",
    "text": "<@U03FJQPSC0Y> surely it's a must? rather than a consideration. Unless I'm missing something, the push from HubSpot towards Help Desk means Conversations and Tickets are abstracted from the user. So any custom functionality we can build out on Tickets, really does need to be available in Help Desk... otherwise it's just driving users away from Help Desk."
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-04-25 08:20:26",
    "text": "Hi Scott, we actually have not received this request from other customers yet, so its not currently on our roadmap to support.\n\nDo you have any other tools in your development lifecycle that you could use to automate your deployments from Bitbucket like <https://circleci.com/|CircleCI> other CI/CD products?"
  },
  {
    "poster": {
      "poster_name": "Scott Moyse",
      "poster_handle": "scott.m"
    },
    "time_stamp": "2024-04-25 17:32:04",
    "text": "We can have a look into it. But it would suck having to have any HubSpot work be outside of everything else... especially given we are most likely going to be writing this code to render out and interact with data in our internal business systems which are developed in house."
  },
  {
    "poster": {
      "poster_name": "Scott Moyse",
      "poster_handle": "scott.m"
    },
    "time_stamp": "2024-04-25 17:32:14",
    "text": "Thanks for the suggestion."
  },
  {
    "poster": {
      "poster_name": "Jeff",
      "poster_handle": "jeff.adawag"
    },
    "time_stamp": "2024-04-25 23:16:57",
    "edited": {
      "time_stamp": "2024-04-25 23:18:25"
    },
    "text": "So we have a ticket object that is associated to a deal object and what we want is when we create that ticket object we also create the associated deal"
  }
]