[
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2024-04-10 02:39:21",
    "edited": {
      "time_stamp": "2024-04-10 02:40:01"
    },
    "text": "Hey everyone! I am wondering about test portals and the UI Extensions. I was actually hoping that the projects could now also be developed in the test portals but it seems this is still not an option. I have built a few Extensions in the past months but always in connection with contracted work in a clients HubSpot portal that had either Sales or Service Enterprise.\n\nMy outdated version of the hs cli suggested I should join a beta which of course is now not available anymore. The updated cli simply says The post in account xxxxxxxxx failed.\nIs there any way to try out new ideas without working in the portal of a client?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-04-10 08:14:34"
      },
      {
        "time_stamp": "2024-04-10 08:18:30"
      },
      {
        "time_stamp": "2024-04-10 08:34:48"
      },
      {
        "time_stamp": "2024-06-01 18:44:54"
      },
      {
        "time_stamp": "2024-06-03 07:42:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-04-10 08:14:34",
    "text": "Hi Byron, do you have access to a partner demo portal? We have other solution partners using those portals to test ideas before sharing with their customers."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2024-04-10 08:18:30",
    "edited": {
      "time_stamp": "2024-04-10 08:18:58"
    },
    "text": "Hey Roger!\nI have access to a partner demo portal but as this is technically my client who uses my work inside of portals of their clients I would ideally want to work outside of it.\n\nAs a matter of fact I have tried to get in touch with HubSpot Partner Program people to figure out how my own company in Vietnam can become an actual partner - but after two tries I have not heard from anyone.\n\nThis is why I was hoping that the testing portals are now able to do it :smile:"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2024-04-10 08:34:48",
    "text": "For anybody that may end up being as blind as I am: The beta is available in test portals.\n<https://app.HubSpot.com/product-updates/>\n```CRM development tools to build UI extensions with React as frontend```\nI still don't understand why I did not find it before - but thanks to <@U056ZR8LVJQ> it is solved now :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Deidra Kandra",
      "poster_handle": "dkandra"
    },
    "time_stamp": "2024-04-10 17:29:34",
    "edited": {
      "time_stamp": "2024-04-10 17:30:24"
    },
    "text": ":wave-yeti: Hi <@U01QVR44MEY>! Yep, we should have the card setting rolled out to production tomorrow! :boom:\n\nBy default, all reports will still filter on associations but you can go in and edit the settings to update the filter preference"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-04-10 17:31:18",
    "text": "Beautiful, sounds great! awesome work"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-04-10 21:23:44",
    "text": "Hey Robert, Thank you for explaining your problem in great detail. I am interested in learning more about your business use case. If you are comfortable, would you be able to share it here, or you can DM me. Your problem can be solved in many ways, none of which are available today, but taking your use case as an example is helpful."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-04-10 21:29:39",
    "edited": {
      "time_stamp": "2024-04-10 21:30:28"
    },
    "text": "Thanks. I am still interested to learn if you had copied the trace ID and used Log trace, then would it have helped you in troubleshooting your problem, so I understand how useful has log trace been in debugging such problems."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-04-10 21:34:22",
    "text": "So you are not using CRM development tools, but building your calling app using calling SDK as listed/unlisted public app, is that right?"
  }
]