[
  {
    "poster": {
      "poster_name": "Sharad Bhandari",
      "poster_handle": "sharad"
    },
    "time_stamp": "2023-05-22 03:53:43",
    "edited": {
      "time_stamp": "2023-05-22 04:00:12"
    },
    "text": "Should i place access token value or api key value, i think above code seems not much different"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-22 05:18:11",
    "text": "the object inside needs to have the \"accessToken\". and the value that you assign, should come from the private app that you have to setup in the portal."
  },
  {
    "poster": {
      "poster_name": "CW Team",
      "poster_handle": "hr"
    },
    "time_stamp": "2023-05-22 12:44:00",
    "text": "Hello @team i have found bugs in HubSpot Now a days. when can see the Layout in preview mode it’s working with all the modules. when i’m trying to edit particular page using live site Edit mode i can’t see anything just one section is showing. after update i am facing this issue."
  },
  {
    "text": "Hello everyone! I've been struggling with a custom schema object UPDATE. Ive been testing with Postman and it looks like the endpoint is correct and returns a 200 OK response but im no seeing any changes whatsoever. I checked for the logs in my private app and they have all been logged correctly but no changes are reflected in my object. Does anyone know what may be going on? Here are the screenshots of my code and postman. Thanks for the help!",
    "time_stamp": "2023-05-22 13:38:42",
    "reply_count": 21,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-22 13:56:06"
      },
      {
        "time_stamp": "2023-05-22 14:02:10"
      },
      {
        "time_stamp": "2023-05-22 14:16:15"
      },
      {
        "time_stamp": "2023-05-22 14:33:24"
      },
      {
        "time_stamp": "2023-05-22 14:38:12"
      },
      {
        "time_stamp": "2023-05-22 14:53:07"
      },
      {
        "time_stamp": "2023-05-23 06:52:14"
      },
      {
        "time_stamp": "2023-05-23 06:54:29"
      },
      {
        "time_stamp": "2023-05-23 07:01:53"
      },
      {
        "time_stamp": "2023-05-23 07:02:36"
      },
      {
        "time_stamp": "2023-05-23 07:08:12"
      },
      {
        "time_stamp": "2023-05-23 07:11:41"
      },
      {
        "time_stamp": "2023-05-23 07:11:57"
      },
      {
        "time_stamp": "2023-05-23 08:48:25"
      },
      {
        "time_stamp": "2023-05-23 08:58:30"
      },
      {
        "time_stamp": "2023-05-23 09:02:51"
      },
      {
        "time_stamp": "2023-05-23 09:05:07"
      },
      {
        "time_stamp": "2023-05-23 09:09:58"
      },
      {
        "time_stamp": "2023-05-23 09:14:22"
      },
      {
        "time_stamp": "2023-05-23 09:18:20"
      },
      {
        "time_stamp": "2023-05-23 12:18:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Juan Camilo Romero",
      "poster_handle": "juancamiloromero"
    },
    "time_stamp": "2023-05-22 13:40:40",
    "text": "Hi! Take a look at my recent post where i did the setup for the private app through the access token <@U04UF7BNBK4> is talking about. Maybe it helps you to clear up some ideas!"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-22 13:56:06",
    "text": "Its a bit late here, but I think you might have to use the properties API to add new properties to a custom Object."
  },
  {
    "poster": {
      "poster_name": "Juan Camilo Romero",
      "poster_handle": "juancamiloromero"
    },
    "time_stamp": "2023-05-22 14:02:10",
    "text": "Hi! Actually im trying to update those properties that already exist in my object. Not sure u=if the patch method is for doing that. Im trying to make the integration certification practicum where the post route should be able to create or update a new object. Dont get it to work properly and im doing it as the documentation says.."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-22 14:16:15",
    "text": "Hmm okay I have to ask one more thing to understand your problem.\n\nAre you trying to update the value of one specific entry of your custom object, or are you trying to update the actual schema of the custom object.\n\nIf you are working with one entry in your fastest_food object, the url you are using is incorrect.\nThe url you need for that would be\n*/crm/v3/objects/{objectType}/{objectId}*"
  },
  {
    "poster": {
      "poster_name": "Juan Camilo Romero",
      "poster_handle": "juancamiloromero"
    },
    "time_stamp": "2023-05-22 14:33:24",
    "text": "Thanks for replying! Im actually trying to change one of mi custom objects properties as you say and already tried with the objects ID but returns 404 Not found. It doesnt like the objectId.."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-22 14:38:12",
    "text": "*PATCH /crm/v3/objects/2-14963659/{objectId}*\n\nthe objectId needs to be the id of the actual entry - you can see it if you navigate in the portal to that specific entry."
  },
  {
    "poster": {
      "poster_name": "Juan Camilo Romero",
      "poster_handle": "juancamiloromero"
    },
    "time_stamp": "2023-05-22 14:53:07",
    "text": "You were right!! It worked! Thanks a lot! Two days stucked and wasnt moving forward! Thanks for your help!"
  },
  {
    "poster": {
      "poster_name": "Melissa Nault",
      "poster_handle": "melissa525"
    },
    "time_stamp": "2023-05-22 15:18:01",
    "text": "Hello all!  We have a client that is on an older theme so there is no option to create a \"Child Theme.\"  They want five pages that have a different navigation than the rest of the site. So I just want to confirm what I would like to do before I pull the trigger. I was able to \"Clone the theme\" and apply that theme to the five new pages. What I would like to do now is change the menu/navigation that theme is using in the global header to the new menu/navigation I create. Doing all of this I should be able to keep these five pages as an \"Intra Net\" that the person would click around on. Am I correct? Mainly I want to make sure that the updates I do to the global header on the cloned theme only affects that cloned version of the global header."
  }
]