[
  {
    "poster": {
      "poster_name": "Kostas Karkaletsis",
      "poster_handle": "k.karkaletsis"
    },
    "time_stamp": "2023-05-05 05:04:24",
    "text": "Hello, I am new in HubSpot. I would like to develop a private app (as I don’t have access to webhooks) to update an external system when a ticket is created in HubSpot. Could anyone help me on this and point me to some documentation?"
  },
  {
    "poster": {
      "poster_name": "Chris Hanson",
      "poster_handle": "chris384"
    },
    "time_stamp": "2023-05-05 05:20:17",
    "text": "Think I am right in saying you need a public app as you will need webhooks to trigger your endpoints when a ticket is created on HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Chris Hanson",
      "poster_handle": "chris384"
    },
    "time_stamp": "2023-05-05 05:20:17",
    "text": "<https://developers.HubSpot.com/docs/api/private-apps>"
  },
  {
    "poster": {
      "poster_name": "Chris Hanson",
      "poster_handle": "chris384"
    },
    "time_stamp": "2023-05-05 05:21:17",
    "text": "From my understanding private apps let you make API calls but you need public app to allow web hooks calls, correct me if I am wrong anyone."
  },
  {
    "poster": {
      "poster_name": "Chris Hanson",
      "poster_handle": "chris384"
    },
    "time_stamp": "2023-05-05 05:22:20",
    "text": "If you create a public app, you can just lock it down to the HubSpot account ID you want it to work with, this is what I am doing on my public app."
  },
  {
    "poster": {
      "poster_name": "Kostas Karkaletsis",
      "poster_handle": "k.karkaletsis"
    },
    "time_stamp": "2023-05-05 06:03:15",
    "text": "Thanks <@U056B0PPT7F>. I don’t have access to webhooks due to my license."
  },
  {
    "poster": {
      "poster_name": "Chris Hanson",
      "poster_handle": "chris384"
    },
    "time_stamp": "2023-05-05 07:52:04",
    "text": "Can you show me where it says you can’t use web hooks? Any public app can use web hooks as far a so know and I could have free HubSpot account and pay for app in the store that utilizes web hooks and sure this would not be limited by me being on a free HubSpot account? I may be wrong but sounds odd. "
  }
]