[
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2020-03-27 03:39:31",
    "edited": {
      "time_stamp": "2020-03-27 03:48:51"
    },
    "text": "Hello dear community. FORM QUESTION :)\n_*Use Case Description*_\nI have a classic form on a page\n-&gt; Is it possible to add a control before submit to check if the contact already exists in the CRM and block the submission if it exists ?\n\nAny idea <@U25PYL3Q8>, <@U7SL518D6> or <@U2H3TT8F2> ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-03-27 06:04:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rob Butler",
      "poster_handle": "rob.butler"
    },
    "time_stamp": "2020-03-27 05:43:24",
    "edited": {
      "time_stamp": "2020-03-27 05:44:55"
    },
    "text": "Hi all, I was wondering if you could help point me in the right direction.\n\nI have a number of brands in use on our HubSpot portals, and we have some specific legal texts we need to use in the footers of our emails, depending on the type of email going out (i.e. newsletter, transactional etc) and we reference the brands in this text and also link out to our sites.\n\nI'd like to make this dynamic, so depending on a brand that's selected from a choice list I have on the template, it should then swap out the variables with the correct brand. I am however, having trouble finding a way to store all of the sites names &amp; urls somewhere I can then get the module with my footer text to pull in the required brands values."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 06:04:22",
    "text": "I think you would have to use a custom form and use the api for this. Not sure if you could do this with a classic form. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 07:02:09",
    "text": "seems like you could store the hubl data in a data attribute and access it from your js"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 07:02:45",
    "text": "`&lt;div data-hubl=\"{{ module.auth_page_link }}\"&gt;&lt;/div&gt;`"
  },
  {
    "poster": {
      "poster_name": "Andrew Gabriel",
      "poster_handle": "golf"
    },
    "time_stamp": "2020-03-27 11:51:14",
    "text": "Hi folks. I had a question regarding blog posts and was wondering if you could help me.\nSo I am building a page which should show blog posts and have filters as well as pagination. Is there a built in way in hubl to query blog posts in the page template rather than using the HubSpot API to load them client-side?"
  }
]