[
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-09-16 07:35:13",
    "text": "<@U02BW35KW7J> can you confirm if you have right tiers and you are super admin?"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-09-16 07:36:10",
    "text": "Also, can you both confirm if you are checking all update and not new updates (default filter)."
  },
  {
    "poster": {
      "poster_name": "Randy Segura",
      "poster_handle": "rsegura"
    },
    "time_stamp": "2024-09-16 07:36:24",
    "text": "Hi Brad, thanks for you feedback. We took notes on all your suggestions :spiral_note_pad:\n\nRegarding the bug, we have to clarify our docs, the description of inline is a bit misleading. Text will still break into a new line if there is not enough room to grow.  Let me try to clarify:\n\n*inline*: text elements are laid out _horizontally_, one after the other.\n*not inline(default)*: text elements are laid out _vertically_, one after the other. The vertical distance between two sibling text is determined by a predefined margin property.\n\nHope that helps. We will do better with the docs."
  },
  {
    "poster": {
      "poster_name": "Annie Short",
      "poster_handle": "annie.short"
    },
    "time_stamp": "2024-09-16 13:23:53",
    "text": "Hi all! I was wondering if there was a way to display a message or tooltip over a disabled button to give a reason as to why the button is disabled? For example, I have a series of buttons on a custom card which open different forms. Certain forms require specific associations and the buttons are disabled if those are missing. I would like to be able to display a short message to show the Sales member which specific association they need to enable the button again. Right now I am conditionally displaying a Text component at the bottom of the card to give the reason but I think a tooltip would look much cleaner.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-16 14:23:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jae Edeen",
      "poster_handle": "jedeen"
    },
    "time_stamp": "2024-09-16 14:19:31",
    "text": "The Tag component has been updated with a new `inline` prop to allow Tags to be inline within Text components. Thanks again for the feedback Magnus!"
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-09-16 14:23:24",
    "text": "Hi Annie,\nThis is great feedback and thank you for the use case detail. I agree, this is an important UX feature add. We don't have this ability right now - but it is something we are discussing how best to solve. In the meanwhile, our suggestion has been to use the microcopy variant of Text (and I see you're doing something like this right now too). I will make sure to update you as soon as we make any improvements here.\n\nThanks for your feedback and I have recorded this on our end!"
  },
  {
    "poster": {
      "poster_name": "Magnus Foldager",
      "poster_handle": "magnus"
    },
    "time_stamp": "2024-09-16 15:23:07",
    "text": "Yesssss Jae! I ADORE the quick turnaround."
  },
  {
    "poster": {
      "poster_name": "Aanchal Sheth (HubSpot PM)",
      "poster_handle": "asheth"
    },
    "time_stamp": "2024-09-16 16:34:44",
    "text": "Thank you for all the feedback <@U02F2QPB4P8>!"
  }
]