[
  {
    "text": "looking at this in the dev console, it's coming from an HTML file for the \"EN\" language.\n\nAre you able to find this file in Design Tools?",
    "time_stamp": "2024-02-20 06:02:21"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 06:15:04",
    "text": "Hi <@U03AKL6Q1B2>, that’s the thing. All theses styles get generated by the page-editor – it is not coming from the template at all – and for sure not visible within Design Tools.\nIt is normal that styles are added - as pages are built to allow setting of padding, background-color and margin on various dnd-levels (if section, column, row or module).\nIn the other Accounts I know &amp; checked the class is never called ‘background-layers’ but ‘background’ oder ‘gradient’ – with according proper styling.\nBut on this one when selecting a simple Background-Color the background image set – which shouldn’t be the case (in my opinion).\n\nExample:\nSetting the background-color to `#dbf2d7` on a dnd-section creates the (wrong) styling:\n```background-image: linear-gradient(rgba(219, 242, 215, 1), rgba(219, 242, 215, 1)) !important;\nbackground-position: left top !important;```"
  },
  {
    "text": "",
    "time_stamp": "2024-02-20 06:16:00"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 06:22:52",
    "text": "my point is: there shouldn’t be a background-image - but a plain background-color generated. It was like that priorly (but it seems it this changed recently - and I wonder why, as it doesn’t make any sense!).\n\nPreviously it WAS styled like:\n```background-color:rgba(219, 242, 215, 1)!important;```"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-02-20 06:27:59",
    "text": "Can you check the _layouts.css to see if they are added there?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-02-20 06:28:59",
    "text": "It is possible to preset options for the DND areas within your theme, this is not a global change that I can find in any of the themes or accounts I have access to (hundreds) so it has to be local to your theme files"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 07:42:08",
    "text": "regardig _layouts.css: this contains plainly only the layout-related styling for the grid-system as it is required for HubSpot (for `row-fluid` and `span1`-`span12` )."
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 07:44:07",
    "text": "regarding options: I did not add any options. These are all options which are available by default for the editor of a page.\nI wouldn’t know how to add/remove entries there (except on module-level)."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-02-20 07:55:47",
    "text": "does your theme have a _containers-dnd.css? this is also a common place where I've seen dnd section defaults being preset"
  },
  {
    "text": "For example, this theme is presetting an 80 px padding on sections, the same can be done for background colors/images, etc. which would set defaults in the page editor",
    "time_stamp": "2024-02-20 07:56:42"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 09:31:29",
    "text": "Hi, yep the theme does contain a _container-dnd.css - with mostly very basic stuffe - with some spacings there tied to settings of the theme.\nYet nothing which I would remotely connect to the issue at hand."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-02-20 10:11:39",
    "text": "I also couldn't find the specific CSS file in the dev tool, all of the styles are directly in that /en HTML template"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2024-02-20 11:09:55",
    "text": "Yep, these are all styles which the HubSpot-Editor generates (depending on the interaction of the Page-editing User).\nAll in all it is fine like that – yet what bugs me is the incorrect use of attributes (especially as it was different just a week ago).\nThere is also no documentation or anything to be found – which would provide reasoning for this (sudden) change."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-02-20 11:11:24",
    "text": "That's really strange, if you download a free theme from the marketplace and build a test page, can you check if this is still happening?\n\nIt's definitely isolated to your HS account, I wonder if it's the theme or something else triggering this"
  }
]