[
  {
    "text": "Can I update custom property by this endpoint?",
    "time_stamp": "2021-10-14 08:49:06",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-14 11:24:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "ov",
      "poster_handle": "dev297"
    },
    "time_stamp": "2021-10-14 11:24:20",
    "text": "<@U025M7ZCEBH> yes. without knowing the end goal you might also want to use the create, search and update endpoints in conjunction with the request.\n\nlets say the initial post errors out due to a pre-existing email for that record, you can catch the error response, search for the flagged email address, grab HubSpot's immutable `contactId` and patch from there\n\n```POST  ...create... /crm/v3/objects/contacts\nPOST  ...search... /crm/v3/objects/contacts/search\nPATCH ...update... /crm/v3/objects/contacts/{contactId}```\n"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-10-14 11:53:28",
    "text": "<@U0276HSQAE8> for what it’s worth — I disagree with Mitja’s last comment. While I understand where he is coming from I do think that this is a community for any and all questions. \n\nI think that there are more than just developers here with various levels of experience and time to commit to learning programming skills. I know plenty of marketers on here who also are forced into dev work. And if I were in that boat I def would want to feel like I could ask any level question to a community focused on helping with HubSpot developers. \n\nI certainly don’t want to be lumped into a community of developers who think any question is too beginner for them. \n\nIf you have any further questions that might be in this vein feel free to post them. There are plenty of people here who will be willing to spend 5 mins explaining how an if statement works. \n\nAnd you can absolutely ping me if you have any questions getting rolling on your developer journey. "
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2021-10-14 11:55:08",
    "text": "Thanks BJ"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-10-14 12:45:19",
    "edited": {
      "time_stamp": "2021-10-14 12:45:56"
    },
    "text": "<@U0276HSQAE8> <@UQWGKUEN7> Yea, I agree with BJ. The interesting thing about developer communities is that we all start as beginners and we often stay beginners in _something_ as we try to keep up with new frameworks, trends, updates, etc. The little bit of extra effort to make this community friendly and responsive is worth it. Good luck on your journey! (Feel free to ping me as well)"
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2021-10-14 12:46:49",
    "text": "Will share when the newly designed blog is complete. Thanks for all the support! I only learn one way - trial and error. It's hard, but it's the only way."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-14 13:01:24",
    "text": "BJ and Andrey, thank you for reflecting :HubSpotheart:  in our community.\n\nThere is no development question too small or too large in this community, that applies to both the developer slack and the Community forums.\n\n<@UK9BKNBD5> thank you for taking time to help Mark earlier.\n\nWe’re all at different stages, learning from each other is how we all grow. Both through being taught, and by doing the teaching. I understand feeling frustrated in situations where it feels like someone is asking you to do their work for them. I don’t believe that was the case here.\n\nI hope you’ll continue to help others as it opens so many doors and can help create long lasting relationships that are both fun, and useful to have as you grow in your career. Just remember to try to see from the other person’s eyes, and be the person you wish you had when you were learning."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-10-14 13:28:50",
    "text": "i agree with <@UQWGKUEN7> <@UDHT6N5SM> and <@U7SL518D6>, all 3 can confirm that my questions starting out were a lot more basic  then an if statement ( i wish the were only nearly as smart ;D….). Through supporting each other, we learn! <@UK9BKNBD5>, i do agree, sometimes work can build up pressure and frustration, that does trigger a response like yours. This happens to all of us from time to time. Btw: thanks again for your help on my module question a couple of days ago!\n\nWhat i love about this community is that, when i don``\nt have time and i see a question from someone who really needs to solve something, i know that there are a lot of people who are willing to help those poeple out!\n<@U0276HSQAE8> you can ping me as well if you need help!\n\nTalking about the community i also would like to mention that i am really amazed about the size of this community, 11400 Members. I do remember, when i joined in 2018 it was less then 500. I will continue to support this community!\n\n<@U0276HSQAE8> you are not alone, that the only way i learn as well. The only good thing about it is, once you learned it, you really know it for a long time!"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-10-14 15:17:59",
    "text": "<@U0276HSQAE8>, ask any question you have!  do a search for my name and you will see how much i have asked this community and how much it has helped me grow.  A while back, I had never heard of HubSpot.  I was thrown into the deep in as the when i took a job at an agency.  Thank god i found the HubSpot Developer Community!"
  }
]