[
  {
    "poster": {
      "poster_name": "Dave",
      "poster_handle": "hello479"
    },
    "time_stamp": "2023-11-02 04:13:55",
    "text": "Great, thanks"
  },
  {
    "poster": {
      "poster_name": "Deidra Kandra",
      "poster_handle": "dkandra"
    },
    "time_stamp": "2023-11-02 10:36:53",
    "text": "Hi <@U01QVR44MEY>! This is interesting! Can you tell me a bit more about your use case (pulling a page out of sejal’s book here :HubSpotheart: )\n\nWhat would you want to do with the `onClick`? Would the `onClick` be on the row? Or on a specific cell in the table? What about for pivot?\n\nWe have plans to add actions to our crm data components but still trying to find the best way to integrate. This would definitely help inform how we build that out!\n\ncc <@U021CFGT73K>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-11-02 10:43:30",
    "text": "Hey <@U05ENUJF7B5>, so basically, the use for this initially would be to build out preview panels with the new side drawer. In the future, it would be used to navigate to details screens. Lots of other use cases as well."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-11-02 10:43:43",
    "text": "Yep hopefully it would trigger on row click"
  },
  {
    "text": "<@U01QVR44MEY> i think we showed you this action popover we’re actively working on where you could customize the “preview” and “actions” dropdown. is this what you’re thinking of?",
    "time_stamp": "2023-11-02 10:55:10"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-11-02 10:58:25",
    "text": "That's definitely a part of this, but the request expand beyond the crm table components, to the regular table as well. Right now you have to place a button in a cell to be able to action any of the rows, but it would be great to be able to just click on anywhere of the row and have a function get called"
  },
  {
    "poster": {
      "poster_name": "Katherine Man",
      "poster_handle": "kman342"
    },
    "time_stamp": "2023-11-02 11:01:58",
    "text": "ah got it. <@U03FJQPSC0Y> some feedback for the standard table ^"
  },
  {
    "poster": {
      "poster_name": "Deidra Kandra",
      "poster_handle": "dkandra"
    },
    "time_stamp": "2023-11-02 11:51:52",
    "text": "This is a good callout, Carter.\n\nWe’ve also been talking about when is the right time to expose the standalone action library rather than having it directly tied to the action components. This gives us another use case where it makes sense to have actions as functions so they can be tied to other uie components as well.\n\nThanks as always <@U01QVR44MEY>, please let us know if you think of other things! :thanku:"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-11-02 11:52:38",
    "text": "of course, thanks for all that you and the team do!"
  },
  {
    "poster": {
      "poster_name": "Lew Talon",
      "poster_handle": "ltalon"
    },
    "time_stamp": "2023-11-02 13:33:23",
    "text": "Was the UI Extensions components playground deprecated? Can't seem to find it in the CRM Development sidebar menu.\n\nI thought this feature was useful to designing/brainstorming before implementing a new project. I know there was some chatter for a Figma kit with components this would also be another viable option? Any info would be helpful!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-02 14:18:54"
      },
      {
        "time_stamp": "2023-11-02 15:22:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-11-02 14:18:54",
    "text": "Thanks, Lew. Yes that playground was specific to JSON based cards and it's deprecated along with sunset of JSON based cards. We are thinking of other options.\n\nCan you tell me more on what's the main problem you were looking to solve when you tried looking for a playground?"
  },
  {
    "poster": {
      "poster_name": "Lew Talon",
      "poster_handle": "ltalon"
    },
    "time_stamp": "2023-11-02 15:22:03",
    "text": "It would be helpful to have a Figma kit to allow us to create mockups of projects and include it within a proposal to a client"
  }
]