[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-02-08 05:32:59",
    "text": "I am assuming you mean for CMS development, not CRN.  In either case, I am probably not the most experienced person here to ask that question.  <@U01QVR44MEY> <@U25PYL3Q8> Can you folks or anyone else you can recommend to answer this question?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-08 06:01:25",
    "text": "This can be approached different ways.  Developer accounts are one way to solve this. Copying modules / code / templates between portals is super easy using the cli / local development or by creating themes and copying them between portals in the design manager. You can also do this with production and sandbox accounts. Now — this is only the code, not the content.\n• If you are setting up your templates / sections / etc in a “best practice” way — then this will solve building / qa / getting ready to push to production.\n• You can also use cms apis to copy pages between portals. There is some work to be done here with the work, but someone with enough patience and understanding can figure it out.\nYou can also develop in the live HubSpot portal. This can be done by building into the theme you are building, cloning the theme, doing a child theme, or building out a new theme. This will work however you want it to.\n• You can use content staging - which allows you to clone a live page or set it to “replace” upon publish. You pick your new theme / template / etc, put your modules in there, add your contentt, then you can publish this to replace the live page\n• You can use alternate domains and sub domains and avoid content staging. You can use HubSpot system domains or create subdomains that allow you to work in there. If using a subdomain you want to make sure you are blocking robots from crawling your pages.\n• You can also just publish pages right to the live website and prevent robots from crawling them.\nI can’t determine what is best practice. I work in the manner that I trade money for time — sometimes people don’t have the money for me to work in a “best practice”\n\nLet me know if you have questions"
  },
  {
    "poster": {
      "poster_name": "Silvio",
      "poster_handle": "silvio.losi"
    },
    "time_stamp": "2024-02-08 06:51:10",
    "text": "Hi Nicholas, thanks! I'll try to export and import pages between portals by CMS API, meanwhile for code, I already use CLI and branches on github with github actions for auto deploy :wink:"
  },
  {
    "poster": {
      "poster_name": "Silvio",
      "poster_handle": "silvio.losi"
    },
    "time_stamp": "2024-02-08 06:53:35",
    "text": "Last question, I forked cms-boilerplate from github and I saw that there is some files in repo, like:\n.blazar-enabled\n.blazar.yaml\ncms-deploy.yaml\nWhat do they do? Can I remove these?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-08 08:57:10",
    "text": "I believe they may have to do with deployment? github/github actions?\n\n<https://github.com/marketplace/actions/HubSpot-cms-deploy>\n\n<https://developers.HubSpot.com/docs/cms/guides/github-integration>"
  }
]