[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-12 07:18:52",
    "text": "Hi Sylvain, you’re correct.\nRight now you cannot add border/box-shadow styles to dnd elements.\n\nWe currently do not support adding a custom class name to these elements either. A work-around would be to use a class on a dnd_area element and style the children of that element. We know that isn’t a be-all-end-alll solution.\n\nWe are working on giving both developers and content creators more control to handle more complicated designs like that."
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-06-12 08:49:52",
    "edited": {
      "time_stamp": "2020-06-12 08:50:38"
    },
    "text": "Thanks a lot, Jon. And bravo for the new templating system: it's so powerfull! Just an idea: I create my own rich text module (for example), and add in it a text field for classes names; in a javascript tag in the html part of the module I add a script which add classes to first dnd row or dnd colum or dnd section parent, will it be possible to add styles with the editor by applying thoses classes like that?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-12 09:45:47",
    "text": "Right now the short answer is I don’t know. There’s a lot of thought going into how we approach it. What we add for developers, we want to make sure content creators who wouldn’t know what say a class is - can utilize the features.\n\nAn example is say we add a text field for a class to the page editor. That would require content creators to understand what a CSS class is, which classes are available, when to use it, and how it can be used. That’s something agencies can wrap their heads around but is harder for end-user companies."
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-06-12 10:02:28",
    "text": "I understand (and you're right). Thank you very much for those details."
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-06-12 10:16:03",
    "text": "My proposition was just for me, not for HubSpot end-users :wink: For an end user, I wouldn't do that, but I'd give some properties like \"border\", a size, and a color, and the result would be to call two or three classes generate in a css file with hubl loops and functions (like \"border-1\", \"border-#123456\" - you split the name with Hubl  to get the color code -, and \"border-opacity-09\"). Or something like that. We just need a color field, a number and a text ones, and the module create and apply the classes alone."
  },
  {
    "poster": {
      "poster_name": "Ian Hoyte",
      "poster_handle": "ian135"
    },
    "time_stamp": "2020-06-12 11:44:47",
    "text": "Some other great options for the sections that would elevate the CMS builder from \"good\" to \"great\" would be:\n1. Responsive padding/margin options (like a phone, tablet and desktop selector);\n2. Field to add an ID (useful for jump-to links);\n3. Custom classes (already mentioned);\n4. Responsive column direction (flex row reverse)\n5. Video backgrounds (with support for locally hosted videos &amp; youtube, vimeo, etc);\n6. Also border and drop shadow options, already mentioned would be cool too.\nCheers, you guys have been doing great work!"
  },
  {
    "poster": {
      "poster_name": "Ian Hoyte",
      "poster_handle": "ian135"
    },
    "time_stamp": "2020-06-12 12:22:50",
    "text": "To address the concern about content creators vs. developers, maybe bunching this stuff into an \"advanced\" tab could solve that."
  }
]