[
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-06-12 00:25:56",
    "edited": {
      "time_stamp": "2020-06-13 11:53:31"
    },
    "text": "Hello. With HTML + Hubl templates with drag and drop areas, we can change some styles (background, padding, margin) in the editor interface. But it's impossible to add border or box-shadows (for example), that's right? If so, those settings could be created later or not? It's just to know if one day a page editor will be able to create borders and box shadows in the editor interface. You confirm also that we cannot add our own css custom settings in the editor interface? I did this in a module: in the editor, some settings create css directly in code, but this is just for a module and it would be great if we could add that kind of stuff in the \"styles\" section into the editor interface...",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-06-12 07:18:52"
      },
      {
        "time_stamp": "2020-06-12 08:49:52"
      },
      {
        "time_stamp": "2020-06-12 09:45:47"
      },
      {
        "time_stamp": "2020-06-12 10:02:28"
      },
      {
        "time_stamp": "2020-06-12 10:16:03"
      },
      {
        "time_stamp": "2020-06-12 11:44:47"
      },
      {
        "time_stamp": "2020-06-12 12:22:50"
      },
      {
        "time_stamp": "2020-08-26 02:52:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-06-12 00:30:22",
    "edited": {
      "time_stamp": "2020-06-12 00:38:30"
    },
    "text": "The rule is: when a page is created from a template, all modules on this template *at this time* loose their default values for the benefit of the editor interface. If you add a module on the template (after opening and/or creating the page and editor interface closed), all the values you change in the template will appear on the page created with this template until someone will open the page in the editor. Hope  I'm clear enough."
  }
]