[
  {
    "poster": {
      "poster_name": "Gopal Chand",
      "poster_handle": "gopal.chand"
    },
    "time_stamp": "2021-05-06 08:11:08",
    "text": "Hi, I am not looking to hire deveoper but just asking the solution to handle this"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-06 08:18:16",
    "text": "There are a few routes you can go.\n\nSo the best route IMHO if you have CMS Enterprise would be to create a store custom object. This object type would store all of the different locations, their contact data etc.\n\nYou then can use the custom object apis to find one based on closest proximity to the user.\n\nYou could even associate the user’s contact record to that store if they “favorite” it.\n\nFor getting the user’s current location I would use the browser location API"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-06 08:19:01",
    "text": "Otherwise you could also build this with HubDB if you have CMS pro. The difference being you couldn’t associate the contact record to the store record."
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2021-05-06 12:34:36",
    "text": "• <@U01LU1NG9EE> I've been playing around with this framework <https://www.surveyjs.io/> for advanced form functionality as I need...\n• multi-step form\n• calculated fields\n• save and complete later (looking at using membership site and saving JSON form data in a custom contact property and loading from  the field when they return. \nSo far it's looking promising."
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2021-05-06 13:27:50",
    "text": "for my testing, I'm using their online form creator to build the form and export the JSON. in HS, I created a simple HubDB table with a single text field to store the exported JSON. In the module using a HubDB field to select the survey, a form field to specify the HS form and the forms API to submit the data."
  },
  {
    "poster": {
      "poster_name": "Gopal Chand",
      "poster_handle": "gopal.chand"
    },
    "time_stamp": "2021-05-06 16:52:11",
    "text": "Hi Jon,\n  Thank you for your response. I have CMS pro plan and created the Hubdb table and now can you please assist me bit more to get the data for frontend on the search page. Can you please let me know I need to create custom module or page template. Also i need to create the geolocation search feature, where if anyone search for any address around the 50 miles and it's gives the locations of all the nearby restaurant."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-06 17:25:42",
    "edited": {
      "time_stamp": "2021-05-06 17:27:41"
    },
    "text": "This doc needs some small updates (we call it CMS Hub now) and i would simply put most of the code it tells you to have in the template - in a module instead, but it should get you pretty far. <https://designers.HubSpot.com/docs/tutorials/lets-build-a-page-with-a-map-with-hubdb|https://designers.HubSpot.com/docs/tutorials/lets-build-a-page-with-a-map-with-hubdb>"
  }
]