[
  {
    "text": "Which Module Do I need to edit… What’s more It’s a snazy Scrollmagic JS page which scrolls horizontally like a timeline with each module being a new item for the timeline, and there are interactions at the start through JS so you can’t see any of the modules in the visual editor. Even if you select the module previous to the one you want, when you hit back you go back to the top of the list so it’s incredibly hard to select the right module",
    "time_stamp": "2020-03-04 03:13:58",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-03-04 08:01:34"
      },
      {
        "time_stamp": "2020-03-04 08:23:26"
      }
    ]
  },
  {
    "text": "Is anyone else having an issue with the RTE field in custom modules? When I click More > Code, the html window isn't displaying...instead it triggering a font change. I'm seeing this in multiple portals. The RTE on pages is working fine. I can only replicate the issue in custom modules via the design manager.",
    "time_stamp": "2020-03-04 07:53:30",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-03-04 08:42:21"
      },
      {
        "time_stamp": "2020-03-04 08:45:17"
      },
      {
        "time_stamp": "2020-03-04 09:21:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-03-04 08:01:34",
    "text": "Instead of multiple modules, could you have 1 module with a repeater field/group for each timeline item?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2020-03-04 08:23:26",
    "text": "Could have done but each module is quite complex with lot’s of different options - admittedly not 3 levels deep but there was a possibility it needed to be. I’ve also got three timelines so 3 flexible columns full of modules. Also when I started building it I did the timeline first which actually made it easier to edit as I was able to select the module on the page to edit it, It’s just gotten a lot trickier since I built other parts of the page. Either way It would be good to get some way of naming modules in a page. Also duplicating modules in a page."
  },
  {
    "poster": {
      "poster_name": "Emily Persing",
      "poster_handle": "epersing"
    },
    "time_stamp": "2020-03-04 08:42:21",
    "text": "Are you looking to access the source code?  That is located under Advanced&gt;Source Code.  The More&gt;Code is to wrap text in the code tag."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-03-04 08:45:17",
    "edited": {
      "time_stamp": "2020-03-04 08:45:25"
    },
    "text": ":face_palm::skin-tone-3: wow. i need to get some coffee. thanks."
  },
  {
    "poster": {
      "poster_name": "Emily Persing",
      "poster_handle": "epersing"
    },
    "time_stamp": "2020-03-04 09:21:06",
    "text": "I know this because I had the same problem a few weeks ago.  Don't feel bad."
  },
  {
    "poster": {
      "poster_name": "Brennen Carroll",
      "poster_handle": "brennen"
    },
    "time_stamp": "2020-03-04 10:30:43",
    "text": "anyone got any ideas? ive been trying ot just tweak it the way it is to match it, but i feel like theres a better way. it looks like the header and footer each have their own style sheets on my website, but on HubSpot theyre set up as global groups and refrence the pages style sheet. so i dont know if there is even a way to use the header and footer sheets from my website."
  }
]