[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-21 07:18:43",
    "edited": {
      "time_stamp": "2019-01-21 07:22:15"
    },
    "text": "Over the weekend an article came out about a lot of chrome extensions being vulnerable by having API’s accessible by websites themselves. Developer Extensions made up 15% of the vulnerable extensions.(those articles all pointed to <http://www-sop.inria.fr/members/Doliere.Some/empoweb/> as the source of the info)\n\n*I had the guy who found this security vulnerability check the dev chrome extension.*  It was found to *NOT* be exploitable. Yay for security. screenshot of his email in github issues <https://github.com/williamspiro/HubSpot-Developer-Extension/issues/191>\n\nThe extension’s core devs are not security specialists. We follow Google Chrome’s best practices for security and use the minimum required permissions from Chrome in order to do everything, allowing Google to basically handle the bulk of the security for us. If you feel you know a lot about security, I would encourage you to look at the github, dig around, let us know if you find anything and we’ll be sure to address it quickly. If you know of any testing tools we can run the extension through let us know we’ll give it a whirl.\n\nHappy Monday!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-21 12:07:01",
    "text": "Bug just appeared, *can anyone confirm if they are seeing this: in the design manager in the dark theme I’m seeing a vertical scrollbar to scroll the whole content of the  page - this appears to be caused by the dark theme.* (let me know if you see this.)\n\nI’m guessing an HTML or css change was made causing this.\n\nIt does appear to also only be there if the design manager inspector pane is scrolled to the top."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-01-21 16:18:54",
    "text": "i am not seeing it"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-01-21 16:19:06",
    "text": "can you screenshot?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-21 16:22:23",
    "text": "<https://spin.d.pr/AF2e8K+>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-21 16:22:39",
    "text": "I will say the issue may have gone away on it’s own. I’m not currently seeing the problem on my end"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-01-21 16:25:01",
    "text": "nope.  not affecting me"
  }
]