[
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-03-09 07:54:17",
    "text": "Hello Developers, \n\nWe have a couple pieces of exciting news to share.\n\n*First*, the CMS Boilerplate is now out of beta and has been updated to include Theme functionality. The CMS Boilerplate is the fastest way to get starting building on the CMS. We are excited to share this progress and look forward to continue to iterate on it with your feedback to make it even better in the future. Check out the latest release <https://github.com/HubSpot/cms-theme-boilerplate/releases|here> and make sure to watch the repository for all of the latest updates.\n\n*Second,* the Asset Marketplace will start accepting Theme submissions tomorrow, 3/10. Here at HubSpot, we believe Themes represent the future of how marketer-friendly websites will be designed on the HubSpot CMS. Developers who wish to build websites that delight content creators and use the latest HubSpot CMS features should start utilizing Themes.\n\nBuild your next site as a Theme and try to use drag-and-drop areas today! Can’t or don’t want to? Let us know why in the thread below.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-03-09 09:16:57"
      },
      {
        "time_stamp": "2020-03-09 11:26:20"
      },
      {
        "time_stamp": "2020-03-09 11:27:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-03-09 09:16:57",
    "text": "<@ULCSUPTGU> — do you know if the HubSpot migration team will adopt this?"
  },
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-03-09 11:26:20",
    "text": "Hi Dennis - HubSpot will be adopting the concept of themes for migrations starting on 3/16. They will be using their own version of the CMS boilerplate to best meet the needs of migration customers."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-03-09 11:27:19",
    "text": "cool.  curious to know what “their” version is!"
  }
]