[
  {
    "poster": {
      "poster_name": "Jarrod Carnegie",
      "poster_handle": "jarrod"
    },
    "time_stamp": "2020-01-22 14:19:02",
    "edited": {
      "time_stamp": "2020-01-22 14:19:14"
    },
    "text": "Hi All!\nI’m a designer who has just completed the Dev cert to better understand what my developers do.\nHoping someone might be able to point me to an answer. After a search through the channels, I can’t seem to find a simple solution. So forgive me if this is an easy one for you all.\n\nI have a HubSpot form. The placeholder text in a field is a grey colour, so when someone inputs an answer, the text turns black, to help the person see they entered an answer.\nWhy is it that the text in a dropdown cannot follow the same logic? When you select an answer, it stays grey?\n\nAgain apologies, I’m sure this has been asked a thousand times",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-01-22 15:21:50"
      },
      {
        "time_stamp": "2020-01-22 17:06:49"
      },
      {
        "time_stamp": "2020-01-23 01:03:35"
      },
      {
        "time_stamp": "2020-01-23 14:50:13"
      },
      {
        "time_stamp": "2020-01-30 18:05:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-01-22 15:21:50",
    "text": ":thinking_face: I’m not a developer, but pretty familiar with our forms. Is this an embedded form (on a non-HubSpot page)? Can you link to an example? I’ve not noticed this before, but am usually looking at forms on HubSpot pages which have their own styling applied, which will be custom to the site."
  },
  {
    "poster": {
      "poster_name": "Jarrod Carnegie",
      "poster_handle": "jarrod"
    },
    "time_stamp": "2020-01-22 17:06:49",
    "text": "Hi <@UGY22E2KC>\nNo, its a HubSpot form on a HubSpot page.\nI can’t unfortunately link the page. Its for a clients website that is not yet live and cant share it. ( I know that is super not helpful!)"
  }
]