[
  {
    "poster": {
      "poster_name": "Ben Rogers",
      "poster_handle": "benjamin.rogers"
    },
    "time_stamp": "2025-02-12 05:46:07",
    "text": "Hello, we're looking for a HubSpot developer we can leverage on an Adhoc basis; here's a job ad I've used elsewhere :slightly_smiling_face:\n++\n*We are seeking an expert HubSpot developer to design and implement custom API-based workflows tailored to our business needs. **Must have extensive HubSpot experience***\n\n• The ideal candidate will have strong experience in leveraging Python to create advanced scripts that enhance functionality and streamline processes within HubSpot.\n• Your expertise will play a crucial role in optimizing our CRM workflows and improving overall efficiency. If you’re a trusted professional with a proven track record in HubSpot development, we’d love to hear from you.\n• To be clear, we are not looking for a CRM manager, we are specifically looking for someone with advanced API / Python experience in HubSpot. A bonus is if you can use React with HubSpot. It's essential that you have extensive experience with the HubSpot platform, and understand the limitations or what is possible with the API.\n• An example of a workflow we need to create is to take transcriptions from HubSpot calls, send this to ChatGPT, and return expert level coaching suggestions (similar to what we would find in tools like <http://Gong.io|Gong.io> or Jimmeny).\n• We will have adhoc project requests, so would prefer an hourly rate. We'd like someone that can work in an Agile way, encourage us to start with an MVP and then iterate.\n• Even better if someone has their ear to the ground on the most recent AI tools and development and can help make suggestions so we can leverage the latest tech advancements where it makes sense for the business.\n• Finally it would be helpful but not essential if this person already uses slack for communication, and <http://monday.com|monday.com> for project management (or is willing to adopt), as this will fit into our tool easily.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-12 07:43:34"
      },
      {
        "time_stamp": "2025-02-12 10:52:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2025-02-12 07:43:34",
    "text": "DM sent"
  },
  {
    "poster": {
      "poster_name": "Ramandeep Singh",
      "poster_handle": "ramandeep.singh2"
    },
    "time_stamp": "2025-02-12 10:52:11",
    "text": "Sent DM."
  }
]