[
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2019-09-27 07:14:18",
    "text": "Hi there!\nwe would like to submit a template to the marketplace and have a question regarding a submission requirement.\nIt says:\n```\nDefault content must match what is advertised on the asset listing page and demo site.\nClarification: all verbiage, images, and other media used on the asset listing page should match what is used on the demo site and the asset.\n```\nThis is pretty clear, but does not allow to use licensed stock material for the demo site only. Which is often more realistic and appealing than the royalty free material available.\nFor the marketplace assets themselves one could still use royalty free items that come with the purchase.\nThis is the way how it is commonly done on other platforms as long as it is clearly stated that the images and videos of the demo are not included.\nIs this really not an option on the HubSpot marketplace?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-27 13:48:36"
      },
      {
        "time_stamp": "2019-09-27 14:01:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-27 13:48:36",
    "edited": {
      "time_stamp": "2019-09-27 13:50:10"
    },
    "text": "The jist of the idea is that when someone buys your template or module from the marketplace they want what you’re advertising. If they pay for and install your module or template, and it doesn’t look the same, they contact HubSpot Support. They may even ask for a refund, because they didn’t get what they thought they were paying for. HubSpot does not take a cut, but provides instant delivery for the customer, and the marketplace is also non-exclusive. <https://offers.HubSpot.com/free-marketplace-account>\n\nIf you wish to use paid stock images in a template or module you submit to the marketplace you need to understand and abide by the usage terms associated with the stock image. That image would be distributed to all who install your module/template."
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2019-09-27 14:01:54",
    "text": "Hi Jon!\nok, we understand HubSpots point of view on this. We have to buy extended licenses if available or use royalty free content then. Thanks for the detailed explanation and quick answer! \nCheers\n"
  }
]