[
  {
    "poster": {
      "poster_name": "sahil dhiman",
      "poster_handle": "sahildhimansanour686"
    },
    "time_stamp": "2021-05-26 02:56:43",
    "text": "Hey Team,\nI have to implement new page on HubSpot. Basically, I need to show some post*(but this is not a blog page)* and when user click on that post then user should land on details page. So, there is any free template are available on HubSpot or do I need to create the custom template for this. If, I need to create custom template then how we can get the post and and link with details page.\nKindly guide me.\nThank you"
  },
  {
    "poster": {
      "poster_name": "Keren Burns",
      "poster_handle": "keren"
    },
    "time_stamp": "2021-05-26 03:28:24",
    "text": "Hi there! :smile:\n\nI have a client who are very keen to build an ROI calculator to share with their audience via paid ads. I was looking into the building of the ROI calculator &amp; it seems like it’s a bit more technical than I expected to tailor it to their needs.\n\nIs there a possibility of receiving a template from HubSpot where we could just plug in the details or will it need to be build from scratch?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-26 09:04:20"
      },
      {
        "time_stamp": "2021-05-26 09:22:49"
      },
      {
        "time_stamp": "2021-05-26 10:06:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-26 09:04:20",
    "edited": {
      "time_stamp": "2021-05-26 09:04:49"
    },
    "text": "Generally calculator functionality needs to be custom built, because no two companies have the same products, billing frequency, options etc.\n\nIf you are not a developer and don’t have on on your team I’d suggest posting in <#CBNDYJJAZ|jobs> with a description of your project and some devs in our community looking for a project will reach out"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2021-05-26 09:22:49",
    "text": "We just started using a no-code tool called Outgrow that helps spin things like this up fairly quickly. I believe Typeform can do calculations, too.\n<https://outgrow.co/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-26 10:06:40",
    "edited": {
      "time_stamp": "2021-05-26 10:06:48"
    },
    "text": "That’s a pretty nifty looking tool. Good share there Adam!"
  }
]