[
  {
    "poster": {
      "poster_name": "Clarke Bishop",
      "poster_handle": "cbishop"
    },
    "time_stamp": "2020-09-01 09:25:35",
    "text": "I’m implementing a full CI/CD pipeline from git to Jenkins to deploy on HubSpot. This is for custom modules.\n\nReally, it’s not that different then using a local machine, with one key exception.\n\nOn my remote Jenkins build server, what’s the best practice for managing authentication. Committing my HubSpot.config.yml file seems wrong. And, I can’t follow the manual steps like *hs init* or *hs auth* that are used for local development.\n\nIt would be nice if I could store credentials securely, then run *hs upload --auth=SOMETHING source dest*.  But, I don’t see where this is available.\n\nWhat is the recommended practice?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-01 11:07:57"
      },
      {
        "time_stamp": "2020-09-01 11:52:42"
      },
      {
        "time_stamp": "2020-09-04 09:17:11"
      },
      {
        "time_stamp": "2020-09-04 09:28:59"
      },
      {
        "time_stamp": "2020-09-09 15:50:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-01 11:07:57",
    "text": "I apologize that I’m not as familiar with Jenkins.\n\nWhen working with GitHub actions for CI/CD we recommend using  secrets within GitHub. <https://developers.HubSpot.com/docs/cms/guides/github-integration#create-a-secret-for-your-HubSpot-account-s-api-key>\n\nIf Jenkins has a similar feature you should be able to do something similar"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-09-01 11:24:54",
    "text": "What error are you running into exactly? Is it in the command line, or in the HubSpot app?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-09-01 11:52:42",
    "text": "Thanks Jon. What you sent gave me a couple of ideas.\n\nIn my case, though, I have a Vue app that turns into a HubSpot custom module. So, there’s a build process and other things that have to run to make the code work in HubSpot.\n\nJenkins serves as the build server and also provides a bunch of scripting automation support."
  },
  {
    "poster": {
      "poster_name": "Aaron Dadap",
      "poster_handle": "wesleyadwebster"
    },
    "time_stamp": "2020-09-01 16:58:02",
    "text": "It says it does and uploads no problem on the message, but in reality it doesnt. The plugin appears to be working no errors thrown but in practice says otherwise. running\n```npm start```"
  }
]