[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-09-04 09:17:11",
    "text": "I’m working through the idea of having a *generate-config.js* file to create my HubSpot credentials on the fly from environment variables.\n\nI came across a use case that hs cli does not support. How can I test a HubSpot.config.yml file? Sure, I could do a hs fetch, but that’s going to add files I don’t want on my local machine.\n\nConsider this a feature request for hs cli. Why not provide *hs ls*? It would just list all the top-level items via the cli.\n\nOr, *hs fetch --dry-run* would be good, too.\n\nIf there’s already a trick in the cli, please let me know."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-04 09:28:59",
    "text": "Filed an issue in the local development tools repository for an `hs ls` <https://github.com/HubSpot/HubSpot-cms-tools/issues/309>"
  },
  {
    "poster": {
      "poster_name": "Sam Basile",
      "poster_handle": "sbasile"
    },
    "time_stamp": "2020-09-04 12:09:50",
    "text": "Hi Everyone!\n\nI'm trying to figure out the best way to work with an entire team of designers, developers, and content specialists.\n\nI understand how to start a boilerplate site and fetch and upload between local development and HubSpot. I've read about running a Git repo for managing the source code in team development.\n\nHowever, I would like to develop a website site in a location outside of the client's account. Is there a way to have a common development location where developers can push code revisions, the design team can review, and the content team build out the site from the templates.  Finally when the project is ready for launch, I would like to deploy the site to the client's account.\n\nIs this possible?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-09-08 00:11:55"
      },
      {
        "time_stamp": "2020-09-08 06:50:47"
      },
      {
        "time_stamp": "2020-09-08 10:35:46"
      },
      {
        "time_stamp": "2020-09-08 11:06:11"
      },
      {
        "time_stamp": "2020-09-08 11:23:07"
      }
    ]
  }
]