[
  {
    "poster": {
      "poster_name": "Marcus G",
      "poster_handle": "marcus209"
    },
    "time_stamp": "2020-09-28 02:44:31",
    "edited": {
      "time_stamp": "2020-09-28 02:45:08"
    },
    "text": "Is it just I who find this page lacking crucial information? Please give me some advice on how to set up a normal development workflow for HubSpot! <https://developers.HubSpot.com/docs/cms/guides/creating-an-efficient-development-workflow> Basically, I want to set up a \"draft version\" of my company page where I can test important changes before I `hs upload` it to the public page. Now, I have set up a sandbox developer account (a described in the link), but that doesn't help since I only have one version of the files in the design manager! Am I supposed to duplicate the top folder in the design manager and upload to the duplicate folder in order to preview the results of my code? Or is there something I'm missing? For example, can I run the HubSpot site on a local web server? Haven't seen anything about that in the docs either... how does this work? @.@",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-28 08:11:02"
      },
      {
        "time_stamp": "2020-09-28 08:15:55"
      },
      {
        "time_stamp": "2020-09-28 08:16:29"
      },
      {
        "time_stamp": "2020-09-28 08:38:12"
      },
      {
        "time_stamp": "2020-09-29 04:54:12"
      },
      {
        "time_stamp": "2020-09-29 06:53:51"
      },
      {
        "time_stamp": "2020-09-29 06:54:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-09-28 08:11:02",
    "text": "Hey Marcus.  You’re correct, you would have to fetch the files you will be working on from your production version of the site and then upload to your sandbox version.\n\nJust a note that this will only work for modules/templates/stylesheets/js files, You can’t actually fetch page content to move to your sandbox site.\n\nOne workaround for this is to use Content Staging as your sandbox environment.\n\nAs per your question about a local web server, unfortunately HubSpot isn’t supporting any local servers at this point."
  },
  {
    "poster": {
      "poster_name": "Marcus G",
      "poster_handle": "marcus209"
    },
    "time_stamp": "2020-09-28 08:15:55",
    "text": "Thank you, this clears it up! Too bad that a professional or enterprise cms account is required to use this :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Marcus G",
      "poster_handle": "marcus209"
    },
    "time_stamp": "2020-09-28 08:16:29",
    "text": "this as in content staging, i mean"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-09-28 08:38:12",
    "text": "Ah, yes, i forgot about that aspect of it.\n\nI wish there was an easier way to move page content between portals, but at least HubSpot is actively supporting local development at this point"
  }
]