[
  {
    "poster": {
      "poster_name": "Bob Gerrmann",
      "poster_handle": "bob737"
    },
    "time_stamp": "2021-12-02 09:33:34",
    "text": "Hi all, we are working in an external data BI program (Tableau). HubSpot data is exported to Tableau through 1) Stitch and 2) BigQuery. The total number of deals in HubSpot is around 77000, where the total number of deals in Tableau is +85000. We have looked into the data and find deal IDs in Tableau which do not exist in HS anymore - we suspect that these could be either deleted.\n\nThe deleted deals: we found a property \"isdeleted\" with true/false as values. However the results in Tableau are inconsistent: it when a deal is marked as deleted:true in Tablea, this is not necessarily deleted in HS and vice versa. this makes the data irreliable. Does anybody know what could be the issue and how this could be solved? Any suggestion or idea is more than welcome!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-02 12:43:55"
      },
      {
        "time_stamp": "2021-12-02 12:44:27"
      },
      {
        "time_stamp": "2021-12-02 12:47:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:24:40",
    "text": "Hi <@U02JU710E73> I think you need to do all the requests in async way."
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:29:14",
    "text": "Hi <@UN7CEHC9X> yeah, the Serverless Functions can extend various HubSpot functionalities. In v3 from API it's possible you to test the calls on API's page"
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:31:02",
    "text": "Ah, and you can test the Serverless Functions without the front-end, using some tools like _Postman_"
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:37:16",
    "text": "Hi <@U02MRL1RFLL> in this case I think you need to create an external app that communicate with HubSpot Portal via API. And that external app need to do some routine to verify this specifics cases."
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:43:55",
    "text": "Hi <@U02PPN1PLG1> You need to create some middleware, an external app, to do the HubSpot API requests and do the logic for treat the inconsistencies."
  },
  {
    "poster": {
      "poster_name": "Natália Dartora",
      "poster_handle": "natalia.dartora"
    },
    "time_stamp": "2021-12-02 12:44:27",
    "text": "Or you can change the Tableau code"
  },
  {
    "poster": {
      "poster_name": "Bob Gerrmann",
      "poster_handle": "bob737"
    },
    "time_stamp": "2021-12-02 12:47:16",
    "text": "Hi Natalia, Thanks for the tip! Yeah this works! Just used the intergration via <https://app.HubSpot.com/ecosystem/3520736/marketplace/apps/marketing/analytics-data/tableau|Datawarehouse.io> and all logic seems return :grin: We've tried to change the tableau code, that was pretty hard without succes."
  }
]