[
  {
    "poster": {
      "poster_name": "Strahinja Cokić",
      "poster_handle": "sc"
    },
    "time_stamp": "2021-12-14 02:09:11",
    "text": "Hi all,\n\nI'm building a form to upload a file from our portal to the HubSpot Files Manager. Is there any limit on how big of a file can be uploaded via API?\nI'm successfully uploading files smaller than 5mb but anything bigger just returns 500 from my serverless function which is handling the API call to upload the file."
  },
  {
    "poster": {
      "poster_name": "Magnus Foldager",
      "poster_handle": "magnus"
    },
    "time_stamp": "2021-12-14 02:48:45",
    "text": "Thank you so very much, Dennis! I’ve been struggling with this for so long. Have a great day!"
  },
  {
    "poster": {
      "poster_name": "Heber Brandao",
      "poster_handle": "heber.brandao"
    },
    "time_stamp": "2021-12-14 04:36:27",
    "text": "Hey everyone, I am currently building an API that writes Notes under a Contact from a custom ticketing tool.\nFor that, I am still using the <https://legacydocs.HubSpot.com/docs/methods/engagements/create_engagement|V1 Engagement API> (which allows me to write a metadata_body and association with contact at the same time. However, this does not support batch actions.\n\nIs there any possible way I can perform a batch Note creation on the V3 api, and also associating it with a contact at the same time?"
  },
  {
    "poster": {
      "poster_name": "Louis Chaussé",
      "poster_handle": "lchausse"
    },
    "time_stamp": "2021-12-14 07:17:47",
    "text": "Awesome thanks!"
  },
  {
    "poster": {
      "poster_name": "Trent Madill",
      "poster_handle": "admin095"
    },
    "time_stamp": "2021-12-14 14:59:02",
    "text": "Hi everyone, I’m new to HubSpot APIs, but I’m curious if anyone can point me in the right direction for how I can create a GET API successfully?\n\nI have a React app (MERN stack) and I’m looking to get a contact’s id. Here’s the GET url that works and returns the correct data when I run it through Postman:\n```// \"hutk\" is the unique HubSpot user token\n// \"apiKey\" is our unique HubSpot API Key\n\nconst getUrl = `<https://api.hubapi.com/contacts/v1/contact/utk/${hutk}/profile?hapikey=${apiKey}>`;```\nSo this works in Postman, but when running in our React app, I receive a *“No ‘Access-Control-Allow-Origin’ header is present on the requested resource.”* error.\n\nCurious if anyone can just point me in the right direction on how I should solve this.\n\nThank you!!"
  },
  {
    "text": "Hi everyone,\n\nWe are currently trying to work with Account Extension API for currency.\nThe main objective we are trying to achieve is to update the Currency Conversion rate using an API.\nWe have found one (SS attached here)\nHas anyone used this before?\nAny  help would be appreciated",
    "time_stamp": "2021-12-14 17:19:01"
  }
]