[
  {
    "poster": {
      "poster_name": "Neil Carpenter",
      "poster_handle": "neil295"
    },
    "time_stamp": "2021-12-01 02:10:17",
    "text": "sorry - it was with hapi - i was getting HubSpot id's from my database and appending it to the update product endpoints. The id's were c+p into the database from an excel csv and some of them had new line characters at the end of them.\nWould have been more clear for me if the error was something like \"Can't find product\" or something but I got there."
  },
  {
    "text": "Hello, its first time I am writing here and I am new to HubSpot, so bear with me, but I would like to get some guidance here and/or get some answers on questions I have.\n\nTL;DR Need help implementing newsletter functionality in HubSpot.\n\nI have a customer who needs simple GDPR compliant newsletter functionality on their website we building. I have found <https://developers.HubSpot.com/docs/api/marketing-api/subscriptions-preferences> which looks like something I should use for this use case. From endpoints I can see that its new endpoints (v3), so I found old ones as well <https://legacydocs.HubSpot.com/docs/methods/email/email_subscriptions_overview>.\n\n1. So my first question which one I should be using for production?\n My issue with new one is that I see from openapi spec that its in Developer_preview status. Calling one of the endpoints (v3) to get status with none existing emails it shows that these emails are subscribed. Not sure if its a bug or intended.\n\n2. My other question is, should I call contact endpoint first to create contact before subscribing? Or I can use subscribe endpoint with email only?\n\n3. Maybe there are some guides online I could take a look for simple usecases like this in regards to subscription apis?",
    "time_stamp": "2021-12-01 05:15:03",
    "edited": {
      "time_stamp": "2021-12-01 05:19:37"
    }
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-12-01 08:12:32",
    "text": "glad you got it figured out!"
  },
  {
    "poster": {
      "poster_name": "Roman Kozak",
      "poster_handle": "roman.gruit"
    },
    "time_stamp": "2021-12-01 10:11:09",
    "text": "Do you mean that a private app isn’t actually an app under the hood?"
  },
  {
    "poster": {
      "poster_name": "Sergio Clavijo",
      "poster_handle": "s.clavijo"
    },
    "time_stamp": "2021-12-01 16:52:46",
    "text": "Hi, I'm developing a integration for send timeline events to a HubSpot portal, What I do first was a proof of concept and that worked, but now, unexpectedly starts to fail, when I try to create a new TL event the response is a 403 \"You don't have access to this application\", I checked several times the scopes, the access_token is sent properly, but I don't know why not works now",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-12-01 16:55:02"
      },
      {
        "time_stamp": "2021-12-01 16:56:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sergio Clavijo",
      "poster_handle": "s.clavijo"
    },
    "time_stamp": "2021-12-01 16:55:02",
    "text": "I'm using OAuth token, I have a dev account, I created the app for OAuth and I grant the permissions to the portal, I created a event type for the TL events, and as a said before, at starts this worked"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-12-01 16:56:05",
    "text": "I appreciate any help"
  }
]