[
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report.a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2023-02-20 08:00:33",
    "edited": {
      "time_stamp": "2023-02-20 08:00:37"
    }
  },
  {
    "poster": {
      "poster_name": "Carla Chalmers",
      "poster_handle": "cchalmers"
    },
    "time_stamp": "2023-02-20 08:21:39",
    "edited": {
      "time_stamp": "2023-02-20 08:30:09"
    },
    "text": "Hello, I am new here and new to HS development and integrations. I'm not sure which channel to post this in.\n\nI have been assigned the task of syncing a MySQL DB into HS with a one way sync for one of our clients. We are using HighTouch since it should be a simple sync.\n\nThe client has given me 3 DB tables to sync. Customers, Contacts and Invoices. Customers and contacts work as expected but I am having issues with the invoices -&gt; deals sync.\n\nThe invoice table consists of individual line items that are all related by Invoice number. The client wants to create deals from these \"Invoices.\" When syncing the invoice table, the system creates a new deal for each line item in the DB. Insead we need a new deal that contains the invoice with all line items that are related to the invoice in the DB.\n\nI'm running up against a time crunch and need to figure out how to achieve the 1 deal containing 1 invoice with multiple line items record. Any help would be greatly appreciated. Thank you.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-02-21 11:37:01"
      },
      {
        "time_stamp": "2023-02-21 11:38:01"
      },
      {
        "time_stamp": "2023-02-22 09:41:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Doug Wilhelm",
      "poster_handle": "sarrus25"
    },
    "time_stamp": "2023-02-20 10:48:50",
    "text": "Hi team, checking in. We’ve noticed a discrepancy with the V2 Blog API that has caused a production issue for our applications. *It appears that the `archived` field has been changed to `archived_at` unexpectedly; same for `deleted` changing to `deleted_at`.* Any thoughts on why this happened / why the documentation does not match either?"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-02-20 11:05:50",
    "edited": {
      "time_stamp": "2023-02-20 11:05:52"
    }
  },
  {
    "poster": {
      "poster_name": "haleonearth",
      "poster_handle": "haleonearth"
    },
    "time_stamp": "2023-02-20 11:12:12",
    "text": "<https://www.thearenaclub.com/>"
  },
  {
    "poster": {
      "poster_name": "Jorge Andrés Fernández Medina",
      "poster_handle": "jorgejgdrj41"
    },
    "time_stamp": "2023-02-20 12:12:57",
    "text": "Hello Everyone, I'm new to this slack community and I'm not sure if this is the right place to ask but I need some help/guidance about an issue that I'm facing with HubSpot right now.\n\nThe thing is that I'm currently working with a company that has an app on HubSpot to implement some integrations with the platform they provide to their users and recently when trying to connect to the app it shows this error message in the browser:\n\n\"*Couldn’t complete the connection* Insufficient scopes were provided. Please contact the app developer.\"\n\nThe scopes requested in the URL when trying to connect the app are oauth, files and tickets.\nAnd the reason for me to be here asking is because nothing has changed in the platform code or in the HubSpot app configuration but it started showing that error.\n\nI found in some posts that may be related to my issue:\n<https://community.HubSpot.com/t5/APIs-Integrations/Error-Couldn-t-complete-the-connection-Insufficient-scopes-were/m-p/741971/thread-id/60331>\n<https://community.HubSpot.com/t5/APIs-Integrations/Couldn-t-complete-the-connection-Insufficient-scopes-were/m-p/681423>\nThat the person trying to help solve that is asking if the account is a test, free, etc... so it takes me to the question, does that matter?\n\nMy goal or the way i expect to use the HubSpot app is using a new fresh and free account as a common user that doesnt really know anything technical about HubSpot but the integration seems to fail so I'm not sure if I'm missing something else from HubSpot side in order to be able to connect the app.\n\nI'll appreciate any help/advice that someone can provide me to be able to understand why this is happening.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-20 12:16:37"
      },
      {
        "time_stamp": "2023-02-20 12:17:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-20 12:16:37",
    "text": "Do you think you can share all the scopes you have selected in the app settings UI? and also the url that you're trying to use for auth? Have you tried using the default url that HubSpot provides?"
  },
  {
    "text": "This one:",
    "time_stamp": "2023-02-20 12:17:09"
  },
  {
    "poster": {
      "poster_name": "Edward Addo",
      "poster_handle": "edward479"
    },
    "time_stamp": "2023-02-20 14:24:57",
    "text": "Oh okay. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-20 16:02:54",
    "text": "of course"
  },
  {
    "poster": {
      "poster_name": "Shahjehan",
      "poster_handle": "az.chughtai9"
    },
    "time_stamp": "2023-02-20 23:49:19",
    "text": "Is there a way to optimize bulk images in HubSpot?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-21 07:18:34"
      }
    ]
  }
]