[
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:34:45",
    "text": "Hello guys how are you doing ?\nI need help to create a plugin on HubSpot to connect other API's platforms like MercadoLibre and FincaRaiz (real estate platform)"
  },
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:35:15",
    "text": "anyone can help me, please ?"
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2025-01-23 11:02:22",
    "text": "Hello everyone how are you?\nI was trying to create a serverless function on vscode using the HubSpot CLI. I finished the code on my side and when I tried to deploy the function an error occurred saying that my personal access key doesn't have the necessary scopes (cms.functions.write to be more exact). I tried to add this scope to my key but i couldn't find it. Does anyone know why this is happening? I do have the CMS Hub Professional so I believe the serverless functions should be available for me.",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-23 11:12:52"
      },
      {
        "time_stamp": "2025-01-23 11:20:16"
      },
      {
        "time_stamp": "2025-01-23 11:22:07"
      },
      {
        "time_stamp": "2025-01-23 11:26:37"
      },
      {
        "time_stamp": "2025-01-23 11:29:23"
      },
      {
        "time_stamp": "2025-01-23 11:31:19"
      },
      {
        "time_stamp": "2025-01-23 11:36:57"
      },
      {
        "time_stamp": "2025-01-23 11:42:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-23 11:12:52",
    "text": "Hey there — I believe <https://developers.HubSpot.com/docs/guides/cms/content/data-driven-content/serverless-functions/overview|Serverless functions> are only available on Enterprise"
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2025-01-23 11:20:16",
    "text": "Oh I see. I thought the professional was enough. I was finding it weird that I couldn't create the function directly in the design manager.\n\nI am not sure if you have any idea how to help me <@UQWGKUEN7>, but I was trying to get the name of a form using the forms API to use it on the html of a module. The only way I found was through the API and for that I need a backend or the serverless function. Do you have any idea of how else I could do it?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-23 11:22:07",
    "text": "What are you trying to do exactly? Just display the name of a form? Is the user selecting the form in the module?"
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2025-01-23 11:26:37",
    "text": "I want to display the name of the form on the html tag of the element so I can see its name when I inspect the page on the browser. The problem is I can't access the name of the form being used in the module creation page of the design manager. The form field on the right tab of the design manager doesn't return the name of the module."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-23 11:29:23",
    "text": "Ahhh ok I see. Is that just so you can quickly get to the form in the form builder / search for it?"
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2025-01-23 11:31:19",
    "text": "Yes. It would be easier to see which form is being used in the page."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-23 11:36:57",
    "text": "I don’t think that there is an easy way to do that. Some ideas would be\n\n• Provide a form title field and use that (user would have to manually enter it though)\n• Use the form id (returned as part of the form field) Also natively is part of the {% form %} tag. You can then use it to navigate directly to the form `<https://app.HubSpotqa.com/forms/{portalID}/editor/{formId}>`"
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2025-01-23 11:42:26",
    "text": "Thank you <@UQWGKUEN7>. Maybe the solution is going to be the first idea. Or I can try to run the serverless function on aws."
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2025-01-23 12:07:33",
    "text": "Hey everybody - just wanted to share the CLI exp from the last couple of days.\nI was presented the \"missing scope GraphQL\"(when watching a custom theme module I'm currently working on) or \"Unable to upload \"XYZ. The post to 'XYZ' in account 123456789 was unauthorized. Couldn't find a refresh token for user 987654321. Generate a new token and make sure the request is coming from an authorized user of account 123456789, then try again.\" in the last couple of days.\n\nSure, refreshing the token is not a big deal but haven't got this messages from any of my accounts before.. Anything changed? :slightly_smiling_face:\n\nCC: <@UQWGKUEN7>"
  },
  {
    "text": "Hello Folks,\nI need assistance on using vidyard videos in HubSpot.\nActually, we are adding videos in HubSpot rich text editor using vidyard embed code. It's working fine in some browser and loading too slow for Chrome. It seems to be CSP headers issue. I am not able locate these settings in  HubSpot Domain security settings. Can you guys please guide me how can I resolve it?\n<https://info.moleculardevices.com/vidyard-test>",
    "time_stamp": "2025-01-24 00:32:52",
    "edited": {
      "time_stamp": "2025-01-24 02:46:45"
    }
  }
]