[
  {
    "poster": {
      "poster_name": "giucot",
      "poster_handle": "giulia.talamonti"
    },
    "time_stamp": "2020-06-08 03:31:29",
    "text": "Hi everyone :wave: i’m working on a blog post template, and i would like to use a module combined with `related_blog_posts` but it doesn’t work (i can get the related post, but using the module inside the post formatter, it seems the variables are not passing by the module), do you have any idea?"
  },
  {
    "poster": {
      "poster_name": "Amy Andrews",
      "poster_handle": "aandrews610"
    },
    "time_stamp": "2020-06-08 14:50:01",
    "text": "yep! this should work: {% for topic in post.topic_list %}{{ topic.name }}{% if not loop.last %}, {% endif %} {% endfor %}"
  },
  {
    "text": "<@UGRDVLV5K> Sorry for the late reply on this one. Hope you found a solution. If not you can add wrapping html around any module or group of modules in design tools.",
    "time_stamp": "2020-06-08 15:11:50"
  },
  {
    "text": "Hi Everyone,\n\nI can't locate the place to add the social icons in the hamburger menu when in mobile view which makes the social icons to appear below the header tab. (Refer to Pic 1)\n\nCurrently what I did is to add the social icons module beside the header module and did some changes to the CSS so that they are aligned in desktop view but because they are still in different HTML div which is the cause of the icons not added inside the hamburger tab. (Refer to Pic 2)\n\nHow to combine these two modules into one single module or where to locate the place to add the social icons inside the hamburger menu when in mobile view?",
    "time_stamp": "2020-06-08 21:35:07",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-06-09 08:37:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-06-09 00:18:13",
    "text": "You could use the rss listing module <https://designers.HubSpot.com/docs/building-blocks/modules/default-modules#rss-listing>"
  }
]