[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-09 07:23:48",
    "edited": {
      "time_stamp": "2021-08-09 07:27:05"
    },
    "text": "We hear ya on the non-sizing based media queries.  Generally though it may be better to provide dark theme controls as a group of theme fields. If the user of the theme opts-in to auto displaying the dark theme then output the media query for it.\n\nThe reason is because the UI you would want for sizing based controls would typically have visual buttons showing smallest screen size to largest. prefers color scheme, and reduced animations queries don’t really fit into that kind of UI. You can be on a mobile screen size AND have the user prefer dark theme.\n\nThey do however make sense to implement directly with theme fields etc.\n\nAdditionally the pattern for dark theme typically is that the site uses the media query as the default setting. Then uses JavaScript and some form of button toggle, to allow the user to change between light and dark.\n\nIf you have other feedback related to that definitely share it. What we don’t want to do is restrict developers or users of the theme."
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-08-09 10:45:11",
    "text": "I agree with you for all you have said, to provide most of functionality. Although I feel the need for just \"custom\" status (as breakpoints name is not really defining this).\nContent and/or design may change depends on different things. For example in the case dark theme:\nIf you are using a custom background for a section you would definetly want to have the ability to change it depending if the user has the dark theme enabled or not. So that option in the style tab, would break the dark theme.\nAlso, you may want to use different images on content when switching between modes.\n\nI believe a much richer experience would be something like in the style tab you could read some defaults from theme json where we could setup things like custom classes that will show as a selector to be choosen for example in sections, columns, and the rich text."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-09 11:34:43",
    "text": "Great point about the style fields and being able to have a different setting for dark and light variants and how having some way of separating in the UI makes sense.\n\nIf you feel strongly about it I’d maybe create an idea forum post for it. That helps our teams determine demand for functionality, and influences prioritization.\n\nCurious kinda what the ratio looks like for how many sites folks are building that have color scheme functionality built in, vs how many don’t."
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-08-09 11:38:16",
    "text": "probably a low ratio. Hopefully growing trend soon!"
  }
]