[
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2020-02-27 04:33:11",
    "text": "Hi all - a client has suggested that we inline critical CSS to improve the technical SEO of their HubSpot sites. The recommendation has been made by an 'SEO Expert' (a friend) who probably ran an automated audit and doesnt know much about HubSpot. Is in-lining even a thing when there is a CDN by default? Could it even be done on HubSpot - without throwing away other benefits? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Jim Rogers",
      "poster_handle": "jrogers"
    },
    "time_stamp": "2020-02-27 05:06:55",
    "text": "You could add this into the head html within the page template quite easily in HubSpot. I guess it would be interesting to see how much it improves rendering and page loading times to see if it's worth it.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-02-27 05:41:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jim Rogers",
      "poster_handle": "jrogers"
    },
    "time_stamp": "2020-02-27 05:07:29",
    "text": "You could run a speed test on two of the same page to see."
  },
  {
    "poster": {
      "poster_name": "Jim Rogers",
      "poster_handle": "jrogers"
    },
    "time_stamp": "2020-02-27 05:07:53",
    "text": "One with inline critical CSS and one without."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-02-27 05:41:31",
    "text": "Thanks Jim - good ideas. I take it from your reply that you've never felt it necessary to do this in the past?"
  },
  {
    "poster": {
      "poster_name": "Jim Rogers",
      "poster_handle": "jrogers"
    },
    "time_stamp": "2020-02-27 09:26:33",
    "text": "Yeah I haven't. We have a cdn and this is pretty fast on our main site and I try to keep our site lightweight. We don't use HubSpot for our main website but we do use if for pages and blogs. It looks like using the templates in the HubSpot environment to generate inline styling would be quite easily done. Especially if there was not much of it then it would be worth it I reckon."
  }
]