[
  {
    "text": "Hello everyone, I’m having an issue with idetifiying users with JS on my website. Here is an example code of my trials. Although this works without any error in the console and triggers a network request to HubSpot, I can not see that contacts are not being updated with the custom properties values I’m seding. I’ve created custom properties on the panel before. Here is the relevaent screenshots. Is there anyone who can help or have any idea for a possible solution? Thanks in advance.",
    "time_stamp": "2024-10-04 03:08:38",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-07 15:32:14"
      },
      {
        "time_stamp": "2024-10-09 01:00:57"
      },
      {
        "time_stamp": "2024-10-09 10:08:56"
      },
      {
        "time_stamp": "2024-10-10 04:34:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Hooks",
      "poster_handle": "james.hooks"
    },
    "time_stamp": "2024-10-04 09:39:09",
    "text": "Hi folks, I was sent here from HubSpot support and hoping someone may be able to help me solve an issue with email links page view tracking.\n\nI cannot get the page view tracking to work through email links to cross domain sites. Even when tracking works in a other contexts e.g. submitting a form we have hooked up through the api and associating the user with _hsq.push(['identify', {email}]).\n\nI have whittled my test page on my external site down to a simple single html file with the HubSpot script embedded and I have verified\n• External domain is part of \"Additional Site Domains\" in the tracking settings\n• The HubSpot tracking script and all subsequent scripts load correctly and are visible in the &lt;head&gt;\n• Cookie banner shows and cookies are accepted\n• The HubSpotutk and other HubSpot tracking cookies are  set\n• The tracking parameters exist in the redirect url from the email i.e. _hsenc, _hsmi, utm_medium, utm_content, utm_source\n• A request to <https://track.HubSpot.com/__ptq.gif>.... appears in the network traffic and is successful\n• No settings or extensions are blocking tracking\nGiven all this, I get no page view entries in the contact associated with the email links. What might be wrong here?"
  }
]