[
  null,
  null,
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:35:22",
    "text": "so let's say I have created a little server applet that pings the HubSpot api via a server-side request then spits that data out via my own CORS / Ajax enabled endpoint(s). This now lets me make applications via JS from within HubSpot's CMS to keep things all in one place (mostly). Is this something anyone would be interested in or is this considered bad practice?"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:37:09",
    "edited": {
      "time_stamp": "2018-08-24 08:37:13"
    },
    "text": "I can't be the only one who wants to do AJAX / Fetch requests... and wondering why no one else has done this yet that I know of"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2018-08-24 08:37:31",
    "text": "I know <@U7ADCU3BM> has an AJAX solution"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:38:22",
    "text": "does HubSpot frown against it or is it okay to do?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-24 08:38:22",
    "text": "I do this :slightly_smiling_face: lol"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:38:32",
    "text": "lol ok"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:38:52",
    "text": "don't want to build an app that's going to get blocked"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:38:56",
    "text": "so glad to know i'm not alone"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-24 08:41:10",
    "text": "I will say I usually just use an API key, not full OAuth, just as a disclaimer. Or I use Zapier to directly interface with HubSpot first, I usually feel a bit more secure going that route, depending on the endpoint I need to hit"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:42:17",
    "text": "oh, can you do this with zapier? enable a new endpoint that will allow client side requests?"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:42:28",
    "text": "would be nice not to run another server"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2018-08-24 08:43:24",
    "text": "If you’re using the API and you’re not passing around hapikeys, this should be fine",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-08-24 08:44:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-24 08:44:23",
    "text": "not quite, and it depends on what I need, but because I use a API key, I feel a lot better from a security standpoint sending my requests to Zapier via AJAX which then either pings HS directly, or forwards the payload to a custom server."
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:44:32",
    "text": "yeah, the key would be hidden"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-24 08:46:48",
    "text": "so as someone who doesn't know much about APIs and such, <@U26BLKGE4> do you have an example? I've been trying to figure out a way to use zapier for something like this",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-08-24 09:06:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:47:09",
    "text": "if HubSpot added a domain whitelist feature per key/token for client side requests (like Google Maps js api), that would save me a ton of time"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:47:51",
    "text": "until then, i'll use a middle-man server to mirror the data lol"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:48:52",
    "text": "and if anyone is interested in the java applet i may be create a little landing page for anyone to sign up"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-08-24 08:49:09",
    "text": "and use the ajax endpoint from my server if there is a desire"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-24 09:06:20",
    "text": "I'll be giving a short presentation during the custom modules session at Dev day around one of our use-cases that kind of shows the potential, but it's more about using VueJS, custom modules, and the contacts API together. In that example I made a Vue instance that worked as an interactive quiz that submitted CRM data (via Zapier) without using a form, without a page refresh, and remained \"semi-smart\" as the contact's email was pre-populated using HubL if it was already known. This was a simple client example, but shows what's possible.\n\nI'll be building something similar in the coming months dealing with a client that wants to use internal HS landing pages as a dispatch system... that's going to be fun. In their case, they want to be able to input new customers (and have their information also be asynchronously sent to their accounting system), search for existing customers in the CRM and edit their information (they don't want these employees in the CRM directly), and schedule service calls that will be reflected in a third system. Lots of AJAX will be going on in that project, believe me lol. Not sure if I'll use Zapier for it, but I'm 99% sure all of that will be possible.\n\nAs shown from above, I mainly deal with the contacts API, but these methods could be used on any endpoint. Do you have any specific use cases in mind?"
  }
]