[
  {
    "poster": {
      "poster_name": "Andy Mc",
      "poster_handle": "andy"
    },
    "time_stamp": "2018-08-22 07:03:13",
    "text": "I hope so <@U26BLKGE4> I just see posts like this one from 2016 (<https://integrate.HubSpot.com/t/list-of-ctas-via-the-HubSpot-api/139> ) with no movement on it. It must be a long evaluation."
  },
  {
    "poster": {
      "poster_name": "Kayla Sutcliffe",
      "poster_handle": "michaela.sutcliffe"
    },
    "time_stamp": "2018-08-22 08:13:22",
    "text": "Hi everyone. Has anyone managed to link multiple stores to one HS account please? We are looking into this for a client"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-22 08:14:23",
    "text": "Are you referring to the Shopify integration?"
  },
  {
    "poster": {
      "poster_name": "Kayla Sutcliffe",
      "poster_handle": "michaela.sutcliffe"
    },
    "time_stamp": "2018-08-22 08:23:46",
    "text": "We have 5 Shopify stores. One is currently linked to the HS account and we would like the further 4 to be connected to the same account"
  },
  {
    "poster": {
      "poster_name": "Kayla Sutcliffe",
      "poster_handle": "michaela.sutcliffe"
    },
    "time_stamp": "2018-08-22 08:24:03",
    "text": "Yes Jon."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-22 08:25:54",
    "text": "I’m afraid I haven’t dabbled in the shopify integration enough but I think it only supports 1 shopify portal at a time right now.\n\nIf the data tracking isn’t the main motivator for linking them, you could use the Shopify JS api to build the shopping experience on HubSpot."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-22 08:26:27",
    "text": "If the data IS the main motivator you may need separate HubSpot accounts for each shopify integration"
  },
  {
    "poster": {
      "poster_name": "Kayla Sutcliffe",
      "poster_handle": "michaela.sutcliffe"
    },
    "time_stamp": "2018-08-22 08:27:29",
    "text": "The data is the main motivator I'm afraid. We found a company who can do this but they're out of budget, unfortunately"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-22 08:32:16",
    "text": "well, another possible way to do it though I don’t know on Shopify’s end how easy it is - as long as there are hooks on Shopify’s end - you could use a separate server that gets data from shopify like new customers, new purchase records etc. and use the HS API to update contacts data. be aware though the data would not be specifically attributed to Shopify and would not show in any analytics data for shopify in HubSpot. It would however allow you to have the data in HubSpot"
  },
  {
    "poster": {
      "poster_name": "Kayla Sutcliffe",
      "poster_handle": "michaela.sutcliffe"
    },
    "time_stamp": "2018-08-22 08:56:37",
    "text": "Okay, thanks Jon. I'm fairly new to HubSpot myself but will ask our other developers what they think to your solution and whether we can work on it further."
  },
  null,
  null,
  null
]