[
  {
    "text": "Can it be that The contact Contact-API is not escaping ” within the values\nI retrieved a json set\nthe page title linked to a contact contains ”\n….in-omzet”,“page-title”:“Stefan Louis (Leclanché): “Elk jaar verdubbelen in omzet”“,”title”:“Xpr….\nparse the json and you have an error",
    "time_stamp": "2018-08-07 10:20:16",
    "edited": {
      "time_stamp": "2018-08-07 10:23:18"
    }
  },
  null,
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-08-07 12:40:16",
    "text": "Imagine your friend is a great front-end web developer ... they have never used API's before, but REALLY want to learn. \n&gt; What online courses / training do you recommend they take to learn the fundamentals of API's and basics for how to use them?  :thinking_face::thinking_face::thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-07 12:43:19",
    "text": "I would probably just send them to make a free Zapier account to see what's possible and encourage them to look at webhooks. That's how I learned. Get the data structure stuff down first, then worry about actually working it in to your projects the hard way.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-08-07 12:45:48"
      },
      {
        "time_stamp": "2018-08-07 12:58:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-08-07 12:45:48",
    "text": "Interesting - was there any documentation Zapier had that you found extra helpful?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-08-07 12:58:34",
    "text": "Not so much documentation, but it gets you started fast and familiarizes you with the vocabulary so you know what to Google. I really got into APIs when I had to make a contact database sync for a client from their local system to HS... don't recommend learning that way, but it worked lol. \n\nThe only course that comes to mind is the one I went through to learn React on Udemy: <https://www.udemy.com/share/1000dW/>\n\nThey use the YouTube API basically as live placeholder content.  Not about APIs directly, but covered enough to give you the idea."
  }
]