[
  {
    "poster": {
      "poster_name": "Rachel McBee",
      "poster_handle": "rachel.mcbee"
    },
    "time_stamp": "2021-10-29 08:10:53",
    "text": "My anxiety has never been higher since the sudden surge of emails. This is nuts!!!!! Worst part is my team has been so busy that we all weren’t able to attend Inbound, and we’re STILL all signed up for everything…"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-29 08:21:15",
    "edited": {
      "time_stamp": "2021-10-29 08:22:40"
    },
    "text": "<@U01A96SC79C> there have been days where I have gotten more inbound spam emails than internal + client + newsletter emails COMBINED. So frustrating!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-29 08:25:41",
    "edited": {
      "time_stamp": "2021-10-29 08:42:33"
    },
    "text": "Hey all, we have a team looking into this, assessing what can be done in the short term and what we can do to prevent an experience like that for future events.\n\nIn the meantime the best suggestion I can give is if the message doesn’t interest you, use the unsubscribe link in the email. If for some reason the message was sent by an individual, so it doesn’t have an unsubscribe, I would reply indicating you don’t want to be contacted any further. I realize that’s not the ideal solution, but it will lessen the impact on your inbox in the short term.\n\nI don’t know if the team working on this will give me updates (I don’t typically work with them) if I hear anything I will update you as soon as I can."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-29 08:31:12",
    "text": "That’s why we love you <@U7SL518D6> :100:"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2021-10-29 09:11:11",
    "text": "i’m sure it’s a matter of marketers not realizing that every single one of them works off of roughly the same workflow/calendar setup, so one contacting us the day after inbound is what they think about when what the recipient sees is twenty having the same idea."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2021-10-29 09:11:24",
    "text": "it’s a catch-22 in a sense"
  }
]