[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-27 08:22:51",
    "text": "A little feedback for HubSpot: I’m a little skeptical to sign up for Inbound if I ever get spammed like this again. The email volume has been unreal and a HUGE headache",
    "reply_count": 14,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2021-10-27 08:58:06"
      },
      {
        "time_stamp": "2021-10-27 09:01:00"
      },
      {
        "time_stamp": "2021-10-27 09:04:36"
      },
      {
        "time_stamp": "2021-10-27 09:05:02"
      },
      {
        "time_stamp": "2021-10-27 09:07:11"
      },
      {
        "time_stamp": "2021-10-27 09:18:08"
      },
      {
        "time_stamp": "2021-10-27 09:56:05"
      },
      {
        "time_stamp": "2021-10-28 20:41:46"
      },
      {
        "time_stamp": "2021-10-29 08:10:53"
      },
      {
        "time_stamp": "2021-10-29 08:21:15"
      },
      {
        "time_stamp": "2021-10-29 08:25:41"
      },
      {
        "time_stamp": "2021-10-29 08:31:12"
      },
      {
        "time_stamp": "2021-10-29 09:11:11"
      },
      {
        "time_stamp": "2021-10-29 09:11:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-27 08:58:06",
    "edited": {
      "time_stamp": "2021-10-27 08:59:13"
    },
    "text": "Hey John, sorry to hear the volume was not what you were expecting.\n\nThe INBOUND website prompted each time a sponsor booth or session’s speaker wanted to be able to contact you. It was optional in all cases.\n\nI want to provide the INBOUND team actionable feedback to make this a better experience. Any additional detail could help us make future events better.\n\n*Was the problematic part:*\n• *the emails that HubSpot sent regarding INBOUND?*\n• *the emails that booth owners and speakers sent out?*\n• the clarity of the language for the opt-ins presented during INBOUND’s sessions and booths?"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2021-10-27 09:01:00",
    "edited": {
      "time_stamp": "2021-10-27 09:03:29"
    },
    "text": "same — for me, it’s the booth owner emails, especially the ones that send pretty much daily. the HubSpot emails were fine.\n\ni was interested in learning more, but their automation levels were such that i unsubscribed from everything within about two days. it felt very “outbound/interruptive.”\n\ni did think the opt-in language was a little confusing. i don’t remember what it was, but it sometimes looked like you couldn’t continue with the session if you didn’t opt in. that could have been me. but if it didn’t say something like “sign up” and “continue without signing up,” that might be helpful next time"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-27 09:04:36",
    "text": "These are emails from Inbound Sponsors. I don’t recall opting in for the sponsors"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-27 09:05:02",
    "text": "I never went to these peoples booths either"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-10-27 09:07:11",
    "text": "fwiw my entire team has complained about it"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-27 09:18:08",
    "edited": {
      "time_stamp": "2021-10-27 09:18:46"
    },
    "text": "Appreciate your feedback, I’ll relay this to the INBOUND team.\n\nFrom your feedback sounds like a combination of those third-party automations or email campaigns being too aggressive and the opt-in language/interface maybe could be improved."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-27 09:56:05",
    "edited": {
      "time_stamp": "2021-10-27 10:08:42"
    },
    "text": "On a related note because developer day is coming up. For developer day:\n\nYou may receive or have already received an email inviting you to dev day. You may receive a reminder email prior to the event. You may also receive a follow up email after the event.\n\nWe don’t have the same sponsor/speaker/booth opt in system for our event. There will be both HubSpot and community speakers. Speakers may have links to their websites - they may include forms to sign up for emails, but we are not providing a _special_ system for it.\n\nEdit: added word special - as the speakers certainly could be using HubSpot tools available to any HubSpot customer like forms, marketing emails, workflows etc."
  }
]