[
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 05:18:14",
    "text": "Looking for new ideas to change the process and experience of launching a website on HubSpot CMS. Ya’ll know I the biggest advocate for it, but man did I take a bullet for it today. So apparently SSL activation can take take “several hours” and this is “expected behavior.” You can’t know this, of course, until you actually switch, which is gated by the new step-by-step process that blocks you if you haven’t switched the DNS. And of course, a client with their own IT and dev department having their website in maintenance mode for “several undefined hours” with no way to monitor or know when it will work while they lose money every second they are down doesn’t sit well with them. The current DNS switching process and launching is so oversimplified, with so much gating, it might be the most frustrating part of HubSpot CMS to date. What do you think? Have you had any experience with this? I’m posting this in ideas because we might need new ones for this process. :exploding_head:",
    "reply_count": 14,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2018-10-04 05:22:53"
      },
      {
        "time_stamp": "2018-10-04 06:30:00"
      },
      {
        "time_stamp": "2018-10-04 06:32:49"
      },
      {
        "time_stamp": "2018-10-04 06:38:19"
      },
      {
        "time_stamp": "2018-10-04 06:46:37"
      },
      {
        "time_stamp": "2018-10-04 09:07:10"
      },
      {
        "time_stamp": "2018-10-04 09:36:12"
      },
      {
        "time_stamp": "2018-10-04 09:38:31"
      },
      {
        "time_stamp": "2018-10-04 09:39:15"
      },
      {
        "time_stamp": "2018-10-04 09:45:36"
      },
      {
        "time_stamp": "2018-10-04 10:02:10"
      },
      {
        "time_stamp": "2018-10-04 10:05:28"
      },
      {
        "time_stamp": "2018-10-04 10:13:40"
      },
      {
        "time_stamp": "2018-10-04 10:14:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 05:22:53",
    "edited": {
      "time_stamp": "2018-10-04 05:23:33"
    },
    "text": "I’ll start with some:\n1. The SSL Activation needs to be more transparent.\n2. We should rethink the new step-by-step screens process and revert to something more accessible for developers. Marketing Mary is almost NEVER the person launching a website, so why was the process tailored to her persona (at least it seems that way)?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-10-04 06:28:42",
    "text": "HS probably uses Vim over Emacs :wink:"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-10-04 06:30:00",
    "edited": {
      "time_stamp": "2018-10-04 06:39:13"
    },
    "text": "I agree with a lot of your points Jesse, and it's something I've brought up with support and the product team in the past. I will note, there is a link in the top right of the screen with the actual DNS controls that will bypass a lot of the unnecessary clicks, but it still isn't ideal. I definitely understand why they did what they did, I can imagine HS support getting thousands of confused marketers asking about DNS. I do think that offering a streamlined 'for developers' button or something that just brought you directly to the settings view would be really beneficial."
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 06:32:49",
    "text": "<@U26BLKGE4> Thanks for the comment! I like your idea. My thinking is that with HubSpot CMS being “pulled out” of the Marketing Product anyway, there’s no need for a “user-friendly” or “Step-by-step” process now. If you’re using HubSpot CMS, like Wordpress, Joomla or any other CMS, you should be expected to know something about DNS to make the connect. Marketing Mary shouldn’t need to be involved in the new structure, so it makes sense to rethink it, even if they JUST redid it not long ago."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-10-04 06:38:19",
    "text": "And I think adding a button or something at the bottom doesn't detract from the people this redesign _does_ help at the same time, because I'm sure that is still a large number of people."
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 06:46:37",
    "text": "Agreed"
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-10-04 09:07:10",
    "edited": {
      "time_stamp": "2018-10-04 09:15:03"
    },
    "text": "This is all great feedback, thank you for sharing.\n\nSo we can actually provision SSL before you CNAME a domain to HubSpot, if you can validate domain ownership.\n\nPreviously this was best done through finding an Email in WHOIS for email validation (this exists in the UI right now), however, with GDPR concerns, most DNS providers have redacted this information from WHOIS, so we can not send the ownership validation email to anyone.\n\nThe alternative domain ownership methods are through a new CNAME record, or through a token which is served at a specified URL (only this token, no html or anything). We might expose 1 of these 2 methods in the UI now that email validation is so hard.\n\nWhich do you think buy and large would be an easier form of domain ownership validation to allow us to provision SSL before a domain is connected? Would you prefer to put in some extra work to verify domain ownership so we can provision SSL before a domain is connected, compared to having a more defined and exposed SSL provisioning \"progress\"?\n\n If required, both of these methods are possible right now, so please reach out if you need it (there is just no UI for it)."
  },
  null,
  {
    "poster": {
      "poster_name": "James Magnarelli",
      "poster_handle": "jmagnarelli"
    },
    "time_stamp": "2018-10-04 09:36:12",
    "text": "I would be up for exposing the link to the DNS instructions more prominently in the UI."
  },
  {
    "poster": {
      "poster_name": "James Magnarelli",
      "poster_handle": "jmagnarelli"
    },
    "time_stamp": "2018-10-04 09:38:31",
    "text": "As Will said, we do have alternative validation methods that can pre-provision SSL for customers before moving onto HubSpot. Currently, the system uses email validation by default for domains that it thinks already support SSL on their external provider (this is precisely to avoid the scenario you mentioned, <@U25C6PU56>, where a site loses SSL during the migration). However, email validation has been working only sporadically over the past few months and we’re evaluating switching to a new default validation method for these customers."
  },
  {
    "poster": {
      "poster_name": "James Magnarelli",
      "poster_handle": "jmagnarelli"
    },
    "time_stamp": "2018-10-04 09:39:15",
    "text": "Any thoughts on CNAME vs hosted token as a means of manual validation would be helpful."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-10-04 09:45:36",
    "text": "I'd prefer CNAME myself, especially when dealing with clients who may have their DNS management tools and web hosting on different services."
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 10:02:10",
    "text": "<@U6W3H6YN8> <@U6MHBFW1K> Thanks so much for weighing in, guys! I think long-term hosted tokens might be the best course once the HubSpot CMS has matured as more of a development platform. In it’s current state a CNAME solution is probably better for now though. To <@U26BLKGE4>’s point, these DNS issues (like the one I had this morning) usually only happen with clients that have their own development or IT resources and have much more stringent requirements on changes, updates, etc. So trying to work with them on a token could be a bit hairy depending on what they’re using with they way things are at present. Does that make sense?"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 10:05:28",
    "text": "Also, I could ABSOLUTELY use the pre-provisioning for this specific client if anyone can DM me to work on it. <@U6MHBFW1K> This is actually the same client that had us turn off TLS 1.0 by default. :joy:"
  },
  null,
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-10-04 10:13:40",
    "text": "<@U25C6PU56> DM me and I can help you with ownership validation and TLS"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2018-10-04 10:14:22",
    "text": "Thanks Will!"
  },
  null,
  {
    "poster": {
      "poster_name": "Andrew Dolan",
      "poster_handle": "andrew"
    },
    "time_stamp": "2018-10-04 14:06:48",
    "text": "It would be nice to have a watermarking feature on images built into HubSpot (since watermarkjs isn't compatible).",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-10-04 14:12:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-04 14:12:59",
    "text": "couldn’t you use the API to pull all the images you want, then run your watermark tool on them and file replace the images?\n\nI’ve never used watermarkjs but there are several ways of implementing this sort of think in javascript, 1 way is to swap img’s with canvas elements and render the images into the canvas and apply your watermark over the top."
  },
  null
]