[
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2021-09-23 05:41:19",
    "text": "It will not. You need to change the subdomain your blog is configured to use (essentially to be the www subdomain) and change the slug to be /blog. This requires that you have CMS hub because marketing hub alone does not support hosting at www. Also, I recommend you add the /blog slug before making the subdomain changes as this make managing redirections much easier."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2021-09-23 06:27:54",
    "text": "If it’s a HubSpot form, any query params that exactly match the internal name of the field on the form will get copied from the query param into the form field value (regardless of whether that field is hidden or not)"
  },
  {
    "poster": {
      "poster_name": "Johan Vantomme",
      "poster_handle": "johanvt"
    },
    "time_stamp": "2021-09-23 08:50:13",
    "text": "Hello\nWe have a site where people are submitting forms with mandatory file-upload property, we receive submission without any attached file.\nIs there a know way to bypass HubSpot form field validation? (except by using console submit)\nI’m thinking about : Private browsers, extensions, …. Any idea what is causing this\nAny thoughts on how to extra enforce it?"
  },
  {
    "poster": {
      "poster_name": "Justin Graci",
      "poster_handle": "jgraci"
    },
    "time_stamp": "2021-09-23 10:17:16",
    "text": "Developers, I'm looking for your input and help. What would incentivize you to invest time in completing a certification or learning a new skill defined by HubSpot? (E.g. HubSpot apparel, gaming computer, paid online training, gift cards, new laptop, etc.)\n\n<https://docs.google.com/forms/d/e/1FAIpQLSe1sc-xSZSqOuDTHKg9X3WllCvE78BhE4ToThX3GFYAmTyD3g/viewform?usp=sf_link|Please submit ideas here>."
  },
  {
    "poster": {
      "poster_name": "Jade Schiffer",
      "poster_handle": "jschiffer"
    },
    "time_stamp": "2021-09-23 12:38:20",
    "text": "Hi Developers! I'm Jade, a UX Researcher at HubSpot, looking to hear your opinions in a paid research study on our HubSpot Media products, e.g., The HubSpot Blog, The Hustle, our YouTube and Podcasts, etc.\n\nIf you are interested and available, please fill out the following survey: <https://www.research.net/r/DBWVVWG>. If you qualify, I will reach out to coordinate a 45-minute interview over the next few weeks, and you will be compensated $50 USD for your time. Thank you so much!"
  }
]