[
  {
    "poster": {
      "poster_name": "Mohammad Raza",
      "poster_handle": "msraza1"
    },
    "time_stamp": "2021-09-25 17:36:04",
    "text": "Hi all, I am new to HubSpot, trying to learn their CMS, CRM tools etc. so that I can find some client to offer these solutions and make money. If you have any tips/suggestions, I would appreciate it"
  },
  {
    "poster": {
      "poster_name": "Katrine Ramsay",
      "poster_handle": "katrine_ramsay"
    },
    "time_stamp": "2021-09-25 21:56:28",
    "text": "Hi everyone! I'm new to HubSpot/ website development and am in the (very slow!) process of creating a website for a start-up company.\n\nI've made a few pages to start us off, but I can't seem to fully share them with my team. I sent them links to the pages which we walked through together over Zoom, then when they tried to go back to the links a few days later they were unable to access the pages.\n\nDoes anyone know why this is? Do they need to sign up for accounts/ be logged into mine?\n\nAny help would be much appreciated!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-09-25 23:16:32"
      },
      {
        "time_stamp": "2021-09-26 21:41:25"
      },
      {
        "time_stamp": "2021-09-27 07:09:58"
      },
      {
        "time_stamp": "2021-09-30 09:23:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Steven Petteruti",
      "poster_handle": "steven632"
    },
    "time_stamp": "2021-09-25 23:07:52",
    "text": "Nope didn’t get an answer! I ended up coding it up myself. I’d recommend speaking to <http://Rutterapi.com|Rutterapi.com>, that’s what we are using and it made the connection seamless "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-09-25 23:16:32",
    "text": "If you’re just sharing the preview link - anyone viewing needs to be logged in. However if you’re building the pages in content staging you can just publish the page to content staging and share that link w no problems. \n\nYou can also just publish the page, assuming the site isn’t live yet, and share the actual url. \n\nIf the site already has live pages though I would recommend using content staging. "
  }
]