[
  {
    "poster": {
      "poster_name": "varun doharey",
      "poster_handle": "varundoharey"
    },
    "time_stamp": "2021-09-14 03:02:08",
    "text": "Hi Guys... I have been playing with CRM card. I am able to display one. I want to open one of the property that is link in iframe. Can anyone let me know can we do it?"
  },
  {
    "text": "",
    "time_stamp": "2021-09-14 03:02:19"
  },
  {
    "poster": {
      "poster_name": "varun doharey",
      "poster_handle": "varundoharey"
    },
    "time_stamp": "2021-09-14 03:10:35",
    "text": "<@UTQQ4TXCH> any help please?"
  },
  {
    "poster": {
      "poster_name": "Keigan Tulloch",
      "poster_handle": "keigan.tulloch"
    },
    "time_stamp": "2021-09-14 08:42:00",
    "text": "Hello! I am looking to get a custom property in a custom coded workflow, wondering if anyone could help me out?"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford182"
    },
    "time_stamp": "2021-09-14 11:53:26",
    "text": "<@U01NW31S9EH> I see that you were looking at this. :slightly_smiling_face: We have encrypted the URLs so someone is unable to SEE the URLs to the files. Partial solve. The client is really set that they want the files to not be accessible unless the user is logged in like they do for the content pages using the membership app. I need a solution quickly for this. I’m trying to get by with the encryption element, but not sure it’s gonna seal the deal."
  },
  {
    "poster": {
      "poster_name": "Christian Nuñez",
      "poster_handle": "cnunez"
    },
    "time_stamp": "2021-09-14 12:52:34",
    "edited": {
      "time_stamp": "2021-09-14 12:54:22"
    },
    "text": "Hey <@U0154FHBYLD> :corgi-wave:, apologies for the delay, I wasn't receiving the notifications before.\n\nBack to the question: Page membership is independent from the files tool, which means that the only option in-app to manage the files privacy is what we describe <https://knowledge.HubSpot.com/files/copy-and-update-the-url-of-files-uploaded-to-the-file-manager|here>.\nHowever, the \"private files\" option only contains 3 different links:\n1. Internal Share link.\n2. Link to file preview.\n3. Temporary 24hr public share link. \n1 &amp; 2 won't work because they're meant to work for HubSpot users in your portal, so unless the client's target is strictly internal, this won't work. On the other hand 3 could work if the files won't be permanently tied to the private content (which I don't think could be the case here).\n\nThat's how the file feature works and It's limitations - Currently, we don't support membership features for files (log in pages, password protection etc.)\n\nWith that being clarified, the last thing you can do is to implement a workaround, such as i.e. \"implementing a server side usar and session management strictly for files\" which could be not ideal since It'll prompt customer log in twice, or a JS solution to hide the links from the front end (I _believe_ this is similar or pretty much what you already did with the encryption).\n\nWe're always open for feedback (I do agree that this could be an interesting feature, I've had this question in the past, so maybe in the future). :slightly_smiling_face:"
  },
  {
    "text": "I’m not sure where to put this question. My team and I are migrating from an old style theme/template from 2018 to a new theme. When we switch the template from the old the new there’s a deprecated “custom Hubl” module that will not go away. It won’t delete or anything. It’s from the old templates/theme.  Does anyone one know the fix to this, other than rewriting that portion of the old theme?",
    "time_stamp": "2021-09-14 14:10:06",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-15 13:53:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford182"
    },
    "time_stamp": "2021-09-14 14:30:18",
    "text": "Thank you so much for getting back to me <@U01NW31S9EH>! Yeah the 24hr link won’t work. I’d love to see this feature fleshed out, so if there’s anything I can do to help if/when a discussion takes place on it, please count me in! In the meantime… is there a method to bulk change about 7000 files from public to noindex??"
  },
  {
    "poster": {
      "poster_name": "George Travin",
      "poster_handle": "george099"
    },
    "time_stamp": "2021-09-15 00:15:47",
    "edited": {
      "time_stamp": "2021-09-15 00:16:44"
    },
    "text": "Hey, maybe someone know, when i try to create or update contact from a frontend  with this endpoint,\n```<https://api.hubapi.com/contacts/v1/contact/createOrUpdate/email/test@HubSpot1.com/?hapikey=xxx>```\nevery time its 401 , from postman its works good, so its mean i cant do a call from a front end ?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-15 03:04:27"
      },
      {
        "time_stamp": "2021-09-15 03:06:03"
      }
    ]
  }
]