[
  {
    "poster": {
      "poster_name": "Dmytro Zaitsev",
      "poster_handle": "dmytro.zaitsev"
    },
    "time_stamp": "2021-09-20 01:55:26",
    "text": "got it, thank you"
  },
  {
    "poster": {
      "poster_name": "Dieu Truong",
      "poster_handle": "dieu.truong"
    },
    "time_stamp": "2021-09-20 03:06:28",
    "edited": {
      "time_stamp": "2021-09-20 13:16:21"
    },
    "text": "hi everyone, I have connected the ad-account (FB) to HubSpot. I created 2 ad-campaigns on HubSpot, the data successfully transfer to HubSpot.\nAfterward, I create 2 more ad-campaigns, but this time I created on Facebook and no data transfer to HubSpot. How could I fix this issue?\n\nWell, I found the problem. So, I would reply myself in case anyone else encounters this.\n=&gt; My teammate created 2 new campaigns with a different higher role account, but the existing HubSpot connection is not this one :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Elikem Daniels",
      "poster_handle": "hello935"
    },
    "time_stamp": "2021-09-20 05:54:45",
    "text": "Hello, everyone. Does the cookie code track customer journey on a HubSpot hosted website even if visitor does not opt-in? I’d like to know if the cookie works this way.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-20 13:09:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-09-20 08:38:45",
    "edited": {
      "time_stamp": "2021-09-20 08:39:18"
    },
    "text": "thanks for the response :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-09-20 08:42:32",
    "text": "i know, for navigation items, there is a recommendation to not have more that 5-7 items ( i read that years ago in some UX Blog). Is there a recommed upper limit for the overall number of navigation links in a site menu? For example in a Mega Menu? Are there bad implications for exceeding that limit ( apart from the obvious bad UX that comes with showing a ton of links :wink: ...)?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-20 09:34:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Stash",
      "poster_handle": "matthew.stash"
    },
    "time_stamp": "2021-09-20 09:00:43",
    "text": "Hello everyone! Forms question that I'm hoping will have a simple solution, yet I can't seem to find one. I have a form that I need to add an id to the submit button. We have a vendor that is requesting an id added to the button for a job they are running on our site, and for some reason *#hsForm_guid input[type=\"submit]*, which works as an identifier for me, is not working for their use case. I also had them attempt to grab it with *.hs-form .hs-submit .hs-button,* which again when I attempt this it will uniquely grab the submit button on this page, but is not working for them. They are insisting that for the button itself it needs to have an id attached to it. For additional context, this page has a single form, and there are no other buttons acting as an input submit. Seems like it should be simple, but I can't find a way to do this. Anyone have any ideas how to accomplish this? :man-shrugging:",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-09-20 11:41:41"
      },
      {
        "time_stamp": "2021-09-20 13:25:04"
      },
      {
        "time_stamp": "2021-09-21 01:56:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-20 09:34:18",
    "text": "I’m not sure there’s necessarily a prescribed upper limit but I would guess 5-7 links per sub menu.\n\n5-7 items are generally all a person can remember at one time, present more stuff than that and it can become overwhelming.\n\nUX and accessibility of megamenus is really the hardest part.\n\nThe mega menus sub menus shouldn’t look vastly different from each other because then the user can’t learn the pattern and be efficient."
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2021-09-20 11:41:41",
    "text": "Hello <@U01GYGV1XD1>, can you confirm that all the action is happening after the form is ready?\n\n<https://legacydocs.HubSpot.com/global-form-events>"
  },
  {
    "text": "Hi <@U02CJPLG9KK>, in my opinion, HubSpot would set both the 1st party cookie on our site and another cookie in this domain \"<http://track.HubSpot.com|track.HubSpot.com>\" by sending a gif. As far as I know, most browsers (such as Chrome) still can set the 1st party cookie without the user's agreement, but the 3rd cookie.",
    "time_stamp": "2021-09-20 13:09:03",
    "edited": {
      "time_stamp": "2021-09-20 13:09:24"
    }
  },
  {
    "poster": {
      "poster_name": "Dieu Truong",
      "poster_handle": "dieu.truong"
    },
    "time_stamp": "2021-09-20 13:25:04",
    "edited": {
      "time_stamp": "2021-09-20 13:25:50"
    },
    "text": "Great answer <@U01D95STUS3>. I just want to ask another question. As the way rendering of HubSpot form, if we use embedded code in the normal HTML (not hosting on HubSpot), the form renders inside an Iframe tag. It causes we can not touch any element of the form by using a normal JS selector.\nSo, could the \"Global Event\" still work in this case?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-09-20 13:30:47",
    "text": "Y’all are killing it today."
  }
]