[
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-03-14 10:39:59",
    "text": "Thanks Lily.\n\nHello <@U04RDS77QF7> can you tell me more about (2)? what are you trying to do there?\n\nAbout (4), you could programmatically construct iFrame URI, let us know if that’s not possible"
  },
  {
    "poster": {
      "poster_name": "Tom Durston",
      "poster_handle": "tom984"
    },
    "time_stamp": "2023-03-14 12:06:38",
    "text": "Hi <@U03FJQPSC0Y>. Our main objective is to create a card with a form that has dependant fields that are displayed or hidden depending on the value of another property on the form (e.g. Radio select with Option A and Option B, where a text input field is displayed if Option A is selected). It doesn’t seem like that’s possible and so our next best option would be launching an iframe that links to a webpage that contains a HubSpot form that we can auto-populate using a query string that contains the collected form inputs.\n\nI know that `associatedObjectProperties`  can append properties of the object record to the iframe’s uri, but some of the values that we are trying to append are not object properties. And so what we are trying to do with (2) and (4) to is collect variables in a form and manually appending those variables into the iframe uri.\n\nCould you please elaborate on your comment about (4) as the only way I have been able to retrieve form values is by using payload.formState in a separate serverless function, however at that point I am unable to launch the iframe.\n\nLet me know if you need me to clarify further, I’m at a bit of a loss here.\n\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-03-14 14:17:16",
    "text": "Ah, now I understand better about what you are trying to do. I think form submission has to happen so you can retrieve values from the payload. These are some of these things we are working to improve at the moment."
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2023-03-14 18:00:47",
    "text": "is there a way to create a row of components similar to stack but horizontal?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-14 22:28:28"
      },
      {
        "time_stamp": "2023-03-15 16:41:54"
      },
      {
        "time_stamp": "2023-03-15 16:51:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-03-14 22:28:28",
    "text": "Hi Noel, I see that you are trying to manage the layout of components. We don’t have horizontal stack yet. What sort of components would you typically stack horizontally?"
  }
]