[
  {
    "poster": {
      "poster_name": "Tim L",
      "poster_handle": "tim462"
    },
    "time_stamp": "2021-07-09 09:29:28",
    "text": "Not exactly HS-related, but with respect to disavowing links – how do people usually go about that? Do you _only_ disavow links with a high toxicity score? Or are weird foreign URLs from .pw TLDs worth scrapping even if their toxicity score is low?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-09 10:12:11"
      },
      {
        "time_stamp": "2021-07-09 10:59:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niklas Vaittinen",
      "poster_handle": "niklas"
    },
    "time_stamp": "2021-07-09 10:12:11",
    "text": "I recommend to review relevancy: if the inbound link is irrelevant, and from foreign TLD, it is worth considering scrapping it.\n\nAnd also bearing in mind, that if the domain authority of the link is low, the less impact it has anyway. Better to keep cleaner link profile with higher domain authorities and commonly used TLDs. Also depends on how significant part of your total links comes from these, the smaller the portion is, less impact it has on your overall profile."
  },
  {
    "poster": {
      "poster_name": "Niklas Vaittinen",
      "poster_handle": "niklas"
    },
    "time_stamp": "2021-07-09 10:15:47",
    "text": "GTMetrix, and another similar tool if you want to compare is Pingdom Tools\n<https://tools.pingdom.com/>\n\nIn general look at the hosting/server performance, and especially the server response time (sometimes I've seen that it takes 1-2 seconds for the server to respond to the initial query for the page load) - I recommend your target time to have this at 0.2s (naturally this depends on location etc)."
  },
  {
    "poster": {
      "poster_name": "Tim L",
      "poster_handle": "tim462"
    },
    "time_stamp": "2021-07-09 10:59:33",
    "text": "Thanks!"
  },
  {
    "text": "I don't understand why some site that we've built on the CMS Hub get their pages an automatic canonical to their non-https version and some others don't... any clues?",
    "time_stamp": "2021-07-09 11:41:48",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-10 12:16:32"
      }
    ]
  }
]