[
  {
    "text": "<@U2H3TT8F2> is there a reason that the default Hubpsot modules don't have a styles option within the global content editor? Can use the alignment option for an image...",
    "time_stamp": "2021-04-21 11:29:44",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-04-21 11:30:25"
      },
      {
        "time_stamp": "2021-04-21 13:00:12"
      },
      {
        "time_stamp": "2021-04-21 15:43:47"
      },
      {
        "time_stamp": "2021-04-21 16:19:00"
      },
      {
        "time_stamp": "2022-11-10 02:28:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-04-21 11:30:25",
    "text": "let me check around internally on this and see what I can find out"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2021-04-21 13:00:12",
    "text": "Hey <@UCTAN7RPA>, good question. We are holding back on showing the style tab in the Global Content Editor for the short term because we’re working on developing a more scalable solution for adding style options to modules that would apply to both default modules and custom modules. So, long term, we will open up the style tab for both default and custom modules. Unfortunately in the interim I don’t have a great alternative, but DM me if you have any other questions!"
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2021-04-21 15:43:47",
    "text": "Thanks for the info <@U8THBCFC4>. I like the dnd setup as it makes it easy for the team to make changes on their own. I was mainly trying to get the horizontal alignment options as it is the most common thing to adjust. I was hoping to avoid cloning the default modules to add a custom alignment field. Do you have a ballpark ETA?"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2021-04-21 16:19:00",
    "text": "I’d say a couple of months--we’re pretty close on it!"
  }
]