[
  {
    "time_stamp": "2021-04-28 08:00:10",
    "edited": {
      "time_stamp": "2021-04-28 08:00:14"
    },
    "text": "Reminder: There are lots of great ways to stay connected with what’s happening in HubSpot development. To be made aware of any changes that affect developers we recommend <https://developers.HubSpot.com/changelog|subscribing to our developer changelog>. We post announcements about new developer facing functionality as well as communicate from there if we need to make <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes>."
  },
  {
    "poster": {
      "poster_name": "Andy Pitre",
      "poster_handle": "apitre"
    },
    "time_stamp": "2021-04-28 12:45:54",
    "text": "Hi All, first of all, I’m sorry that you’re feeling surprised about the web hooks change. If you’re feeling surprised, it means we could have done a better job communicating.\n\nFirst, I want to make sure a few things are clear:\n• Webhooks are being legacy-ed into all enterprise portals. No one who has them is losing them. \n• Webhooks will remain as a part of the developer portal. I think there’s a bug that is preventing webhooks from being in developer portals, and we’re fixing that now. We’re also working on getting all the operations hub features in developer test portals. We want partners and developers to continue to test and experiment solutions for their clients. \nSecond, here’s the inside scoop on how we’re thinking about Webhooks. We are moving use cases related to business process automation into Operations Hub. In the past, we might have thought of some of those operations use cases as being “advanced,” or “enterprise,” but that model needs to change as our customers scale. As we expand our CRM suite, we have created new Hubs that fit the “jobs” of different people working out of the CRM and the majority of use cases for webhooks fit the operations job.\n\nIn the cases mentioned in this thread, we see a future where a customer would choose Operations Hub Pro, rather than Marketing Hub Enterprise. Operations pro also gives customers access to the custom code action, data quality actions, and the data sync powered integrations, which will also come in handy for the types of companies who need to build on webhooks.\n\nIn addition, for many customers, buying Operations Hub Pro is more cost effective than buying Marketing Hub Enterprise, which will help use serve more companies. We obviously think that customers will continue to buy Marketing Hub Enterprise, but they will do it for more of the advanced marketing use cases. I should also note, as more companies adopt HubSpot as their CRM, more and more will buy the entire CRM suite.\n\nThat’s some of the inside baseball. I appreciate the feedback, and want to keep the conversation going."
  }
]