[
  {
    "poster": {
      "poster_name": "Ruth",
      "poster_handle": "rfarrell"
    },
    "time_stamp": "2020-10-06 04:40:46",
    "text": "Hey <@UEHTND2NN>! At this time it's not possible to add HubSpot blog tag pages to the sitemap. Blog posts and listing pages are included automatically, but not tag/author pages. I'm interesting in knowing more about why you'd like to have these tag pages in the sitemap if you have the time though? Thank you!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wagner",
      "poster_handle": "andreas882"
    },
    "time_stamp": "2020-10-06 04:48:51",
    "text": "Hi everyone! Sorry if this is not the right channel! Does anyone know where I send a blog design to be templated by HubSpot?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-10-07 15:40:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kelly Molloy",
      "poster_handle": "kmolloy"
    },
    "time_stamp": "2020-10-06 05:20:51",
    "text": "Hey <@UDA8HTA6T> thanks for getting back to me! One of my clients requested adding these pages to the sitemap for SEO purposes. Is there a workaround to add them?"
  },
  {
    "poster": {
      "poster_name": "Brandon H Goding",
      "poster_handle": "brandon"
    },
    "time_stamp": "2020-10-06 11:36:52",
    "text": "Starting an APP that I would like to put in HubSpot instead of running from my LAMP server, the app connects to the clients ERP's REST API.  The client will need to allow access through their Firewall via IP rules.  Do serverless functions come from a set IP range that we could put a rule in for?",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-10-06 12:02:13"
      },
      {
        "time_stamp": "2020-10-06 12:31:09"
      },
      {
        "time_stamp": "2020-10-06 12:31:34"
      },
      {
        "time_stamp": "2020-10-07 05:55:50"
      },
      {
        "time_stamp": "2020-10-07 07:31:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2020-10-06 12:02:13",
    "text": "By the nature of serverless we don’t have provisioned servers that would normally allow you to pin down a set of IPs (note this is a problem for all serverless providers). Typically we would recommend setting up a secret for authentication purposes"
  },
  {
    "poster": {
      "poster_name": "Brandon H Goding",
      "poster_handle": "brandon"
    },
    "time_stamp": "2020-10-06 12:31:09",
    "text": "I'll talk to the clients network team and see what we can do.  AWS lambda has work around where you use a static IP and a NAT gateway, but all that add complexity for a relative simple app.  Thanks for the reply <@U6GNQ7JBU>"
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2020-10-06 12:31:34",
    "text": "Yea that is a feature we are considering internally"
  }
]