[
  {
    "poster": {
      "poster_name": "Cinlen Chen",
      "poster_handle": "chenxinlong2009"
    },
    "time_stamp": "2020-10-23 02:26:11",
    "text": "Hi, my program will sync all contacts from my database to HubSpot every day,  after I delete some contact on HubSpot,  I need a mechanism to tell my program do not sync these deleted contact to HubSpot next day.  Is create app -&gt; set up webhook  -&gt; install app the only way to do this ?   Is there a more convenient way to do this ?"
  },
  {
    "poster": {
      "poster_name": "Dan Green",
      "poster_handle": "dan436"
    },
    "time_stamp": "2020-10-23 07:25:12",
    "text": "Workflow naming conventions: What are your best tips? TIA",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-23 07:49:14"
      },
      {
        "time_stamp": "2020-10-23 07:57:22"
      },
      {
        "time_stamp": "2020-10-23 07:59:59"
      },
      {
        "time_stamp": "2020-10-23 08:00:54"
      },
      {
        "time_stamp": "2020-10-23 08:08:33"
      },
      {
        "time_stamp": "2020-10-23 08:09:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Drew Davidoff",
      "poster_handle": "drew244"
    },
    "time_stamp": "2020-10-23 07:34:00",
    "text": "We have a client using a custom object to kind-of facilitate a parent-child relationship between companies and their divisions. It’s a use case that’s not totally in alignment with custom object qualification best practices, but it was a requirement for fitting HS to their sales process (and closing the deal haha). We’re working on a few other use-cases as well, I’d be happy to tell you more in a DM"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2020-10-23 07:45:15",
    "text": "Hello everyone!  Can properties from custom objects be used in forms?\nI've created one custom property in my dev sandbox account and I'm asked in a check box if I want it to be available in forms and bots.\nWhen I create a form the custom property is not showing.\nShould this work?"
  },
  {
    "poster": {
      "poster_name": "Drew Davidoff",
      "poster_handle": "drew244"
    },
    "time_stamp": "2020-10-23 07:49:14",
    "text": "If we’re talking about HS workflows:\n1. Abbreviations are king.\n2. Make sure it’s searchable. This means its name should be as close to what its function/purpose is as possible.\nWe use an abbreviation for a workflow’s general purpose, followed by a title.\nFor example, a lead nurture workflow for a nurture campaign called “10 mistakes with email” would be: LN - 10 Mistakes with Email. “LN” standing for lead nurture."
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2020-10-23 07:50:46",
    "text": "what would be the cause of HubSpot not combing css files? TIA",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-23 07:59:04"
      },
      {
        "time_stamp": "2020-10-23 08:35:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dan Green",
      "poster_handle": "dan436"
    },
    "time_stamp": "2020-10-23 07:57:22",
    "text": "<@U01D9RNG540> This helps. I like the prefix idea. Are you using folders?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-10-23 07:59:04",
    "text": "it's pretty hit and miss tbh, we've had the exact same template with the exact same dependencies combine CSS in one portal and not in another. For new projects, we're moving to combining/minifying on our own with local dev."
  },
  {
    "poster": {
      "poster_name": "Drew Davidoff",
      "poster_handle": "drew244"
    },
    "time_stamp": "2020-10-23 07:59:59",
    "text": "Not nearly as much as we should. In portals we’ve been in for a while (we’re an agency so we’re in a bunch) we aren’t  really using folders. We have some set up in those older portals but no real hierarchy. In the portals we’ve entered more recently, we have some minimal hierarchy set up. A lot of this is because we use a ton of workflows and while we have process for setting those up, we don’t have process for organizing them (other than naming conventions)."
  },
  {
    "poster": {
      "poster_name": "Drew Davidoff",
      "poster_handle": "drew244"
    },
    "time_stamp": "2020-10-23 08:00:54",
    "text": "You might not need prefixes if you use folders well, but the prefixes do help with searchability."
  },
  {
    "poster": {
      "poster_name": "Dan Green",
      "poster_handle": "dan436"
    },
    "time_stamp": "2020-10-23 08:08:33",
    "text": "some combination of prefix and nested folders will probably help, yeah."
  },
  {
    "poster": {
      "poster_name": "Drew Davidoff",
      "poster_handle": "drew244"
    },
    "time_stamp": "2020-10-23 08:09:53",
    "text": "At the end of the day, what matters most is that your titles are idiot-proof levels of searchable. The search bar is always going to be lower friction on a work process than using filters and/or clicking through a folder hierarchy."
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2020-10-23 08:35:58",
    "text": "yeah that is what we are seeing as well"
  },
  {
    "poster": {
      "poster_name": "Ana Madeira",
      "poster_handle": "ana.madeira"
    },
    "time_stamp": "2020-10-23 09:45:26",
    "text": "Hi guys! I’m using clean6 as our template and now I’m setting up a new brand in my account and having issues to setup a simple menu…I did all as the documentation…but no lucky till now…any suggestions?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-10-23 12:47:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marcello Bertero",
      "poster_handle": "marcello.bertero"
    },
    "time_stamp": "2020-10-23 09:57:38",
    "text": "Hello everyone. I want to put a phone mask validator in an input field of a HubSpot form. Does anyone know how and where I can do that? I basically need to know if i can use a custom validation in a form input field."
  },
  {
    "poster": {
      "poster_name": "Quentin Lamamy",
      "poster_handle": "quentin.lamamy"
    },
    "time_stamp": "2020-10-23 12:47:13",
    "text": "I think that your post will get more visibility, if you post in <#CFPGEKRJ7|templates>"
  }
]