[
  {
    "poster": {
      "poster_name": "Fabian Pasin",
      "poster_handle": "fabian.pasin"
    },
    "time_stamp": "2024-05-14 04:01:31",
    "text": "Hello everyone,\nwe are looking for an additional HubSpot CMS developer. We're a small marketing agency based in Cologne, Germany.\nJob entails developing websites in HubSpot CMS and possibly other software development projects.\nBesides frontend skills a very good handle on the German language is important as you will be in contact with German speaking clients regularly.\nFor more information checkout out career page : <https://www.inboundfriends.com/karriere/>\nPlease reach out to me for questions.",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-05-14 12:17:45"
      },
      {
        "time_stamp": "2024-05-14 16:21:59"
      },
      {
        "time_stamp": "2024-05-16 03:47:14"
      },
      {
        "time_stamp": "2024-06-21 15:05:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "MrJoshi",
      "poster_handle": "mrjoshi.4u"
    },
    "time_stamp": "2024-05-14 12:17:45",
    "edited": {
      "time_stamp": "2024-05-14 12:18:39"
    },
    "text": "Hello <@UDA3F01U4> We at Dotsquares have extensive knowledge of HubSpot CMS Website development.\n\nI would like to provide you with some information about our company and our capabilities in HubSpot.\n\nWe are a team of Certified HubSpot Developers and have great experience in setting up, installing, and customizing HubSpot Products for many industries and requirements.\n\nBelow are the few products that we have expertise with:\n\n1.      *Dotsquares HubSpot Team Details*\n• Dotsquares has a large in-house development team now with industry-recognized certifications in India\n• Certified team of Project Managers\n•  Member of the International Association of Outsourcing Professionals\n• Have worked upon more than 300+ HubSpot Projects\n• *HubSpot Themes Challenge 2021 - Winner* - A competition to submit our custom developed themes within a limited time period. Glad to share that we came in Top 26 Winning Companies out of 950+ organizations.\n2.      *Strength & Certifications*\n• *40+* HubSpot Full Time Dedicated Developers\n•  *35+ Migrations* -Dynamics 365, Salesforce, Audience View, Snowflake, Zendesk, Vantage, HubSpot to HubSpot, Interprise, Tully, Space and People CRM, Pipedrive Zoho CRM , Barbour ABI and many more.\n•  *50+ Integrations with 3rd Party applications* -  Sage50, XERO Invoice sync, Dynamics 365 (with multiple versions), PayPal Braintree payments, Salesforce, Zoho, Audience View, Snowflake, Sage200, Pipedrive, <http://Monday.com|Monday.com>, Airtable, MS Outlook Integration, Chargebee, Zoho CRM, Interprise Integration, Vantage Integration and many more.\n• Have a bench team to enhance the production support requirement quite rapidly\n•  Endless development of CMS development\n•  Experience in setting up of Hubs (*Marketing* / *Sales* / *Service* / *CMS / Operations*)\n•  *Certifications:* - HubSpot Solutions Partner, CMS Hub Implementation, Data Integrations Certification, Marketing Hub Implementation, Service Hub Software, HubSpot CMS For Marketers, Email Marketing, Inbound Sales Certified, HubSpot CMS for Marketers Certified, HubSpot CMS for Developers Certified, Growth-driven agency design certified, Content Marketing Certified, Frictionless sales certified and many more.\n3.      *Dotsquares can help you with*\n• HubSpot CMS On Boarding - HubSpot Website, Blog, Landing page and Email Template Design & Development\n•  HubSpot CRM On Boarding\n•  HubSpot API Integration with 3rd Party Applications\n• HubSpot Data Migration\n• HubSpot Sales Hub Enablement\n• Email Marketing and Automation\n• Workflow, Sequence planning, creation & optimization\n• Inbox configuration and Chatbot setup\n• Dashboard Setup, Custom Reporting, On boarding, and enablement\n• Customer Service Portal setup & Tickets pipelines and enablement\nI have sent DM you please check and advise"
  },
  {
    "poster": {
      "poster_name": "valor wide",
      "poster_handle": "valorwide"
    },
    "time_stamp": "2024-05-14 16:21:59",
    "text": "Hello <@UDA3F01U4>\nI hope you are doing well. Please check your DM.\n\nThank You"
  }
]