[
  {
    "poster": {
      "poster_name": "Swapit Hub",
      "poster_handle": "info458"
    },
    "time_stamp": "2024-05-16 03:47:14",
    "text": "Hello <@UDA3F01U4>\nI hope you are doing well. Please check your DM.\nThanks!!"
  },
  {
    "text": "Dear Bethany!\n\nAs a full stack developer, I am eager to take part in your workspace.\nthanks for your time for me.\nI am looking forward to your reply.\n\nShaiming",
    "time_stamp": "2024-05-16 08:25:29"
  },
  {
    "poster": {
      "poster_name": "Shaiming Pai",
      "poster_handle": "paishaiming995"
    },
    "time_stamp": "2024-05-16 09:08:14",
    "text": "Hello\n\nCan U check DM now &amp; reply for me?"
  },
  {
    "poster": {
      "poster_name": "Ali Shan",
      "poster_handle": "aleimran137"
    },
    "time_stamp": "2024-05-16 12:43:09",
    "text": "Looking for a career change - Curious about being a HubSpot developer\n\nI have a background in Lead Generation. I worked on a Salesforce implementation a long time ago and enjoyed it.\nI'm considering a move out of my current role. I would like to get something that works from home and was looking into getting HubSpot certification.\nFor those of you who do HubSpot development full-time, I have a few questions:\n1. How's that market? How hard is it to find work?\n2. Is remote work readily available?\n3. What's the general starting pay for a developer?\n4. Any advice for someone in my spot? Specific certifications to focus on, etc?\n",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-17 09:25:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stephen Thiele",
      "poster_handle": "stephen491"
    },
    "time_stamp": "2024-05-16 17:08:48",
    "text": "Looking to hire a part time back end HubSpot developer. Must have experience with APIs, PHP, Java, and HTML. It would be ideal if you also have experience launching products on the HubSpot marketplace and understanding all relevant requirements. Potential for full time work for the right person. Must have overlap with EST business hours and be willing to work within our PM system. Please DM me or send an email to <mailto:stephen@atakinteractive.com|stephen@atakinteractive.com> and include a resume and hourly pricing.",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-05-17 01:32:17"
      },
      {
        "time_stamp": "2024-05-17 11:37:55"
      },
      {
        "time_stamp": "2024-05-17 15:04:48"
      },
      {
        "time_stamp": "2024-06-21 15:04:37"
      }
    ]
  }
]