[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-12-16 13:25:01",
    "edited": {
      "time_stamp": "2022-12-16 13:26:51"
    },
    "text": "the way child themes are handled and documented for end-users (marketers) needs to be improved:\n\n1 - creating a child theme should be a prompt upon theme purchase from the marketplace, and created without needing design tools, instead of jumping into theme settings or building pages (unless the child theme creation can be made automatic).\n\n2 - it should be easier to set the child theme as the default for the domain, especially when using multiple domains, having to swap back and forth when creating pages is the source of many mistakes and frustration. Brand Kits should tie back to domains.\n\n3 - the developer should be able to limit files within the theme that can't be cloned to the child. That is the whole point of child.css and child.js. If a developer needs to overwrite a critical theme file, they know how to do it within the child, but a marketer can seriously break things for future updates.\n\n4 - documentation needs to be improved, especially for agencies who provide website services, but also for the end user - when the child theme is created, there should be a message that says, \"You're all set, the files needed for the child have been created and all others are inherited from the parent theme. No other files need to be cloned to the child unless you are customizing the code.\"\n\n5 - system page templates don't exist in the child theme because they are inherited from the parent, but when they create the child theme and see that there aren't any files, they start cloning stuff without actually customizing a single line of code\n\n6 - the \"migrate to a theme service\" needs improvement, many of these same issues are happening via HubSpot's paid service. Cloning nearly every theme file to a child theme without customizing it is a disservice to the customer and breaks the relationship with the parent and the opportunity for updates to be applied"
  }
]