[
  {
    "time_stamp": "2020-07-19 07:55:37",
    "text": "rubber duck development"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-07-19 08:23:10",
    "text": "hiya <@U7SL518D6> I actually went to create a HS sandbox account in an existing clients account who already have a fully fledged CMS/Sales package. So I created a sandbox, and then thought OK I will prototype the clients forms into a page, so I go to form builder then I am prompted again with the appeals process with \"File Manager\" access again, it asked about the company, secondly compliance with opt-in and double opt-in followed by contact email.\n\nI thought I'd be able to shortcut my way around this with an existing paid HS account (with 6+ months of billing and a dozen seats IIRC) but I am sort of washed ashore now because I wanted to create a prototype so I could basically evaluate the solution where a form is embedded as a template from the basic things like custom fonts - to listening to lifecycle hooks or similar in these forms - or even using the HS Forms JS API extensively with Vue.\n\nThis is where my frustration lies I find some spare learning time to evaluate HubSpot CMS then boom! :smile: Banned until the court rules that i can have a simple web form.\n\nThis is a sandbox account too so I'm sure that form emails would not be sent in general e.g. (this wouldn't happen in the teams I manage) but in any scenario somebody somewhere has messed up importing production data into a sandbox...\n\nSo its a barrier to entry really, I understand you have to be diligent but these things make me think oh jesus well if I have to spin up say another website instance so I can let say a secondary function in the business (with a company throwaway domain, without actual sending powers) I'll end up the appeals and allow 48-72 hr :smile:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-19 08:55:29",
    "text": "I would contact support on this and follow any process that may be getting displayed on those screens you've been seeing.\n\nIt is not normal to see that, that is our security system responding to suspicious activity. You should have no issue using cms hub in your sandbox  or app developer portal features in an app developer account."
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-07-19 09:03:19",
    "text": ":raised_hands:"
  }
]