[
  {
    "poster": {
      "poster_name": "Jan Jabłoński",
      "poster_handle": "jan.jablonski"
    },
    "time_stamp": "2023-09-14 06:25:07",
    "text": "hi! We are trying to create a GTM Tag that would push data from HubSpot form dropdown field. Later we would like to use the data to feed a Google Analytics event (so that it fires each time a form is submitted and savese the dropdown value in the Event Label). In the past we managed to successfully set up a custom event in GTM that would fire each time a form is submitted and the Label value was the submission page, but we can't figure out how to push actual form data to a GTM variable. Do you maybe have some working solution for this? We tried solutions in this <https://community.HubSpot.com/t5/APIs-Integrations/Get-HubSpot-form-field-values-using-Google-Tag-Manager-GTM/td-p/680543> and this <https://community.HubSpot.com/t5/APIs-Integrations/Google-Tag-Manager-Push-Form-Data-to-dataLayer/m-p/526052> community threads, but couldn't make it work"
  },
  {
    "poster": {
      "poster_name": "Ali Morina",
      "poster_handle": "ali.morina"
    },
    "time_stamp": "2023-09-14 06:34:44",
    "text": "Hi! I am trying to build a website from scratch using React and host it in HubSpot. So far I could only find documentation on how to create modules using React and place them inside an existing theme. My objective is to create a complete website from scratch using React but so far no luck in finding anything. Can anyone help me with this? I have been searching for a solution for the last 3 days. Thank you in advance.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-09-14 11:17:09"
      },
      {
        "time_stamp": "2023-09-15 01:15:25"
      },
      {
        "time_stamp": "2023-09-18 21:39:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-09-14 11:17:09",
    "text": "I don’t think you can build React based templates atm. There are some HubSpot based structures you won’t be able to get away from. Though I’m not sure I can think of very many features you’d gain even if you had the ability to do so. You still get access to the entire DOM within the modules.\n\nI’m curious what you’d like to do with React that you can’t do with the existing ability to build modules with it."
  },
  {
    "poster": {
      "poster_name": "Thangaraj M",
      "poster_handle": "gkthangarajvvp"
    },
    "time_stamp": "2023-09-14 22:58:11",
    "edited": {
      "time_stamp": "2023-09-14 22:59:01"
    },
    "text": "Hello everyone,\nI need to integrate HubSpot with my react custom form.\nCan anyone guide me through.\n\ni have hubSpot script though and  an account."
  }
]