[
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2019-07-23 09:44:05",
    "text": "I think this is a great idea. Especially if more layout decisions are made page level instead of having marketers make template changes in the design manager."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2019-07-23 09:46:04",
    "text": "are you currently just uploading files to the file manager then copy and pasting the url into a link field?"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-07-23 10:34:39",
    "text": "Yeah since the `Image` column type does not show `.pdf` file extensions and that's the only column type that would open up the File Manager to select an item.\nThankfully, our client should be uploading into a single folder so it makes import/export of items a bit easier to handle. But makes thing a little more cumbersome for them to have to copy/paste a URL from a different tab/screen of the file manager instead of selecting directly within the HubDB row's column, or if for instance the File in File Manager was replaced with a new filename, they'd have to manually update the reference in that HubDB row."
  },
  {
    "poster": {
      "poster_name": "Johanna Tchon",
      "poster_handle": "johanna.tchon"
    },
    "time_stamp": "2019-07-23 13:01:36",
    "text": "When creating translations, HubSpot just clones the form that I want to translate instead of storing these translations in the same form.  Is it possible to keep the translations in the same form?  Or at least in the works?"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2019-07-23 13:28:01",
    "text": "great points and I agree it is cumbersome in this case."
  },
  {
    "poster": {
      "poster_name": "Bhargav",
      "poster_handle": "bhargav"
    },
    "time_stamp": "2019-07-23 13:42:34",
    "text": "Ability to develop pages locally has opened up so many possibilities. We started using LESS for faster and cleaner development. However, quickly realized we won’t be able to maintain a sync between HS console and Local since LESS won’t work on HS console. Being able to code in LESS on HS console will be awesome and would save a ton of time!",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-07-23 13:44:43"
      },
      {
        "time_stamp": "2019-07-23 14:48:31"
      },
      {
        "time_stamp": "2019-07-24 11:54:04"
      },
      {
        "time_stamp": "2019-07-30 19:55:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2019-07-23 13:43:19",
    "text": "That definitely makes sense. We’ll plan on adding that--might be a little bit but it’s now officially on the list!"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-07-23 13:44:43",
    "text": "Why not just upload your compiled CSS?"
  },
  {
    "poster": {
      "poster_name": "Bhargav",
      "poster_handle": "bhargav"
    },
    "time_stamp": "2019-07-23 14:48:31",
    "text": "Sometimes when team members (non developers) make CSS updates on the console then there would be inconsistency with LESS (local) and console."
  }
]