[
  {
    "text": "Hi there! I’m new to this channel and I have a question. I have set up a blog in HubSpot and I want to add a Facebook feed to the blog. So I opened the official Facebook developer website: <https://developers.facebook.com/docs/plugins/page-plugin/>. I exactly did what they said. I included the JavaScript SDK on my page once (in the header of the template in blog settings), and I made a custom module an added the code <http://developers.facebook.com|developers.facebook.com> gave me.\nSometimes the Facebook feed shows perfectly, sometimes it shows 1 line with text and sometimes it shows an network error, when I refresh the page. See images below:\nCould anyone help me with this issue? Did I add the codes to the right places?",
    "time_stamp": "2020-11-19 04:18:36",
    "edited": {
      "time_stamp": "2020-11-19 04:25:48"
    },
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-11-19 12:04:11"
      },
      {
        "time_stamp": "2020-11-19 12:04:53"
      },
      {
        "time_stamp": "2020-11-19 12:05:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-11-19 12:04:11",
    "text": "Dont’ async/defer your code, it is likely loading after your other scripts that are trying to bring in the content."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-11-19 12:04:53",
    "text": "without seeing your live page and being able to inspect the console on the error, I am pretty sure this is what happeneinng"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-11-19 12:05:02",
    "text": "if you want to share the url I can attempt to replicate the issue and dig more"
  },
  {
    "poster": {
      "poster_name": "Jason Adams",
      "poster_handle": "jason475"
    },
    "time_stamp": "2020-11-19 17:05:55",
    "text": "Has anyone tried using the CMI to use Local Developer Tools with multiple access tokens? I set one up for my sandbox, and now I want to set up another one, but when I try to input my accesskey after `hs auth`  steps, it throws errors and won't let me continue through to adding more than one accesskey on my local dev.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-11-19 17:16:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Adams",
      "poster_handle": "jason475"
    },
    "time_stamp": "2020-11-19 17:16:28",
    "text": "I figured it out. I was not able (for some reason) to paste my accesskey. What's weird is that I was able to paste it in the command tool, but not at the step where it was requesting the key. So I had to manually type the accesskey. I actually did this before I reached out, but I must have accidentally mistyped something (which is really easy to do in that long string!)."
  }
]