[
  {
    "text": "Hi Dustin,\nI've been noticing oddities in the themes for a while now. For example, as you can see, the global font should take the color of the global color\n\" \"inherited_value\" : {\n      \"property_value_paths\" : {\n        \"color\" : \"theme.global_colors.primary_color.color\"\n      }\n    },\n\" and it is so but in the theme settings, the \"color dot\" does not detect the appropriate color creating confusion to the user who edits the settings of the theme",
    "time_stamp": "2021-10-15 01:29:51"
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2021-10-15 01:31:25",
    "text": "Hi Andreas,\nand how do you fix this bug? No one seems to care about this issue"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-10-15 03:59:08",
    "text": "Yeah, that’s exactly what I’m getting. Maybe they goofed something."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-10-15 07:55:28",
    "edited": {
      "time_stamp": "2021-10-15 07:55:52"
    },
    "text": "Where would we report a discovered bug in the templating system whereby repeaters on CRM objects do not return the select object properties if a repeater is enabled for the object. I'd love to know if anybody else can replicate the bug or whether this is an \"undocumented feature\"\n\nTo replicate:\n1. Create a new theme and a new module.\n2. Add a field of type Selectors -&gt; CRM Objects. Choose `Product` as the type of CRM Object. Name it whatever, set the `Properties to Fetch` to `SKU` and the `Properties of choice label` to `Name` and `Format of Choice Label` to `0%`\n3. Add some code dumping out the output such as  {{ module.whatever.properties|pprint }} - you will see the object and associated key/value pairs of `hs_sku` and `id` as expected in both a preview of the output in the web developer tools as well as in a production page using the theme/template.\n4. Enable the repeater capability on the module, set a minimum such as 2, publish, make your selections in the theme and choose a few different products. In a preview of the output in the web developer tools the module data is shown with the correct `hs_sku` and `id` keys and each product is shown.\n5. In production however with a repeater on a CRM Object, you will only get the `ids` and the selected properties are not returned.\nExpected behavior would be that in production pages the selected SKU/hs_sku property is returned.\n\nThoughts?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-15 08:55:44"
      },
      {
        "time_stamp": "2021-10-15 14:37:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-10-15 08:55:44",
    "text": "The temporary resolution is to create a field group with a repeater. That works fine."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-10-15 14:37:39",
    "text": "Nevermind, that doesn't work. This is a defect."
  }
]