[
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2019-01-04 12:35:43",
    "text": "Allow scheduling of content staged page would be ideal, or even if you make a change to a already published page, allow the ability to publish changes on a scheduled date without requiring the page to be unpublished, would be nice",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-01-04 12:48:10"
      },
      {
        "time_stamp": "2019-01-04 13:09:56"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-04 12:48:10",
    "text": "page doesn’t need to be unpublished for staged page to be published.\n\nI agree on the scheduling thing - would be nice.\n\nThough personally I feel that might be best on an individual page level not something that should be done in bulk(CS sometimes has errors you have to manually fix, doing that in bulk and setting and forgetting could cause headaches)"
  },
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-01-04 13:09:56",
    "text": "im all for scheduling updates. This is a pain when we do blog republishes as we have to manually republish them otherwise the blog gets taken down till the scheduled date"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-04 13:09:57",
    "edited": {
      "time_stamp": "2019-01-04 13:10:15"
    },
    "text": "would be nice if in the design manager when clicking a dependent the default action was to open the page on the front end, and holding down cmd/ctrl and then clicking would open the details page  <https://spin.d.pr/KJR7mh+>\n\nWould be cool with this option being togglable under developer settings."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-04 13:35:00",
    "edited": {
      "time_stamp": "2019-01-04 13:35:34"
    },
    "text": "“highlight changes” I realize this might be complicated but would be pretty useful. It’d be nice if when a file/module has been updated there were was a way to highlight the unsaved changes. There’s nothing more terrifying to me than looking at a row of tabs with asterisks indicating unsaved changes when I open a new portal I haven’t looked at before or haven’t looked at in a long time. option could be hidden under context menu when right clicking a tab in the tab bar."
  },
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Michael Giaimo",
      "poster_handle": "mgiaimo"
    },
    "time_stamp": "2019-01-04 18:14:29",
    "text": "I just found out today (the hard way) about having to add a few minutes delay inside workflows - for example between adding a sub type to a contact and sending them an email, to allow HubSpot to actually apply that sub type. It would have been very helpful if maybe an alert, an exclamation mark, etc. appeared in the workflow UI for those steps, explaining just that. "
  },
  null
]