[
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-07-27 09:03:37",
    "text": "The only issue with this is that the user on the front end can add/remove columns/rows etc so then you’d lose all your custom classes/styles.  I had this same wish but the option of the user to remove these things makes those custom classes kind of moot.  You can add an ID inside the modules and then use that ID in some inline CSS but that’s the best I’ve come up with so far unless I’m missing something."
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-07-27 09:05:45",
    "text": "If I make an update to a dnd_area such as changing/adding the vertical_alignment on a column it doesn’t appear to update on any pages that are already staged/created using that dnd_area and column.  Is there anyway to force these pages to update?  Or is there a place to access this alignment on the front end?  I’m not finding anything as of yet to get this to update.  The site is still in development but since the page is created for proofing I really don’t want to delete the page and go back and recreate it so the alignment on the column works.",
    "reply_count": 7,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-07-27 09:31:47"
      },
      {
        "time_stamp": "2020-07-27 11:56:05"
      },
      {
        "time_stamp": "2020-07-27 12:37:59"
      },
      {
        "time_stamp": "2020-07-27 13:14:22"
      },
      {
        "time_stamp": "2020-07-28 01:28:47"
      },
      {
        "time_stamp": "2020-07-30 08:45:44"
      },
      {
        "time_stamp": "2020-07-30 09:17:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-07-27 09:31:47",
    "text": "Whatever is done within a DND area is going to be scoped to that page only. Once any change occurs to that DND area, it is independent of the template level defaults."
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-07-27 11:56:05",
    "text": "so is there a way to set vertical alignment on a column in the template page?  I can’t seem to find it anywhere."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-07-27 12:37:59",
    "text": "only in the code itself: <https://developers.HubSpot.com/docs/cms/hubl/tags/dnd-areas#drag-and-drop-column-code-dnd-column-code->"
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-07-27 13:14:22",
    "text": "Right so the only way my template page will reflect this is if I delete it, add the vertical alignment to the dnd_area column and then recreate the page?  That is a lot of work to fix one overlooked item."
  }
]