[
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2023-12-21 03:36:53",
    "text": "Can you provide the full script?"
  },
  {
    "poster": {
      "poster_name": "Andrew Smeallie",
      "poster_handle": "andrew431"
    },
    "time_stamp": "2023-12-21 05:05:01",
    "text": "<@U062Z43DDU5> - My pleasure, I hope it's the solution you were looking for. Let me know if you need any help getting started.\n\nTo answer your question we launched our first few apps this year. File attachment associations went live a few months ago. We haven’t promoted it much, but have had a dozen or so people discover us on the marketplace. The majority are still actively as the app helps solve from pretty specific pain points around files / file management in the CRM."
  },
  {
    "poster": {
      "poster_name": "Andrew Smeallie",
      "poster_handle": "andrew431"
    },
    "time_stamp": "2023-12-21 05:07:32",
    "edited": {
      "time_stamp": "2023-12-21 05:10:06"
    },
    "text": "<@U0687RD4LJW> I'm struggling with this same dynamic right now. I don't believe there's a solution here, but will be interested to see anyone else's ideas.\n\nFor what it's worth, here's what it's causing me to do _after_ the workflow activates:\n\n• Workflow triggers custom object creation via deal-based workflow, I'm backfilling data which is where this gets tricky\n• Duplicate custom object creation occurs where there should only be 1x custom object associated to a given contact (the custom object creation workflow races with another workflow which in the _future / ongoing_ basis helps control for duplicates, but doesn't have time to process fast enough, thus duplicates get created)\n• To clean-up the data, I created a rollup property to count how many of a specific custom object type are associated to a contact, if it's anything more than 1x I know it's duplicate data\n• With that data, a custom report allowed me to export just the duplicate custom object data, which I re-uploaded to HubSpot and deleted in bulk"
  },
  {
    "poster": {
      "poster_name": "Andrew Smeallie",
      "poster_handle": "andrew431"
    },
    "time_stamp": "2023-12-21 05:10:40",
    "text": "It took me a minute to figure out steps 3/4 in the bullets above, so just in case any part of that is relevant to you I figured I'd share"
  },
  {
    "poster": {
      "poster_name": "Falk",
      "poster_handle": "falk.hermann"
    },
    "time_stamp": "2023-12-21 05:39:29",
    "text": "Hi folks :slightly_smiling_face:\n\nIs there any prepared accessToken within Custom Code Workflow actions that can be used out-of-the-box? Or do I need to register an app for that purpose?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-12-21 05:40:25"
      },
      {
        "time_stamp": "2023-12-21 05:47:04"
      },
      {
        "time_stamp": "2023-12-21 12:21:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-12-21 05:40:25",
    "text": "there is none. you need to create an app, be it private or public."
  },
  {
    "poster": {
      "poster_name": "Falk",
      "poster_handle": "falk.hermann"
    },
    "time_stamp": "2023-12-21 05:47:04",
    "text": "thanks"
  },
  {
    "poster": {
      "poster_name": "Isaias Hunter",
      "poster_handle": "isaias.hunter598"
    },
    "time_stamp": "2023-12-21 09:34:37",
    "text": "That is the full script, the only section missing is how I access the HubSpot client that contains a secret. This should suffice to see what I am missing."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-21 12:20:24",
    "text": "what is your use case here? What is the issue you are solving for? Why are so many objects being pushed into a workflow? How many objects? How often? Is this during an import? Is this daily business? Is this in testing?\n\nWhat are the triggers that start this workflow? What does the workflow do?\n\nAre you running into api issues? what is the reason you don’t want them all to process at the same time?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-21 12:21:07",
    "text": "yeah, create the private app and add it to secrets, then you aer able to pull that in\n\n`const apiKey = process.env.HS_ACCESS_TOKEN` or however you set it up"
  }
]