[
  {
    "poster": {
      "poster_name": "Aman Shukla",
      "poster_handle": "aman.shukla"
    },
    "time_stamp": "2023-12-12 03:50:39",
    "text": "Hello There,\n\nIs it possible to format the \"WhatsApp Phone Number\" property in HubSpot for number formatting?\n(I am looking to add country code by workflow in the \"WhatsApp Phone Number\" property)\n\nKindly help me If you have any solution for this!!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-12-12 09:53:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-12 06:09:44",
    "text": "i save some workflow code on my local machine with git. workflows doesn’t use the same editor experience and local cli stuff. \n\ni use step 4a 4b, 5r etc for different pivots. most logic that is part of a step, i’ll output some variables from the code to the workflow and branch in the workflow. \n\ni’ve made massive workflows with 15 code actions checking and creating a credit check intake process and then i’ve redone them into a whole lot smaller workflows and broken the steps up into like 9 workflows. to me they both work the same way. the key thing for me is trying not to repeat code and only doing “one thing” in a custom code action. \n\nit is music easier to debug an issue if the code is only going one thing — and if the same code is in like 4 different places that can get so difficult to manage "
  },
  {
    "poster": {
      "poster_name": "Alex Kim",
      "poster_handle": "akim04"
    },
    "time_stamp": "2023-12-12 07:35:34",
    "text": "Appreciate the advice <@U25PYL3Q8>. Super helpful!!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-12 09:53:58",
    "text": "you can’t change a property input type after creation. you would need to create a new field called whatsapp number with country code or something to that extent "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-12 09:54:33",
    "text": "good luck. if you do get into this and find a different way of organizing it please respond here. i’d love to see another way"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2023-12-12 15:03:02",
    "text": "I actually rolled my own HubSpot API Client when I first started learning the CRM API, this was before I even realized their was already a client from HS I could use.  I still fall back to this sometimes if I want to call something only available in another API version."
  }
]