[
  {
    "poster": {
      "poster_name": "Levon Stepanyan",
      "poster_handle": "levon"
    },
    "time_stamp": "2023-12-01 01:35:13",
    "text": "Alright thanks! :relaxed:"
  },
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2023-12-01 03:50:13",
    "text": "I have a new challenge for anyone to assist me with. I have a workflow set up that notifies our sales team when I post sale email is received, this is working well. What I have been challenge with is to extract the body of that email and store it to a dedicated property so it can be added to a slack notification? Can this be done?"
  },
  {
    "poster": {
      "poster_name": "Tim Schaeppi",
      "poster_handle": "tim.s"
    },
    "time_stamp": "2023-12-01 13:06:41",
    "edited": {
      "time_stamp": "2023-12-08 14:06:07"
    },
    "text": "*[Webhook Data Not Usable in Workflows in Some Cases]*\n\nI have a webhook coming from Zapier triggering a Workflow that is showing a full JSON payload the way I want it\n\n• Webhook setup test payload is showing ALL properties in \"Data Out\" on Zapier.\n• Webhook test receipt in HubSpot is showing full payload.\n• All field types are correct.\n• Contact is appropriately enrolled in the workflow\n• When the workflow fires, NONE of the properties are able to be read from the JSON payload being targeted in the actions.\n    ◦ The contact completes all actions successfully, but properties are set to blank or not changed at all.\n*Why are properties from the webhook not coming through?*",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-01 13:45:05"
      },
      {
        "time_stamp": "2023-12-01 13:56:48"
      },
      {
        "time_stamp": "2023-12-01 14:01:07"
      },
      {
        "time_stamp": "2023-12-01 14:01:23"
      },
      {
        "time_stamp": "2023-12-01 14:39:40"
      },
      {
        "time_stamp": "2023-12-08 09:19:53"
      },
      {
        "time_stamp": "2023-12-08 12:52:02"
      }
    ]
  },
  {
    "text": "Hey Tim, it’s difficult for us to tell what’s going on without having more specific information to your use case. But it sounds like you’re referring to the “Enrollment properties” in later workflow actions not working as expected?\n\nI’d recommend reaching out to support and we’ll be able to assist you better through the ticket they create :slightly_smiling_face:",
    "time_stamp": "2023-12-01 13:45:05"
  },
  {
    "poster": {
      "poster_name": "Tim Schaeppi",
      "poster_handle": "tim.s"
    },
    "time_stamp": "2023-12-01 13:56:48",
    "text": "Yep, that's exactly what's going on. I'll submit a ticket but support has been... Less than supportive lately."
  },
  {
    "poster": {
      "poster_name": "Jesse Bartola",
      "poster_handle": "jbartola"
    },
    "time_stamp": "2023-12-01 14:01:07",
    "text": "Sorry to hear that. When you submit a ticket it will show up in our support queue and I/someone on the team will be able to better assist you"
  },
  {
    "poster": {
      "poster_name": "Tim Schaeppi",
      "poster_handle": "tim.s"
    },
    "time_stamp": "2023-12-01 14:01:23",
    "text": "Submitted!"
  },
  {
    "poster": {
      "poster_name": "Tim Schaeppi",
      "poster_handle": "tim.s"
    },
    "time_stamp": "2023-12-01 14:39:40",
    "text": "Yep, got a big ol shrug from support. I'll let you know if there are any updates on this next week."
  }
]