[
  {
    "poster": {
      "poster_name": "sartaj aziz lone",
      "poster_handle": "sartajazizlone"
    },
    "time_stamp": "2023-10-20 02:01:36",
    "text": "Hello"
  },
  {
    "poster": {
      "poster_name": "Erin Shimamoto",
      "poster_handle": "erin490"
    },
    "time_stamp": "2023-10-20 10:41:05",
    "text": "Hello! Has anyone been able to confirm if using *dynamic/smart content* on an indexed page has a negative SEO impact? A client of ours was going to duplicate a page multiple times and make changes based on personas, but I thought smart content would help to reduce the number of pages in the platform. I just don't want to put our team in a bad position in the long-term.",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-20 10:43:53"
      },
      {
        "time_stamp": "2023-10-20 10:46:06"
      },
      {
        "time_stamp": "2023-10-20 10:48:12"
      },
      {
        "time_stamp": "2023-10-20 13:49:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-10-20 10:43:53",
    "text": "i guess it depends on what portion of the page is using smart content"
  },
  {
    "poster": {
      "poster_name": "Erin Shimamoto",
      "poster_handle": "erin490"
    },
    "time_stamp": "2023-10-20 10:46:06",
    "text": "Totally. I'd understand minor edits (a word or phrase perhaps) but not entire paragraph changes. I'm also hesitant about smart content that changes any H1s too."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-10-20 10:48:12",
    "text": "Isn´t it the same with A/B Testing? I mean, it´s quite similar in terms of SEO Impact, right? Both create different versions of a website."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-10-20 13:49:28",
    "text": "Search bots would only see the default content, they wouldn't be able to see the smart content.\n\nIf the original content is good enough for SEO and the personalization you're doing for personas is contextualizing it, it's probably fine - but if each variation changes the messaging/content in a way that would change the information that would impact the keywords/search intent, then I would make them separate pages.\n\nBasically - is it duplicating the content and personalizing it based on persona so it changes words like, \"in the manufacturing industry\" vs \"in the construction industry\"?\n\nor is it completely changing the content specific to those personas."
  }
]