[
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-05 09:18:31",
    "text": "Can you provide an example of this type of page that's driving lots of organic traffic?"
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dan.wong"
    },
    "time_stamp": "2023-10-05 09:37:02",
    "text": "it's not about driving traffic here, but a listing pages where people can filter and search. Every blog has one right?"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-05 09:38:28",
    "text": "Sure, but your original question asked if there would be any ramifications, correct?"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-05 09:39:11",
    "text": "So, if I'm understanding correctly, and you're taking multiple pages of content down, and putting them onto one page instead of multiple, this will in fact have an impact on your organic traffic"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-05 09:39:55",
    "text": "it may not matter because the traffic isn't meaningful anyway, but, it will cause a loss if you're reducing your content down to a smaller number of pages."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-10-05 12:26:03",
    "text": "I've confirmed with HubSpot that Landing Pages aren't automatically added to your Sitemap:\n\n• HubSpot automatically adds your live HubSpot-hosted website pages and blog posts to your sitemap. Landing pages are not added automatically and must be manually added to your sitemap.\nBut if you want to prevent indexing you do have to add the no index manually.\n\nThis<https://knowledge.HubSpot.com/seo/prevent-content-from-appearing-in-search-results| KB article> also includes an option to use meta tag instead of robots.txt if you want to give that method a try if it's still showing in search"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-05 15:10:50",
    "text": "Perfect! Thanks <@U03AKL6Q1B2>, that's exactly what we recommend at my agency. Adding a noindex to the template of the landing pages to avoid them being indexed."
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dan.wong"
    },
    "time_stamp": "2023-10-05 18:57:01",
    "text": "no no, i'm not putting the posts itself onto the page, i'm juts making a listing like a blog listing, but instead of paginating through the results on different pages i'm doing it on 1 page"
  }
]