[
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-10-23 04:30:45",
    "text": "Hi everyone, is anyone able to tell me how HubSpot is generating its SEO recommendations scores for core metrics such as LCP and CLS? For one of our pages, HubSpot’s LCP score is 3.7s, whereas the Pagespeed report for this page gives 2.6s (field data) and 1.5s (lab data). For the same page, HubSpot’s CLS score is 0.13, whereas the Pagespeed report for this page gives 0.15 (field data) and 0.094 (lab data).\n\nI’m guessing that HubSpot is pulling field data as it’s generally closer to the Pagespeed field data scores, than to Lighthouse scores, but can anyone confirm this? And also explain why the HubSpot LCP score would be so much longer than the Pagespeed field data score?",
    "reply_count": 16,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-23 09:24:04"
      },
      {
        "time_stamp": "2023-10-23 09:26:10"
      },
      {
        "time_stamp": "2023-10-23 10:45:04"
      },
      {
        "time_stamp": "2023-10-23 10:53:03"
      },
      {
        "time_stamp": "2023-10-23 10:53:27"
      },
      {
        "time_stamp": "2023-10-23 10:57:52"
      },
      {
        "time_stamp": "2023-10-23 10:58:33"
      },
      {
        "time_stamp": "2023-10-23 10:59:11"
      },
      {
        "time_stamp": "2023-10-23 11:00:55"
      },
      {
        "time_stamp": "2023-10-23 11:01:26"
      },
      {
        "time_stamp": "2023-10-23 11:01:38"
      },
      {
        "time_stamp": "2023-10-23 11:02:34"
      },
      {
        "time_stamp": "2023-11-13 08:15:01"
      },
      {
        "time_stamp": "2023-11-13 08:16:47"
      },
      {
        "time_stamp": "2023-11-13 08:17:15"
      },
      {
        "time_stamp": "2023-11-13 08:33:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 09:24:04",
    "text": "I can not confirm this but would the Scores change based on location and the time of the crawl?"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 09:26:10",
    "text": "I'm not 100% sure but I would guess that the HubSpot scan is taking place at a different location, at a different time, using different settings vs your Pagespeed crawl."
  },
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-10-23 10:45:04",
    "text": "hey Delbert, it depends which scores you mean? the field data scores in the Pagespeed test are based on all page visits over the last 30 days, so there's no single location as such - it's giving a score for everywhere the page's visitors are located. the lab data does depend on the tester's location (ie my location, and I've seen in vary quite a bit, I think largely depending on my the current speed of my internet connection which goes up and down)\n\nif the HubSpot scores are pulled from Pagespeed field data, then the location wouldn't be relevant, I don't think? I'm not sure what it would be anyway - HubSpot's server location?  And if it *IS* pulling from field data, why would HubSpot's LCP score be so much higher than the Pagespeed LCP? seems rather odd to me"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 10:53:03",
    "text": "I agree Sarah, I'm not sure why the scores change so much. You're correct about using the Field Data if that's in fact what they're using during the scan. At my agency we recommend using multiple page speed tools to test and refine our work."
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 10:53:27",
    "text": "I apologize that I don't have any concrete answers for you, Pagespeed sucks to measure and there's no such thing as perfect."
  },
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-10-23 10:57:52",
    "text": "please don't apologise, I'm grateful for your reply! :grinning:\n\nI'm really not looking for perfection - more just to understand how HubSpot are getting their scores. my client is using the SEO recommendations tool to check their web pages, and of course I can explain that they should use multiple testing tools. I was just surprised to see such a poor LCP score in HubSpot cf the Pagespeed score"
  },
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-10-23 10:58:33",
    "text": "think I'll ping their support team and see if they can shed any light"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 10:59:11",
    "text": "I understand. I typically use the other tools outside of HubSpot to talk specifically about pagespeed. From my understanding HubSpot was using a lot of Lighthouse work and terminology"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 11:00:55",
    "text": "so instead of just regurgitating Lighthouse via HubSpot, I'd just use GTMetix or WebPageTest and talk about specific elements we can control..."
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 11:01:26",
    "text": "but please keep me informed! I love learning new stuff"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-10-23 11:01:38",
    "text": "and if HubSpot is doing something specific I'd like to know how that works"
  },
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-10-23 11:02:34",
    "text": "yep for sure, will let you know here if I get any useful info. and thanks again for your input!"
  }
]