[
  {
    "text": "So <@U04AQA0QM8E> in my specific use case described in my original post, are you saying that for a simple IF statement inside a FOR loop (actually, a `{% email_each %}` loop) over line items the beta would not be necessary? I tried a bunch of different approaches, even in rich text as you guys mentioned, but to no avail.\nWith the beta enabled everything is working fine.\n\nAs per the beta limits (see attached image), is there anything to worry about? I'm using a simple IF statement inside a FOR loop, no HubL function.\n<@U01QVR44MEY> am I right? Is `{% email_each %}` considered a HubL function?\nThank you everyone.",
    "time_stamp": "2024-06-14 08:51:02",
    "edited": {
      "time_stamp": "2024-06-14 08:56:24"
    }
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-06-14 10:26:11",
    "text": "I’ll be honest, I didn’t look closely enough at your code before, I was answering in the abstract. :sweat_smile: I’m actually not familiar with the `email_each` function, so you should disregard anything I say about code that’s reliant on that!\n\nAs far as the programmable email limitations go, I _believe_ that only the `crm_object`, `crm_objects`, `crm_associations`, `crm_property_definition`, and `crm_property_definitions` count as a CRM hit for the purposes of those sending limits. Again though, `email_each` is a blindspot in my knowledge, so it may be worth testing."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-14 10:33:51",
    "text": "I’ve had the same question around the limits and your answer is exactly what I’ve heard as well from other people."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-14 10:34:18",
    "text": "(and more specifically, straight from a developer working at HubSpot)"
  },
  {
    "poster": {
      "poster_name": "Christa Carter",
      "poster_handle": "christa983"
    },
    "time_stamp": "2024-06-14 14:29:38",
    "edited": {
      "time_stamp": "2024-06-14 14:30:29"
    },
    "text": "Hi community!\nHas anyone been successful with getting email engagement events (opens, clicks with email name or campaign name) from HubSpot into Amplitude? The current integration offered by Amplitude still relies on email to match the records from HubSpot to Amplitude. We need to be able to map to the UUID in Amplitude since that is the identifier we use in that system. We use webhooks in workflows for other property info to go to Amplitude. Curious if anyone has figured out how to get the specific email engagement info to POST in Amplitude with a webhook (assuming that may be the only workaround)"
  }
]