[
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 05:00:06",
    "text": "Hello, team!\nCurrently, I am working in the HubSpot Design Manager, where I am fetching and rendering data. When I switch to the Design Previewer, I can see the rendered data, which works perfectly.\nI have added a choice field manually from the \"Add Fields\" option and provided the required options. This field also renders correctly in the previewer.\nWhat I want to achieve is that, by selecting any option from this choice field, the rendered data should change based on the selected option.\nThe challenge I am facing is how to access this featured select field in the Design Manager code because I need to use the value of this select field in my code.\nCurrently, I am using a hardcoded value in my code, as shown below:\n```{% if row[\"13\"] == \"BMW\" %}```\nIf I can somehow access the value of the HubSpot featured select field, I can make this condition dynamic.",
    "reply_count": 13,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-24 06:49:48"
      },
      {
        "time_stamp": "2024-06-24 07:05:55"
      },
      {
        "time_stamp": "2024-06-24 07:20:42"
      },
      {
        "time_stamp": "2024-06-24 07:27:32"
      },
      {
        "time_stamp": "2024-06-24 07:28:20"
      },
      {
        "time_stamp": "2024-06-24 07:34:25"
      },
      {
        "time_stamp": "2024-06-24 07:36:12"
      },
      {
        "time_stamp": "2024-06-24 07:41:36"
      },
      {
        "time_stamp": "2024-06-24 07:44:04"
      },
      {
        "time_stamp": "2024-06-24 08:05:45"
      },
      {
        "time_stamp": "2024-06-24 08:06:58"
      },
      {
        "time_stamp": "2024-06-24 08:12:10"
      },
      {
        "time_stamp": "2024-06-24 08:20:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 06:49:48",
    "text": "You can just click on the field in design manager and click copy snippet or copy value"
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 07:05:55",
    "text": "Thanks for replying, but I don't want to manually copy it. I want the value to be automatically reflected in the design manager code I have written, allowing the process to be dynamic by using this value."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 07:20:42",
    "text": "I'm going to be honest, I truly do not understand what it is you're asking. Best I can guess is that you want to make a selection in the design managers drop down field for this custom field on the right, and then the code is automatically updated for you on the left?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 07:27:32",
    "text": "In your example, is BMW the value of the select field? My only other guess at the moment is that you're trying to do multiple if/ else statements to cover all possible select field values?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 07:28:20",
    "text": "Or is it the other way around? Because that row variable wouldn't be your select field. Not the way it's currently written anyway."
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 07:34:25",
    "text": "For half part you are right,I want this featured HubSpot select field which is rendering on the previewer part and I want whatever user selects from it the product should also change based on it ."
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 07:36:12",
    "text": "Right now in my code I have used BMW as hard-coded value for make and if someone I will be able to someone access the value of this field then I will remove the hard-coded value and make use of this dynamic value and in that way it will achieve dynamic nature"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 07:41:36",
    "text": "Clarifying question. When you say that a user selects from it, do you mean a user within your organization that is building this email? Or do you mean a user as in the recipient of this email makes a selection in the email."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 07:44:04",
    "text": "If it's the former, then it sounds like you just need a string of if/ else statements. And you would do that by first copying the snippet from the select field which will give you your first if statement.\n\nAnd if I'm still not understanding your question, it might help if you shared some more of your code."
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 08:05:45",
    "text": "Thanks Man ,I just figure it out as i just inserted this line of code {% set selectedMake = module.choice_field %} in my template and i got the value of the select field and when the value changes as for now i am select it ,filter works fine for me"
  },
  {
    "poster": {
      "poster_name": "Daniel Keogh",
      "poster_handle": "dkeogh"
    },
    "time_stamp": "2024-06-24 08:06:51",
    "text": "Hey Zach,\n\n&gt; Does anyone know of a numerical updated IDs for CTA?\nOld: `1790629`\nNew: `122980089970`\n\nThe fact these are missing from the doc looks like a mistake. I’ll open a ticket internally to get it updated. Apologies"
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 08:06:58",
    "text": "if you still want me to clarify the question,do let me know &amp; i will describe it to you in-detail then"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 08:12:10",
    "text": "No worries. I'm not sure I understand why you needed to use `set` and make a new variable when you can just use `module.choice_field` (unless you're then modifying the value that gets sets).\n\nBut if you got it to work then cool! :+1:"
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 08:20:20",
    "text": "Thanks for replying, cheers:coffee:"
  },
  {
    "poster": {
      "poster_name": "Zach Oates",
      "poster_handle": "zach681"
    },
    "time_stamp": "2024-06-24 13:06:23",
    "text": "Thank you!!"
  },
  {
    "poster": {
      "poster_name": "Jill McElroy",
      "poster_handle": "jill111"
    },
    "time_stamp": "2024-06-24 17:52:56",
    "text": "Anyone know of an email developer looking for hourly work building an html email template?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-24 20:46:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Yawer Ali",
      "poster_handle": "yawer.ali"
    },
    "time_stamp": "2024-06-24 20:46:48",
    "text": "Please DM me. I would like to review the work first, and it might work for me. If not, I can give you a referral for the same."
  }
]