[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-18 07:00:59",
    "edited": {
      "time_stamp": "2021-02-18 07:05:54"
    },
    "text": "Hey there, good catch.\n\nI discussed with the team in charge of that feature.\n\nIt’s honestly a bit hard to fix right now. If we update the script to result in unique IDs it will make that change across all existing sites both on and off of HubSpot. Potentially breaking any CSS/JS targeting those IDs.\n\nThis does not mean it’s impossible to solve this problem for future embeds, but providing that separate path for new embeds is a lot of work.\n\nFrom an accessibility standpoint I did some research to better understand why the unique IDs are as important as they are.\n\nThe primary reason is for any labels for input fields. The second is any interactive element that says it affects that id - or is affected by that id via aria attributes. Third is similar - making sure aria-describedby works properly.\n\n&gt; If the IDs are not used by attributes or scripting on your webpage, the chances are that they won’t affect the accessibility of your webpage. But the minute that an ID attribute is used to provide programmatic relationship on your webpage, it starts affecting your users.\nThe one situation this DOES impact, though highly unlikely people use it this way. Is for anchor links to that specific id.\n\nThe browser will navigate to the first instance of the id.\n\nSo as you can see while it will come up in automated tests. The specific use-case for the id  on a CTA is not really causing much real-world pain.\n\nIf you’d like to encourage/push for this change to be made I would create a post on the ideas forum for this, that will help the team identify the demand for it and weigh the priorities. The amount of work required to make this change and not risk breaking old sites is hard to justify when the largest benefit is mostly just looking good in an accessibility testing tool vs having a real-world impact."
  }
]