[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-12-11 01:44:12",
    "text": "<@U7SL518D6> I was about to ask the same :slightly_smiling_face:\n\nSince I’m working on a theme right now, it’d be great to hear your feedback <@U02KUKZ1MT8> in more detail.\nWhat are specific things HubSpot doesn’t allow you to achieve in terms of website? Would you be interested in having a call about that?"
  },
  {
    "poster": {
      "poster_name": "Tracy Graziani",
      "poster_handle": "tracy"
    },
    "time_stamp": "2021-12-11 09:28:03",
    "edited": {
      "time_stamp": "2021-12-11 09:31:56"
    },
    "text": "No native search functionality, inability to fully customize the header and navigation, linking images requires custom code. The lack of functionality on mobile optimization is laughable. There should be a simple way to leverage CSS. Not design, but the DNS issues are a JOKE. Probably the root of some of the worst issues is the terrible documentation.  We have a developer, but the learning curve on the CMS is terrible due to poor documentation. Frankly when a product is $300/mo we shouldn't have to pay a developer to do things that could easily be done without a developer on Wordpress ten years ago, Premium price should mean premium product. Complete lack of real-time support. The default HubSpot chat support knows NOTHING about CMS. The slack channel and the forum are SLOW and ineffective. Our last CMS project took twice as long and was significantly over budget. When our developer finally discussed all this with Luke Summerfield the best idea he had was to charge MORE for better support? UM NO,"
  },
  {
    "poster": {
      "poster_name": "Tracy Graziani",
      "poster_handle": "tracy"
    },
    "time_stamp": "2021-12-11 09:40:48",
    "text": "<@UMZFZHVUJ> it seems simple to me. Why didn't HubSpot consult with designers and developers? Why didn't they look at the functionality people have come to expect from EVERY other CMS? Certain things should just be table stakes for offering a CMS, and those are missing. The top themes in the WordPress market are Divi and Elementor. Start there. That's what people actually use and like. The problem is they're pulling people off of those platforms for 50 times the cost AND provide less documentation and support."
  },
  {
    "poster": {
      "poster_name": "Tracy Graziani",
      "poster_handle": "tracy"
    },
    "time_stamp": "2021-12-11 09:46:29",
    "text": "And <@U7SL518D6> we have developers. We'd BE a marketplace provider if it were possible to build a good product. We want what the CMS is hoping to someday be, but it's just not there yet. We're a business. Why should we burn payroll to find workarounds to cobble something together when the core product isn't really ready for prime time? Why pay my people to fix things HubSpot should be solving since they're charging ME a premium for it? It's almost like HubSpot opened and marketed a five star restaurant, but when you show up all the high quality ingredients are hidden or on high shelves, the place has no ladders, AND you expect everyone to cook their own dinner for 50 times MORE than they'd pay anywhere else."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-11 10:16:38",
    "edited": {
      "time_stamp": "2021-12-11 10:23:34"
    },
    "text": "Thank you <@U02KUKZ1MT8> for your feedback, really appreciate it. Sorry you’re having a rough experience.\n\nI have some follow up questions to a lot of your comments, as well as some resources I can share for both you and your developer.\n\nBut first can you send me your <https://knowledge.HubSpot.com/account/manage-multiple-HubSpot-accounts#:~:text=have%20access%20to.%C2%A0-,Check%20your%20current%20account,-To%20check%20which|HubSpot account id>?"
  }
]