[
  {
    "text": "Does anyone know how quickly a Workflow on Conversions is triggered?\n\nI’m trying to set the the contact owner and then two steps later use the Contact Owner’s name within the response message.\n\nScreenshot has an example.",
    "time_stamp": "2022-08-22 13:52:58",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-08-22 15:40:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2022-08-22 14:02:30",
    "text": "<@U03TCDK517T> do yo have two pipelines, one for eCommerce and abandoned?\n\nOr just a single pipeline and the stages change?"
  },
  {
    "poster": {
      "poster_name": "Emma Golborne",
      "poster_handle": "egolborne"
    },
    "time_stamp": "2022-08-22 15:22:17",
    "text": "Hey <@U01BZ4SQRL4> - I’m the Product Manager on the team that owns the webhook action and for some reason this came up in my slack which is perfect timing because we just rolled out new functionality that will allow you to do this! Now when you click into the webhook action and select POST, you’ll see that you’re able to customize the webhook request. You can select data from the enrolled object or from previous actions (including previous webhook actions with outputs specified). Please test it out and let us know if you have any feedback!"
  },
  {
    "text": "I usually use the delay until action, and delay the action until the contact owner is known. It’s usually instant though.",
    "time_stamp": "2022-08-22 15:40:40"
  },
  {
    "poster": {
      "poster_name": "Aaron M Thomas",
      "poster_handle": "athomas"
    },
    "time_stamp": "2022-08-22 15:53:00",
    "text": "Hi <@U022ANB8ZC4>, that is a nice feature. Much appreciated for letting me know!"
  },
  {
    "poster": {
      "poster_name": "Jed Thomas",
      "poster_handle": "jthomas"
    },
    "time_stamp": "2022-08-22 18:39:15",
    "text": "I have two separate Pipelines. One Abandoned Cart the other one - E-Commerce <@U03REFNRMB3>"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2022-08-22 20:04:02",
    "edited": {
      "time_stamp": "2022-08-22 20:16:23"
    },
    "text": "Is the only common item between the two the contact record? (the two pipelines)"
  }
]