[
  {
    "text": "<@UHVJJUWFN> <@U03MJJ5Q4AG> this does not seems to be a custom object. Also can be seen in screenshot",
    "time_stamp": "2022-08-01 05:34:27"
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-08-01 06:44:24",
    "text": "Right — so it appears that Cases is a custom object. What you’ve highlighted (“Customize the Create Cases form”) is referring to if you went to Contacts &gt; Cases &gt; click the Create Case button, what are users required to enter in order to create a new case. If you click Manage Case properties, I would assume that there is a property on the Cases object called Form Name. This is not affiliated with the Forms HubSpot function."
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2022-08-01 07:03:14",
    "text": "To <@U03REFNRMB3>’s point, being able to save \"portions\" of workflows to use _within_ the portal but in other workflows is a feature we want to work on (but haven't prioritized yet) that would then enable our sister team to create more \"external\" libraries of sub-workflows that could then be used by anyone. Sort of like a library of sub-workflows or groups of actions"
  },
  {
    "text": "<@U03MJJ5Q4AG> thanks for continued support on this. Yes, case is custom object. We do not have Form Name attribute on case. And that form name highlight i did not meant to draw your attention to that is not being used. We have a HubSpot form  which is placed on a site. screenshot attached.    I am more than happy to walk you through in case if that might help.   <@UHVJJUWFN>",
    "time_stamp": "2022-08-01 07:39:14",
    "edited": {
      "time_stamp": "2022-08-01 07:40:17"
    }
  },
  {
    "text": "Right - the issue is back at this step. An object can’t be associated with a form submission because a form isn’t an object.",
    "time_stamp": "2022-08-01 07:43:46"
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-08-01 07:45:09",
    "text": "You would need to set the property “Form Name” on the Case object, which you can’t do directly from forms. You could have a contact workflow that triggers on “has filled out Polly Helpdesk form” &gt; action “Set Property Value” to target Case property Form Name and update it to Polly Helpdesk. THEN the flow you have built should work if the trigger is Case property form name is Polly Helpdesk"
  },
  {
    "poster": {
      "poster_name": "Vikash Tiwari",
      "poster_handle": "vtiwary"
    },
    "time_stamp": "2022-08-01 07:50:05",
    "text": "That makes sense and i would go for that Contact route now. Thank you <@U03MJJ5Q4AG>"
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-08-01 07:50:33",
    "text": "good luck!"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2022-08-01 08:30:30",
    "text": "<@UHVJJUWFN> exactly. I think it can be done via the API but not 100%"
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dawong"
    },
    "time_stamp": "2022-08-01 14:56:42",
    "text": "<@U0157R7AQ84> I’m looking for the right way to store any ‘connection’ settings. This would be like account reference and authentication tokens as well ‘set and forget’ configuration."
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dawong"
    },
    "time_stamp": "2022-08-01 14:59:19",
    "text": "so I think I’ve mis-interpreted ‘connection’ - as you described it, this is workflow ‘connection’. I was thinking this was external integration ‘connection’"
  }
]