[
  {
    "poster": {
      "poster_name": "Sammy Murray",
      "poster_handle": "sammy"
    },
    "time_stamp": "2022-08-09 11:13:22",
    "edited": {
      "time_stamp": "2022-08-09 11:13:41"
    },
    "text": "Hi,\nWe are trying to decide if we should wait until the v3 Workflows API update or use the v2 endpoints as-is. I know, unless its deprecated, APIs are still supported, but it would be helpful to know if this update is a few months or a few years out. I've checked the roadmap, upcoming changelog and forum. Does anyone know if there's any news on a rough timeline for the v3 Workflows API?\n\n<https://developers.HubSpot.com/docs/api/automation/create-manage-workflows>\n<https://legacydocs.HubSpot.com/docs/methods/workflows/add_contact>",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-08-09 14:24:58"
      },
      {
        "time_stamp": "2022-08-09 14:32:34"
      },
      {
        "time_stamp": "2022-08-09 14:57:36"
      },
      {
        "time_stamp": "2022-08-09 14:58:09"
      },
      {
        "time_stamp": "2022-08-09 14:58:20"
      }
    ]
  },
  {
    "text": "Hi, I need some help as to why my Workflow Custom Coded Action is not copying enumeration value from the action to the Ticket.Category property. Here is a screenshot where the value from the custom code = BILLING_ISSUE is being passed to the Copy step. But the ticket category is always blank. I see that Ticket Category property definition has a value of (Billing inquiry -- internal value = BILLING_ISSUE). Not sure why the copy step is not working for enumerated output.\n\nAny thoughts?",
    "time_stamp": "2022-08-09 12:51:56",
    "edited": {
      "time_stamp": "2022-08-09 12:52:21"
    }
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-08-09 14:24:58",
    "text": "Hey Sammy, I checked with the team on this one—their answer was that the new workflows API is on the team’s roadmap, but there isn’t a definitive timeline at this point. For what it’s worth I don’t expect the changes from the current “enroll contacts” API to whatever the new version looks like to be too substantial, so if you have the ability to make changes down the line it should be relatively low lift once the new API is ready, if it’s something that you want to start working with now."
  },
  {
    "poster": {
      "poster_name": "Sammy Murray",
      "poster_handle": "sammy"
    },
    "time_stamp": "2022-08-09 14:32:34",
    "text": "Thank you so much <@U0157R7AQ84>. I really appreciate the information and it's good to know it's likely a relatively lower lift. In general, is there a rough estimate of how long we would have to migrate from v2 to v3 before v2 was deprecated?"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-08-09 14:57:36",
    "text": "I believe our standard timeframe is 180 days"
  },
  {
    "poster": {
      "poster_name": "Sammy Murray",
      "poster_handle": "sammy"
    },
    "time_stamp": "2022-08-09 14:58:09",
    "text": "Thank you!"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-08-09 14:58:20",
    "text": "No problem!"
  }
]