[
  {
    "poster": {
      "poster_name": "Andrew Jenkins",
      "poster_handle": "andrew.jenkins88"
    },
    "time_stamp": "2020-12-21 07:49:45",
    "text": "Hey Trey, yep it is still supported.  Taking a look now"
  },
  {
    "poster": {
      "poster_name": "Andrew Jenkins",
      "poster_handle": "andrew.jenkins88"
    },
    "time_stamp": "2020-12-21 08:01:09",
    "text": "So in step 1 it mentions getting set up for local development, as part of that, there is a step to create your `HubSpot.config.yml` file.  This file is generated in whatever your current directory is.\n\nOne way to be set up for all of your repos would be to generate your config file in your home directory.  `cd ~ &amp;&amp; hs init` . Once that is in place, the event registration app should be able to detect its presence and the authentication step should work.\n\nSorry for the confusion, the documentation could definitely be more clear"
  },
  {
    "poster": {
      "poster_name": "Trey",
      "poster_handle": "trey185"
    },
    "time_stamp": "2020-12-21 12:12:13",
    "text": "i have a HubSpot.config.yml and it works find ive been using it for local dev for over a year"
  },
  {
    "poster": {
      "poster_name": "Trey",
      "poster_handle": "trey185"
    },
    "time_stamp": "2020-12-21 12:15:09",
    "text": "it looks like to me there needs to be a env file?"
  },
  {
    "poster": {
      "poster_name": "Andrew Jenkins",
      "poster_handle": "andrew.jenkins88"
    },
    "time_stamp": "2020-12-21 15:02:16",
    "edited": {
      "time_stamp": "2020-12-21 15:04:00"
    },
    "text": "There shouldn’t need to be an env file, just the HubSpot.config.yml file.  There are optional environment variables you can set, but they shouldn’t be required.  ~What version of the CLI are you using?~ Nevermind I see it is using the version installed by the app"
  },
  {
    "poster": {
      "poster_name": "Andrew Jenkins",
      "poster_handle": "andrew.jenkins88"
    },
    "time_stamp": "2020-12-21 15:17:14",
    "text": "Looking through that code, I can confirm it is having an issue finding your `HubSpot.config.yml` file.  If the config file you normally use is in a different directory, specifically one that isn’t in the file tree that leads from `~/` to your `cms-event-registration` dir, the command won’t be able to find it.\n\nYou can fix this by either copying your `HubSpot.config.yml` file into the `cms-event-registration` directory, or making it global by copying it to `~/HubSpot.config.yml`\n\nI do apologize for the messy error though, I’ll make sure we get that cleaned up"
  }
]