[
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-08-28 08:51:01",
    "text": "Have you tried the format filter?\n```{{ \"Hi %s %s\"|format(contact.firstname, contact.lastname) }} ```\n"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-08-28 08:54:15",
    "text": "or the string filter might work. Sorry, dont have a test env in front of me at the moment\n\n```{{ some.random.property|string}}```\n"
  },
  {
    "poster": {
      "poster_name": "Luc Benayoun",
      "poster_handle": "luc"
    },
    "time_stamp": "2023-08-28 09:19:47",
    "text": "I would just use the slug instead of the blog tag name :) hope it helps!"
  },
  {
    "poster": {
      "poster_name": "Luc Benayoun",
      "poster_handle": "luc"
    },
    "time_stamp": "2023-08-28 09:24:07",
    "text": "Hey! Hope this helps, I often check the Django filters which are similar to the HubSpot queries here: <https://docs.djangoproject.com/en/4.2/ref/models/querysets/|https://docs.djangoproject.com/en/4.2/ref/models/querysets/>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-28 12:50:17",
    "text": "<@UQWGKUEN7> we noticed last week that the 404 and 500 error page URLs now have language slugs, which means the content contained within the page is properly translating.\n\nHowever, the language slugs weren't added to search results pages - for example, if someone is on the IT version of the site, the results show only EN if that is the default domain language.\n\nWith all of that said, it has helped with the content translation, but unfortunately, these templates don't have full support for translations, so the language switcher is hidden - and as a result, the header/footer menus aren't showing the multi-language variants.\n\nBecause this is a recent change, I was wondering if you have any insight into whether this capability is on the roadmap - to add more support for multi-language on system pages?\n\nAny insight is greatly appreciated so we can prioritize a solution within the theme if needed."
  },
  {
    "poster": {
      "poster_name": "Yakub",
      "poster_handle": "yakub"
    },
    "time_stamp": "2023-08-28 21:14:48",
    "text": "I'm trying to integrate tailwind UI into a HubSpot theme and having trouble getting the tailwind styles applied to HubSpot forms. Obviously when you use a HubSpot form within a module, it outputs without any of the inbuilt HubSpot styling. But in order to apply tailwind's styles, I need to add a bunch of CSS classes to various elements of the form.\n\nCurrently I'm using jQuery to add the necessary CSS classes to every form once the page is loaded, which seems to work fine for now, but is there a way I can directly manipulate the markup that HubSpot outputs when inserting a HubSpot form?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-29 00:37:39"
      },
      {
        "time_stamp": "2023-08-29 16:54:26"
      },
      {
        "time_stamp": "2023-08-29 22:16:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-08-29 00:37:39",
    "text": "just use @apply directives"
  }
]