[
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-24 09:51:52",
    "text": "You can alway check the content of a var with\n{{ module.choice_field|pprint }}"
  },
  {
    "text": "Hi,\n\nI am using dynamic pages populated by a custom object.\nThe list of crm objects is displayed using the hubl <https://developers.HubSpot.com/docs/cms/hubl/functions#:~:text=than%20range%3D).-,crm_objects,-Gets%20a%20list|crm_objects> function.\nI am filtering the dynamic list by adding query parameters to the url, which then updates the crm_objects query param.\n\nAll of the above is working fine.\n\nI now want to do something similar but using a search bar. The search input will be used to find a given text property that partially contains the value.\n\nI see in the docs that it mentions ‘startwith’ but I can’t get it to work. Do you know how ‘startwith’ should be called? I already tried this and a few other variations: \"event_name__startswith=Dublin 2020\"",
    "time_stamp": "2023-08-24 10:45:36",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-28 09:24:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-24 11:09:12",
    "text": "Do you have some more context? Are you willing to achieve this through a custom module in CMS Hub?"
  },
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-24 11:09:30",
    "text": "Where are you fetching the data from?"
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2023-08-24 18:44:39",
    "text": "Hi! I'm trying to create a competitor's landing page template that can adjust its content, especially the table. It requires a table that needs to be updated per competitor. The data will come from the content editor in charge of populating the LPs."
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2023-08-24 20:36:37",
    "text": "hi! i'm trying to add this line to the HS robot txt:\nUser-agent: GPTBot\nDisallow: /\n\nbut it's not showing up. is there something missing?"
  }
]