[
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2023-08-10 01:09:40",
    "text": "Hi All, I want to make use of aliases for a module, right now i have a text field which i added a repeater to so that the marketeers can just create multiple items. Now they want to expand on it and have more information per item, this requires me to change it into a repeater group with all the info in there. Given this module is actively used, how can i make sure that the values of the current repeater are passed to the group repeater, in short it now looks something like this\n\nSoftware (text field) (repeater)\n\nAnd needs to look like this\n\nSoftware items (group)\n• software_name (text field) &lt;- this is where i need to pass the former software text\n• software_requirements\n• etc\n• etc",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-10 10:46:16"
      },
      {
        "time_stamp": "2023-08-10 13:28:22"
      },
      {
        "time_stamp": "2023-08-11 09:46:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "hub.sketch",
      "poster_handle": "hub.sketch"
    },
    "time_stamp": "2023-08-10 07:55:33",
    "text": "Hi\nhow Can we implement chat GPT within HubSpot live chatbot? Does anyone have an idea it would be appreciated.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-10 16:50:07"
      },
      {
        "time_stamp": "2023-08-10 16:50:23"
      },
      {
        "time_stamp": "2023-08-11 06:18:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-10 10:46:16",
    "text": "I don't know the exact behaviour of HS regarding your question. What I would suggest is that you make a clone of your module and do a trail-and-error test to see how HS behaves."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-10 13:28:22",
    "text": "It’ll make your fields and rendering logic a bit complex, but you could maintain the existing “single-item” fields as they are, and add separate fields and rendering logic for the repeater.\n\nTo make it less confusing for users, you could use a boolean toggle to switch between single-item and multi-item “modes” — hiding the repeater and turning off their rendering when set to single-item mode, as well as the reverse for multi-item mode.\n\nIt’s not necessarily the cleanest solution, but it’ll guarantee that you don’t lose any data in the process of remapping fields."
  },
  {
    "poster": {
      "poster_name": "Cooper Elias",
      "poster_handle": "cooper.elias"
    },
    "time_stamp": "2023-08-10 15:53:23",
    "text": "I'm trying to come up with the best method to filter a HubDB table to return only rows where the datetime column is within the current week. So far my best idea is to create a copied list of all rows, loop through and add a week property to each row that represents the numeric week of the year, then filter the list by that new property.\n\nAny better ideas? Or issues you see with my idea?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-11 03:53:35"
      },
      {
        "time_stamp": "2023-08-11 11:16:22"
      },
      {
        "time_stamp": "2023-08-11 15:46:14"
      },
      {
        "time_stamp": "2023-08-11 15:46:19"
      },
      {
        "time_stamp": "2023-08-11 15:47:39"
      },
      {
        "time_stamp": "2023-08-25 04:11:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jordan Ryken",
      "poster_handle": "jordan.ryken"
    },
    "time_stamp": "2023-08-10 16:50:07",
    "text": "you could potentially incorporate a service such as <http://drafter.ai|drafter.ai> to do this, but there isn't a native way aside from that which I know of without a decent bit of code."
  },
  {
    "poster": {
      "poster_name": "Jordan Ryken",
      "poster_handle": "jordan.ryken"
    },
    "time_stamp": "2023-08-10 16:50:23",
    "text": "That said, drafter can definitely get you a solution if you need one to solve for this."
  }
]