[
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-01 03:57:07",
    "text": "The first one should be the correct one:\n```{% set sku = line_item.hs_sku %}```"
  },
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-01 03:58:50",
    "text": "If it is not working you can debug like this:\n\nCheck if the var you try to assign has a value, maybe there is something wrong here:\n```{{line_item.hs_sku|pprint}}```\nAfter you set the new variabele, you can check if the variabele has any value\n```{% set sku = line_item.hs_sku %}\n{{sku|pprint}}```"
  },
  {
    "text": "Hello everyone!\n\nIs there a way to edit the theme's style fields (fields.json) in the same manner (drag and drop) as we can edit the module fields (the menu on the right side)?\n\nI'm typing json and it can get a bit tiresome and complex pretty quickly. Or how do people usually work with this? (Trying to create my first theme from the boilerplate).\n\nThank you!",
    "time_stamp": "2023-08-01 13:19:09",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-01 17:50:19"
      },
      {
        "time_stamp": "2023-08-03 11:53:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alessandra Lima",
      "poster_handle": "alessandra.lima"
    },
    "time_stamp": "2023-08-01 14:27:56",
    "text": "Hello guys.\nI've been having this problem for months and I still can't solve it.\nMy goal is to make a cms module with a carousel of birthdays. For this I made a query with the crm_objects function, looking for the contacts in the crm, but in addition to not being able to bring more than 10 contacts, I was not able to separate, via hubl, the birthdays by weekly date. All my properties are in the right format. Will I have to create a backend just to call all this data through the HubSpot api and manipulate from there? If so, how could I show the data in my new module?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-02 05:54:46"
      },
      {
        "time_stamp": "2023-08-02 08:10:07"
      },
      {
        "time_stamp": "2023-08-11 14:45:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-08-01 17:50:19",
    "text": "Yeah you can just create all the theme fields in a module. Then copy the JSON and paste it in the theme's fields.json"
  },
  {
    "poster": {
      "poster_name": "G T",
      "poster_handle": "graemetulip"
    },
    "time_stamp": "2023-08-01 23:31:09",
    "text": "i checked if there was a value already by printing it in an email but for no variation did a value appear"
  }
]