[
  {
    "poster": {
      "poster_name": "Michael Niemeijer",
      "poster_handle": "michael915"
    },
    "time_stamp": "2021-05-20 02:43:02",
    "text": "it works like a charm, thanks again!"
  },
  {
    "poster": {
      "poster_name": "Diogo Alves",
      "poster_handle": "diogo"
    },
    "time_stamp": "2021-05-20 06:19:50",
    "text": "Hello everyone. I’m figuring out what is the best approach to setup a development workflow with github (on a project that been all done via the design tool so far) and have two questions:\n• How do you test page changes? My understanding is a developer can change templates &amp; modules locally, but the pages that use them are only in the “production” environment and won’t be in the test environment. So that means that changes to templates will have immediate live impact if pushed and there’s nowhere to test them since the pages are not under version control.\n• For templates/modules that use hubdb tables, what is the recommended approach. When I try to push to a development environment with `hs upload` they fail since they are looking for tables by id that do not exist in the dev environment",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-20 06:50:46"
      },
      {
        "time_stamp": "2021-05-20 08:20:46"
      },
      {
        "time_stamp": "2021-05-21 02:08:07"
      },
      {
        "time_stamp": "2021-05-24 09:32:28"
      },
      {
        "time_stamp": "2021-05-24 10:22:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Diogo Alves",
      "poster_handle": "diogo"
    },
    "time_stamp": "2021-05-20 06:50:46",
    "text": "<https://developers.HubSpot.com/docs/cms/features/hubdb#getting-rows|found the solution for the 2nd one>, so only question 1 remains!"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-05-20 08:20:46",
    "text": "Q1 is a great question! I don’t have a complete answer right now, but in the next few months my team will be exploring automated testing solutions. I will say that currently we have created some node scripts that we use to (somewhat) effectively clone content from prod to a staging portal, where we can at least do some better visual inspection before deploying."
  }
]