[
  {
    "poster": {
      "poster_name": "Shani",
      "poster_handle": "hsdeveloper6"
    },
    "time_stamp": "2020-09-04 04:11:54",
    "text": "I don't think so <@U2LEJ045D>."
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2020-09-04 04:17:12",
    "text": "What do you mean by \"default content on a repeater module\"? You mean repeateted fields or groups in a module?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-04 05:53:17",
    "edited": {
      "time_stamp": "2020-09-04 05:54:38"
    },
    "text": "Yes you can, at the template level.\nYou have to pass an array. The array should contain variables of the same type as the field default.\n\nSo if a repeater text field, an array of strings. If a repeater of image field, an array of image dicts"
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-09-04 08:53:00",
    "text": "This is a drag and drop template.  The section that the background is on doesn’t exist until the user creates it basically.  They have the choice to put a background color or image on the built in HubSpot styles tab.  But it doesn’t appear that they can choose both.  And since the section doesn’t necessarily exist and even if it did it could have any number of id’s depending on where on the page it ends up, I can’t target it in CSS.  And there is no inline."
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2020-09-04 08:54:11",
    "text": "You can set the default content of each part of that repeating group or field, and then you can set how many of the repeated field or group to start with as default but it’ll be the same default content for all the repeated items until a user changes them on the page."
  },
  {
    "poster": {
      "poster_name": "Daniel Jovanny Puc May",
      "poster_handle": "daniel136"
    },
    "time_stamp": "2020-09-04 15:00:59",
    "edited": {
      "time_stamp": "2020-09-04 15:02:29"
    },
    "text": "My problem is if my praticum is correct or not, like  I show you. because in the example it show diferents objects. (In my case is the same cat) but in the praticum it show differents cats so is there  a tool o step to change my module and  make different cats for deafault?"
  },
  {
    "poster": {
      "poster_name": "Josh Lambert",
      "poster_handle": "hi812"
    },
    "time_stamp": "2020-09-04 16:37:18",
    "text": "Howdy! Has anybody found a way to get custom CSS into the Knowledge Base in HubSpot? Perhaps using the CLI or some other tool?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-09-04 18:17:10"
      },
      {
        "time_stamp": "2020-09-04 18:59:09"
      },
      {
        "time_stamp": "2020-09-04 19:00:16"
      },
      {
        "time_stamp": "2020-09-07 12:28:40"
      },
      {
        "time_stamp": "2020-09-07 13:29:55"
      },
      {
        "time_stamp": "2020-09-23 21:28:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-09-04 18:17:10",
    "text": ":disappointed: I’m sorry, but this is just not possible right now… but someday it will be. I just don’t know when!"
  },
  {
    "poster": {
      "poster_name": "Josh Lambert",
      "poster_handle": "hi812"
    },
    "time_stamp": "2020-09-04 18:59:09",
    "text": "OK thank you for letting me know."
  },
  {
    "poster": {
      "poster_name": "Josh Lambert",
      "poster_handle": "hi812"
    },
    "time_stamp": "2020-09-04 19:00:16",
    "text": "Where we can put in a request for this feature? It's super important for one of my clients and likely this will cause them to consider moving this functionality to Wordpress unfortunately."
  }
]