[
  {
    "poster": {
      "poster_name": "Antoine Ravet",
      "poster_handle": "aravet"
    },
    "time_stamp": "2020-09-10 03:34:09",
    "text": "Thanks <@U017458R1MH> :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2020-09-10 10:06:52",
    "text": "Does anyone have some great HubSpot Membership examples that they can share? I have a client looking at this - but need something to show.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-10 14:48:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-09-10 13:50:49",
    "text": "<@U019P8E5LCR> Happy to talk through. we've done a lot with it"
  },
  {
    "poster": {
      "poster_name": "Seth.I.D.",
      "poster_handle": "seth.dorr"
    },
    "time_stamp": "2020-09-10 14:39:54",
    "edited": {
      "time_stamp": "2020-09-10 14:43:26"
    },
    "text": "<@U2H3TT8F2> got <#C019VT42R8X|workflows> set up so we are up in there talking now! I can just make sure to share whatever I learn from you there too.\n\nAnyway, I'll be meeting with my engineering team on Monday to discuss, but I'm sure there will be all sorts of fun questions that come out of it.\n\nWe just really need to be able to send reminder messages after delayed periods to members and if possible close it then send an email.\n\nBased off the resources I gathered it does look as though it's possible. I think my only remaining question would be if it's possible to include that \"closing\" email send with the Code Snippet actions from saved emails inside our HubSpot platform. I don't see this being outlined in any of the examples I saw. _(We love automatic transcripts and bot doesn't do those, so looking for a way)_\n\n*This is kind of what we are thinking the Verification Actions would look like now:*\n\n• Member Chats in and Bot requests Verification\n• Bot gets stuck verifying as member doesn't provide email/phone\n• Bot sees no response when asking for email so after 2 min it asks again for email.\n• Bot sees no response when asking for email and reminding the member after 5 minutes so it asks again for email.\n• Bot sees no response STILL after 2 reminders so closes chat and emails the member with emails we'll be creating for common FAQs from the chat flow they were in."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-10 14:48:44",
    "edited": {
      "time_stamp": "2020-09-10 14:49:01"
    },
    "text": "<https://designers.HubSpot.com/inspire/browse?functionality=Memberships%20%2F%20Login>\n\nUnfortunately though  for your situation, you won’t be able to see what’s behind the logins."
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2020-09-10 16:37:32",
    "text": "does anyone have experience using OneTrust on HubSpot instead of using HubSpot’s default?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-23 06:24:53"
      },
      {
        "time_stamp": "2020-11-23 07:03:29"
      }
    ]
  }
]