[
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-06-07 10:18:45",
    "text": "Hey there, has anyone built a website using HubSpot and a Vue.js / Nuxt.js app for the front end? Or does anyone know of any guides around this at all?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-06-07 11:13:16"
      },
      {
        "time_stamp": "2019-06-07 11:15:03"
      },
      {
        "time_stamp": "2019-06-07 13:34:32"
      },
      {
        "time_stamp": "2019-06-07 13:44:21"
      },
      {
        "time_stamp": "2019-06-18 12:16:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-07 11:13:16",
    "text": "I’ve done vue.js on HS a fair amount but never with nuxt"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-07 11:15:03",
    "text": "As far as I’m aware there are no guides for using Vue with HubSpot nor Nuxt, but Using Vue isn’t hard and Vue lends itself really well to being sprinkled into sites vs going full on everything is managed by vue."
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-06-07 13:34:32",
    "text": "Could I be really cheeky and see something you’ve made or do you have any pointers in getting things to work properly with HS?\n\nI wasn’t sure of if you need to build out stuff to utilise webhooks as i’m new to the framework and the potential for building a HS site with a single page app feel.  I’d certainly try to pay it forward in getting a guide of sorts together.\n\nAs always thanks Jon, you’re a legend round these parts. (your cache buster extension has saved so many headaches for my marketers!)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-07 13:44:21",
    "text": "unfortunately I think all of my VueJS implementations on HS sites are under NDA and not on normal public facing parts of client sites. (hard to explain, has to do with using them for specific events)\n\nbasic jist though - VueJS - sprinkle it in where needed, I wouldn’t try to build a full website where everything is wrapped in vue.\n\nSay you have like a portion of the site that’s SPA like, that would be fine to have that be all Vue. But that can only exist as one page in HubSpot’s back end.\n\nIf you want to go overboard and do VueJS routing and all that you’d have to have a separate server to query against, which that server would use the HS API’s to pull content from pages and whatnot to feed to your SPA.\n\nThat could get really complicated and ultimately not likely worth the extra effort.\n\nAppreciate that about the extension, always glad to hear it’s helping people out."
  }
]