[
  {
    "poster": {
      "poster_name": "Acun Gürsoy",
      "poster_handle": "acun.guersoy"
    },
    "time_stamp": "2019-06-25 00:41:16",
    "edited": {
      "time_stamp": "2019-06-25 01:27:34"
    },
    "text": "Hey all,\ni am embedding the support ƒorm for Tickets in HubSpot (for creating tickets that will appear in a service pipeline) in a SPA using react.\nMy use case:\nI want to prefill some fields that are defined as hidden in the support form (which currently works) and also prefill the email field, which can't be set to hidden. Currently i am doing this inside of the onFormReady callback with vanilla js (we want to use jquery as less as possible).\nFor the email field i am having the problem that with the first change in any other given field (in my case i have a title input and a description textarea included and visible) the prefilling of the email field gets removed.\nI know that the Support Form also works with React and i assume that it disappears because of the fact that the state for the input is still a empty value and will be set again with every state change inside the form.\nAny ideas on how to prefill the email input when it is not hidden and should be prefilled after the form has be initialized with the help of vanilla js?\nThx for any ideas in advance! :pray:\n\nEDIT:\nFound a fix with vanilla js but it's not a beauty imho :smile:\n\n\n```\ninputElement.value = value;\n!inputElement.dispatchEvent(new Event('change'));\n!inputElement.dispatchEvent(new Event('input'));\n!inputElement.dispatchEvent(new Event('blur'));\n```\n\nThe combination of the 3 event dispatch calls made it work ...",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-06-25 00:42:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Acun Gürsoy",
      "poster_handle": "acun.guersoy"
    },
    "time_stamp": "2019-06-25 00:42:30",
    "edited": {
      "time_stamp": "2019-06-25 00:43:06"
    },
    "text": "Maybe an addition:\nWhen using jquerys function combi `val(...).change()` the prefilling of the email field works.\nWith vanilla js i tried setting the `HtmlElement.value` property and `dispatchEvent(new Event('change'))` afterwards - but that didn't make it :confused:"
  }
]