[
  {
    "poster": {
      "poster_name": "Pablo Jiménez",
      "poster_handle": "pjimenez"
    },
    "time_stamp": "2024-12-03 06:26:39",
    "text": "Hi, are there any plans to implement mutation endpoints for v3 Events API or some kind of alternative? We currently use it to log our conversations with a client using an external app that uses WhatsApp APIs, and this update completely breaks the flow of our HubSpot application.",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-12-03 07:07:24"
      },
      {
        "time_stamp": "2024-12-03 07:21:11"
      },
      {
        "time_stamp": "2024-12-03 08:05:45"
      },
      {
        "time_stamp": "2024-12-03 08:32:33"
      },
      {
        "time_stamp": "2024-12-04 00:42:16"
      },
      {
        "time_stamp": "2024-12-04 04:30:05"
      },
      {
        "time_stamp": "2024-12-12 09:06:25"
      },
      {
        "time_stamp": "2024-12-12 09:06:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lars Osterberg",
      "poster_handle": "losterberg"
    },
    "time_stamp": "2024-12-03 07:07:24",
    "text": "Hi Pablo, we don’t have plans to implement mutation for our v3 APIs, but I’d love to understand what you’re trying to do and figure out a way to model it effectively in HubSpot. Is the issue that you can’t combine the WhatsApp messages into a single timeline event?"
  },
  {
    "text": "Precisely. Every day, whenever we receive or send a new message, we create a single card that will keep updating each time another message is exchanged. If we were to create an event for every new message, this will quickly flood the timeline and would be pretty pointless for our use case.",
    "time_stamp": "2024-12-03 07:21:11",
    "edited": {
      "time_stamp": "2024-12-03 07:24:55"
    }
  },
  {
    "poster": {
      "poster_name": "Lars Osterberg",
      "poster_handle": "losterberg"
    },
    "time_stamp": "2024-12-03 08:05:45",
    "text": "Is there a reason you decided not to use a <https://developers.HubSpot.com/beta-docs/guides/api/crm/engagements/communications|Communication Object>?"
  },
  {
    "poster": {
      "poster_name": "Pablo Jiménez",
      "poster_handle": "pjimenez"
    },
    "time_stamp": "2024-12-03 08:32:33",
    "text": "Users wanted a way to view their conversations on the timeline. Also our app manages multiple telephone numbers, I don't know if we could implement this with Communications API. We could either use Communication objects or create on a cron one Timeline Event at night with the whole chat."
  },
  {
    "poster": {
      "poster_name": "Pablo Jiménez",
      "poster_handle": "pjimenez"
    },
    "time_stamp": "2024-12-04 00:42:16",
    "text": "I've looked up the Communication Object, and something to miss is that on WhatsApp type Objects we can't set the direction of the message (inbound/outbound). We also can not group the conversations by different numbers we may have. We'll probably stick by now creating one card a day, but I feel that this update sets back a bit our app."
  }
]