[
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2024-09-05 12:56:21",
    "text": "Hello Everyone. We’re currently setting up our Shopify Store. I did set up a few in Europe before but the first for the US. If I add the Payment it asks for the SSN of the “Account Holder” even if it’s a Private Company. As Support tells me, that’s a normal thing. How do you handle that with your customers, nobody really wants to give there SSN? Thank You, Thomas.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-05 15:26:06"
      },
      {
        "time_stamp": "2024-09-05 15:28:38"
      },
      {
        "time_stamp": "2024-09-05 17:17:27"
      },
      {
        "time_stamp": "2024-09-06 03:20:50"
      },
      {
        "time_stamp": "2024-09-06 12:34:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-09-05 15:26:06",
    "edited": {
      "time_stamp": "2024-09-05 15:26:21"
    },
    "text": "Hi <@U033VNNBBBP>,\n\nHope you are well today! This is actually something I touch on fairly regularly in Data Protection & Privacy. The simple answer, in this case, is to point your customers to Shopify, as it is their policy, as below:\n\n```When you set up Shopify Payments, you need to enter your tax details. All businesses need to submit a tax ID. If you are a sole proprietor and don't have a tax ID, then you can submit your Social Insurance Number (SIN) or the last four digits of your Social Security Number (SSN) instead.\nIf the tax ID that you submit is not valid, then you have to update it. When you're required to update your tax details, you receive an email from Shopify and a notification appears on the home page of your Shopify admin.```\nFrom: <https://help.shopify.com/en/manual/payments/shopify-payments/configuring-shopify-payments#update-your-tax-details>\n\nUltimately, we always aim to support our customers the best we can but the reality of these scenarios is for their information and their protection you should provide them with the end-source of the conflict zone, which in this case is Shopify's policy, not your own. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-09-05 15:28:38",
    "text": "As a slight additional (and perhaps something light-hearted for this late in the day!) remember, from this famous clip, the end-source for Shopify is the IRS. And not even <https://www.youtube.com/watch?v=G56VgsLfKY4|The Joker> will play games with the IRS. :wink:"
  },
  {
    "text": "Thank You. I can totally see that. The Shop is for our Company as an additional sales channel and we’re a Private Company. But even then I get that one here:",
    "time_stamp": "2024-09-05 17:17:27"
  },
  {
    "poster": {
      "poster_name": "Mastery Seo",
      "poster_handle": "admin026"
    },
    "time_stamp": "2024-09-06 00:22:27",
    "text": "These are my workflow i have tried, but the criteria is met, but i got confusion on action setup, could any help me to do this!"
  },
  {
    "text": "",
    "time_stamp": "2024-09-06 00:23:10"
  }
]