[
  {
    "text": "Good morning together,\nwe are using the `local-hubl-server` together with `HubSpot-cms-cli`. Our goal is to move the template development for HubSpot Landing Pages/ Blogs/ etc. out of the Design Manager and into a local approach + pushing this to github for version control.\n\nMy folder structure:\n• `{root}/HubSpot-cms-cli-project` (Project where templates get developed locally, together with the associated assets (css, img, js)\nHere I have added my theme in the folder structure like: `Templates/hubthemes/[my-theme-folder]`\n• `{root}/local-hubl-server` (Folder where the local-hubl-server is installed and running)\nIn order to use the templates and assets defined in the `HubSpot-cms-cli-project`, I've updated the `templateBaseDir` property `config.yml` of `local-hubl-server` pointing to the `HubSpot-cms-cli-project`.\n\nMy issue :smile: :see_no_evil::\nI am having issues when setting img-references and assets-referencing (like stylesheets) in the templates so that the previews of the template, both local through local-hubl-server and the preview of the template in HubSpot CMS (see picture), are working together.\nSome time around I found the recommendation in the community, to use the file-manager syntax when referring to img's/ assets - then some HubSpot magic would grab and make the job :smile:, so one example of my current img-referencing looks like this:\n`{% image \"header_image\" alt=\"Image Placeholder\" src=\"/file_manager/img/img-placeholder.png\" no_wrapper=True %}`\nWorks locally but not after uploading to HubSpot.\n\nHas someone else experienced this problem? And if not, how did you setup your local environment so that the referencing you use in the template works for both local and live previews? Do I need to respect some specific folder structure or can I configure the hubl-server in a way that it works like the preview in HubSpot CMS? Happy about your thoughts guys! :pray:",
    "time_stamp": "2019-12-19 01:53:01",
    "edited": {
      "time_stamp": "2019-12-19 01:54:21"
    }
  }
]