[
  {
    "text": "Hello everyone! :sunglasses:\n\nColleague of mine and I are working on a new project that was done by previous developers, and we have ran into the following problem:\n\n• There are two identical search-results.html files in the database and while one redirects and displays search results, the other uses the same parameter but has no relevant search on its domain and webpage (_shown in the two screen recordings attached_). \nAny idea what would be the best possible solution for this? :thinking_face:\n\nI would really appreciate if you could share any examples of your solutions for this kind of a problem, or similar. Thanks! :pray:",
    "time_stamp": "2024-07-17 01:39:32",
    "edited": {
      "time_stamp": "2024-07-17 01:41:06"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-17 12:58:11"
      },
      {
        "time_stamp": "2024-07-22 04:38:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:31:52",
    "text": "This is a more complex/different approach, but I wrote this set of functions that take advantage of the JS `dispatchEvent` handler, and combines it with a field map and a data map - <https://gist.github.com/robertainslie/32d786d7254ec7bc6cbbff3d1e292cd4>\n\nThe use case is taking data from something like Dunn &amp; Bradstreet / firmographic data, which return key:value pairs of fields and data. If you supply a field map (i.e. this DUNS field = this HubSpot field), it then takes the DUNS object and writes to any matching HS form field"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-07-17 12:32:32",
    "text": "it's a little more scaleable if you're going to be doing this alot"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-07-17 12:58:11",
    "text": "Unfortunately, I’m not sure if there’s quite enough information here to be able to track this issue down. We’d probably need to be able to look at both the template source *and* the rendered page to be able to tell.\n\nA few potential things do come to mind/stick out to me from what we can see here:\n• Search results pages can be dependent on being set as the “Search results” page for that domain to display their content. (*Settings &gt; Pages &gt; System Pages &gt; Search Results*) Make sure the template you’re looking at is set correctly.\n• I notice that on the page where results aren’t rendering, the search header isn’t displaying either. It might be worth doing some debugging to confirm whether there’s something from preventing page content from rendering entirely.\n• I also notice that the header and background seem to persist across pages on the Xiphos site. Is it running as an SPA? I believe that HS search requests require a full page load, since the page content is rendered based on request header data. If you’re running as an SPA, try setting up your router to force a full reload on that specific path."
  },
  {
    "poster": {
      "poster_name": "Rushik vaghasia",
      "poster_handle": "rushikvaghasiya21"
    },
    "time_stamp": "2024-07-18 00:31:09",
    "text": "<@UEQQ2AGEP> How do you generate the Dynamic nonce value? I implemented the Content security policy and My anaytics and other external scripts not working,"
  }
]