[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-03 02:14:12",
    "text": "It's not possible"
  },
  {
    "poster": {
      "poster_name": "Anna Zrust",
      "poster_handle": "azrust"
    },
    "time_stamp": "2024-07-03 09:43:39",
    "edited": {
      "time_stamp": "2024-07-03 09:45:54"
    },
    "text": "Hi Everyone\n\n*Is there a way to load HubSpot Forms with JS not as embeds?* :party_think:\n\nMore info:\n• We are trying to optimizing our page and HubSpot v2.js script for forms is receiving lot of penalization from PageSpeed\n• We tried to load the forms after the main content is resolved, but the result is form wrapped in iframe. We are looking  for solution which would insert the code in a similar way HubSpot form tag does `{% form \"my_form\" form_to_use='{{module.form_field.form_id}}' %}` \n```/* Solution we tried for inserting forms*/\nhbspt.forms.create({\n  portalId: portalId,\n  target: formPlaceholderId,\n  formId: formId,\n});```\n• On our page we are heavily editing styles of the forms, so using embeds removes this option from us. ",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-03 15:21:55"
      },
      {
        "time_stamp": "2024-07-03 15:23:53"
      },
      {
        "time_stamp": "2024-07-04 02:06:23"
      },
      {
        "time_stamp": "2024-07-04 06:12:06"
      }
    ]
  },
  {
    "text": "you can create a custom setup to lazy load the script.\n\nYou can also just not use HubSpot forms, create your own HTML, then send to the forms api.\n\nInside your form — do you have an option similar to this\nmight need to get that setting correct as well.\n\nIf you dig more into the form embed options <https://legacydocs.HubSpot.com/docs/methods/forms/advanced_form_options> I think at one time I used the css or cssClass options in there and that also prevented the iframe (but it has been a really long time since I’ve needed to mess with these)",
    "time_stamp": "2024-07-03 15:21:55"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-03 15:23:53",
    "text": "Also, I’m just going to address this as well. If you need a page to be performant because you are trying to rank for it, then that will be a page that receives incoming traffic. Instead of putting the form on the page, take the users through a journey. Get them to click to another page, then fill out the information. This creates a journey you can track, it creates engagement for google analytics to see, and it fixes the need to optimize around a form —\n\nI personally like to load a form when a user clicks a button if I’m trying to keep them on the same page and have the best of all worlds."
  }
]