[
  {
    "text": "Hello all\n\nWe tried integrating the IP Address extraction and then inserting into a HubSpot form IP Address field earlier today without success.\n\n*The steps we took and results:*\n1. Add the form to the website via the hbspt.forms.create() function.\n2. Trigger the fetch and inject IP Address functionality via the fetchIPAddress() function. I added a 10 second delay to this to ensure the form is loaded.\n*Results, outcome and testing:*\n1. After 10 seconds we can see the IP address being fetched and returned, there after we get an error that the IP Address field could not be found. Please see screenshot 1. This made me think it might be because the form is embedded via an iFrame.\n2. We then tried to embed the form as Raw HTML by making the form as Raw HTML in HubSpot. Unfortunately the results were the same. This made us think that due to security the Javascript responsible for injecting the IP address into IP Address input field can not do so as it will be a security risk.\n3. To test we created a simple form with a singular field in it and gave it the \"ipaddress\" name. Please see screenshot 2.\n4. When the fetchIPAddress() function is now triggered after 10 seconds we can see the IP address being fetched and then populating the temporary IP address field that we created. Please see screenshot 3.\n5. We looked through a number of resources but didn't get any closer to get it working.\n6. Please note that the capturing of IP addresses works perfectly on HubSpot landing pages, but what we tried to do here is integrate on a WordPress site page.\n*Links:*\nThe page with the embedded form, temp IP address field and IP address capturing and the form manipulation script link: <https://nationaldebtcounsellors.co.za/ttest/>\n\n*What we need:*\nPlease help us with ways in which we can embed a HubSpot form and then manipulate it to add the IP address data to the IP address hidden field.\n\nAll the best\nNikolai",
    "time_stamp": "2024-07-19 05:47:23",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-24 06:23:59"
      }
    ]
  }
]