[
  {
    "poster": {
      "poster_name": "Ahmed Jamal Tariq",
      "poster_handle": "ahmed.jamal.tariq"
    },
    "time_stamp": "2023-09-01 02:32:09",
    "text": "I have workflow where I chose custom code as action and I have node script which manipulates HubDB. All of the sudden I start getting this error `ERROR\tTypeError: HubSpotClient.cms.hubdb.rowsBatchApi.purgeDraftTableRows is not a function` . Everything still works fine on my local environment. any idea what's wrong?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-01 11:53:07"
      },
      {
        "time_stamp": "2023-09-01 12:04:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Vaibhav Awachat",
      "poster_handle": "vaibhav787"
    },
    "time_stamp": "2023-09-01 07:33:04",
    "text": "The custom action is not visible in spite of using a test account associated with the app.\n\n• I created a custom action for an app and installed the app in a test account.\n• The custom action is not visible when setting the workflow in the test account. \n• The documentation mentions the developer portal for testing. However the developer account doesn't have an option to create workflow.\nWhat am I missing here? Do I need to publish the app to test it on the test account associated with the app?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-29 03:00:09"
      },
      {
        "time_stamp": "2023-09-30 17:10:58"
      },
      {
        "time_stamp": "2023-10-04 07:30:44"
      },
      {
        "time_stamp": "2023-10-04 07:37:06"
      },
      {
        "time_stamp": "2023-11-01 06:53:08"
      }
    ]
  },
  {
    "text": "Hello everybody,\nI am creating a custom workflow action, My actions will have some input fields, one of those input field will be a dropdown of property list. Now in that field I need a list of all object(selected trigger) properties.  Currently I am using \"supportedValueTypes\": [\"OBJECT_PROPERTY\"], but this field return me selected property value not the label. I need a selected label (Property name) name. Can anyone please help me on this?",
    "time_stamp": "2023-09-01 07:39:34"
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-09-01 11:53:07",
    "edited": {
      "time_stamp": "2023-09-01 11:55:30"
    },
    "text": "could be running an outdated version of the api client locally. Or - you have an older/newer/different version being loaded into your coded action node. Try toggling between the v3 and v8 in the dropdown directly to the right of the ‘full screen’ button at the top of the code editor. Pretty sure the 2 use different versions of the client. Thinking that’s the most likely source of your issue."
  },
  {
    "poster": {
      "poster_name": "Ahmed Jamal Tariq",
      "poster_handle": "ahmed.jamal.tariq"
    },
    "time_stamp": "2023-09-01 12:04:48",
    "text": "I tried toggling between v3 and v8, same error"
  },
  {
    "poster": {
      "poster_name": "Jordan Ryken",
      "poster_handle": "jordan.ryken"
    },
    "time_stamp": "2023-09-01 18:11:31",
    "text": "Hey everyone - <http://drafter.ai|Drafter AI> is making a new tool (that already works, but we're cleaning and refining it) which generates perfect custom code actions for HubSpot (e.g. workflows) based on natural language (e.g. \"make a code that takes a contact and does xyz\"). I'm manually processing a few hundred pages of documentation pulled from the api documentation webpages. Does anyone have a clean download of the entire API and CMS documentation that could save me a few hundred hours of time?\n\n:bulb: *Feel free to @ anyone at HubSpot who might be able to help!* :bulb:\n\n• The first tool generates custom code actions from natural language\n• The second debugs custom code actions for a given code and execution log\n• The third (in progress) will convert custom code actions into custom workflow actions ready to put on the marketplace\nCUSTOM CODE ACTION AND CUSTOM WORKFLOW ACTION EXAMPLES ARE ALSO VERY HELPFUL",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-06 06:55:54"
      }
    ]
  }
]