[
  {
    "poster": {
      "poster_name": "Camille Biscay",
      "poster_handle": "camille.biscay"
    },
    "time_stamp": "2023-09-08 01:01:42",
    "text": "I want to merge contacts if they have the same firstname, lastname AND company. IS it not what this does?"
  },
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-08 01:40:28",
    "text": "<@U058ZPH175H>\nYeah, I see, but I'm looking for how to track events. I mean, when a customized event is handled locally, I want to send a notification to HubSpot and then send an email to the contact related to this event. Is that possible with your suggestion?"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2023-09-08 07:29:08",
    "edited": {
      "time_stamp": "2023-09-08 07:29:10"
    },
    "text": "Are you talking about Timeline events?"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2023-09-08 07:30:54",
    "text": "So just for the ease of understanding. You want for example a click in the third party app, and that click should trigger an email to said contact in HubSpot?\nAre you sending any data, is there any data that needs to be added inside the email?\nMy best suggestion is to set up a workflow, based on a \"Send Email\" field, that is being set by the api inside the third party app"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2023-09-08 07:31:27",
    "text": "You can't view secrets indeed, you can only edit them"
  },
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-08 13:04:40",
    "text": "<@U046C9LKJP8> No, there isn't any specific data. I only want to include the email address of the contact to whom we will send the email from the workflow. I have already created a workflow in my HubSpot account. However, the issue I've encountered is how to send a notification from my Laravel app to HubSpot (I have integrated HubSpot into my local app) in order to trigger the email send action within the workflow"
  }
]