[
  {
    "text": "Hello\nI'm trying to use Accounting Extension to integrate an accounting app with HubSpot user's account.\n\nI've followed the documentation for CRM accounting extension but I'm stuck\n1. I've authorized the accounting app with newly created test account on HubSpot\n2. I've created a user account using CRM user account api and then called settings api as well for webhook URLs setup and all worked well.\n3. But when I go to my connected apps under settings and click on the accounting app which I've just connected always show unavailable and I don't get any info on internet to get through this.\nAny help or document or links will be great to move forward.\nThanks",
    "time_stamp": "2021-05-24 04:34:32"
  },
  {
    "poster": {
      "poster_name": "Amanda",
      "poster_handle": "amanda.petersen"
    },
    "time_stamp": "2021-05-24 09:15:51",
    "edited": {
      "time_stamp": "2021-05-24 10:57:28"
    },
    "text": "Hello Everyone,\nI'm wondering if there's a good way to target iOS devices specifically in my CSS file. My navigation menu is rendering differently between iOS and Android devices (specifically the\n`left: 50%` piece). I've tried a few standard methods (see below), but they haven't worked... so I'm looking for some other ideas. Here is a link to the nav menu: <https://www.attigo.com/>\n```@supports (-webkit-touch-callout: none) {\n  .mobile-header-container-new button#mobile_menu {\n    right: 0.5rem;\n  }\n}```\nThank you in advance!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-24 10:00:18"
      },
      {
        "time_stamp": "2021-05-24 11:01:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-24 10:00:18",
    "edited": {
      "time_stamp": "2021-05-24 10:00:35"
    },
    "text": "If you post a link so folks can see the navigation menu, they may be able to help better.\n\ntargeting CSS based on browser or device type should be a last resort. It’s likely that the `appearance` value of an element should be set to none, to prevent the iOS default control being used in your case."
  },
  {
    "poster": {
      "poster_name": "Amanda",
      "poster_handle": "amanda.petersen"
    },
    "time_stamp": "2021-05-24 11:01:34",
    "text": "Thanks, that's a good tip! I will take a look at the appearance value and see where that gets me :slightly_smiling_face:"
  },
  {
    "text": "hello all , i have created an app and it is live in app marketplace but i want to change one thing inside its crm card i.e. powered by all in one sms =&gt; powered by webdew.where \"webdew\" is my company name and \"all in one sms\" is my app <http://name.it|name.it> is by default showing the the app name i want to change it's name to company name .can anybody tell me how can i do that.i am sharing my app crm card screen shot . please have a look .Thanks!",
    "time_stamp": "2021-05-24 22:31:57"
  },
  {
    "poster": {
      "poster_name": "Niranjan Reddy",
      "poster_handle": "reddy"
    },
    "time_stamp": "2021-05-24 23:17:59",
    "text": "Does anyone built #PWA ( Progressive Web App) on HubSpot CMS. TYI",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-05-25 06:52:06"
      },
      {
        "time_stamp": "2021-05-25 08:33:13"
      },
      {
        "time_stamp": "2021-05-25 09:13:29"
      },
      {
        "time_stamp": "2021-05-25 09:17:10"
      },
      {
        "time_stamp": "2021-05-25 10:45:22"
      }
    ]
  }
]