[
  {
    "poster": {
      "poster_name": "Adam Leach",
      "poster_handle": "adam879"
    },
    "time_stamp": "2021-05-18 09:35:20",
    "edited": {
      "time_stamp": "2021-05-18 09:38:29"
    },
    "text": "Does anyone know a way to transfer web pages from one account to another? We have a tonne of pages built in one portal and need them moving to another. We can move the theme but is there a way to export/import the page content?"
  },
  {
    "poster": {
      "poster_name": "Katherine Man",
      "poster_handle": "kman342"
    },
    "time_stamp": "2021-05-18 10:18:40",
    "text": "glad to hear it!"
  },
  {
    "poster": {
      "poster_name": "Sean Henri",
      "poster_handle": "sean615"
    },
    "time_stamp": "2021-05-18 13:53:41",
    "text": "FYI <@U01FCEDD28Y>"
  },
  {
    "text": "Hey all, i am new to using HubSpot\nI want to ask how to make the template that I created can be published (edited) \nIs this the template I made, but the website page doesn't appear?\nWhat is the solution, maybe because I just don't understand",
    "time_stamp": "2021-05-18 19:12:48"
  },
  {
    "poster": {
      "poster_name": "Mainak Deb",
      "poster_handle": "mainakmayukh2000"
    },
    "time_stamp": "2021-05-18 22:53:53",
    "edited": {
      "time_stamp": "2021-05-19 11:28:39"
    },
    "text": "Hi <@UNQ6UDGSJ>, I had submitted a case study to the HubSpot Inspire page, but I am not able to find it on the inspire website, even after a 5 hour wait, I didn't receive any sort of a confirmation mail. Is this delay normal? or should I submit my case study again?\n\nThe name of the project submitted is - AgroAssist",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-19 00:22:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-18 23:33:21",
    "text": "HI all, if couple of devs edit the same page in the design tool, the changes are sometimes not saved. how can couple of devs work on the same project in the design management tool? any ideas?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-19 09:40:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Varun",
      "poster_handle": "contact537"
    },
    "time_stamp": "2021-05-18 23:54:21",
    "text": "hello, it's been more than 24 hrs since I opened the HubSpot dev account and tried to verify our domain via the DNS we have on AWS. It just's yet to go through and I know it typically doesn't takes this long to verify domain. Anyone has experience with AWS for addition of that TXT record?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-05-19 00:22:06",
    "text": "On the same note, our project is already <https://devpost.com/software/agroassist|live on devpost> and we submitted the form successfully about 8 hours ago.  But we did not see our website come up in the <https://designers.HubSpot.com/inspire|HubSpot inspire page> yet, and neither did I get any confirmation mail (if any).\n\nWe're not sure why this is happening, any help would be welcome.  Thanks."
  }
]