[
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2021-05-04 10:08:56",
    "text": "Quick question for the group -- is there documentation anywhere regarding the cache policy management from the HubSpot side? We are attempting to provide context for a client and haven't been able to find information from an official source as to how the cache policies are determined. Google Page Speed is dinging us for images that have the 14-day refresh in place and we need to be able to better contextualize the 14-day setting for our client.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-04 10:09:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2021-05-04 10:09:54",
    "text": "cc <@U0189NXRP1U>"
  },
  {
    "poster": {
      "poster_name": "T-ray",
      "poster_handle": "tracyreuther"
    },
    "time_stamp": "2021-05-04 14:45:41",
    "edited": {
      "time_stamp": "2021-05-04 14:46:06"
    },
    "text": "Hello <#C22PU4LV8|general>, Does anyone know if there is a way to trigger an alert message when a user hits the submit button on a form before submission completes? I have a custom module with an input field that i want to make required for the user. This input is NOT and CANNOT be part of the form. It has to be in this module on the page. Or if no change to input, then trigger alert?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-04 14:48:26",
    "text": "Hey Jon, this is you from the future. You work at HubSpot now. You’re on the team that does a lot of the doc writing. I know weird right, you wanted to edit the docs, well you’re gonna do it. Anyways, we added a feedback form. Is this good enough for you?\n<https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1620160960121800>"
  },
  {
    "poster": {
      "poster_name": "Chris Reynolds",
      "poster_handle": "chris.reynolds"
    },
    "time_stamp": "2021-05-04 16:40:09",
    "text": "Was there any new deploys today that would affect webhook triggers? My OAuth app just got spammed 30K+ times by only 2 users, which then took my server down :thinking_face:"
  }
]