[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-25 06:52:06",
    "text": "Yes, I’ve seen folks do it a few times. I don’t know if I have permission to share some of the examples I’ve seen, but I will check if I can link out to one as an example"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-25 08:33:13",
    "text": "I got permission to share this one:\n<https://crypto-keeper.io>"
  },
  {
    "poster": {
      "poster_name": "Randeep Singh",
      "poster_handle": "randeep.s"
    },
    "time_stamp": "2021-05-25 08:45:43",
    "text": "Hello all,\n\nHow I can update custom object inner record using HubSpot api? can you please help me.\n\nThanks !!"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-05-25 09:13:29",
    "text": "Cool <@U7SL518D6>! Can you elaborate on how this interfaces with HubSpot CMS? Always interested to see how people are handling that architecture."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-25 09:17:10",
    "text": "PWAs are mostly a front-end thing. They basically added a service worker js file and a manifest.\n\nTo make an installable PWA your serviceworker needs to at least be able to provide a basic offline HTML page when not connected to the internet. For that page you should put all of your CSS, images and JS in the HTML itself to make it easier to serve that page. Once you’ve got that and want to go more complicated there are some libraries you might be able to use that make building more sophisticated service workers easier. I’d suggest looking into them, as it’s very easy to accidentally build a service worker that kinda borks your PWA, if you’re not careful."
  },
  {
    "poster": {
      "poster_name": "Niranjan Reddy",
      "poster_handle": "reddy"
    },
    "time_stamp": "2021-05-25 10:45:22",
    "text": "Thanks <@U7SL518D6>  for the information "
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-05-25 12:22:14",
    "text": "What's new about the new custom events feature?"
  },
  {
    "poster": {
      "poster_name": "Cameron Taljaard",
      "poster_handle": "cameronstaljaard"
    },
    "time_stamp": "2021-05-25 17:47:28",
    "text": "Does the edit this template option work for adjusting margins on drag and dropped in components that aren't a part of the template itself?"
  }
]