[
  {
    "poster": {
      "poster_name": "Lari",
      "poster_handle": "laricsmartins"
    },
    "time_stamp": "2024-06-28 07:47:53",
    "text": "Hi Raman, thanks. That’s what I thought, doing it with cookies or local storage. But do you have any idea of how can I display the form when the user clicks to watch the video? the video can only be watched after submitting the form. <@UUX58C0S3>"
  },
  {
    "poster": {
      "poster_name": "Erick Barrantes",
      "poster_handle": "erick850"
    },
    "time_stamp": "2024-06-28 08:40:06",
    "text": "Hi all, I have a quick question about using React with CMS for serverless.. can this be used with all Content Hub accounts or just Enterprise?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-28 23:25:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2024-06-28 22:46:37",
    "text": "Hi <@U077H4064AV>,\n\nYes, we can use cookies for this.\n\nSteps:\n1. First, create a cookie variable.\n2. When the user clicks on the video, check if the cookie variable is empty. If it is empty, display a pop-up form where the user can fill in their details such as first name, last name, email, and so on.\n3. Once the form has been submitted, set the cookie variable to true and refresh the page.\n4. Now, when the same user clicks on the video again, check the cookie variable. If the cookie variable is set, you don’t need to show the form, and the video will play automatically.\n\nFor further discussion, we can connect via email at <mailto:ramanverma2005@gmail.com|ramanverma2005@gmail.com>."
  },
  {
    "text": "Hi <@U079R9Y1SA2> you should have Content Enterprise account only\n\n<https://developers.HubSpot.com/docs/cms/guides/getting-started-with-serverless-functions>",
    "time_stamp": "2024-06-28 22:48:10"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2024-06-28 23:25:56",
    "text": "It of-course need Enterprise but If you are using serverless functions from UI extensions, you can do it with either Sales Hub, Service Hub or or CMS hub Enterprise.\n\n<https://developers.HubSpot.com/docs/platform/serverless-functions>"
  }
]