[
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-15 18:44:52",
    "text": "Does anyone know if there’s a way to retain semantic markup in the Rich Text module/Rich Text fields when using custom fonts in a theme?\n\nWhen using a default font, or one available via Google Fonts, functionality like Bold and Italic use semantic markup — they’ll add a `&lt;strong&gt;` or `&lt;em&gt;` tag, respectively. However, in my themes which use custom fonts, the bold and italic buttons are disabled entirely; the only way to change slant and weight variants is via the font dropdown. This means that all changes to font styling are applied using the style attribute on `&lt;span&gt;`s, which poses a few issues:\n\n1. Any sort of emphasis or differentiation applied to text is rendered completely invisible to assistive technology and other non-sight-based methods of interaction. While it won’t completely inhibit the usage of a site, this still unquestionably provides a degraded and *less complete experience for users of assistive technologies.*\n2. It provides a *significantly worse editor experience*. Editors are no longer able to use the familiar Ctrl+B/Ctrl+I shortcuts for formatting text — instead, they have to select it from the “Change font” menu, which is a whole mess of its own. _(unintuitive relocation of core editing functionality, buggy and disordered selection flyouts, improper font rendering — I could go on.)_\n3. It complicates font handling and typesetting from a development standpoint, since it basically goes bull-in-china-shop on any styling we’ve defined, inserts excessive and messy markup, and is messy/inconsistent to target via CSS or JS.\nAs it stands, the best workaround I’ve identified is to avoid using any built-in custom font functionality, and to instead use a standard `@font-face` import. This re-enables bold and italic functionality, but comes with its own set of editor experience drawbacks.\n\nIt seems like this is just a hard-and-fast limitation, but I’m double-checking to be sure I’m not missing some obscure documentation page or undocumented feature/restriction.",
    "reply_count": 33,
    "reply_users_count": 6,
    "replies": [
      {
        "time_stamp": "2023-09-22 13:07:43"
      },
      {
        "time_stamp": "2023-09-22 13:12:20"
      },
      {
        "time_stamp": "2023-09-22 13:14:08"
      },
      {
        "time_stamp": "2023-09-22 13:16:14"
      },
      {
        "time_stamp": "2023-09-22 13:20:21"
      },
      {
        "time_stamp": "2023-09-22 13:21:08"
      },
      {
        "time_stamp": "2023-09-22 13:22:35"
      },
      {
        "time_stamp": "2023-09-27 09:19:07"
      },
      {
        "time_stamp": "2023-09-29 10:11:51"
      },
      {
        "time_stamp": "2023-09-29 10:13:01"
      },
      {
        "time_stamp": "2023-09-29 10:15:15"
      },
      {
        "time_stamp": "2023-09-29 10:16:29"
      },
      {
        "time_stamp": "2023-09-29 10:18:25"
      },
      {
        "time_stamp": "2023-11-28 10:07:12"
      },
      {
        "time_stamp": "2023-11-28 10:09:17"
      },
      {
        "time_stamp": "2024-03-11 12:38:51"
      },
      {
        "time_stamp": "2024-03-11 12:40:50"
      },
      {
        "time_stamp": "2024-03-11 12:43:58"
      },
      {
        "time_stamp": "2024-03-11 12:51:40"
      },
      {
        "time_stamp": "2024-03-11 12:52:31"
      },
      {
        "time_stamp": "2024-03-11 12:53:05"
      },
      {
        "time_stamp": "2024-03-11 12:53:28"
      },
      {
        "time_stamp": "2024-03-11 12:54:06"
      },
      {
        "time_stamp": "2024-03-11 12:54:19"
      },
      {
        "time_stamp": "2024-03-11 12:54:21"
      },
      {
        "time_stamp": "2024-03-11 12:54:24"
      },
      {
        "time_stamp": "2024-03-11 12:54:47"
      },
      {
        "time_stamp": "2024-03-11 12:55:06"
      },
      {
        "time_stamp": "2024-03-11 12:57:05"
      },
      {
        "time_stamp": "2024-03-11 12:57:16"
      },
      {
        "time_stamp": "2024-03-11 12:57:19"
      },
      {
        "time_stamp": "2024-03-11 12:57:42"
      },
      {
        "time_stamp": "2024-03-11 12:57:42"
      }
    ]
  }
]