[
  {
    "poster": {
      "poster_name": "Jaivardhan Dalal",
      "poster_handle": "jai.palmspire"
    },
    "time_stamp": "2023-08-07 02:47:22",
    "text": "Hi all,\nCan we create a theme using React in HubSpot?\nIf yes, could you please share the documentation of react theme?\nThanks in advance!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-10 14:31:36"
      },
      {
        "time_stamp": "2023-08-10 21:33:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-08-07 07:21:08",
    "text": "Yeah that's a bit confusing, but as web pages and landing pages are merely an organizational element in your portal, you can create a website page using your landing page template... so you can still access it... it just won't reside under \"landing pages\"."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-07 07:23:05",
    "text": "Ya, we explained that option, it still doesn't make sense why LPs can't access a theme's assets"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-08-07 07:59:57",
    "text": "I think that was a more recent change. Not a fan, but I think it's a \"is what it is\" scenario that gives a little nudge to upgrade your account. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2023-08-07 10:04:45",
    "text": "Sorry if this is a very basic question, but I’m having problems locating the reusable sections of a purchased theme. Not finding them in the design manager.\n\nAlso, I know saved sections don’t updated throughout the site, but do reusable sections? Thanks!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-07 11:22:02"
      },
      {
        "time_stamp": "2023-08-07 14:50:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-08-07 11:22:02",
    "text": "Hey when you click the + button to add a section, you'll see your saved sections on the right... and then UNDER yours will be \"Theme sections\". Same location, just separated. This is assuming your theme includes sections. It is required for themes in the marketplace now, but your theme could be older and not include them.\n\nSections are not global though, so they are just like a template. It gives a starting point that you can edit. The only elements that would be edited in one place and update throughout the site would be global content, like your header/footer. You can setup a custom module to be global so the contents of that module are the same every where it is used. But not an entire section, although your section could include a global module."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-07 14:50:14",
    "text": "if you're looking in Design Tools, there should be a folder in the theme called sections with HTML files - similar to how there are folders for modules and templates.\n\notherwise, as Nathan mentioned, you'd access them via the DnD editor"
  }
]