[
  {
    "poster": {
      "poster_name": "Pooja Bhimani",
      "poster_handle": "pooja.bhimani121"
    },
    "time_stamp": "2020-10-09 02:51:35",
    "text": "Hello All , I am developing custom module for portfolio and would like to add tag field in that where user can add multiple tag to their work.I have no idea which field is suitable for this can anyone give some hint on this?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-09 04:07:16"
      },
      {
        "time_stamp": "2020-10-10 02:30:02"
      },
      {
        "time_stamp": "2020-10-12 04:06:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2020-10-09 04:07:16",
    "edited": {
      "time_stamp": "2020-10-09 04:08:04"
    },
    "text": "in my opinion use hubDb to make portfolio section, there user can have the opportunity for multiple selection of tag"
  },
  {
    "poster": {
      "poster_name": "Vincent Rose",
      "poster_handle": "rose187"
    },
    "time_stamp": "2020-10-09 08:23:21",
    "text": "I’m stumped at what’s going on. I have a module with a boolean field that shows or hides content in . The module preview works as expected, and previewing the landing page with the Preview button shows the proper behavior. Reloading the page with the browser button also shows the change. However, while editing the content, when I show or hide content with the Boolean, the Preview on the right doesn’t always update.  Is there a click event that I could listen for in the module to trigger a reload of the Preview panel on the right?"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2020-10-09 08:24:13",
    "text": "after you click apply?"
  },
  {
    "text": "Apply works fine, but backs them out of the module’s content entry if that makes sense. Sometimes the attached booleans update the Preview on click and sometimes they don’t update the Preview. It works inconsistently so it seems buggy to the client. Works as expected in the module preview though. There aren’t any javascript errors either. It’s like it just dies or only fires once to update the Preview.",
    "time_stamp": "2020-10-09 08:44:01"
  },
  {
    "text": "Here is how the module preview looks. Show Form Image Column == true",
    "time_stamp": "2020-10-09 08:48:21"
  },
  {
    "text": "Here is how the module preview looks. Show Form Image Column == false",
    "time_stamp": "2020-10-09 08:48:44"
  },
  {
    "text": "And here is what is happening during the content entry preview unless the user hits Apply. It’s a small but annoying behavior. Show Form Image Column == false on the left, but the right panel doesn’t update",
    "time_stamp": "2020-10-09 08:50:53",
    "edited": {
      "time_stamp": "2020-10-09 09:15:38"
    }
  },
  {
    "text": "How do you hide the opacity option for the color picker from the user?",
    "time_stamp": "2020-10-09 10:56:51",
    "edited": {
      "time_stamp": "2020-10-09 10:57:02"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-10-12 10:53:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "MiradeWeb",
      "poster_handle": "miracledev0303"
    },
    "time_stamp": "2020-10-09 10:58:39",
    "text": "Is there anyway to make the image alt text required in module fields?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-09 11:32:31"
      },
      {
        "time_stamp": "2020-10-09 11:33:21"
      },
      {
        "time_stamp": "2020-10-09 11:41:08"
      },
      {
        "time_stamp": "2020-10-09 11:42:58"
      },
      {
        "time_stamp": "2020-10-09 11:43:37"
      },
      {
        "time_stamp": "2020-10-09 11:54:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-09 11:32:31",
    "text": "Is there ever a time that the image would be presentational and not critical content? If so, it’s actually fine to allow empty alt"
  },
  {
    "poster": {
      "poster_name": "MiradeWeb",
      "poster_handle": "miracledev0303"
    },
    "time_stamp": "2020-10-09 11:33:21",
    "text": "Does it not affect SEO?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-09 11:41:08",
    "text": "First and foremost. Alt text’s primary purpose is for accessibility. It exists so that screen readers can relay to users using assistive tech what the image conveys. There are times such as presentational images, where it doesn’t make sense to convey to the user anything about the image. Example: an image that shows a visual lens flare. It has no relevance to the content, it is just there to make it visually look nice. Having alt text would result in the screen reader going “Hey there’s an image here, it says it’s a camera like lens flare, with glowing rays radiating from it”\n\nEspecially to a blind person that alt text would make them go “Great, I have no idea what a lens flare is, glowing isn’t a concept that means a lot to me and I have no idea why that relates to this article about the product I’m learning about”.\n\nSecondly from the SEO perspective, take that same example: What does that presentational image have to do with your product/service? It likely would bring no value SEO wise to you as no one looking for your product/service is searching for “Cool lens flare”.\n\nBecause of this, providing an empty alt text saves both the a11y side, and the confusion that it might cause a search engine."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-09 11:42:58",
    "text": "hopefully that made you laugh a bit but it’s the truth. To learn more about alt text this is a great article <https://www.a11yproject.com/posts/2013-01-14-alt-text/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-09 11:43:37",
    "text": "If you’d like to learn more about accessibility, I also highly highly encourage checking out our own article on it:\n<https://developers.HubSpot.com/docs/cms/developer-reference/accessibility>"
  },
  {
    "poster": {
      "poster_name": "MiradeWeb",
      "poster_handle": "miracledev0303"
    },
    "time_stamp": "2020-10-09 11:54:47",
    "text": "Thanks for your great information!"
  },
  {
    "poster": {
      "poster_name": "Caleb Bertsch",
      "poster_handle": "caleb762"
    },
    "time_stamp": "2020-10-09 14:16:12",
    "text": "Hi all - is there any way (without using webpack) to have HubSpot bundle all the CSS for modules into one file? Instead of having a dozen small CSS files loaded into the page. TYIA"
  }
]