[
  {
    "poster": {
      "poster_name": "Zach Aysan",
      "poster_handle": "zach.aysan"
    },
    "time_stamp": "2024-08-23 07:35:11",
    "text": "Hi everyone! I'm new to the Slack :slightly_smiling_face:\n\nWe're working on connecting our data into our Contact which we've created using the python client, but we're missing some context. It looks like submitting a form can solve this so I've successfully been able to submit an API request to create a new form submission with the HubSpotutk (aka, hutk) parameter in the API's context field. I understand that this should be able to link up data that we're currently losing but I'm unsure where to check in the HubSpot dashboard that sending the HubSpotutk token actually impacts tracking a customer.\n\nAny advice?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-23 08:56:23"
      },
      {
        "time_stamp": "2024-08-23 08:58:02"
      },
      {
        "time_stamp": "2024-08-23 09:00:54"
      },
      {
        "time_stamp": "2024-08-23 09:01:04"
      },
      {
        "time_stamp": "2024-08-23 09:03:01"
      }
    ]
  },
  {
    "text": "Hi <@U07J5RP3YCV>,\n\nWelcome to Slack! Having used it for a few years now, I've found it's a great little tool for collaboration and easy on the eyes to boot.\n\nThe way to check if your HUTK has been successful is to simply go to your Contact and check the \"Activities\" tab. If someone is navigating around your site and such with that token, you'll see it as a page view.",
    "time_stamp": "2024-08-23 08:56:23"
  },
  {
    "text": "You can also navigate to \"Reporting\" &gt; \"Reports\" &gt; \"Traffic\" and then filter to \"Page views/session\" if you want to see some more global tools.\n\nHope this helps!",
    "time_stamp": "2024-08-23 08:58:02"
  },
  {
    "poster": {
      "poster_name": "Zach Aysan",
      "poster_handle": "zach.aysan"
    },
    "time_stamp": "2024-08-23 09:00:54",
    "text": "Thank you for the advice <@U07DPM31V1N>!"
  },
  {
    "poster": {
      "poster_name": "Zach Aysan",
      "poster_handle": "zach.aysan"
    },
    "time_stamp": "2024-08-23 09:01:04",
    "text": "I thought that may be the cause but I wasn't sure."
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-08-23 09:03:01",
    "text": "No problem at all. Happy to help."
  },
  {
    "poster": {
      "poster_name": "Rea Lopez",
      "poster_handle": "revangelinec"
    },
    "time_stamp": "2024-08-23 10:39:56",
    "text": "support said the cart module by shopify not available for editing in the design manager :disappointed: If anybody here have any leads for its documentation, how it's coded, please let us know!"
  },
  {
    "poster": {
      "poster_name": "bspaulding",
      "poster_handle": "bspaulding"
    },
    "time_stamp": "2024-08-23 13:18:15",
    "text": "Hello, looking for some help with an enterprise portal with multiple websites hosted in the same portal - anyone have any experience doing this  - i have started building 2 sites already but have some questions re: segmenting content and objects for each corresponding domain. Thanks in advance.\n\nAlso ran into an issue where i can only have one child theme per portal  - i have currently 2 websites with plans for minimum 4, using themes from the marketplace and attempting to customize each one doesn't seem like it will be doable. Any ideas?\n\nAny insights and guidance is much appreciated.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-28 17:39:06"
      },
      {
        "time_stamp": "2024-08-28 18:18:08"
      },
      {
        "time_stamp": "2024-08-28 18:21:32"
      }
    ]
  }
]