[
  {
    "poster": {
      "poster_name": "Fredrikke Eriksson",
      "poster_handle": "fredrikke.eriksson"
    },
    "time_stamp": "2024-08-26 09:06:41",
    "text": "Hi all, i have a client looking for assistance on getting started with HubSpot and beginning to add content to their HubSpot website. They want to publish the content in HubSpot, but they would like to have an API that connects HubSpot to their website platform, Webflow. One of their advisors mentioned that there is already an app developed for this, so we wouldn’t have to set up an API through Zapier or similar services. Does anyone have experience with this? And could you show me some examples? I would also appreciate some help understanding the scope of this if we are to assist our client in setting it up. I’m finding very little documentation on Webflow and HubSpot.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-26 14:02:51"
      },
      {
        "time_stamp": "2024-08-27 06:58:23"
      },
      {
        "time_stamp": "2024-08-30 08:49:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-08-26 14:02:51",
    "text": "Hi <@U057ZHLNCKD>, not sure if I get this right...\nYour client has Webflow where the website is located and he wants to build a website in HubSpot which connects to webflow?!\nMaybe I'm missing something but this doesn't seem right.\n\nOr is he looking to migrate from Webflow to HubSpot?\n\nIf your client is looking for something like creating landing pages/thank you pages &amp; emails in HubSpot, you don't need an API connection/tool or similar to do this kind of work. Just connect a subdomain like\n<http://content.COMPANY.com|content.COMPANY.com> or something like this to HubSpot, implement the design of the company and you're good to go.\n\nIf the client want's to use HubSpot simply as \"CRM\", you can simply create forms and emails (don't forget the subscription center) and embed the forms with the embed code in Webflow."
  }
]