[
  {
    "poster": {
      "poster_name": "Tae Kim",
      "poster_handle": "takim"
    },
    "time_stamp": "2023-11-21 10:44:19",
    "edited": {
      "time_stamp": "2023-11-21 11:12:27"
    },
    "text": ":rocket: *[Developer Project Platform Version 2023.2 Release in Public Beta]* :rocket:\n\nHello fellow developers! We are happy to announce the release of <https://developers.HubSpot.com/changelog/developer-projects-platform-version-2023.2|Project Platform Version 2023.2>, the first version for the new <https://developers.HubSpot.com/docs/platform/platform-versioning|versioning mechanism> that we are implementing for <https://developers.HubSpot.com/docs/platform/create-a-project|Developer Projects>. Users can now easily update their software to new platform versions containing the latest changes, rollback to previous versions, and manage any breaking changes in a more coordinated fashion. :developers-developers-developers:\n\nPlatform version 2023.2 includes the following new features:\n\n• *Support for asynchronous functions for App Functions (Async Await support)*\n• *Removal of 4KB limits for CRM card logs and integration with an improved logging system* that will enable log tracing feature for CRM custom cards in the near future (_coming soon!_)\n• *Control Node version through platform version (v2023.2 will point to Node 18)* - Simply update your platform version to get the latest Node version!\n• *Endpoint function deprecation for CMS Projects* - App Functions will replace Endpoint Functions for Projects\n• *JSON custom card deprecation* - You will no longer be able to use JSON cards for v2023.2 (<https://developers.HubSpot.com/changelog/upcoming-sunset-json-custom-cards|sunset announcement>). Instead, you'll need to update to React custom cards.\nSimply update your platform version to 2023.2 following the instructions in the <https://developers.HubSpot.com/docs/platform/platform-versioning|Project Platform Versioning> documentation to get access to these features. The previous platform version (2023.1) is on path to deprecation on March 2024.\n\nYou can refer to the <https://developers.HubSpot.com/changelog/developer-projects-platform-version-2023.2|changelog announcement> and <https://developers.HubSpot.com/docs/platform/platform-versioning|Project Platform Versioning> documentation for more details and instructions! :sprocket-dance:"
  }
]