[
  {
    "time_stamp": "2024-01-23 08:00:20",
    "text": "Reminder: You can find our developer content on HubSpot academy by going to <https://academy.HubSpot.com/results?q=developer&amp;library=true>  Additionally we have a YouTube Channel with a developer podcast and some great developer content <https://www.youtube.com/c/HubSpotDevelopers/playlists>"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2024-01-23 08:16:53",
    "text": "have some of the certification courses been removed? i got a notification to re-up CMS Hub Implementation, and I looked back through the course videos a couple days ago, and I went to take the exam today and got a \"missing content\" message. I don't even see a reference to the certification on Google anymore -- searching gives me results for Developer Certification (which I have).\n\nSuddenly, i have three fewer certifications in my completed list. Not sure what the other two are.\n\nMy employer did just lose their partner status, but I don't see any documentation saying personal academy certifications are dependent on partner status. Agency accreditations, yes, but certifications? Did i lose certifications because I don't work for a partner?\n\n:confused: .......",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-01-23 10:00:44"
      },
      {
        "time_stamp": "2024-01-23 10:04:22"
      },
      {
        "time_stamp": "2024-01-23 10:09:06"
      },
      {
        "time_stamp": "2024-01-23 11:38:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-01-23 10:00:44",
    "text": "<@U02227D27V3> any insight here?"
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2024-01-23 10:04:22",
    "text": "Hey <@UDEASNWEB>, the CMS Hub Implementation certification is a partner-only certification, and if your certification expired and you're no longer a partner, unfortunately, you won't be able to renew your CMS Hub Implementation certification."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2024-01-23 10:09:06",
    "edited": {
      "time_stamp": "2024-01-23 10:41:35"
    },
    "text": "okay thanks! <@U02227D27V3> is there a list somewhere of what the partner-only certifications are? i wasn't able to find documentation on that"
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2024-01-23 11:38:12",
    "text": "Unfortunately, this list isn't freely available to non-partners, so I can't send you any official stuff, but I can give you a list of the developer-related ones:\n\n• CMS Hub Implementation\n• Salesforce Integration\n• Growth Driven Design\n• Data Integrations\n• HubSpot Architecture I: Data Models and APIs\n• HubSpot Architecture II: Content and Messaging Tools\n• CRM Data Migration"
  }
]