[
  {
    "poster": {
      "poster_name": "I Made Sariyanta",
      "poster_handle": "desar.sariyanta"
    },
    "time_stamp": "2024-03-26 02:18:26",
    "text": "When we're migrating an existing website, we'd like to recreate everything on HS.\nFor pages, I can immediately use the current domain (after setting it to ready for publishing) to make staged pages. However, for the blog, if I select the current domain, when we hit preview, it actually points to the current domain.\n\nThis is not ideal when we want the client to review the website pages before we go live.\n\nFor now, we connected a subdomain as the blog domain. It would be nice if we could stage blog and blog posts the same way we can for pages and landing pages."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-03-26 07:21:41",
    "edited": {
      "time_stamp": "2024-03-26 07:22:27"
    },
    "text": "Understood.  Consider suggesting the idea and ask people here to upvote.  I see some people have been asking about this as long as 4 years ago.  I do not know of a solution except what some recommended way back then:  Create a temp blog and block Google from indexing it while you're testing (or do what you're doing now)  <https://community.HubSpot.com/t5/HubSpot-Ideas/idb-p/HubSpot_Ideas>"
  },
  {
    "poster": {
      "poster_name": "Carly Schultz",
      "poster_handle": "carly837"
    },
    "time_stamp": "2024-03-26 08:41:13",
    "text": "New to this slack group. Learning more about HubSpot CMS to help manage our company's website and become more educated in coding. Thanks for having me!"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-03-26 09:00:04",
    "edited": {
      "time_stamp": "2024-03-26 09:00:09"
    }
  },
  {
    "poster": {
      "poster_name": "Julia Clemente",
      "poster_handle": "julia468"
    },
    "time_stamp": "2024-03-26 09:22:18",
    "text": "Hello, team! Hope you all are doing well!\n\nI am trying to check from HubSpot how many *form submissions* my *Google Ads* campaigns have generated. The problem I am encountering is that the main object is the \"contact\" and I am not seeing a way to report by inquiry (form submission). I have tried and found the following difficulties so far:\n1. From marketing &gt; Ads: attribution models are based on contacts. This means that by selecting a long period in which a contact may have submitted several forms, it will only be counted once.\n2. From Marketing &gt; Forms: this is the only option I have seen to obtain information by inquiry. By storing the utms in form fields and exporting the information per form I can obtain the number of inquiries attributed to Google Ads campaigns. However, as forms are not available in Custom Report Builder and considering the forms volume at my account, exporting them manually doesn't seem like the best option.\n*Has anyone found any workaround for this?* :thinking_face: I was thinking on doing these form exports via API (not sure if this is possible) or via a connector like Google Spreadsheet. Thank you all in advance!"
  },
  {
    "poster": {
      "poster_name": "Mike Bergsma",
      "poster_handle": "mbergsma"
    },
    "time_stamp": "2024-03-26 09:39:35",
    "text": "Hi all, I've been reading up on React in HubSpot, but it looks like it's specific to cards within object views. We have some lists (ie: a Contact List) where we'd like to customize the way they are displayed so they can be assessed, prioritized, assigned etc. Is there a way to leverage React to change the table to something like a card view, with custom details and interactivity?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-26 09:47:43"
      },
      {
        "time_stamp": "2024-03-26 09:48:28"
      },
      {
        "time_stamp": "2024-03-26 09:48:44"
      },
      {
        "time_stamp": "2024-03-26 09:50:40"
      },
      {
        "time_stamp": "2024-03-26 09:52:17"
      },
      {
        "time_stamp": "2024-03-26 10:26:07"
      },
      {
        "time_stamp": "2024-03-26 10:29:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-26 09:47:43",
    "text": "Hey Mike"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-26 09:48:28",
    "text": "The UI Extensions are for when the object is loaded and you are viewing the record."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-26 09:48:44",
    "text": "The possibilities are countless in what you can do"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-26 09:50:40",
    "text": "As for using react to customize the views you are going to be limited to the columns / filters."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-26 09:52:17",
    "text": "Your use case is intriguing and warrants some additional conversation around what details you want to see on a list view and what interactivity you need."
  },
  {
    "poster": {
      "poster_name": "Mike Bergsma",
      "poster_handle": "mbergsma"
    },
    "time_stamp": "2024-03-26 10:26:07",
    "text": "Thanks for the info, I think because my initial need is to create different list views, I just assumed I could use a React component there, but obviously there is a lot of benefit to using them within records as well."
  },
  {
    "poster": {
      "poster_name": "Mike Bergsma",
      "poster_handle": "mbergsma"
    },
    "time_stamp": "2024-03-26 10:29:50",
    "text": "My particular use is quite simple.. we have new contacts created via another integration, and we can see those on a custom list with various filters applied/ columns shown. We need to assess the new contacts based on the values in the columns, but there are about 15-20, so a lot of side scrolling. Tables don't allow us to pin columns, so it's a bit of a pain to see the relevant info + name. Some of the columns are editable (ie: Priority) where the person reviewing the contacts sets a priority, maybe assigns the contact to someone, or requests additional info via a new task. The list is maybe 10-15/day, so a card view with more space to see all the info at once would be a much nicer flow for working through the contacts. We might end up just doing this in Retool or something similar for now."
  },
  {
    "poster": {
      "poster_name": "Matt Swanson",
      "poster_handle": "matt353"
    },
    "time_stamp": "2024-03-26 11:17:16",
    "text": "<@U01QVR44MEY> played around with this today: the file property is a `;` delimited list of the File IDs from File Manager"
  },
  {
    "poster": {
      "poster_name": "Matt Swanson",
      "poster_handle": "matt353"
    },
    "time_stamp": "2024-03-26 11:17:26",
    "text": "you can set it like a normal API property"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 11:24:20",
    "text": "Very nice! Thanks for letting me know"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 12:30:30",
    "text": "Interesting enough, I just tested this and it looks like if you've previously uploaded a file it will return the file url"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 12:30:35",
    "text": "but for new files it's a file id"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 12:34:03",
    "text": "actually another thing to point out, if it comes from the form it will be a url"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 12:34:39",
    "text": "so you could have a url, or an id, or a mix"
  },
  {
    "poster": {
      "poster_name": "Matt Swanson",
      "poster_handle": "matt353"
    },
    "time_stamp": "2024-03-26 12:49:32",
    "text": "yeah, I wonder if they will do a migration when it goes live for everyone"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-03-26 12:52:11",
    "text": "I hope so, it's pretty strange"
  },
  {
    "poster": {
      "poster_name": "Joav Abraham-Beermann",
      "poster_handle": "developer989"
    },
    "time_stamp": "2024-03-26 13:46:26",
    "edited": {
      "time_stamp": "2024-03-26 16:00:12"
    },
    "text": "Hi, I was wondering if there is a way to get a HubSpot form hosted on an external website to not be in an IFrame? I have set the form to be \"Raw HTML\". The form appears to not be in an IFrame when hosted on HubSpot. Thanks in advance.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-26 19:22:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joav Abraham-Beermann",
      "poster_handle": "developer989"
    },
    "time_stamp": "2024-03-26 19:22:06",
    "text": "Was not able to use Raw HTML on external websites on the current plan. Went with the forms API instead"
  }
]