[
  {
    "text": "Hi Team,\n\nI have to create customized  page with the following field.. (Screen shot attached)\n\nmy company is providing SMS services and planning to implementing the feature ( Sending SMS) from HubSpot .\n\n my client are using HubSpot. Can any one help us the approach to implementing the integration.\n\nNote: We tried through workflow with private app , but unable to share the workflow to my clients.",
    "time_stamp": "2024-03-05 03:37:38"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-03-05 09:00:06",
    "edited": {
      "time_stamp": "2024-03-05 09:00:11"
    }
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2024-03-05 11:09:59",
    "text": "*Notice for Google Integration users*\n*NEW*\nStarting March 2024, businesses that don’t integrate with Google Consent Mode V2 could experience measurement loss of tracked data from EEA/EU/UK visitors. To prevent this measurement loss across Google’s suite of advertising and analytics tools, you’ll need to set up a cookie banner in HubSpot using an opt-in policy type that targets EEA/EU/UK countries. Personalized data from EU/EEA/UK visitors will only be shared with Google if those visitors provide explicit consent to tracking. <https://knowledge.HubSpot.com/privacy-and-consent/support-google-consent-mode-v2|Learn More>"
  },
  {
    "text": "In Conversations > Templates, how would I allow a user permission to allow them to edit a template they didn't create?  Or does only the Owner have ability to set who can edit?",
    "time_stamp": "2024-03-05 11:34:13",
    "edited": {
      "time_stamp": "2024-03-05 11:53:42"
    }
  }
]