[
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2024-03-07 03:25:02",
    "text": "Hello! :wave:\nIs there a way to generate a HubSpot report for page views based on a given URL? Not in page details tab for a particular page but all the page views for last year for example when URL is filter option?"
  },
  {
    "poster": {
      "poster_name": "Naseebullah Ahmadi",
      "poster_handle": "naseebullah.ahmadi"
    },
    "time_stamp": "2024-03-07 04:33:34",
    "text": "Hya! We are using HubSpot CMS with nodejs sdk. We are trying to add secrets so that we can call our own APIs. Would appreciate if anyone can direct me to the doc on how to add secrets and access them in our nodejs Extension. Thanks"
  },
  {
    "poster": {
      "poster_name": "Lars van der Water",
      "poster_handle": "l.vanderwater"
    },
    "time_stamp": "2024-03-07 05:35:38",
    "text": "Hello HubSpot Developers,\n\nI just joined the group and I'm having trouble figuring out which channel is appropriate for my query. Can someone please help me identify which channel would be the best fit for the following issue:\n\nWe've successfully connected our support shared email to our helpdesk on HubSpot. However, we've come across an issue where the HTML content of engagement objects created through the HubSpot API, with the recipient being this shared email, isn't visible within our help desk environment. In contrast, incoming emails to the shared support email address display the content correctly.\n\nI would greatly appreciate any suggestions on which channel would be the best fit for my query. Thank you."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-03-07 07:10:34",
    "text": "hmmm, maybe I am missing something - but in your form options you can tell it who to send the email notifcations to for submissions.  Where you can actually see that the email was generated I am not sure but you could simply add yourself to the list and you will receive it too."
  },
  {
    "text": "",
    "time_stamp": "2024-03-07 07:10:42"
  },
  {
    "poster": {
      "poster_name": "Edmond Deema",
      "poster_handle": "edmond"
    },
    "time_stamp": "2024-03-07 10:20:35",
    "text": ""
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-07 12:39:03",
    "text": "I understand now - I couldn't locate anything.  If you are familiar with SendGrid, they have an \"activity\" feed which shows all emails sent and more details about deliverability.  Maybe someone else know where to find this information."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-03-07 12:45:25",
    "text": "<@U05QE60GVQC> make sure you hang out in <#CBNDYJJAZ|jobs> if you aren't in there already :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-03-07 17:19:56",
    "text": "It requires you to hard-code the content into the page templates, but you can use HubL to check the user’s system language provided in their request headers and swap out content based appropriately.\n\nHere’s how to get the array of user language preferences:\n```{% set user_preferred_content_languages = request.headers[\"accept-lanugage\"] | split(\",\") %}```\nThese will be ordered by priority of preference, so in this case, `user_preferred_content_languages[0]` would be their primary system language, and `user_preferred_content_languages[1]` and on would be fallback languages."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-03-07 17:20:22",
    "text": "Oh wow, I just realized I’m scrolled way back in the channel! Sorry for the late response, hope this is still useful!"
  }
]