[
  {
    "text": "<@UEC65BQV8>, from my experience the fonts won't load in the CTA preview unless the font styling is in a stylesheet linked via the Attached Style Sheets under HubSpot Settings &gt; Website &gt; Pages. however i personally never use this method for attaching stylesheets and instead put them directly in my template code. sometimes you _think_ the fonts load because they're installed on your OS and therefore render, but they won't show unless its one of the two...at least from my understanding. i may be wrong and i'd love for someone with more understanding to weigh in on it. i've just learned to #dealwithit. but it would be a great if the fonts would render regardless of where your stylesheet is attached.",
    "time_stamp": "2019-11-07 07:48:33"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-11-07 10:20:53",
    "text": "<@UB690RZA7> Any tips on email? or is it just a no go? It looks like the button gets rendered as an image and not pulling any of the font goodness through, even if I have the fonts include int he `style` of the `head`"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2019-11-07 10:22:55",
    "text": "<@UEC65BQV8> I always use Image CTAs for email."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-11-07 10:23:36",
    "text": "ahh, gotcha. so just gotta make my own then I guess."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-11-07 10:24:10",
    "text": "is there a way to somehow hook a cta (linked to a campaign) without having to actually use a cta module?"
  },
  {
    "poster": {
      "poster_name": "Tejas Panchal",
      "poster_handle": "tejpanchal93"
    },
    "time_stamp": "2019-11-07 10:24:39",
    "edited": {
      "time_stamp": "2019-11-07 10:25:31"
    },
    "text": "<@UEC65BQV8> doesn't support the hover effect in email template template so use the cta image ."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-07 11:17:14",
    "text": "Because a lot of email clients don’t support the level of customization CTAs support - CTA modules generate an image for emails. This ensures visual consistency.\n\nOn alternatives for if you want to role your own coded CTA, I think <@UJL4N3WN8> may have some insights. I remember him talking about this",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-11-08 16:57:50"
      },
      {
        "time_stamp": "2019-11-08 16:58:08"
      },
      {
        "time_stamp": "2019-11-10 07:45:46"
      },
      {
        "time_stamp": "2019-11-10 07:45:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-11-07 11:36:42",
    "text": "Thanks <@U7SL518D6> I mean, I can design and export images that look like buttons in order to use the cta functionality, but I already have them coded for email and it would be great if there was a way to also attach them to the cta functionality.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-11-07 12:42:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-11-07 12:42:10",
    "text": "One thing i did way back (not sure if it would still work) as a workaround to this was creating everything then simply looking at the embed code for the cta and using the href from the embed code as the href for the image link.\n\nQuick note, if it even still works, this will mean you don’t get anything in the stats like the views, click rate, or locations (I believe it will still track clicks to it though)."
  },
  {
    "poster": {
      "poster_name": "Anders Grové",
      "poster_handle": "andersgrove"
    },
    "time_stamp": "2019-11-07 23:57:43",
    "text": "Hi, is anyone else experiencing the issue of the HS sprocket not loading on Windows/Chrome? Two of our team members having the same thing :homealone:\n<https://community.HubSpot.com/t5/Blog-Website-Page-Publishing/Can-t-see-HubSpot-sprocket-icon-on-live-site/td-p/298805>",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-11-12 06:09:16"
      },
      {
        "time_stamp": "2019-11-12 06:54:34"
      },
      {
        "time_stamp": "2019-11-12 13:30:43"
      }
    ]
  }
]