[
  {
    "poster": {
      "poster_name": "Neil Junsan",
      "poster_handle": "neiljunsan09"
    },
    "time_stamp": "2023-03-15 01:58:20",
    "text": "Hello @everyone ,\n\nAnyone tried to display deals filtered by company association label . Let me know how we can achieve this kind of feature. Thanks\n\nIs something like this ?\n```crm_associations(associated_companies.results[0].id, 'HubSpot_DEFINED', 6, \"label=Partner Company\", 'dealname,amount,dealstage,createdate,closedate') %}```\n",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-03-15 08:41:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-15 08:41:54",
    "text": "so the \"6\" in that function is the association label, (company to deal right?) and if you change the HubSpot_DEFINED to USER_DEFINED and change the number to the association type id (of the association label) you can pull in just those associations"
  },
  {
    "poster": {
      "poster_name": "Simon Gugala",
      "poster_handle": "simon722"
    },
    "time_stamp": "2023-03-15 09:50:01",
    "text": "<@UKJSMBW6A> Did you figure out a solution to this?  I have a client who wants each subscription to have sub subscriptions and when they unsubscribe from an email, to only show a limited number of items (subscription and sub-subscription) on the unsubscribe page (including the unsubscribe all) and specific branding dealing with the main subscription.  I thought using a query would be a way to do it, but I had the same issue as you where it wasn't reading the query.  Would love to see how yours worked out"
  },
  {
    "poster": {
      "poster_name": "Derek Cavaliero",
      "poster_handle": "derek168"
    },
    "time_stamp": "2023-03-15 09:54:21",
    "text": "oh man you're really gonna test my memory here... i'd need to remember where I did this"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-03-15 13:07:52",
    "text": "In this case, I can just use a template literal around it like\n```callback: `{{ module.callback }}````\nBut that’s still need really a solution, since the callback string could have template literals in it."
  }
]