[
  {
    "poster": {
      "poster_name": "Richa Sharma",
      "poster_handle": "richa.sha199"
    },
    "time_stamp": "2022-12-30 11:13:03",
    "edited": {
      "time_stamp": "2022-12-30 11:43:02"
    },
    "text": "Hey All.\nGreetings!\n\n*Another Year come and gone!*\n\n\n*A very Happy New year to you*. I am pleased to introduce our organization Crowd Volley IT Solutions Pvt. Ltd.\n\n*Who we are?*\nCrowd Volley IT Solutions PVT. Ltd. has a Certified:sports_medal: HubSpot Developer team who serve more than 10 years in the same technology. Our 50-plus themes are published on the marketplace. More than 500 projects we have completed yet of HubSpot DESIGNING AND DEVELOPMENT. We are a team of creative minds growing rapidly. We charted legends of creativity, innovation, and client satisfaction serving local and global clientele. In addition, we extended our helping hands to many known and unknown brands to visualize a steep growth curve on their dashboard for traffic, engagements, and conversions with decent ROI. We HAVE 10+ Years of Software Development background. You can visit us here- <https://crowdvolley.com/|https://crowdvolley.com/>\n\n*SPECIALISATION IN HubSpot*\n1. HubSpot Apps.\n2. HubSpot Themes.\n3. HubSpot Migration.\n4. HubSpot Development.\n5. HubSpot Newsletter.\n6. HubSpot E-mail Templates.\n7. HUbspot CRM\n*Why We are Here?*\nWe would like to get an opportunity to get associated with your esteemed organization &amp; to serve to the best of our ability, I would eagerly await your interest in our services as and when the future requirement comes to have a long-lasting relationship with your esteemed organization.\n\n\nThanks and Regards.\nCrowd Volley IT Solutions "
  },
  {
    "text": "*Enjoy the best Rates* :raised_hands:\n\n*Offers are attached below,You can check over there* :point_down::skin-tone-2:  And you can enquire about quotes and other related thing through <mailto:business@crowdvolley.com|business@crowdvolley.com>\n\nThanks.",
    "time_stamp": "2022-12-30 11:43:35",
    "edited": {
      "time_stamp": "2022-12-30 11:53:47"
    }
  }
]