[
  {
    "poster": {
      "poster_name": "Duncan du Plessis",
      "poster_handle": "duncan918"
    },
    "time_stamp": "2022-08-04 05:05:34",
    "text": "Hello everyone,\n\nI need help around a integration between HubSpot and Adobe by using Adobe text tags on a certificate. I want to pull the necessary values from HubSpot to the certificate. Has anyone done this? And if so can I maybe get some guidance please"
  },
  {
    "poster": {
      "poster_name": "Anneka Hicks",
      "poster_handle": "anneka.hicks"
    },
    "time_stamp": "2022-08-04 06:42:43",
    "text": "Hi all, does anyone know of a module that I can install that allows us to select recent posts *by tag/tags and display as cards?* There are a few in marketplace that allow to select by blog, which is all very well, but I’d like to be more granular so posts are more relatable to specific content within landing pages for eg.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-08-04 07:17:34"
      },
      {
        "time_stamp": "2022-08-04 07:28:36"
      },
      {
        "time_stamp": "2022-08-04 07:53:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2022-08-04 07:17:34",
    "text": "I just finished working on implementing something like this for a custom blog listing that needs to filter by one or multiple tags. <https://HubSpotdev.slack.com/archives/C2YH119N2/p1659578982078879?thread_ts=1659573925.165919&amp;cid=C2YH119N2>\n\nYou're going to need someone to help you with a custom coded listing template."
  },
  {
    "poster": {
      "poster_name": "Anneka Hicks",
      "poster_handle": "anneka.hicks"
    },
    "time_stamp": "2022-08-04 07:28:36",
    "text": "Thanks so much for this, I think it will help someone a little more experienced than me!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-08-04 07:53:25",
    "edited": {
      "time_stamp": "2022-08-04 07:54:32"
    },
    "text": "Hi Anneka, power theme's post preview module has quite a few options for displaying posts by blog, recent, popular, relevant, tag, and author. If you already have a theme you would need a developer to determine if the module would be compatible. If you're using for landing pages, you could configure power theme to match your current design and use it instead."
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2022-08-04 09:05:39",
    "text": "<@UQWGKUEN7> is this what you needed?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-08-04 09:09:05",
    "text": "You can’t use inlineMessage with the redirectUrl. Try removing inlineMessage and it will likely work out."
  },
  {
    "text": "",
    "time_stamp": "2022-08-04 09:09:31"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-08-04 09:11:48",
    "text": "If it has to do with the value not populating at all, and the value is pulling form a default value I would go into the page and remove the default value and just paste it back in. I’ve had plenty of issues with defaults not pulling from time to time if the module is already on the page when it’s being worked on. <@UCDEM8T63>"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2022-08-04 09:33:25",
    "text": "When I am within the edit mode of a page and go to the developer mode via /?developerMode=true and copy the Hubl from a section - The alignment options are not being copied along with it. Is that a bug or is this how it is supposed to work? Its making building templates extremely difficult to parse at times."
  },
  {
    "text": "I’ve created a CMS Developer Sandbox portal accounts (2 with the same name actually, accidentally), and I want to delete one of them. I click here (see image) and enter my email for confirmation, but it returns a 400 bad request error. Any ideas?",
    "time_stamp": "2022-08-04 10:19:37",
    "edited": {
      "time_stamp": "2022-08-04 10:19:51"
    }
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-08-04 10:22:14",
    "text": "Not sure, but resetting my password and using that to login instead of SSO seemed to do it."
  },
  {
    "poster": {
      "poster_name": "Ryan",
      "poster_handle": "ryan512"
    },
    "time_stamp": "2022-08-04 10:59:29",
    "text": "What about linking to the portal selection screen with a redirect parameter in the URL… is that a thing?"
  },
  {
    "poster": {
      "poster_name": "Til Kams",
      "poster_handle": "til"
    },
    "time_stamp": "2022-08-04 11:11:06",
    "text": "Hi everyone,\nwe are currently planing a custom integration between HubSpot and our own App for Data transfer. I was wondering if any of you have done a similar thing and can share some feedback about obstacles and problems that might occur?\nThank you in advance!"
  },
  {
    "poster": {
      "poster_name": "Ryan",
      "poster_handle": "ryan512"
    },
    "time_stamp": "2022-08-04 11:13:29",
    "text": "Yeah, there’s a redirect param… but I don’t see how I’d tack on the portal ID at the end of the redirect URL once it’s known\n<https://app.HubSpot.com/login/?loginRedirectUrl=https%3A%2F%2Fapp.HubSpot.com%2Fnotification-preferences>\n\nAre there any good “URL Hacks” for HubSpot? Salesforce has/had a ton"
  },
  {
    "poster": {
      "poster_name": "Courtney Roach",
      "poster_handle": "courtney049"
    },
    "time_stamp": "2022-08-04 11:52:22",
    "text": "Hey everyone! I've posted to the community forum but will try here as well. I am having an issue with our webhook URL (custom installed app, not workflows) failing with a response of \"SubscriptionWebhookErrorCategory.CONNECTION_DENIED\". But this is only occurring with our production url (servers in a major cloud provider). I can use a development url pointing to our dev servers (private data center) and it is successful. The odd thing is our production firewall has no log record of the attempt. It records everything. I can run the same url through a browser and see a record in the log. Something is failing before HubSpot can reach the edge of our network. My only guess right now is that there is an issue with the TLS handshake. Or HS doesn't like our SSL cert. Any additional ideas would be appreciated! [we have Marketing Hub Pro, Sales Hub Pro] Community forum link: <https://community.HubSpot.com/t5/APIs-Integrations/Webhook-URL-fails-SubscriptionWebhookErrorCategory-CONNECTION/m-p/675158/highlight/true#M55491>"
  },
  {
    "text": "Hi, I have a question. I have the rule of redirect:\n`pages/*rest-of-url`  to `/{rest-of-url}` but doesn't work. What can be a problem?",
    "time_stamp": "2022-08-04 11:53:54",
    "edited": {
      "time_stamp": "2022-08-04 11:54:26"
    }
  },
  {
    "text": "Hello,\n\nHi All, we are implementing sending emails from one of our applications through the HubSpot SMTP service. After the email is sent we are calling the following endpoint (<https://api.hubapi.com/email/public/v1/events?recipient={Email}>) to get information like how many times the user opened the email, or if was received or bounced.\nBased on the data returned by this endpoint we don't find a way to group all these events by email; we notice that we get the \"smtpid\" (image 1) property but is null. The question is if you guys know others why group these events? or how we can get back the \"smtpid\" from this endpoint. The main idea is to display the data in our system like the following image (image2).\n\nImage 1  - Image 2",
    "time_stamp": "2022-08-04 14:08:42"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-08-04 14:28:49",
    "text": "We have a .com domain site hosted. We want to keep it, but add some HubSpot pages to it. Is it possible to simply add the .com domain to HubSpot to accomplish this? And if so, can it possibly hurt our SEO?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-08-04 14:37:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2022-08-04 14:37:36",
    "text": "As you have to add a CNAME it’s either this or that hosting. Why don’t you use a subdomain like <http://HubSpot.domain.com|HubSpot.domain.com>, instead of <http://www.domain.com|www.domain.com>."
  },
  {
    "poster": {
      "poster_name": "Jeppe Wienziers Stenbæk",
      "poster_handle": "jeppe.stenbaek"
    },
    "time_stamp": "2022-08-05 00:42:46",
    "text": "Hi all. I don't know what the right channel is so feel free to redirect. Has anyone manage to make reports inside HubSpot using historical property data?  I would like to see the development in a property over time. "
  }
]