[
  {
    "text": "hi\n i m try to work on HubSpot App marketplace. But I have many problems.\n1. I did create App and send CRM, scope and redirect URL but when I call API with client secret here you can seen pic of client secret.\nimage.png\n<https://HubSpotdev.slack.com/files/U03U52C27BK/F03U592RP9P/image.png>\nwhen id send GET request <https://api.hubapi.com/crm/v3/objects/contacts> with header Authorization (client secret) then API response\n`{`\n    `\"status\": \"error\",`\n    `\"message\": \"Authentication credentials not found. This API supports both API Key and OAuth 2.0 authentication and you can find more details at <https://developers.HubSpot.com/docs/methods/auth/oauth-overview>\",`\n    `\"correlationId\": \"f2c66b86-54b8-4a3d-b596-0b8a5ec4c2cb\",`\n    `\"category\": \"INVALID_AUTHENTICATION\"`\n`}`\nso how i can run my app ?",
    "time_stamp": "2022-08-16 01:21:26"
  },
  {
    "poster": {
      "poster_name": "Mac Kang",
      "poster_handle": "mac630"
    },
    "time_stamp": "2022-08-16 03:41:52",
    "text": "Hi Everyone, I have a client who's using TreasureData as their CDP, and HubsPot as their CRM.\nThey want to implement Personalized HubSpot Chatbot which identify the customer with their stored cookie data.\n\nWould it be possible to connect TreasureData's cookies and HubSpot cookies so that they can identify contact on HubSpot Chatbot.\n\nI'm afraid it would not be possible cause both are using First-Party cookies...\nbut my assumption is like as below.\n\n1. Send HubSpot cookies to TreasureData(CDP)\n2. Get TreasureData's cookies(including TreasureData's cookies, and HubSpot's cookies) and store in HubSpot.\n3. Use the cookies as a identifer. "
  },
  {
    "poster": {
      "poster_name": "Mert Karabulut",
      "poster_handle": "mert.karabulut"
    },
    "time_stamp": "2022-08-16 03:58:13",
    "edited": {
      "time_stamp": "2022-08-16 03:58:34"
    },
    "text": "Hi everyone, I have created a client app that requires some tiered scopes and I was wondering if it is possible to authorise this app (with OAuth) for an external account before it is listed in the HubSpot marketplace?"
  },
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2022-08-16 05:17:07",
    "text": "is it just me or does the HubSpot sales extension for outlook desktop have issues authenticating with google. Each time it authenticates and then reloads to login, sending me a 2FA SMS afterwards without an ability to add in the code anywhere"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2022-08-16 07:05:04",
    "text": "Do you have HubSpotContentSearchBot added to your robots.txt file and correct settings there?\n\n&gt; <https://knowledge.HubSpot.com/design-manager/site-search-frequently-asked-questions|You'll need to include >_<https://knowledge.HubSpot.com/design-manager/site-search-frequently-asked-questions|HubSpotContentSearchBot>_<https://knowledge.HubSpot.com/design-manager/site-search-frequently-asked-questions| as a user-agent in your robots.txt file to allow the search feature to crawl your pages>."
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2022-08-16 22:34:36",
    "text": "<@U028QE2PEPN> both plugins are compatible with each other, so after checkout this wordpress plugin will only send the form data, but WooCommerce plugin sends some calculated data - like products bought, total order value, discount, coupon, last products bought\n\nadditionally it creates each order as deal with products as line items and associate those with contacts for better reporting and visibility."
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2022-08-16 22:35:07",
    "text": "please let me know if you want to have a demo of how it works and what additional functionality it offers"
  }
]