[
  {
    "poster": {
      "poster_name": "Frank Fava",
      "poster_handle": "frank.fava"
    },
    "time_stamp": "2022-08-15 03:07:01",
    "text": "Is there anyway to get a raw and uncached asset? `_hcms/raw-resource` used to be a thing but is no longer available. We need to use the same stylesheet on HubSpot (hosted on HubSpot) as well as on a 3rd party site"
  },
  {
    "text": "Hi everyone, I hope I'm asking this question in the right place. I am getting an error while I am authorising my client app with an external HubSpot account by using the OAuth 2.0 flow, though I don't get this error when I try this with my developer test account. I am authorising for these scopes: `content, automation, forms, tickets, e-commerce, sales-email-read, crm.objects.contacts.read, crm.schemas.contacts.read, crm.objects.feedback_submissions.read`  Anyone know what the problem is?",
    "time_stamp": "2022-08-15 05:57:57"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-08-15 11:47:15",
    "text": "I wasn’t sure what channel to post this in. Does the <https://developers.HubSpot.com/docs/cms/developer-reference/debugging-and-errors#developer-info|Developer Info> not work with HubSpot CMS Free? When I try to access it, I get an error that says ‘this page is not available’. I’m trying to retrieve values using <https://developers.HubSpot.com/docs/cms/building-blocks/modules/export-to-template-context|export_to_template_context> and the dev info would be helpful in finding the correct parameter…which brings up my second question. Is `export_to_template_context` available with HubSpot CMS Free?"
  },
  {
    "text": "Hello community,\n\nMARKETING &amp; SALES ENTERPRISE\n\nI have done with satisfaction the connection of the HubSpot application with Data Factory - DataLake, but at the moment of getting the information I only get half of my records of the Contacts object (530.913). How could I do to get 100% of the records of that object?\n\n<https://community.HubSpot.com/t5/APIs-Integrations/How-to-get-all-records-of-the-contact-object-connected-to-Data/td-p/680706|HubSpot COMMUNITY>\n\nSomeone who can help me please.",
    "time_stamp": "2022-08-15 15:44:01",
    "edited": {
      "time_stamp": "2022-08-15 18:18:38"
    }
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2022-08-15 16:09:27",
    "text": "Is there any way to get the search module to include pages in content staging? Of course, I understand that generally, this would NOT be desired! But we have a new site with tons of content in staging and the client wants to test search functionality before publishing pages. Any ideas?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-08-16 07:05:04"
      }
    ]
  },
  {
    "text": "hi\nhow i can install in at least three active unique ?",
    "time_stamp": "2022-08-15 22:59:06"
  }
]