[
  {
    "poster": {
      "poster_name": "Ville Pekkarinen",
      "poster_handle": "ville"
    },
    "time_stamp": "2022-08-10 03:07:29",
    "text": "alt text is alternate description of image, caption is something else"
  },
  {
    "poster": {
      "poster_name": "Maia Torell",
      "poster_handle": "maiatorell123"
    },
    "time_stamp": "2022-08-10 03:11:48",
    "text": "Hello, I have an dynamic page with CRM object content where featured image not showing up when sharing on social media. Featured image in settings are set to the right object property but when debugging on Facebook it says that the page doesn't contain a og:image metatag"
  },
  {
    "poster": {
      "poster_name": "Bethany Harvey",
      "poster_handle": "bethany.harvey"
    },
    "time_stamp": "2022-08-10 03:20:26",
    "edited": {
      "time_stamp": "2022-08-10 03:22:02"
    },
    "text": "Hi everyone. I am hoping someone can help me with an issue I am having. I have a third party who is looking to share contact data through an API into a HubSpot form I have created. They have mapped the properties and are posting the data to a URL which holds only the form. When submitting they are getting a 'Request Forbidden' response. Any ideas on how to fix this/manage it in a simpler way (I don't currently have CMS hub and am not sure if there are any IP restrictions)? Further to this is there a way to set up a key authorisation? Thanks!"
  },
  {
    "text": "Hi everyone, I have a question.\nWe have an app called \"Contract creation\" that is basically a webhook that send HubSpot deal id to dovetail webaddress.\nThe app works as intended.\nWhat I want to do is create a card in \"deals\" with a button to retrigger the application and deal id is sent again to dovetail.\nHere :arrow_down: is where Id like to have the card with the \"retrigger\" button.\nIf anyone got an idea on how to do it, I'd appreciate it a lot.\nThanks in advance",
    "time_stamp": "2022-08-10 05:10:59"
  },
  {
    "poster": {
      "poster_name": "Anna",
      "poster_handle": "sweetstrawberrybonbon"
    },
    "time_stamp": "2022-08-10 06:56:30",
    "text": "Hi all,\nI'm trying to bulk update Contacts through the API using 'idProperty'=&gt;'email'  without success.  I'm using the PHP library. If I do the update with regular ids it works, but with 'idProperty' I get an error message 'Could not get some CONTACT objects, they may be deleted or not exist. Check that ids are valid.' I tried rearranging the input and moving around 'idProperty' as I don't know which is the right syntax, but none worked for me.\n```$inputs = [\n    [\"idProperty\" =&gt; \"email\", \"id\"=&gt;\"<mailto:xxxx@example.com|xxxx@example.com>\", \"properties\" =&gt; [\"evt_test\"=&gt;true]]\n];\n$BatchInputSimplePublicObjectBatchInput = new BatchInputSimplePublicObjectBatchInput(['inputs' =&gt; $inputs]);```\nPlease help! :worried: Thank you!"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2022-08-10 14:47:55",
    "text": "is it possible to use a flexible column module on a blog post template ??"
  },
  {
    "text": "I'm getting a strange error here --",
    "time_stamp": "2022-08-10 14:48:05"
  },
  {
    "poster": {
      "poster_name": "Rudolph Chaney",
      "poster_handle": "rudy.chaney"
    },
    "time_stamp": "2022-08-10 16:40:51",
    "text": "Wow, I feel like I've found my people! :wave-yeti:"
  },
  {
    "time_stamp": "2022-08-10 17:12:18",
    "text": "One of us"
  },
  {
    "poster": {
      "poster_name": "Jacob Simpson",
      "poster_handle": "jacob590"
    },
    "time_stamp": "2022-08-10 21:41:49",
    "text": "Hi everyone, I have been a WordPress developer for a number of years now and am looking at getting my experience into a new realm. I am currently starting to learn HubSpot and am excited to join such a thriving and exciting community.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-08-11 06:38:00"
      },
      {
        "time_stamp": "2022-08-11 09:09:46"
      }
    ]
  }
]