[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 07:49:55",
    "edited": {
      "time_stamp": "2019-05-10 07:51:54"
    },
    "text": "If anyone’s interested in helping get the documentation site going:\n\n<https://github.com/TheWebTech/CrankShaft/issues/21#issuecomment-491295008>\n\nJust need someone who wants to figure out how to make it look decent. Some people suggested using Slate, there’s a link in there, their site has instructions to set it up. If you don’t think slate is a good fit voice your opinion in that thread. We can use something else if there’s a better fit.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-05-10 08:21:02"
      },
      {
        "time_stamp": "2019-05-10 08:21:26"
      },
      {
        "time_stamp": "2019-05-10 08:22:37"
      },
      {
        "time_stamp": "2019-05-10 08:28:28"
      },
      {
        "time_stamp": "2019-05-10 08:29:03"
      },
      {
        "time_stamp": "2019-05-10 08:30:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tim L",
      "poster_handle": "tim462"
    },
    "time_stamp": "2019-05-10 08:21:02",
    "text": "I’ve used slate for docs and it is top notch. I know language support in the code column probably won’t cover hubl but outside of that I think it’s a great choice."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 08:21:26",
    "text": "well language wise, if it supports jinja, then we’re fine"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 08:22:37",
    "text": "regardless if someone wants to take up the task of getting it set up that would be awesome, and would enable us to move on some docs related tasks"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 08:28:28",
    "text": "actually I just set it to slate in the github settings. idk if it’s the same thing though"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 08:29:03",
    "text": "<https://thewebtech.github.io/CrankShaft/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 08:30:17",
    "text": "and clarification to anyone who looks at that page. ANYTHING can be changed on there. I just picked a theme, there’s no mandate on having that “maintained by TheWebTech” bit that was automatically generated."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 10:21:26",
    "edited": {
      "time_stamp": "2019-05-10 10:23:11"
    },
    "text": "So I’ve kinda thought about the logo situation.\n\nHere’s what I think we’ll do. We’re going with <@U7AS8L4MR>’s logo.\n\n*Jon, make any changes you feel you need to, then either post an issue with the files on github or add them to the root folder for the project and submit a pull request to the crankshaft master(either way is fine).*\n\nIf you want to let others weigh in on tweaks, you can put it in an issue and collect feedback - you get to decide when you’re done making changes and which changes to implement. That way you don’t feel burnt out or feel like you have to make dumb changes.\n\n---\n\nFor those that wanted the other logo. If you post an issue and can get 5 more “votes” than Ikes got(meaning Ikes total from the poll + 5 people posting and confirming they will vote 1 single other logo) we can do a revote. Otherwise we’re moving on to the code and docs for the project."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-10 20:46:50",
    "text": "I’ve started putting together some content for the documentation site, feel free to add to it <https://thewebtech.github.io/CrankShaft/>"
  }
]