[
  {
    "poster": {
      "poster_name": "Corey King",
      "poster_handle": "cking"
    },
    "time_stamp": "2021-03-11 07:49:39",
    "edited": {
      "time_stamp": "2021-03-11 07:59:06"
    },
    "text": "Hi there, I have a couple questions regarding HubDB. If anyone has any insight, it would be appreciated!\n\nWe want to create a partner locator for our channel partner program. The thought is that people will be able to select their geographic region or enter their address, and we will provide them with a list of partners they can purchase from. We'll likely want this to be a module we can embed on pages.\n\nWe'll want people to be able to filter by geographic region, maybe even country. They'll do that then be presented with their options. In the future, we'll want users to be able to filter by a number of things including specific partner types (Reseller, Integrator, etc), products sold, partner tier (platinum, silver, gold, etc) and industry among other things. We'd like to make it flexible enough that we can easily add the ability to filter by new options without rearchitecting the whole solution.\n\nMy first questions are:\n• When dealing with HubDB, it's typically confined to one page vs adding a module element to the situation. There's really no module option for this, correct? \n• As for filters, Those are always within the page associated with the HubDB table's code. We couldn't allow the content editor to select what filters they want to or do not want to use at any given point?",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-03-12 02:08:39"
      },
      {
        "time_stamp": "2021-03-15 07:53:31"
      },
      {
        "time_stamp": "2021-03-15 07:53:49"
      },
      {
        "time_stamp": "2021-03-15 08:06:10"
      },
      {
        "time_stamp": "2021-03-15 08:14:56"
      },
      {
        "time_stamp": "2021-03-15 09:03:00"
      },
      {
        "time_stamp": "2021-03-15 11:03:18"
      },
      {
        "time_stamp": "2021-03-16 01:05:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-03-11 22:35:37",
    "text": "I’m not quite sure that I understand your questions entirely. You could absolutely turn this into standalone module if that’s the question. As a module you can def create some fields that will allow you to toggle filters on and off too. "
  }
]