[
  {
    "poster": {
      "poster_name": "Oscar Aviles",
      "poster_handle": "oaviles"
    },
    "time_stamp": "2022-01-25 05:19:02",
    "text": "Hi, I'm getting an `INVALID_AUTHENTICATION` error when trying to use the smtp-token endpoint from the Transactinal Email API, I'm sending a valid hapikey that works with any other requests I make, anyone knows what could be the problem? I even try from the `Test call` button from the developer docs with the same results",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-25 06:11:50"
      },
      {
        "time_stamp": "2022-01-25 06:36:58"
      },
      {
        "time_stamp": "2022-01-25 09:38:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-01-25 06:11:50",
    "text": "Does your account have the Transactional Email add on?"
  },
  {
    "poster": {
      "poster_name": "Oscar Aviles",
      "poster_handle": "oaviles"
    },
    "time_stamp": "2022-01-25 06:36:58",
    "edited": {
      "time_stamp": "2022-01-25 08:02:22"
    },
    "text": "we suposedly have, but I don't really know, how can I confirm this?"
  },
  {
    "poster": {
      "poster_name": "Parker Short",
      "poster_handle": "parker"
    },
    "time_stamp": "2022-01-25 08:38:31",
    "text": "Has anyone dealt with content security policy issues on quotes? We have the images hosted externally (that’s really the only way to set them up with products), but we can’t actually get them to load. I’ve messed around with the content security policy meta tag, but I’m not able to get anything to appear consistently (aside from disabling the security warnings locally, which isn’t a viable solution)."
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-01-25 09:38:52",
    "text": "You can DM your account ID and I can check"
  },
  {
    "poster": {
      "poster_name": "Jessica Luna",
      "poster_handle": "jluna"
    },
    "time_stamp": "2022-01-25 12:30:19",
    "edited": {
      "time_stamp": "2022-01-25 12:30:27"
    },
    "text": "Hello Everyone, I have a quick question (not a developer, so hoping I can get some guidance from you experts out there!). One of our booking vendros (they are a bookings platform), mentioned they’d be able to integrate our HubSpot environment with their platform so that all info of people booking services with us will feed into the HubSpot platform. We have the Marketing Professional Hub. When our vender was in there working on setting up behavioral events via the API integration, they got a notification that we needed to Upgrade to Enterprise. We don’t want to upgrade at the moment, any workarounds to this? Could we integrate both systems via API to segmented static list? Or could we integrate both systems using only name, phone and email with the API? One thing I was thinking is that the bookings platform could create an App on HubSpot, but that might take longer. Open to all your suggestions! Thank you so much!",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-01-25 13:35:12"
      },
      {
        "time_stamp": "2022-01-25 23:56:23"
      },
      {
        "time_stamp": "2022-01-26 07:01:46"
      },
      {
        "time_stamp": "2022-01-26 07:02:27"
      },
      {
        "time_stamp": "2022-01-26 07:57:12"
      },
      {
        "time_stamp": "2022-01-26 08:18:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bruno Amico",
      "poster_handle": "bruno"
    },
    "time_stamp": "2022-01-25 12:45:10",
    "text": "Hi all, anyone having issues with custom objects today? I can't copy properties between objects, and when i click on it, it loops back to the Deal (I.E)."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-01-25 13:23:28",
    "edited": {
      "time_stamp": "2022-01-25 13:23:39"
    },
    "text": "Hey <@U011U4A6TNY>, sorry this has taken a bit I checked internally on this.\n\nThe reason that page can’t be prerendered is you’re using the A/B testing functionality on that page.\n\n<https://developers.HubSpot.com/docs/cms/developer-reference/cdn/prerendering#:~:text=Pages%20that%20use%20Adaptive%20Tests%20or%20A/B%20Tests>\nWe’re hoping to support the feature in prerendering down the road, but it’s a particularly tricky feature since we are serving an entirely different copy of the page dynamically based on the a/b test."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-25 13:35:12",
    "text": "Hey Jessica! The only reason you would need to upgrade here would be to leverage behavioral events, but there are likely many ways you could leverage the data that is currently segmented between the two platforms depending on your goals."
  },
  {
    "text": "I rolled back my migration for the granular scope migration process and now I receive this error when I try to retry the process: \"Something Went Wrong. Please retry later or contact suppport\" Does anyone know what to do to fix this error?",
    "time_stamp": "2022-01-25 14:17:01"
  },
  {
    "poster": {
      "poster_name": "Stan Bartczak",
      "poster_handle": "stan"
    },
    "time_stamp": "2022-01-25 23:56:23",
    "text": "I agree, the solution/workaround depends on what data exactly you are trying to integrate between the 2 systems"
  }
]