[
  {
    "poster": {
      "poster_name": "Chris Richter",
      "poster_handle": "chrisr"
    },
    "time_stamp": "2022-01-05 13:22:34",
    "text": "Hi all, does anyone know where we can get help with the contact scopes migration before the deadline of February 28, 2022? It's in reference to this <https://developers.HubSpot.com/docs/api/oauth/contacts-scope-migration>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 15:54:46",
    "text": "No, this is not currently supported.\n\nAs you suggest, what's currently supported are two things:\n• Using SAML based SSO to log in to a HubSpot account (i.e. using Okta to login to a HubSpot account)\n• Using SAML or JWT based login for HubSpot CMS Private Content login"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:00:33",
    "text": "That's the only method. The request signature verification is the method to verify that the request is coming from HubSpot. The request will include info about the account and user, so you can verify that:\n1. The request is legit - (both HubSpot and you know your oAuth 2.0 client secret, which is the critical component to create the hashed string)\n2. Who the account/user is\n3. Then, return relevant data to the card\nAssuming you've seen the doc on request verification? <https://developers.HubSpot.com/docs/api/webhooks/validating-requests>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:02:37",
    "text": "This is a transactional type email and requires an add-on in HubSpot. You can talk to your customer success manager about this (or, talk to support and they can help you get connected)\n\nYou CAN send this email via normal marketing email, but it will include subscription status footer and filter out any opted out contacts before sending."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:05:41",
    "text": "<@U02S74KKXPW> - can you say more about the flow?\nI'm going to make an assmption about the likely way this is setup or should be setup.\n\n1. You created a Webhook subscription in your developer portal and app.\n2. The app must then be installed into a HubSpot account - remember that apps authenticated via oAuth 2.0 are meant to be authorized into many HubSpot accounts.\n3. For any account that authorizes your integration, any deal stage change will fire a webhook at the webhook URL provided in the Developer portal / app.\n4. Your Integromat scenario can then trigger"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:06:37",
    "text": "In Integromat, did you set up a custom HubSpot oAuth connection that uses your client secret and client ID?\n\nThen, did you authorize the app into your desired HubSpot portal?"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:08:34",
    "text": "I've actually setup something almost identical to this before."
  },
  {
    "text": "In my app, see my Integromat webhook",
    "time_stamp": "2022-01-05 16:08:40"
  },
  {
    "text": "Then in the auth tab, make sure you've copied the URL and then installed the app into the portal you care about:",
    "time_stamp": "2022-01-05 16:11:14"
  },
  {
    "text": "Resulting in your normal HubSpot portal (non-dev account) having your app connected under Settings &gt; Connected Integrations.",
    "time_stamp": "2022-01-05 16:12:04"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-01-05 16:12:34",
    "text": "This should then fire all of those changes at your Integromat hook"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2022-01-05 23:27:59",
    "text": "Does anyone is facing issue with page editor ?? I am noticing issue since morning like page editor is not working perfectly and is very slow to respond :thinking_face:"
  }
]