[
  {
    "text": "when trying to retrieve records, or create records in custom object getting \" Unable to infer object type from Member\",please help or provide link for this",
    "time_stamp": "2022-01-11 05:37:29"
  },
  {
    "poster": {
      "poster_name": "Shubhangi Pawar",
      "poster_handle": "oic_adap_team"
    },
    "time_stamp": "2022-01-11 05:39:09",
    "text": "I'm unable to create schemas through the Oauth API. The HubSpot API claims that I'm missing a required scope but doesn't mention which one it is. I'm only trying to create the schema on my app test account and the docs imply that this should work.\n\n The test account has the following products: \"Sales Enterprise\", \"Service Enterprise\", \"Marketing Enterprise\". Since they all have \"Enterprise\" in the name, they have access or not?\n\n\"App test accounts are free HubSpot accounts that include trials of many enterprise features.\"\n\n I'm guessing that these test accounts don't have access to custom objects. But if that's the case, how do any developers test this feature?\n Can you provide clarity here?"
  },
  {
    "poster": {
      "poster_name": "Petrine Nyhus",
      "poster_handle": "petrine"
    },
    "time_stamp": "2022-01-11 06:11:44",
    "text": "Hi there, HubSpot homies. It's a pleasure making your electronic acquaintance :)\n\nMy team is building a HubSpot-eSign integration, and want it to support signing Quotes as described <https://knowledge.HubSpot.com/deals/use-e-signatures-with-quotes|here> (the HS functionality is powered by HelloSign, however, according to a customer representative, there shouldn't be anything in the way of other signing solutions building support for the same).\n\nI haven't been able to find instructions for how to build this in the API documentation. Would anyone be able to point me in the right direction, or provide some generic guidance?"
  },
  {
    "text": "There’s definitely something wrong with the section screenshot generator. Sometimes it will show an empty box, other times varying levels of faintness of what the actual section looks like (as seen in the screenshot below). You can just barely make out that there’s anything there at all, sometimes you get a bit clearer of an image, and sometimes (rarely) it comes out perfectly fine. It seems like it’s prematurely taking the screenshot while it’s still appearing, or something… not sure really.",
    "time_stamp": "2022-01-11 12:17:12",
    "edited": {
      "time_stamp": "2022-01-11 12:18:02"
    },
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-11 12:18:38"
      },
      {
        "time_stamp": "2022-01-11 12:23:24"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2022-01-11 12:18:38"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-11 12:23:24",
    "text": "It may also have to do with things appearing/fading in. Maybe give it an extra second or 2 of delay before taking the screenshot to account for such things?"
  }
]