[
  {
    "poster": {
      "poster_name": "Vaishali Jain",
      "poster_handle": "vaishalijn9211"
    },
    "time_stamp": "2022-01-28 01:43:13",
    "text": "you can use load more js for infinite scolling"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2022-01-28 01:44:14",
    "text": "any reference??"
  },
  {
    "poster": {
      "poster_name": "Hitesh Patel",
      "poster_handle": "hitesh102"
    },
    "time_stamp": "2022-01-28 02:31:04",
    "text": "<@U01T4LC601X> hi"
  },
  {
    "text": "<@U01T4LC601X>\nthis code useful to you",
    "time_stamp": "2022-01-28 02:31:30"
  },
  {
    "poster": {
      "poster_name": "Ville Pekkarinen",
      "poster_handle": "ville"
    },
    "time_stamp": "2022-01-28 02:54:36",
    "text": "You'd need to get blog data via JS and outside of API solutions that require authentication (or serverless functions, if your account permits, I suppose) I don't think it can be done"
  },
  {
    "poster": {
      "poster_name": "Ville Pekkarinen",
      "poster_handle": "ville"
    },
    "time_stamp": "2022-01-28 02:55:24",
    "text": "Of course you could loop through all the posts and output a `const blogs = []` in the template and use that for data, but if you have a huge number of posts it might not be feasible"
  },
  {
    "poster": {
      "poster_name": "Kyle Bloom",
      "poster_handle": "kbloom"
    },
    "time_stamp": "2022-01-28 07:55:32",
    "edited": {
      "time_stamp": "2022-01-28 07:57:53"
    },
    "text": "I have noticed HS being a little slow to update with another project I'm working on using a contact property to control user viewing preferences on a website as well. I like your solution by using query parameters in the URL and will give that a shot."
  },
  {
    "poster": {
      "poster_name": "Kyle Bloom",
      "poster_handle": "kbloom"
    },
    "time_stamp": "2022-01-28 07:57:29",
    "text": "As far as actually accessing those contact properties within hubl on a HS landing page, I haven't been able to find any documentation on how to do that. I have seen the contact properties api that I'm using on the other project I mentioned, but I would think if you're on a landing page in hubl within HS that would not be necessary? Or am I wrong in that? Thanks for any pointers on that one."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 08:04:31",
    "text": "Nope, you’re right on there, the syntax is literally `{{ contact.email }}` etc…\n\nI’d recommend using the “developer info” tool in the sprocket menu to see all the data available in hubl on a given page"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 08:05:09",
    "text": "Note, this is for rendering and logic use; you can not change or update contact properties using hubl"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 08:12:54",
    "text": "Hey Stefan, I’ve done this a few times. You have three options: loading a ton of posts using the ‘recent posts’ function (max 200 objects returned), using the blog APIs as Ville mentioned (but this will require either serverless functions or some middleware for authentication) or my preference, AJAX.\n\nUsing the AJAX method, you essentially crawl the subsequent autogenerated pages of your blog (/page/2) using intersection observer or another scroll trigger to get the data for your posts and then build your cards or sections in a way that doesn't download unnecessary data for your users.\n\nRegardless of your approach, this will require some good JS skills, just wanted to be clear there."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 08:13:36",
    "text": "The new graphql data layer could be an option as well, but I haven’t experimented with that yet"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-01-28 08:44:41",
    "text": "Another option would be to add some data to  the `simple listing`  page. This page, by default, will house all of your blog posts unless you tell it otherwise. So you could create a data obj here in JS that gives you whatever you want from the blogs and then, similar to what mark said, use AJAX to grab that data object. It’s nice because it’s only one call to grab whatever you need and then you can deal with that data however you want on the fly."
  },
  {
    "poster": {
      "poster_name": "Kyle Bloom",
      "poster_handle": "kbloom"
    },
    "time_stamp": "2022-01-28 08:54:56",
    "text": "I had no idea such a thing existed! Is that \"developer info\" tool within the \"Marketing -&gt; Files And Templates -&gt; Design Tools\" interface when you're viewing an .html or .module file? or is that in the design editor view when editing a site/landing page? I can't seem to find the sprocket menu. Some kind of reference like that is exactly what I need."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 09:13:16",
    "text": "Preview any page while you're logged into your HS account and the sprocket menu should be in the top right corner"
  },
  {
    "poster": {
      "poster_name": "Kyle Bloom",
      "poster_handle": "kbloom"
    },
    "time_stamp": "2022-01-28 10:22:21",
    "text": "Thank you so much Mark! Have a great Friday and weekend"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-28 10:42:37",
    "text": "back at you dude!"
  },
  {
    "poster": {
      "poster_name": "Samir Singh",
      "poster_handle": "ssingh"
    },
    "time_stamp": "2022-01-28 13:00:14",
    "text": "Hello!  This is a long shot.  I know this isn't a support channel, but just wanted to see if I can get pointed in the right direction.  We have an ex-employee at our company who set up a HubSpot OAuth app.  We need to make changes to the OAuth app, but we lost access since the ex-employee's email is no longer active.  Do you know who can help us regain access?  I tried HubSpot Chat Support to no avail.  I really appreciate your help.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-28 13:02:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-01-28 13:02:57",
    "text": "Could you send me the HubID for the HubSpot account, or the support ticket id?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-28 13:46:19",
    "edited": {
      "time_stamp": "2022-01-28 15:09:50"
    },
    "text": "Uhmmm. For some reason I'm getting 403 Forbidden Errors for images and videos on my website when I try to load them now. Is HubSpot blocking me? :sob: I'm not DDOS'ing you HubSpot, I promise. I'm just working on a theme. EDIT: Thank you for unblock HubSpot."
  },
  {
    "poster": {
      "poster_name": "Bryan Daniel Moncada Ramos",
      "poster_handle": "bdanielmr"
    },
    "time_stamp": "2022-01-28 15:14:57",
    "text": "Hello HubSpot fam.  Wanted to know if there is any doc to implemented matillion routine to export data to google cloud and then to HubSpot.\nthant for answers"
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2022-01-28 18:56:15",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-28 20:35:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-01-28 20:35:45",
    "text": "The conversations widget actually comes with the HubSpot analytics tracking code.\n\nAdditionally it sounds like you want to interact with it. This may help.<https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk|https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk>"
  }
]