[
  {
    "text": "Thanks guys! Our design team has put together some concepts for a set of simple \"mini-modules\" to use within blog posts to help move visitors through an article. They range from very simple text callouts and pull-quotes (which can probably be handled with a wrapping html tag w/ class attribute) to things that might require multiple inputs like a side-by-side image+quote or a whitepaper download callout with an image side-by-side with headline & download button. For example:",
    "time_stamp": "2020-07-18 06:06:38"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2020-07-18 06:15:22",
    "text": "For the simple quote on the bottom, we could almost already do that by using the blockquote in the dropdown to the far left of the RTE toolbar... it would be great if we had the ability to add new elements to that dropdown (or the insert/advanced dropdowns) where we could specify the wrapping html `&lt;blockquote class=\"mds-pullquote\"&gt;{{text}}&lt;/blockquote&gt;`"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2020-07-18 06:55:06",
    "text": "The \"mini-modules\" that have multiple inputs might be a little more complicated, but I picture that UI maybe to act like it does when you click on the \"add link button\" where you edit the content in a popup. Then on the backend we would somehow have to be able to give multiple insertion points\n```&lt;figure class=\"mds_blockquote\"&gt;\n    &lt;img src=\"{{image.src}}\" alt=\"{{image.alt}}\"&gt;\n    &lt;blockquote&gt;\n        &lt;p&gt;{{text}}&lt;/p&gt;\n    &lt;/blockquote&gt;\n    &lt;figcaption&gt;{{author}}&lt;/figcaption&gt;\n&lt;/figure&gt;```\n"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2020-07-18 06:57:35",
    "text": "Alternatively (or additionally) another great HubSpot feature would be the ability to specify a set of modules that can be used within a DND/flex column. That way we could develop a few modules to be used within blogs like this, without opening up blog posts to our entire set of modules. I don't believe this is currently possible, correct?"
  }
]