[
  {
    "poster": {
      "poster_name": "Nate Perry",
      "poster_handle": "nate829"
    },
    "time_stamp": "2020-07-31 09:06:28",
    "text": "Hey all,\n\nWent to sync a project earlier and was notified our teams test account expired today. When we went to renew it the status changed from expired to active like expected, however our account never actually updated and seem to be locked out of syncing locally or even viewing the files we had in the design manager.\n\nHubSpot seems to not really offer any support to devs. Anyone have any solutions or experience this before? We can easily create a new test account and that works fine, but it of course doesn’t have any of projects.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-07-31 09:21:46"
      },
      {
        "time_stamp": "2020-07-31 09:21:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sandy Garrido",
      "poster_handle": "sandy889"
    },
    "time_stamp": "2020-07-31 09:21:46",
    "text": "So I found out that those accounts which expire are not the right type of test accounts.\nThese CMS test ones are - this might help for future ones?"
  },
  {
    "poster": {
      "poster_name": "Sandy Garrido",
      "poster_handle": "sandy889"
    },
    "time_stamp": "2020-07-31 09:21:49",
    "text": "<https://offers.HubSpot.com/free-cms-developer-sandbox>"
  },
  {
    "poster": {
      "poster_name": "Daniel Braun",
      "poster_handle": "dbraun"
    },
    "time_stamp": "2020-07-31 15:59:26",
    "text": "Hello everyone! I'm new to local development in HubSpot and I'm trying to setup an older project (years ago) my employer has to use local development. I have successfully set up a local env, fetched the production website dev files and then uploaded them to my sandbox account's design manager. The production site does not use \"themes\" (just a folder?), so that was a bump in the road to figure out that in my sandbox, I needed to delete the tutorial theme that was present in order for the sandbox website to stop looking at it. So now I just have a normal folder containing /Coded_Files /Custom_Modules and /Templates. Given what I'm trying to do, am I right so far to be using \"sandbox\" as a \"dev site\"? I see uploading code files IMMEDIATELY publishes them, and thats no good for production. So I'm guessing I need the sandbox, right? But the problem is that the sandbox has none of the pages/blogs, assets or database of the production site. If I understand what I've researched, there's no way for me to clone my production site to sandbox/dev, correct? And, what about global CSS &amp; Stylesheets, as found in the production site's Settings/Pages -- it doesn't exist in the sandbox Settings/Pages. I'm going to need that too for development (the site uses a \"main.css\" file. Sorry for the long post, but it seems like I'm going down a wrong path or missing a part of the workflow here to make local dev worth while. (and I really want this to work, esp for GIT!)",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-08-02 22:55:00"
      },
      {
        "time_stamp": "2020-08-02 22:55:50"
      },
      {
        "time_stamp": "2020-08-03 07:40:14"
      },
      {
        "time_stamp": "2020-08-03 10:17:44"
      },
      {
        "time_stamp": "2020-08-03 10:25:26"
      },
      {
        "time_stamp": "2020-08-04 04:03:03"
      },
      {
        "time_stamp": "2020-08-04 04:03:16"
      }
    ]
  }
]