[
  {
    "poster": {
      "poster_name": "Kris Gösser",
      "poster_handle": "kris443"
    },
    "time_stamp": "2020-07-22 10:23:46",
    "text": "Hello — Just getting started with scoping a build for my company's website to live on the HubSpot CMS.\n\nThe question I have is around local testing. As I design/build the theme, I'm a bit unsure of what the best way is to iteratively test my local updates in real-time with a local server.\n\nFrom what I researched in both documentation and in past Slack discussions here, it seems like the best practice is\n\n➜ Set up two portals in the YAML, one for my `production` real HubSpot account, and one using the `sandbox` account\n➜ Set `watch` on my directory, but have it sync to `sandbox`\n➜ When I'm ready to \"deploy\", I switch from the sandbox portal profile to the `production` one\n\nIs that still the suggested best practice for a development workflow?\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Kris Gösser",
      "poster_handle": "kris443"
    },
    "time_stamp": "2020-07-22 10:26:47",
    "text": "<https://HubSpotdev.slack.com/archives/CD432DF3K/p1595010600323100>"
  },
  {
    "poster": {
      "poster_name": "Kris Gösser",
      "poster_handle": "kris443"
    },
    "time_stamp": "2020-07-22 10:27:13",
    "text": "I just saw this thread in a different channel now. Looks like what I stated is indeed still the best practice. URL suggested is this one: <https://developers.HubSpot.com/docs/cms/guides/creating-an-efficient-development-workflow>"
  },
  {
    "poster": {
      "poster_name": "Kris Gösser",
      "poster_handle": "kris443"
    },
    "time_stamp": "2020-07-22 10:27:23",
    "text": "Sharing here for others in the future who search in Slack."
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2020-07-22 23:28:03",
    "text": "Do you want to create a custom blog listing or blog detail template? You can create a template for blog and set it through the settings. We use a custom module for our listing and the 'Blog Content' module for our blog detail pages. We also add a bunch of custom modules to the template for our blog detail page template.\nYou can than use the variables available for blog (set through the content object) as described here: <https://developers.HubSpot.com/docs/cms/hubl/variables#blog-variables>"
  }
]