[
  {
    "poster": {
      "poster_name": "Shamash Athoraya",
      "poster_handle": "shamash.athoraya928"
    },
    "time_stamp": "2024-05-20 02:14:48",
    "text": "Hi, anyone know if it’s possible to control HubSpot cookies using a 3rd party consent solution (not cookiebot)? What I’ve found in the documentation is either rejecting all cookies or allowing all (`_hsq.push(['doNotTrack']);`), but what if a user accepts analytics cookies but not functional? There’s a function to get the consent status of the different categories but not to push updates :thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Gagandeep Singh",
      "poster_handle": "gagan317"
    },
    "time_stamp": "2024-05-20 03:52:47",
    "text": "Hi all, is there an api to update quote payment status?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-20 15:03:02"
      },
      {
        "time_stamp": "2024-05-21 03:09:23"
      }
    ]
  },
  {
    "text": "Hi, How to log email replies using engagement API. I have used metadata for from and to email. but here after logging the record, it says from a different <http://account.It|account.It> is supposed to be the contact email address of that contact Is there a better way to solve this? i want to log email replies when this contact replies to my email.",
    "time_stamp": "2024-05-20 04:44:07"
  },
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-05-20 04:55:14",
    "text": "Hello <@U05CJMDM467>,\n\nThank you for your response.\n\nIt is set by HubSpot. We have used the JavaScript tracking script throughout the pages of the website:\n\n&lt;!-- Start of HubSpot Embed Code --&gt;\n&lt;!-- &lt;script type=\"text/javascript\" id=\"hs-script-loader\" async defer src=\"&lt;//js.hs-scripts.com/HUBID.js&gt;\"&gt;&lt;/script&gt; --&gt;\n&lt;!-- End of HubSpot Embed Code --&gt;\n\nYour attention to this matter is greatly appreciated, and we eagerly await your response."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-05-20 05:28:39",
    "text": "So I see that on April 24th the new Orders and Carts public APIs were announced as available.  I also can see in the Data Management -&gt; Properties that both the Cart and Order object properties can be managed.  But I do not see either of these objects in the Data management -&gt; Objects reference yet.  Has anyone started using these APIs yet?  Where can a user access these objects in HS?  I am interested in checking these objects out because I have needs for these in a few client portals.  <https://developers.HubSpot.com/changelog/new-public-apis-for-orders-and-carts-objects> (edited)"
  },
  {
    "poster": {
      "poster_name": "Bashir",
      "poster_handle": "ayo_idan"
    },
    "time_stamp": "2024-05-20 05:37:52",
    "text": "Hi, \n\nI’m sorry I can’t be of more help at the moment. I am unable to visualise the issue completely "
  },
  {
    "poster": {
      "poster_name": "Max B",
      "poster_handle": "mbrooks"
    },
    "time_stamp": "2024-05-20 06:40:39",
    "text": "Hi, I'm trying to use the search bar on this page <https://developers.HubSpot.com/docs/api/overview>. But all the links take me to links like this <https://developers.HubSpot.com/#endpoint?spec=POST-/crm/v3/objects/companies> which is just a splash screen."
  },
  {
    "poster": {
      "poster_name": "Borna Budimir-Bekan",
      "poster_handle": "bbekan"
    },
    "time_stamp": "2024-05-20 06:52:11",
    "text": "Could somebody tell me what property does the \"Deal Origin\" dimension correspond to in the CRM API?"
  },
  {
    "poster": {
      "poster_name": "Jesse Roberts",
      "poster_handle": "jesse385"
    },
    "time_stamp": "2024-05-20 08:03:54",
    "text": "Is there a way to presign a request for an image that is stored as part of a form submission? currently, we push info from the form submission to our CRM. We are only able to receive the URL for the image, and our API is not able to access the image as it's behind a 2FA. Could anyone provide some guidance as to a best practice for retrieving the image without needing the 2FA (or with pre-coding the request in the integration call)?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-05-20 08:32:55",
    "text": "It's now live :blush:"
  },
  {
    "poster": {
      "poster_name": "Roy Vincent Niepes",
      "poster_handle": "roy508"
    },
    "time_stamp": "2024-05-20 08:35:27",
    "edited": {
      "time_stamp": "2024-05-20 08:35:58"
    },
    "text": "is HubSpot having an issue?\n\nsome api endpoints suddenly returns 404"
  },
  {
    "poster": {
      "poster_name": "Roy Vincent Niepes",
      "poster_handle": "roy508"
    },
    "time_stamp": "2024-05-20 08:45:28",
    "text": "api endpoints are now coming back thanks"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-05-20 09:13:00",
    "text": "<@U070VV9A9MH> Just joined this channel and did a search for “Fivetran” conversations… because i, too, am a data warehouse person, and already having issues bringing data into BigQuery.  Wondering if there was a resolution to this?  [Also wondering if your fivetran connection was successful in bringing in any custom events?  I’m having a hell of a time finding where they might have ended up… I don’t see them in the “events” table.. and I’m not seeing any other potential tables…or, for that matter, where I can find ANY of the events associated to contacts…]"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-05-20 09:14:38",
    "text": "Hey <@U01R5BKGZE1> - I just joined this slack channel and searched for “Fivetran” - cause I”m also runing into lots of issues bringing HubSpot data into data warehouse.  Did you ever get a solution to your API usage issue?  Additionally, wondering if you know where any of the custom events may end up in the data warehouse?  [I’m not seeing them in the ‘events’ table and can’t figure out where else they might be.] Thanks!"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-05-20 09:16:00",
    "text": "Hi <@U01T0NZSXR9> - I just joined this slack channel and did a search for “Fivetran” because I’m also having trouble bringing in my HubSpot data into a data warehouse. Did ou end up getting a resolution to this question? Thanks!"
  },
  {
    "time_stamp": "2024-05-20 10:00:24",
    "text": "Reminder: *Want to be the first to know when a new API is available or an existing API has a new version?*  We publish all of that on our <https://developers.HubSpot.com/changelog|Developer Changelog>.  While we do our best to avoid <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes> to our APIs, sometimes for security, and reliability we have to. The Changelog is where we’ll post announcements ahead of time about it. <https://developers.HubSpot.com/changelog|Subscribe to the Developer Changelog> to stay up-to-date on what’s happening in the world of HubSpot development."
  },
  {
    "text": "<@U07443RTRPX> have you checked here?",
    "time_stamp": "2024-05-20 15:03:02"
  }
]