[
  {
    "poster": {
      "poster_name": "James Brownlee",
      "poster_handle": "james150"
    },
    "time_stamp": "2024-05-28 04:43:15",
    "edited": {
      "time_stamp": "2024-05-28 04:43:27"
    },
    "text": "I have solved this issue."
  },
  {
    "poster": {
      "poster_name": "Yinon Shalev",
      "poster_handle": "yinon"
    },
    "time_stamp": "2024-05-28 05:28:18",
    "text": "Hi,\nWhen a business wants to build a Private App for API integration with their product -\n\n1. Which environment needs to be opened to enable Private App API integration? I know there are several types of environments and need guidance.\n2. How do you open it? Who should open it so that it is accessible to developers?\n3. How do you synchronize the fields from the production portal to the development environment?\n4. How do you create a Developer user for both the development environment and the production portal?\n5. Where is the private app actually produced - in the development environment or in the production portal?\n6. If it is produced in the development environment - how do you then transfer it to the production portal?\n\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Masa Alnomani",
      "poster_handle": "malnomani"
    },
    "time_stamp": "2024-05-28 05:51:44",
    "text": "Hi,\nI have problems with the Marketing Beta API. I have used the POST request `/marketing/v3/emails` to create an email.\nI added the parameters `name`, `recipient` and `widgets` to the body of the request, but the output does not contain any of my inputs.\nSo these three parameters are empty in the output. Did anyone have the same issue?"
  },
  {
    "poster": {
      "poster_name": "Kemin Kasundra",
      "poster_handle": "kemin"
    },
    "time_stamp": "2024-05-28 06:05:34",
    "text": "Hi,\nI am submitting form using HubSpot API from one of my website pages which is created on HubSpot CMS only.\nI need to include hutk with form params to able to track analytics.\nFor that I already embeded HubSpot tracking code and it is storing cookie also. But on <http://HubSpot.com|HubSpot.com> domain. So, when I try to get it while submitting form to include it in params it is not accessible."
  },
  {
    "poster": {
      "poster_name": "Estelle Louviot",
      "poster_handle": "estelle155"
    },
    "time_stamp": "2024-05-28 09:08:54",
    "text": "Hi all :wave:\n\nMy team and I are working on an integration with HubSpot and we are planning to send activities in the activity timeline. We want these events &amp; event tokens sent in the timeline to be usable in workflows - from the docs we've seen and the tests we've made, it seems to be possible. We still have some questions though on event tokens :\n• Are all event tokens usable in workflows or do they need to be of a certain type (string, date...) ?\n• For a given event, is it possible to set up different event tokens for each of our customers who will be using our integration?\n• Can the event tokens or the content of the event tokens we send change over time? Depending on the evolution of certain customer parameters in our product, we may need to modify the data sent for certain events.\nThanks for your help :slightly_smiling_face:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-30 06:00:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2024-05-28 09:32:58",
    "text": "this is good to know. Thanks for sharing your results"
  },
  {
    "poster": {
      "poster_name": "Manu Shakthi",
      "poster_handle": "manusakthi94"
    },
    "time_stamp": "2024-05-28 10:01:04",
    "text": "I created one custom form in this developer account and  I need to implement one form in my website and post the values using HubSpot api. I checked one HubSpot link \"<https://legacydocs.HubSpot.com/docs/methods/forms/submit_form>\" is this correct?\n\nHow to get the portalId and formGuid"
  }
]