[
  {
    "poster": {
      "poster_name": "Efe Efeoglu",
      "poster_handle": "efeefeoglu"
    },
    "time_stamp": "2021-10-27 03:37:07",
    "text": "Hi guys do you know is there anyway to reach email templates through api? I cound't see in api docs?"
  },
  {
    "poster": {
      "poster_name": "Juan Gomez",
      "poster_handle": "felipe.gomez"
    },
    "time_stamp": "2021-10-27 05:46:55",
    "text": "Hi\nI've create some personalised properties for our deals, but I can't see those properties when I'm trying to get the information of our deals using the API.\nDoes some know what I'm forgetting to do?\n(I'm using the free HubSpot version)"
  },
  {
    "poster": {
      "poster_name": "Dominic Ostiguy",
      "poster_handle": "d.ostiguy"
    },
    "time_stamp": "2021-10-27 10:33:39",
    "edited": {
      "time_stamp": "2021-10-27 10:35:15"
    },
    "text": "Hi everyone,\n\nI created a custom integration that's using the card system.\n\nThe card generate an \"Action / iframe\" button that when clicked, call an external endpoint on my server to do an action.\n\nSo far so good.\n\nThe problem is when the Iframe is closed (either manually via the \"X\" on the HubSpot interface or using the javascript way, HubSpot send a second call to the endpoint thus doing the action twice.)\n\nHow do you prevent or at least identify which request is the original and which request is the \"Closing request\" ? I dont want the action to be done twice, only once....\n\nI tried adding a flag in the Uri of the button that opens the iframe, but that same flag is also sent when closing... basically both requests look identical and I dont seem to have a way to know which one is which"
  },
  {
    "poster": {
      "poster_name": "Josimar Andrade",
      "poster_handle": "jandrade"
    },
    "time_stamp": "2021-10-27 11:14:01",
    "text": "I know that the API for creating associations has to be use after object creation *Question:* but there is a way to *create the object with association at the same time?*"
  },
  {
    "poster": {
      "poster_name": "Sam Korn",
      "poster_handle": "sam594"
    },
    "time_stamp": "2021-10-27 17:00:47",
    "text": "Does anyone know if you can create Events using the API? I can only see that you can view events?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-28 08:30:47"
      },
      {
        "time_stamp": "2021-10-28 08:31:03"
      },
      {
        "time_stamp": "2021-10-28 10:41:42"
      },
      {
        "time_stamp": "2021-10-28 10:42:15"
      },
      {
        "time_stamp": "2021-10-28 10:47:16"
      },
      {
        "time_stamp": "2021-10-29 02:50:07"
      },
      {
        "time_stamp": "2021-10-29 02:51:04"
      }
    ]
  }
]