[
  {
    "poster": {
      "poster_name": "Hector Archilogic",
      "poster_handle": "hector290"
    },
    "time_stamp": "2021-10-21 03:59:16",
    "text": "Hi everyone,\nI want to schedule an API request to obtain the feedback submission every certain time.\nIs there any way to add time filter into the request?\nFor now I’m getting everything and filtering on my own, but I don’t want to block your API and is not the best way either.\nI’ve opened a post as well. Thank you in advance:\n<https://community.HubSpot.com/t5/APIs-Integrations/Filter-API-Request-by-timestamp/m-p/513614#M47924>"
  },
  {
    "poster": {
      "poster_name": "Hector Archilogic",
      "poster_handle": "hector290"
    },
    "time_stamp": "2021-10-21 04:31:20",
    "text": "Following this,\nI would like to ask as well if there is any way to get the owner of a contact by using the contact endpoint API.\n\n<https://community.HubSpot.com/t5/APIs-Integrations/Get-Owner-of-a-Contact-by-Contact-API-Endpoint/m-p/513658#M47929>\n\nThank you in advance."
  },
  {
    "poster": {
      "poster_name": "Richard Leo",
      "poster_handle": "richard911"
    },
    "time_stamp": "2021-10-21 05:44:25",
    "text": "Hello\n\nIs there a way to obtain the folder of a List, I dont see it on the API. I want to know to what folder the list belongs to, it seems there is a \"parentFolderID\" on the response but it is always null.  Any ideas?"
  },
  {
    "poster": {
      "poster_name": "Richard Leo",
      "poster_handle": "richard911"
    },
    "time_stamp": "2021-10-21 05:54:36",
    "text": "Hi Mohit, im not sure but it seems its a problem on the data you are uploading. You have to convert it to byte[] first"
  },
  {
    "poster": {
      "poster_name": "Richard Leo",
      "poster_handle": "richard911"
    },
    "time_stamp": "2021-10-21 05:58:04",
    "text": "Also, you are storing the file as \"jpg\", of course you will see that if you open it with Notepad, try opening it as an image"
  },
  {
    "poster": {
      "poster_name": "Tord Holmqvist",
      "poster_handle": "tord"
    },
    "time_stamp": "2021-10-21 07:02:42",
    "text": "Hi, I'm building an application with a crm card extension and have some questions regarding the response format?\nin the v3 response format the id of the section is defined as a string and still the card will not load unless the id can be parsed to an integer? I can not find any schema for this response format (apart from the example) and no motivation why this limit exists?"
  },
  {
    "poster": {
      "poster_name": "Ben Gavin",
      "poster_handle": "ben.gavin"
    },
    "time_stamp": "2021-10-21 11:22:46",
    "text": "Does anyone know if there is any more detailed documentation available for the CRM v3 import endpoints?  The overview has a couple examples, but the actual request format for creating a new import doesn't seem to be documented fully (i.e. what fields are available, valid values, etc).  It's also rather unclear if running an import full of existing contacts will update those contacts, or simply return a bunch of conflict errors.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-22 00:12:54"
      },
      {
        "time_stamp": "2021-10-22 15:09:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-10-22 00:12:54",
    "edited": {
      "time_stamp": "2021-10-22 00:13:49"
    },
    "text": "<https://github.com/HubSpot/HubSpot-api-nodejs>\n<https://github.com/HubSpot/HubSpot-api-python>\n\nnote that the client libraries are actually auto-generated (OpenAPI spec) which means that they’ll share pretty much the same payloads.\n\nThe node library for example has an import example:\n```<https://github.com/HubSpot/HubSpot-api-nodejs#example-import-contacts>```\nAlso if you click “Endpoints” on this page you’ll get more detail about the import endpoints <https://developers.HubSpot.com/docs/api/crm/imports>\n\nThe valid are dependant on the type of the target properties"
  }
]