[
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-10-07 04:05:15",
    "text": "As far as im aware this is not possible yet"
  },
  {
    "poster": {
      "poster_name": "Kristian Overgaard",
      "poster_handle": "kristian.overgaard"
    },
    "time_stamp": "2021-10-07 06:15:14",
    "text": "I'm looking into som workflows appearing, seemingly, out of nowhere in our HubSpot.\nWhen i GET the workflow thorugh the api i get af creationSource, but i'm not sure exactly if it's the webinterface, og an api integration that creates them, or something completely different.\n\n```<https://api.hubapi.com/automation/v3/workflows/1234>\n\n\"creationSource\": {\n    \"sourceApplication\": {\n      \"source\": \"DIRECT_API\",\n      \"serviceName\": \"AutomationPlatformService-web\"\n    },\n    \"clonedFromWorkflowId\": 16898692,\n    \"createdAt\": 1633426295523\n  },\n    ```\nCan someone point me to the documentation for the different creationSource and what they mean ?\nThe above example sounds like an integration with DIRECT_API, but a user interaction in the web interface based on serviceName."
  },
  {
    "text": "Hi <@U016E6U81V1>, unfortunately we don't have a public API that exposes the customers HubSpot subscription tier.\n\nTo solve for this integrators generally list the requirements for installation like; required subscription tier and the permissions the app will be requesting etc",
    "time_stamp": "2021-10-07 08:13:18"
  },
  {
    "text": "Hi <@U01SBFHARMZ> , hope you are doing well.\n\nThis is relatively new functionality so the engineering team will be monitoring the adoption rate of the API and the feedback coming from users over the coming weeks to decide how long the beta will run for. So if you have any feedback you can share it directly on the documentation.\n\nWhen an API exits beta and enters general availability we will announce it on the developer changelog which you can subscribe to and get a notification when it happens.",
    "time_stamp": "2021-10-07 08:28:39"
  },
  {
    "poster": {
      "poster_name": "Maxime Blaszka",
      "poster_handle": "mblaszka"
    },
    "time_stamp": "2021-10-07 09:27:07",
    "text": "any ideas ?"
  },
  {
    "poster": {
      "poster_name": "Dr. Hutson",
      "poster_handle": "dr-hutson"
    },
    "time_stamp": "2021-10-07 11:34:48",
    "text": "<#C2YHAHB6K|api> Working through pulling Company information using the API. Trying to map between our different systems. I successfully pull company info using CURL, but I'm not getting Industry or City or State values. I confirmed these values are present in the App and populated by HubSpot Insights Database. Any ideas why these would be excluded from an API result? this is the URL I'm using `<https://api.hubapi.com/crm/v3/objects/companies?archived=false&amp;hapikey=>`"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-10-07 11:51:56",
    "text": "Any plans to augment the events API with quantities? So many of the reasons we have for using the events API are about tracking not justs \"did this event happen\" but \"in what amount did this happen\" (e.g. did this person consume a certain amount of some consumable) - the absence of this ended up forcing our team go to pick up a maxpanel type product which does the job but we'd prefer to keep everything in HubSpot.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-08 05:31:00"
      },
      {
        "time_stamp": "2021-10-08 17:33:46"
      }
    ]
  },
  {
    "text": "Hello, I have a problem.\nThe problem is that the text in the footer is searched.\nTo solve this problem, I surrounded `hs-search-hidden`, but I continue to be exposed to search results. How can I solve this problem?\nplease~",
    "time_stamp": "2021-10-07 23:00:40",
    "edited": {
      "time_stamp": "2021-10-07 23:00:53"
    }
  }
]