[
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-10-12 03:29:52",
    "text": "Hi <@UJJ239SC9> Is this only available with mh enterprise our site is on CMS Enterprise with SH Pro"
  },
  {
    "poster": {
      "poster_name": "walter lentfert",
      "poster_handle": "walter"
    },
    "time_stamp": "2021-10-12 07:53:26",
    "text": "Hi There, the contact API can write values based on the contact ID as a handle. so if the ID you use in your own redirect tool = the HubSpot ID (even if it is encrypted) you are in a good spot. then the payload can update ANY value on the contact property level"
  },
  {
    "poster": {
      "poster_name": "Matthieu Veillon",
      "poster_handle": "matthieu.veillon"
    },
    "time_stamp": "2021-10-12 11:43:09",
    "text": "perfect thanks, your answer helped me to figure it out"
  },
  {
    "poster": {
      "poster_name": "Matthieu Veillon",
      "poster_handle": "matthieu.veillon"
    },
    "time_stamp": "2021-10-12 11:49:17",
    "text": "Hey folks,\n\nI have a *custom object* for which I have only a code (not the id) and I try to get a company information associated to it. Currently I do (with the node sdk) :\n\n1. call `HubSpotClient.crm.objects.searchApi.doSearch` with a query where I filter based on the code I have.\n2. With my custom object instance, I now have its instance which allows me to get the associations through `HubSpotClient.crm.objects.basicApi.getById` allowing me to pass the associations I want aka \n3. With the associated companyId I can now call `HubSpotClient.crm.companies.basicApi.getById` which allows me to get specific fields on that company instance\nThis 3 calls logic seems sub-optimal to me, and I’m pretty sure there is a better way to handle it (at least reduce it to 2 calls)"
  },
  {
    "poster": {
      "poster_name": "Matthieu Veillon",
      "poster_handle": "matthieu.veillon"
    },
    "time_stamp": "2021-10-12 11:49:53",
    "text": "I still have one question here though :slightly_smiling_face: <https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1634060957397200> if you have any clue - would be super apprectiated. Thanks in advance"
  },
  {
    "poster": {
      "poster_name": "Eric",
      "poster_handle": "eric.hoppe"
    },
    "time_stamp": "2021-10-12 11:51:14",
    "text": "Hi all. Wondering if anyone has experience with creating contacts in HubSpot via the API, and how you would get it to stop showing \"created via Offline Sources\" as the source, and instead, view the actual source for that new lead.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-12 12:35:06"
      },
      {
        "time_stamp": "2021-10-12 12:35:10"
      },
      {
        "time_stamp": "2021-10-12 13:53:13"
      },
      {
        "time_stamp": "2021-10-12 13:53:46"
      },
      {
        "time_stamp": "2021-10-12 13:53:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mansoor Bahramand",
      "poster_handle": "mansoor"
    },
    "time_stamp": "2021-10-12 12:35:06",
    "text": "Hey Eric, I just solved for this! What you want to do is create a form in HubSpot and actually do a form submission via the api and pass in the `hutk` which will then populate the fields you are wanting for tracking."
  },
  {
    "poster": {
      "poster_name": "Mansoor Bahramand",
      "poster_handle": "mansoor"
    },
    "time_stamp": "2021-10-12 12:35:10",
    "text": "Hope this helps!"
  },
  {
    "poster": {
      "poster_name": "Mansoor Bahramand",
      "poster_handle": "mansoor"
    },
    "time_stamp": "2021-10-12 12:47:26",
    "text": "Lets talk about meetings, calendars, and engagements. I need help for coming up with a few solutions to integrate a HubSpot round robin calendar to be usable within our mobile app. Ideally, I’d like to allow our users to select a date and time that is available then submit via API to the round robin so it tracks in our HubSpot ecosystem. I tried reaching out to live chat but they were useless."
  },
  {
    "poster": {
      "poster_name": "Mansoor Bahramand",
      "poster_handle": "mansoor"
    },
    "time_stamp": "2021-10-12 12:49:45",
    "text": "I guess the requirements are as follows:\n1. Getting a list of available open times of all users based off round robin meeting link\n2. Book a meeting with the next person up in the round robin meeting link\n3. Redirecting the user to continue their experience in our flow\nI know we can use the engagements API to book meetings but I am not sure if it actually books a meeting in the calendar, I thought we could use the embed but it doesn’t allow me to redirect to a url with parameters passed in.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-30 11:19:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Eric",
      "poster_handle": "eric.hoppe"
    },
    "time_stamp": "2021-10-12 13:53:13",
    "text": "thanks Mansoor!"
  },
  {
    "poster": {
      "poster_name": "Eric",
      "poster_handle": "eric.hoppe"
    },
    "time_stamp": "2021-10-12 13:53:46",
    "text": "one of the challenges we're running into with doing a HubSpot form is we ask new users to enter a password, which HubSpot can't support"
  },
  {
    "poster": {
      "poster_name": "Eric",
      "poster_handle": "eric.hoppe"
    },
    "time_stamp": "2021-10-12 13:53:50",
    "text": "did you encounter that?"
  },
  {
    "poster": {
      "poster_name": "Kairen Tan",
      "poster_handle": "ktan"
    },
    "time_stamp": "2021-10-12 21:32:51",
    "text": "Hey guys, I am making calls to the *<https://legacydocs.HubSpot.com/docs/methods/email/get_events|Get Email Events endpoint>*. In the response payload for an Open event, I notice the `duration` field is set as the “the approximate number of milliseconds the user had opened the email.“.\n\nSo…. does that mean the Open event only becomes AFTER the the user has closed the email?"
  }
]