[
  {
    "poster": {
      "poster_name": "Andrew Peill",
      "poster_handle": "andrew.peill"
    },
    "time_stamp": "2021-10-14 04:24:44",
    "edited": {
      "time_stamp": "2021-10-14 04:26:06"
    },
    "text": "Hi, I am trying to access a HubDB table from one of my pages. I can grab the information just fine. However, I am using the API to store data into a field which is working fine (I can see it has updated in the table). But for some reason the webpage isn't being reflected by this and is just picking up old data by the looks of things. I thought the issue was because it could be updated in 'draft' mode possibly?\n\nI have tried using an endpoint like:\n<https://api.hubapi.com/cms/v3/hubdb/tables/5243285/publish?hapikey=**************>\nTo get it published.\n\nBut it doesn't seem to do anything in regards to publishing the table with the new data? It stays the same until i manually go to the HubDB and press Publish (at that point it does pick up on the webpage)"
  },
  {
    "text": "Can I update custom property by this endpoint?",
    "time_stamp": "2021-10-14 08:38:42"
  },
  {
    "poster": {
      "poster_name": "Julie Scotland",
      "poster_handle": "julie890"
    },
    "time_stamp": "2021-10-14 10:30:10",
    "edited": {
      "time_stamp": "2021-10-14 10:30:38"
    },
    "text": ":wave: I would like to set up a HubSpot form that  feeds information it collects into specific input fields within an excel model we've put together. Is there an easy way to do this? If so, once the data has been entered into the model, is there a way to then pull the new calculations from excel back into a HubSpot field? Basically I want two-way integration to avoid manual inputs.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-18 04:32:45"
      },
      {
        "time_stamp": "2021-10-20 09:52:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Josimar Andrade",
      "poster_handle": "jandrade"
    },
    "time_stamp": "2021-10-14 15:36:32",
    "text": "amazing you know how I can fallow to know when is out?"
  }
]