[
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vdw"
    },
    "time_stamp": "2021-10-18 04:32:45",
    "text": "I think if you want to alter fields, you'll be looking at the API or the operations hub. Don't think there is anything that will provide this natively"
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2021-10-18 08:11:09",
    "text": "Hey all, I have a customer that's trying to pull line items from HubSpot through Zapier. Seems like most are being found by Zapier save for two - Start Date and Recurring Billing Frequency). Any suggestions on how to figure out why these aren't available in Zapier?"
  },
  {
    "time_stamp": "2021-10-18 10:00:57",
    "edited": {
      "time_stamp": "2021-10-18 10:01:01"
    },
    "text": "Reminder: *Want to be the first to know when a new API is available or an existing API has a new version?*  We publish all of that on our <https://developers.HubSpot.com/changelog|Developer Changelog>.  While we do our best to avoid <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes> to our APIs, sometimes for security, and reliability we have to. The Changelog is where we’ll post announcements ahead of time about it. <https://developers.HubSpot.com/changelog|Subscribe to the Developer Changelog> to stay up-to-date on what’s happening in the world of HubSpot development."
  },
  {
    "poster": {
      "poster_name": "Alejandro Rivera",
      "poster_handle": "arivera655"
    },
    "time_stamp": "2021-10-18 16:22:38",
    "edited": {
      "time_stamp": "2021-10-18 16:23:45"
    },
    "text": "Hi everyone, i am creating a HubSpot forms via api, but i need create a forms in 2 columns, how could be possible? for example in 1st column firstname and 2nd column lastname",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-19 01:06:23"
      },
      {
        "time_stamp": "2021-10-20 06:08:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Klasson",
      "poster_handle": "anton839"
    },
    "time_stamp": "2021-10-19 00:40:44",
    "text": "Hello, I am trying to figure out webhooks in purpose to integrate with my workflow. My workflow triggers when a form is submitted, so then i want a webhook to trigger a google cloud function. I want this function to create a new document in my firestore to store incoming forms data. There are over 160 unique forms, so thats why I need webhooks. Thats atleast what im thinking. Is this possible or are there other solutions i should try?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-10-19 01:12:36"
      },
      {
        "time_stamp": "2021-10-19 01:24:10"
      },
      {
        "time_stamp": "2023-05-11 14:51:04"
      }
    ]
  }
]