[
  {
    "poster": {
      "poster_name": "Fran Casal",
      "poster_handle": "fcasal"
    },
    "time_stamp": "2024-02-06 03:55:23",
    "text": "Hi!\nSorry, I´m not sure which channel is the right one for a question like this:\n\n*Is it possible to build (in HubSpot CRM) a popup to show a test and gives the test results?*\nOur intention is to use a CTA to open such a test in a popup form with just a few simple questions (sliding one after another, not all at the same time) for the user to select a grade (1 to 5) and see a final grade not with calculation result. And after that, of course, a follow up email with the results.\n\nThanks in advance\nCheers",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-02-06 05:50:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "JuanCastellanos Entrenador Personal",
      "poster_handle": "juancastellanospt"
    },
    "time_stamp": "2024-02-06 04:57:15",
    "text": "Hey Team! i have a problem to connect one extern font for use it in to the landing page, i use this link <https://knowledge.HubSpot.com/de/website-pages/use-fonts-in-HubSpot> but there is not explanation to do it"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-02-06 05:50:46",
    "edited": {
      "time_stamp": "2024-02-06 05:51:19"
    },
    "text": "Yes, it's possible– working on such a project right now. HubSpot doesn't have multi-step forms yet, in which case, the future might provide a tool to make this type of thing easier.\n\nI am setting it up as a custom module with input fields for specifying the multi-step form elements.\n\nStoring the data in javascript for the calculated display on form submit, and adding the custom form element selections as values in hidden fields on a normal HubSpot contact form at the conclusion of the multi-step form, so that answers can also be traced back to contact."
  },
  {
    "text": "Hii\n\nCan someone help me from where to grant permission to access the tab as shown in below image ?",
    "time_stamp": "2024-02-06 06:28:19"
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-02-06 06:56:26",
    "text": "Hello, perhaps this is the wrong place to ask my question, if so please direct me :slightly_smiling_face:\n\nI am tasked with populating our HubSpot companies with information about them that we have in our Azure SQL Server database and am currently looking into different ways of doing this. We don't want to pay for this so a third party vendor is out of the question.\n\nI have mainly two ideas:\n1. Creating an API for the database which we then can do GET-requests to from HubSpot\n2. Connecting to the database using python according to this (<https://learn.microsoft.com/en-us/azure/azure-sql/database/azure-sql-python-quickstart?view=azuresql&amp;tabs=windows%2Csql-inter>) and then using POST-requests to populate the companies in HubSpot.\nAre there anyone who could point me in the right direction or has done something similar? Grateful for all help! :innocent:",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-02-06 10:05:14"
      },
      {
        "time_stamp": "2024-02-06 10:06:25"
      },
      {
        "time_stamp": "2024-02-06 10:08:02"
      },
      {
        "time_stamp": "2024-02-06 10:09:53"
      },
      {
        "time_stamp": "2024-02-06 10:17:04"
      },
      {
        "time_stamp": "2024-02-06 10:47:43"
      },
      {
        "time_stamp": "2024-02-06 11:09:06"
      },
      {
        "time_stamp": "2024-02-06 11:09:26"
      },
      {
        "time_stamp": "2024-02-06 11:47:12"
      },
      {
        "time_stamp": "2024-02-07 01:30:21"
      },
      {
        "time_stamp": "2024-02-21 08:51:36"
      },
      {
        "time_stamp": "2024-02-22 07:18:39"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-02-06 09:00:06",
    "edited": {
      "time_stamp": "2024-02-06 09:00:13"
    }
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-02-06 10:05:14",
    "text": "• how are you handling company deduplication between HubSpot and Azure? (How will you match and index corresponding records?)\n• How often do you need to update a company record in HubSpot?\n• What volume of records will you be updating?\nA few tips:\n• As you create the dedupe logic, HubSpot has the ability to create custom unique value properties, which you can then use to query and update against. This is often the easiest way to create your index. \n    ◦ <https://knowledge.HubSpot.com/properties/create-and-edit-properties#:~:text=For%20contact%2C%20company%2C%20deal%2C,unique%20value%20properties%20per%20object|https://knowledge.HubSpot.com/properties/create-and-edit-properties#:~:text=For%20contact%2C%20company%2C%20deal%2C,unique%20value%20properties%20per%20object>. \n    ◦ <https://developers.HubSpot.com/docs/api/crm/understanding-the-crm?|https://developers.HubSpot.com/docs/api/crm/understanding-the-crm?>\n• When importing to HubSpot, there are APIs for individual record update, batch updates or for large quantities of data, import API that accepts file imports. \n    ◦ <https://developers.HubSpot.com/docs/api/crm/imports|https://developers.HubSpot.com/docs/api/crm/imports>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-02-06 10:06:25",
    "text": "Assuming you’re building for just one company (not an ecosystem listed integration), you’ll likely handle authentication through private apps \n<https://developers.HubSpot.com/docs/api/private-apps|https://developers.HubSpot.com/docs/api/private-apps>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-02-06 10:08:02",
    "text": "In terms of your middleware to handle your API requests and jobs, sounds like you’re in the right ballpark for working in Azure. "
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-02-06 10:09:53",
    "text": "I’m a bit more familiar with AWS, but a common architecture is to use API gateway and lambda/serverless functions to create the DB connections, and then schedule jobs for the data transfers. "
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-02-06 10:17:04",
    "text": "Thanks for the reply! Will definitely look into the links you have provided!\n• So we are pulling company data from HubSpot that we are enriching in the database - we therefore have the companyId in the database and can match through that. \n• I am currently assuming that we will do an update daily for companies that has changed during the day\n• We currently have about 140k records\n• I am currently thinking about using DataBase API Builder  (dab) to expose one table in the database (created for only this integration) and then hosting that on Static Web Apps\n• When the API is created through dab I was thinking about doing get-requests directly from HubSpot"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-02-06 10:47:43",
    "text": "• Just took a look at the Azure database api builder and seems like a logical architecture\n• Say more about `When the API is created through dab I was thinking about doing get-requests directly from HubSpot`- what process are you thinking of that will drive this behavior? "
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-02-06 11:09:06",
    "text": "Was thinking about this:\n<https://community.HubSpot.com/t5/Releases-and-Updates/Now-Live-GET-Request-via-Workflow-Webhooks/ba-p/591568>"
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-02-06 11:09:26",
    "text": "But perhaps there are better ways?"
  },
  {
    "text": "• GET requests from Workflows are good for smaller volume syncs since they process one Company record at a time. Pretty easy to setup, but tradeoff for scaleability. \n    ◦ imagine your admins run a process that runs all 140k companies through a workflow and those triggered your workflow that sends an outgoing hook - you would get 140k requests - one for each company record that triggered the WF.\n• One item you can pursue is using a webhook in a private app that let's you subscribe to certain event. One request can contain up to 100 events and you can throttle the number of simultaneous requests \n• Alternatively, you can create a poll against specific companies or batch of companies from the API",
    "time_stamp": "2024-02-06 11:47:12",
    "edited": {
      "time_stamp": "2024-02-06 11:47:17"
    }
  },
  {
    "poster": {
      "poster_name": "Bobby Makynen",
      "poster_handle": "bobby605"
    },
    "time_stamp": "2024-02-06 14:21:21",
    "text": "Hey all. I don't know if this is the right place to put this, but I am trying to install the HubSpot plugin on our Wordpress site. It installs and activates fine, but when I click the \"Connect website\" button I get the following error:\n\nlang=en-US\nThe state parameter is empty\n\n...which is a Wordpress error. I talked to HubSpot support and was told...\n\n_it appears, this needs to be added from the platform's end, as our installation process will start with the oAuth request, and then the platform should add the parameter and allow the user to continue with the process, it appears Wordpress is not adding the parameter and thus does not validate the app._\n\nHas anyone come across this error before, and if so, any guidance on how to resolve it? It seems to be an oAuth error, but I don't know why my site wouldn't be doing what it's supposed to in that regard.\n\nThanks in advance. Hope everyone is off to a great new year!"
  },
  {
    "text": "Hi,\nI upgrade the version of HubSpot Api Client library but when the app is goin to be authenticated at the moment to generate de access token crash the request.",
    "time_stamp": "2024-02-06 15:15:26"
  },
  {
    "poster": {
      "poster_name": "Binod Manandhar",
      "poster_handle": "binod"
    },
    "time_stamp": "2024-02-06 15:36:42",
    "text": "Thank you all guys."
  }
]