[
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2024-02-20 07:37:47",
    "text": "what is the best solution when building 404 and 505 pages for a multiLanguage site??"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2024-02-20 07:38:21",
    "text": "HubSpot doesn't do multiLanguage for system pages -- so trying to figure out a solution here. Has anyone come up with a good solution here??",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-07 17:19:56"
      },
      {
        "time_stamp": "2024-03-07 17:20:22"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-02-20 09:00:09",
    "edited": {
      "time_stamp": "2024-02-20 09:00:15"
    }
  },
  {
    "poster": {
      "poster_name": "Cameron Herron",
      "poster_handle": "cameron.herron"
    },
    "time_stamp": "2024-02-20 09:41:28",
    "text": "Hi all. I am attempting to import a wordpress blog into HubSpot using Smart Copy. It says the import is completed and when I click review results it prompts me to Start Mapping. The problem I am having is when I click Start Mapping, it takes me to a blank white page devoid of content. Has anyone else had this problem? Anyone know of a fix?"
  },
  {
    "poster": {
      "poster_name": "Omar Tanti",
      "poster_handle": "omar.tanti"
    },
    "time_stamp": "2024-02-20 10:34:55",
    "edited": {
      "time_stamp": "2024-02-20 10:38:15"
    },
    "text": "Hi All. I am Omar and and at the moment I am currently working with a client to get his Sales and Operations onboarded on HubSpot. We have a lot of workflows set up and we are pretty much there. Atm we also managed to develop an integration between HubSpot and SignNow to have contracts issued automatically through workflows. So basically we have a Deal Pipeline Stage 'Contract Pending' and when a deal owner moves it to 'Contract Pending' we send a webhook trigger to an AWS Lambda function which we developed to integrate with SignNow APIs. Then we have SignNow webhooks sending requests to same AWS Lambda function to move the Deal to 'Closed/Won' as soon as all signatures are fulfilled on the contract.\n\nHowever, the client is now finding SignNow very expensive for the amount of contracts we will be issuing and we are considering to switch to HubSpot Quotes. My issue here is that with SignNow integration I am able to merge documents (service terms based on the services that the deal is about) and have checkboxes on the contract show based on conditional logic related to Deal Custom Properties. So for e.g. :\n• If a deal will handle both Delivery and Pickup Services we would need to merge 3 documents which are:\n    ◦ the Delivery Terms and Conditions\n    ◦ The Pickup Terms and Conditions\n    ◦ Then another document with list of all the services available (we have 5) but with a ticked checkbox next to only Delivery and Pickup only. And a place for 2 signatures at the bottom\nWhen I tried looking into HubSpot Quotes, there does not seem to be a way to have fields, texts, or icons to render based on specific conditional logic. Can someone please let me know if there is a workaround for this? The only workaround I found is to create all the combinations of all the ticked Services and have them as separate templates, but obviously I don't want to go down that route because it is not scalable.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-02-21 00:12:16"
      }
    ]
  },
  {
    "text": "Can someone help me with the datetime issue. I am trying to clear the datetime field but it's giving me error.",
    "time_stamp": "2024-02-20 18:53:17"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-02-21 00:12:16",
    "text": "Managed to find a solution by developing a new quote theme. Created a new module with new settings declared in fields.json and then through conditional logic rendering the sections accordingly. - In case anyone has such a challenge in the future"
  }
]