[
  {
    "text": "Hello Fellow Developers! :wave:\nIs there a way to turn on animation loading on default HubSpot AMP blog setup? Or exclude certain blog posts from it by maybe adding a line of code?",
    "time_stamp": "2024-02-12 01:44:23",
    "edited": {
      "time_stamp": "2024-02-12 01:47:13"
    }
  },
  {
    "poster": {
      "poster_name": "Cristian",
      "poster_handle": "crmolinaz"
    },
    "time_stamp": "2024-02-12 04:41:13",
    "text": "<@U04NGGHDXC0> you should always do a loop, never trust the ids like the one you mentioned above. Good luck!"
  },
  {
    "poster": {
      "poster_name": "Tara Flavin",
      "poster_handle": "tara.flavin"
    },
    "time_stamp": "2024-02-12 07:41:25",
    "text": "Really simple one - I just want a drop-down field that updates the page content differently depending on its value. I know how to do this outside of HubSpot. But using HubSpot forms makes it harder - seems like a submit button is required, and I don't want one. And I can't see a way to change what happens when the form's submitted, besides either displaying a thank you message or going to another page. Any ideas?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-02-12 09:28:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2024-02-12 09:28:18",
    "text": "you’ll need to create a custom module and probably custom template to do this. you can control any form markup inside of your own custom module"
  },
  {
    "poster": {
      "poster_name": "Justin Pelham",
      "poster_handle": "justin387"
    },
    "time_stamp": "2024-02-12 15:38:22",
    "text": "Hi everyone, I’m not technical, so forgive me if this is embarrassingly easy. For context, our sales &amp; onboarding teams use HubSpot, while our support team uses Zendesk. I’ve installed the Zendesk integration from the HubSpot app marketplace for a bi-directional sync.\n\n*HubSpot to Zendesk:*\nCurrently, it creates the company &amp; contact records in Zendesk when a HubSpot deal’s stage is marked “Live &amp; Installed”. Trigger is working.\n\n*Zendesk to HubSpot:*\nWhen a client is marked as “Churned / Inactive” in Zendesk, I want it to change the status in the HubSpot deal. Trigger is not working.\n\nWhile the data is flowing both ways correctly, I can’t figure out how to trigger the sync when the client status field is changed in Zendesk. Currently, I’m having to manually run the integration sync for the Zendesk to HubSpot direction.\n\nIs there a way to have sync automatically run when that field is updated in Zendesk and/or have the sync run on a schedule (for example, every 30 minutes)?\n\nThank you!"
  }
]