[
  {
    "poster": {
      "poster_name": "Aman Shukla",
      "poster_handle": "ashu"
    },
    "time_stamp": "2024-06-25 07:13:52",
    "text": "A new update HubSpot needs to implement in the filters. it would a hierarchy filter in all date &amp; time property. which will be very helpfull in reports, views, active list, etc."
  },
  {
    "poster": {
      "poster_name": "Aman Shukla",
      "poster_handle": "ashu"
    },
    "time_stamp": "2024-06-25 07:14:40",
    "text": "in lead scoring property you need to add page and points."
  },
  {
    "text": "<@U079F8UQCHL> Thanks Aman. I put it logic here, see the screenshot. Bit looks like the value are incorrect in most of contacts. Is there \"Or/And logic available? Similar like we while creating list and workflow.",
    "time_stamp": "2024-06-25 08:37:57"
  },
  {
    "text": "Just had a new colleague that we had to teach not to use the inline forms editor because it doesn’t actually work for anything other than an overly simplified form.\nWhich reminded me of this post\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Form-Fields-are-far-too-long/idi-p/803410>\n\nBasically the Form field UI is horrendously long\nThese fields should at the very least be collapsed by default\nI’m also a firm believer of removing the form fields option for here and just having a dedicated link to the full form editor.",
    "time_stamp": "2024-06-25 08:52:57"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-06-25 09:16:33",
    "text": "Admittedly we need a better way to report bugs :disappointed: Our hope is the Ideas board is a start to get the right eyeballs on it, But bug reporting mechanisms need to improve for sure."
  },
  {
    "poster": {
      "poster_name": "Jaivardhan Dalal",
      "poster_handle": "jai.palmspire"
    },
    "time_stamp": "2024-06-25 09:19:50",
    "text": "Yes <@UQNEXHW14>,\nAs of now we can have one dedicated channel for bug reporting,\nLater on we can have separate board like ideas board."
  },
  {
    "poster": {
      "poster_name": "Aman Shukla",
      "poster_handle": "ashu"
    },
    "time_stamp": "2024-06-25 23:13:33",
    "text": "When you wanna create score of contacts, you can add your parameters in that property."
  }
]