[
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2020-05-01 06:13:46",
    "text": "Hi, I’m using SEMRush for an audit of a HubSpot site and the main issue that comes back at the moment is that pages don’t have title tags, when they clearly do in the source and within the editor.\n\nHas anyone else come across this and had any success in fixing what might be harming our SEO?"
  },
  {
    "text": "Hi all, does anyone know why my class names in my css file have turned red all of a sudden, it is not all of them, but a lot of them?",
    "time_stamp": "2020-05-01 07:12:38",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-01 07:16:03"
      },
      {
        "time_stamp": "2020-05-01 07:16:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2020-05-01 07:16:03",
    "edited": {
      "time_stamp": "2020-05-01 07:16:08"
    },
    "text": "Check for an unclosed quote or bracket above that. Usually when I see things like this the problem is actually before all the errors it’s trying to highlight"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-05-01 07:16:17",
    "text": "thanks"
  },
  {
    "text": "Hi All - for anyone looking for a native Wordpress search that includes HubSpot results in search I wanted to share this plugin we updated. It was originally developed by the agency Webbege but wasn't kept up to date so it stopped working with PHP 7. <@UKJRJR8D8> updated it to PHP 7 so it's working again and we wanted to share it with the community. I have also shared it with <@UL3QS9ASJ> so hopefully search makes it's way into the HubSpot for Wordpress plugin. We will not be supporting or keeping the plugin up to date.",
    "time_stamp": "2020-05-01 10:40:20"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-05-01 14:23:49",
    "text": "This content can't be displayed.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-12-14 17:28:50"
      },
      {
        "time_stamp": "2020-12-14 17:29:54"
      },
      {
        "time_stamp": "2020-12-14 17:34:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-05-01 15:03:45",
    "text": "Thank you to all that joined us for the Virtual Happy Hour!"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-05-01 15:13:31",
    "text": "Thanks to you guys, it is great seeing some of the community stuff and easier APIs you have opened since I started working on my (huge) project approx. last October."
  },
  {
    "poster": {
      "poster_name": "mmcdaris",
      "poster_handle": "morgan"
    },
    "time_stamp": "2020-05-01 18:56:18",
    "edited": {
      "time_stamp": "2020-05-01 18:56:40"
    },
    "text": "Hi Guys, Hope the happy hour went well :beers:! I'm having a great time with the new ruby gem for the v3 API great work btw!\nQuestion for you: Is it possible to create contacts and companies not based on email and email domain but on a custom property?\nI'd like to create companies and contact associations based on my own unique identifers for those records.\nAny guidance is appreciated to get me pointed in the right direction.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-04 12:00:20"
      },
      {
        "time_stamp": "2020-05-04 12:11:02"
      }
    ]
  }
]