[
  {
    "poster": {
      "poster_name": "Arun Mohan",
      "poster_handle": "arun.mohan"
    },
    "time_stamp": "2020-05-22 05:16:44",
    "text": "Is it possible to add JSON animations in a template from <https://lottiefiles.com/> ?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-22 10:28:04"
      },
      {
        "time_stamp": "2023-05-11 03:08:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-05-22 10:28:04",
    "text": "Yep! I've been using Lottie for more robust animations. It's pretty amazing. Head over here: <https://lottiefiles.com/web-player> generate an embed code. If you want to do something more dynamic, say via a HubSpot custom module, just add a file  field to your module to allow for upload of a JSON file."
  },
  {
    "poster": {
      "poster_name": "Ali J. Taylor",
      "poster_handle": "ali"
    },
    "time_stamp": "2020-05-22 14:26:18",
    "text": "<@U38EZFVFE> Perfect solution for what I was dealing with. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-05-22 14:35:28",
    "text": "I have a situation where customers can request a quote to get service of a part.  We ask about 4 questions to be able to provide a quote.  In many cases, they are sending 2-4 parts to us at once. If I show only 1 set of questions to keep the form short is it possible to allow the customer to \"Add Another Part\" and be able to answer the same series of questions if they add another part? I was thinking I could create this as a question dependency, but I wasn't sure I can have the same input fields on the form again and if there was a better way to achieve this.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-22 15:12:48"
      },
      {
        "time_stamp": "2020-05-28 04:28:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-05-22 15:12:48",
    "text": "I think what you're looking for is a multi-step form, which as of right now HubSpot does not support natively. There are ways to do it, but they would require custom development. I've seen some people use TypeForm as an \"out-of-the-box\" option for these kinds of forms in the past: <https://www.typeform.com/>"
  }
]