[
  {
    "poster": {
      "poster_name": "J Lee",
      "poster_handle": "jlee330"
    },
    "time_stamp": "2023-11-30 11:55:45",
    "text": "is there a way to insert a form into a shadow dom? We're integrating with a 3rd party for popups. We were using  `hbspt.forms.create` to insert the form on a js callback on the 3rd party popup, but they recently switched their popups to display in shadow dom and it's no longer working."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-30 14:04:41",
    "text": "SPAs don’t have a normal page cycle like a website so that is why you aren’t seeing updates until you refresh. see this page around the single page apps section for some more clarity. <https://developers.HubSpot.com/docs/api/events/tracking-code|https://developers.HubSpot.com/docs/api/events/tracking-code>\n\nyou will need to set these up in your app to trigger because it doesn’t have that same lifecycle like websites. as for best practices on this i’ll remove myself. i’m not a great react developer and i tend to be pretty hacky. maybe searching through github/gists will find some examples as well as chat gpt or the community forums, even in this slack channel i know there have been plenty of discussions around that. \n\ni need to reread your part two. not sure im understanding so give me a few minutes "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-30 14:10:06",
    "text": "okay for the second part i’m not sure the best way. so HubSpot is storing stuff in cookies and local storage or wherever it is. if you’d truly like to have a nuclear option, on log out you could clear all those items from their cookies. if you inspect/dev tools and go to that section and search HS or by domain - i think you can find them, delete them manually then review to see if that disappears before clicking the log out and see what happens. \n\nyou might also need to send an update to your component. \nagain, i’m not the best at react so maybe this is wrong. and by me saying these things hopefully that guy will come in and say well actually so that you aren’t given the wrong information\n\ndocumentation review is best, then google search around and try to find that solution. good luck"
  }
]