[
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-11-17 13:22:50",
    "text": "My stance is that, as a developer, it’s your professional responsibility to inform your client that a requested tracking implementation may not be regulation-compliant. However, for the 99.99% of web developers who are not also lawyers, you also don’t have the necessary domain expertise to responsibly provide declarative legal guidance to a client.\n\nSo, how do you approach a request for tracking implementation when you suspect that the implementation might not be regulation-compliant? Here’s my typical approach:\n1. Inform the client in writing. Let them know that their request may not be in compliance with relevant privacy regulations.\n2. Suggest that they seek professional legal counsel to ensure their organizational regulatory compliance.\n3. Assuming you’re qualified to do so, offer the opportunity to hire you to implement a consent management solution.\n4. Request confirmation of receipt from the client before proceeding with the implementation.\nAre there situations where the regulatory non-compliance is so clear-cut that you should outright deny the request? Probably, but I think it’s going to be situational. I’ve certainly given a unilateral “no” to requests that involved reckless or egregious violation of privacy regulations, like requests involving inappropriate handling of medical data or payment data. I can’t say I’ve personally hit that hard wall for the implementation of standard 3rd-party tracking scripts, though.\n\nAre you at risk of being held liable for implementing a non-compliant tracking solution? If you claim to be an expert in implementing compliant tracking, and have specifically sold that as a service — probably yes. For a web developer who’s just doing general implementation and got an ad-hoc request from their client? I have no clue, and there likely isn’t a clear-cut answer. I don’t think it’s been tested in court.\n\nIf you’re concerned about it and want a definitive answer, I’ll have to refer you to point number two above — that’s a question for a lawyer, not a web developer. ;~)"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-11-17 14:41:10",
    "edited": {
      "time_stamp": "2023-11-17 14:43:12"
    },
    "text": "Thanks for responding!\n\nYeah, this comment: \"for the 99% of web developers who are not also lawyers, you don't have necessary domain expertise to responsibly provide declarative legal guidance\" – I think that combined with Third Party Service scripts making (usually) NO mention of Consent mechanisms has resulted in Third Party Scripts being dropped ubiquitously where they shouldn't be....\n\nThird Party Scripts should be loaded through some consent strategy, No?"
  }
]