[
  {
    "poster": {
      "poster_name": "Sercan",
      "poster_handle": "srcn882"
    },
    "time_stamp": "2021-08-05 01:19:29",
    "text": "<@U7SL518D6>\nHello everyone,\n\n*The problem was about creating a Child Theme. (Old and New Method)*\n\nBefore the Marketplace was updated (4 August 2021), we were creating our customers' pages by creating a child theme -old method- (connecting with the original theme by adding the manual _*extends*_ code in theme.json file). We added some new features at the theme level by changing the fields.json in our original theme (Parent) which is connected to the Marketplace. However, customers who created a child theme with the old method could not get these new theme features. Because the json files were not updated.\n\n• Q1) if a new update is released in the parent theme's fields.json file,  Customers who created a child theme the old way will not get this update?\n• Q2) When we manually change the fields.json files in Child Theme for the customers who cannot get new theme features because of not updated fields.json file (the process of copying and pasting the fields.json from the parent theme again), *all the old theme settings were lost and reset.* (like CTA color, font color and style). The strange thing is that when we restore the fields.json file that we manually pasted from parent's updated version, the client's theme settings did not still come back. How can we restore the client's old theme features?\n• Q3) Last question is, Can customers who create a child theme with the old method (by adding the manual _extends_ code in _theme.json_ file) switch to the new method (child.js, child.css) without any breaking?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-08-06 08:07:58"
      },
      {
        "time_stamp": "2021-08-06 13:00:26"
      },
      {
        "time_stamp": "2021-08-06 13:11:09"
      },
      {
        "time_stamp": "2021-08-06 13:11:45"
      },
      {
        "time_stamp": "2021-08-06 13:14:29"
      },
      {
        "time_stamp": "2021-08-08 07:12:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-08-05 04:07:50",
    "text": "If you are trying to get this to work in fields.json for image src you can use this.\n\n\"src\" : \"&lt;//cdn2.HubSpot.net/hubfs/{{&gt; hub_id }}/raw_assets/public/your-theme-folder-name/images/name.jpg\","
  }
]