[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-08-12 09:37:23",
    "text": "I’m experiencing unexpected inherited field behavior\n`field_b` inherits value from `field_a` which inherits value from `primary_field`\n(`primary_field` &gt; `field_a` &gt; `field_b`)\nWhen `primary_field` changes, `field_a` inherits the value properly, but `field_b` does not."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-08-12 17:55:38",
    "text": "Oh I see. I tested this and you can just drag modules to stack them but there is not an option I see to create a.blank row"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 22:04:27",
    "edited": {
      "time_stamp": "2021-08-12 22:05:16"
    },
    "text": "I think we are still missing the point.\n\nIt is very possible to stack a few modules on top of eachother. That creates a DND Column.\n\nThis column isnt wrapped in anything other than the DND section. So the user can clone that column all that they want. Which makes it possible for them to include multiple columns in a single section. Which in turn means that these columns can have the same background image set on the section.\n\nBut — What if my content editor wants to create a logo parade that is a grid of logo images:\n\n```[] [] []\n[] [] []\n[] [] []```\nYou would Ideally want these to be horizontally centered in their respective row. And aligned vertically with their column.\n\nIn order to make that happen in the editor you would need to be able have each group of 3 columns wrapped in a dnd row so you could stack the rows on top of each. And then you would vertically center the columns and you should be good to go.\n\nI feel like the only way to currently make this work is to either code it into a reusable section or make it a custom module. Does that make sense?\n\nIve always just made it a custom module at least — but I feel like it would be nice if colums were automatically wrapped in a row. <@U7SL518D6> Does my logic make sense here? Or am  I just being silly?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 22:06:15",
    "edited": {
      "time_stamp": "2021-08-12 22:06:48"
    },
    "text": "I should mention that the use case is that this logo parade needs to be in the same section so it can have the same background image"
  }
]