[
  {
    "poster": {
      "poster_name": "Marko Cvetkovic",
      "poster_handle": "info228"
    },
    "time_stamp": "2021-08-10 01:58:18",
    "text": "Nope, notifications seem to be turned off... "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-10 12:12:26",
    "text": "Is anyone aware of a good way to get the DND UI to make multiple rows inside of single section? I can easily get mutiple columns. And have columns have rows. But I cant get multiple instances of a row with columns in it. Does that make sense?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-11 04:51:27"
      },
      {
        "time_stamp": "2021-08-11 04:51:53"
      },
      {
        "time_stamp": "2021-08-11 06:20:08"
      },
      {
        "time_stamp": "2021-08-12 17:55:38"
      },
      {
        "time_stamp": "2021-08-12 22:04:27"
      },
      {
        "time_stamp": "2021-08-12 22:06:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Peter Rastello",
      "poster_handle": "peter"
    },
    "time_stamp": "2021-08-10 18:17:51",
    "text": "Thank you <@UG7S8J18D>, I appreciate your help. I  have cut and pasted the global_fonts and global_colors groups from fields.json from the boilerplate and referenced them in my css file to set &lt;body&gt; and &lt;p&gt; selectors in the same way as the boiler plate themes-override.css file you shared.\n\nAll of the fields show up in the page editor Design tab, but I still can't get anything on that page to actually change font or text color.\n\nIt appears that my css is not actually pulling through information from the json file. When I inspect the css file when viewing the published page in Chrome developer tools. the &lt;body&gt; and &lt;p&gt; selectors have no styling information on the font and color fields referenced by my css file.\n\n*Here's the pertinent segment from my css file:*\n\n{% set body_font = theme.primary_font %}\n\nbody {\n   max-width: 70%;\n   {{body_font.font}};\n\n}\np {\n  {{ body_font.font }};\n}\n\n*...And here's what shows up in Developer Tools:*\n\nbody {\nmax-width: 70%;\n;\n\n}\np {\n  ;\n}\n\nSeems odd to me, but I'm sure I am just overlooking something obvious. Thoughts?"
  }
]