[
  {
    "poster": {
      "poster_name": "Marcio Oliveira",
      "poster_handle": "marcio.oliveira"
    },
    "time_stamp": "2024-05-16 06:02:57",
    "text": "Hi guys, I have some throuble with facebook tracker data.\nI already connect HubSpot and meta but the quality is zero because they dont receive ip, an some others datas.\n\nSomeone could help me ?"
  },
  {
    "poster": {
      "poster_name": "Marcio Oliveira",
      "poster_handle": "marcio.oliveira"
    },
    "time_stamp": "2024-05-16 07:59:57",
    "text": "Is it the right channel ?"
  },
  {
    "time_stamp": "2024-05-16 08:00:20",
    "text": "Reminder: HubSpot has an <https://knowledge.HubSpot.com/seo/view-seo-recommendations-in-HubSpot|SEO recommendations tool> built into HubSpot that helps you track down issues and suggests changes you can make."
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-05-16 21:23:21",
    "text": "Was this recorded? HubSpot has so much script code, and would love to get more insight on how to clean up their code, please send along recording link"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-05-16 22:50:28",
    "edited": {
      "time_stamp": "2024-05-16 22:50:48"
    },
    "text": "Now we have all the SEO reports HubSpot provides, clients with websites on HubSpot CMS are really frustrated and anxious because they want to fix all those warnings, but many of them are caused by HubSpot itself. It's hard to explain to them that those render-blocking stuff comes from HubSpot and we, as theme creators/developers, don't control that code which is a real bummer"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-05-16 22:53:47",
    "text": "I have this client right who is a non-technical person, and honestly she is angry about this situation.\nShe wants a performance score of 80+ on mobile, but with a cookie banner and chatbot from HubSpot, it's impossible to achieve.\nI even tested on clean boilerplate code with everything inside body deleted. Once I added cookie banner score goes from 100 to 70 on Google speed test."
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-05-16 22:55:26",
    "text": "<@U7SL518D6> is there a way to fix that:point_up_2: or find a workaround to all this JS coming from HubSpot?"
  }
]