[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-05-12 09:20:45",
    "text": "The only way to edit the sitemap that I know of is to manually remove the pages you don't want included in the sitemap settings"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-05-12 20:53:03",
    "text": "<@U03AKL6Q1B2>, ugh so basically I have will have to go through over 1000s webpages and remove them manually? so question, if I do end up cleaning up those pages from sitemap, how do I prevent any new blog posts for that blog from showing up automatically in the sitemap?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-05-12 20:54:16",
    "text": "Website pages and blogs are added automatically, no way to prevent them that I'm aware of, create a process to remove them as you publish"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-05-12 20:57:12",
    "text": "Is that a \"Process\" something that is created in HubSpot? Do you have an knowledge base article that showing how to create a \"Process\" to automatically remove when publishing a blog post for a specific blog?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-05-12 20:58:17",
    "text": "No, I mean an internal process that you can document for your team so the sitemap stays updated. It's always going to be manual to remove, no way to automate."
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-05-12 20:59:17",
    "text": "ugh ok, HubSpot really makes it hard to automate things with sitemap or just programmatically update that area, so difficult"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-05-12 21:00:52",
    "text": "I'm not sure why you're hiding this blog content, but why have it if you're hiding from search? How are you using this content?"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-05-12 21:12:42",
    "text": "so for News (blog), we are using a custom field to link to external articles, like PR articles, so there is no actual content in the blog post itself, so we do not want google to crawl that blog content at all or appear in the XML Sitemap, the PR team knows this process for creating blog post articles so to change up that process would be a major disruption, but seems like HubSpot should have a programmatic API that connects to the XML Sitemap area, so updates can happen in bulk, or like in XML Sitemap area, they allow for more of a batch way to delete from XML Sitemap"
  }
]