[
  {
    "text": "Hoping someone has experienced this issue before and knows of a way to resolve.\nAfter moving a project from staging and pushing live, a previously working endpoint is no longer available. The response is acting like the endpoint does not exist at all.\nI have verified everything looks correct including the config file, but there has been no change in the error being reported. As this was working as expected previously I am leaning toward this being a bug or otherwise unintended functionality for serverless functions",
    "time_stamp": "2022-03-22 08:26:57",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-03-22 09:14:33"
      },
      {
        "time_stamp": "2022-03-22 11:18:21"
      },
      {
        "time_stamp": "2022-03-22 11:31:02"
      },
      {
        "time_stamp": "2022-03-22 11:32:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anthony Pizzurro",
      "poster_handle": "anthonypizzurro"
    },
    "time_stamp": "2022-03-22 09:14:33",
    "text": "Are “staging” and “live” referring to difference HubSpot accounts?"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2022-03-22 11:18:21",
    "text": "<@U01AHCQ7EJC> :point_up_2::skin-tone-4:"
  },
  {
    "poster": {
      "poster_name": "Christian Dow",
      "poster_handle": "christianrdow"
    },
    "time_stamp": "2022-03-22 11:31:02",
    "edited": {
      "time_stamp": "2022-03-22 11:32:41"
    },
    "text": "<@U26B530N6>, staging link being the content staging url that includes sandbox (ex: <https://www-some-company.sandbox.hs-sites.com/>).\nLive being the 'normal' url after publishing the page from 'Content Staging' (ex: <http://www.some-company.com>).\n\nI have found others here having a similar issue, but I am not seeing the 'deploy' action mentioned from the thread in the screenshot below\n\nThis seems like a new feature to serverless, as historically this deploy action was not something that was used/or needed to set up a working serverless endpoint from my previous experiences"
  },
  {
    "text": "",
    "time_stamp": "2022-03-22 11:32:54"
  }
]