[
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2022-01-13 12:43:41",
    "text": "Hey everyone, I need some help here.\n \n*SCENARIO*\nI’m building out a dnd template for a theme. I’d like to have a section that contains a multi-layer background. The background contains 3 gradient layers, an image layer, and a blend-mode for each layer.\n \n*CSS*\n```background: linear-gradient(to right, rgba({{ bgColor|convert_rgb }}, 1), rgba({{ bgColor|convert_rgb }}, 0)),\n            linear-gradient(to right, rgba({{ bgColor|convert_rgb }}, .5), rgba({{ bgColor|convert_rgb }}, .5)),\n            linear-gradient(to right, #fff, #fff),\n            url({{ bg.bg_image.src }});\nbackground-position: {{ convert_position(bg_hor, bg_vert) }};\nbackground-size: cover;\nbackground-blend-mode: normal,\n                       normal,\n                       saturation,\n                       normal;\nbackground-repeat: no-repeat;```\n*IDEAL SOLUTION*\n1. How can I build this type of background for a dnd section? I see dnd section options for “background_image,” “background_color,” and “background_linear_gradient,” but not for “background” or “background-blend-mode,” which are needed in order to get this effect. Is the effect possible?\n \n*POTENTIAL WORKAROUNDS*\n1. Build a custom module with the background and then create a dnd section that uses the module. A content editor can then add the section to any dnd area. How can I turn off the dnd section options (content alignment, padding, margin, background) after setting default values, since adjusting those will cause the module background to not fill the dnd section correctly?\n2. Build a custom module that can be added to a flexible content area. How can I allow a content editor to add a module or a dnd section without designating specific dnd areas and flexible widget areas (so they can add a module or dnd section anywhere on the page)?\n"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-01-13 14:20:54",
    "text": "This means your module doesn’t have fields. You must add fields to your module to make it editable. Fields can be added using the Design Manager or using the HubSpot CLI."
  }
]