[
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2023-11-27 07:07:31",
    "text": "Note, React context will not get automatically pass from server rendered components to islands (intentionally*).\n\nHowever, you can use our <https://github.HubSpot.com/cms-js-building-block-examples/reference/cms-components.html#usesharedislandstate|island shared state APIs>, `useSharedIslandReducer` and `useSharedIslandState` to explicitly define state on the server that is shared to all islands _and_ can be updated by the islands live in the page"
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2023-11-27 07:09:27",
    "text": "ps: Intentionally, because using context is very common in React, especially in libraries. And not only would the cost of serializing lot of unecessary data to the browser be not worth it in most cases, also context can store things like functions and Component references… which cannot be serialized as JSON and sent to the browser."
  },
  {
    "poster": {
      "poster_name": "Marcelo Candil",
      "poster_handle": "marcelo.candil"
    },
    "time_stamp": "2023-11-27 07:35:47",
    "text": "I think it’s the same thing I’m trying to do if I’m not mistaken, in storybook I have a module that makes a Fetch POST to a serverless endpoint, it also returns a CORS error, I tried what was mentioned above modifying the path but the same error continues Is there anything else I should do?\n\nWhat I’m trying to do to clarify is to be able to obtain the data from local, so I don’t have to do a deploy every time I make a modification and need to see the changes."
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-27 07:44:14",
    "edited": {
      "time_stamp": "2023-11-27 07:47:08"
    },
    "text": "i’d recommend not using storybook for that flow and instead using the `my.domain.com.hslocal.net:3000` local development path for two reasons:\n• the error you hit is happening because we don’t know the right domain in the storybook context (the `<http://my.domain.com|my.domain.com>` at the beginning we use to proxy any external references that you don’t have locally)\n• generally i think storybook is intended for smaller components that don’t touch the server, because the environment isn’t quite the same and you often run into issues like the one you’re currently running into\nare there any issues blocking you from using the <http://hslocal.net|hslocal.net> proxy path? (docs <https://github.HubSpot.com/cms-js-building-block-examples/reference/cms-dev-server.html#basic-usage|here>)"
  }
]