[
  {
    "text": "I'm using tailwind for a clients main theme and recently I've decided to add in a js module also using tailwind but for some reason the tailwind classes of the js module are overriding my tailwind classes in the theme folder. Any solution to this besides using a prefix in one of them? Also tailwind intellsense doesn't seem to be working in the react files",
    "time_stamp": "2023-11-15 05:45:34",
    "edited": {
      "time_stamp": "2023-11-15 05:45:48"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-15 07:09:27"
      },
      {
        "time_stamp": "2023-11-15 07:12:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2023-11-15 07:09:27",
    "text": "I assume that the JS module tailwind stylesheet comes after the main theme one (order in the HTML document) and that is what is causing this.\n\nDepending on your setup, you might be able to move things in templates to get the main css lower than the JS module CSS (I can’t remember the subtleties with where exact JS modules put CSS). Also I know that you can use things like `important` in the tailwind config to change precedence: <https://github.com/HubSpot/cms-js-building-block-examples/pull/16/files#diff-88d45f23e7887f250100262d753c904ee5e5197b3cde7a19728a4be2ab10a18dR9>"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2023-11-15 07:12:02",
    "edited": {
      "time_stamp": "2023-11-15 07:12:19"
    },
    "text": "If i place the module one lower than the main one then the issue will most likely just happen the other way around. I'll try the solution with the important class. This probably isn't possible to solve until the theme and project could run under 1 build process"
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-15 09:09:33",
    "text": "<@U01D95STUS3> would you be able to DM me a link to an example page with that error?"
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-15 09:26:46",
    "text": "i think for material UI this is related to <https://github.com/mui/material-ui/issues/37335>, we can look into upgrading our vite dependency to fix the issue. as an alternative in the meantime i believe\n```import { Button } from '@mui/material';```\nas an import pattern should work"
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-15 09:27:30",
    "text": "<@UE70ED6JV> are you running into similar issues with chakra-ui?"
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-15 11:21:58",
    "text": "&gt; we can look into upgrading our vite dependency to fix the issue\nafter some more investigation i don’t think a vite change is sufficient to fix this pattern - it looks like the MUI packages still would need to make changes to their ES module output to be compatible. i’d recommend using the alternative pattern i mentioned above, as you can see used in our graphql-storybook example <https://github.com/HubSpot/cms-js-building-block-examples/blob/0ea279d08f22d2fef0725736a89dc26c5c9f9a41/graphql-storybook/gql-storybook-project/gql-storybook-app/components/modules/ContactList/index.tsx#L1-L12|here>"
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2023-11-15 13:25:51",
    "text": "<@U04DVL5T2TE>, thanks for the follow up, I'll send a links as soon as I'm on my pc again."
  },
  {
    "poster": {
      "poster_name": "Ben Briggs",
      "poster_handle": "bbriggs"
    },
    "time_stamp": "2023-11-15 13:49:49",
    "text": "if you continue to run into issues i’d be happy to take a look, i think the import pattern change should fix it"
  },
  {
    "text": "Hi <@U04DVL5T2TE> I'm new to React and trying to explore this. Is it possible you provide samples setup in GitHub that we can clone and follow structure. I want to use/utilize any built-components from React UI library . as of now I can't figure out how to setup it properly. Thanking you in advance",
    "time_stamp": "2023-11-15 17:19:39",
    "edited": {
      "time_stamp": "2023-11-15 17:33:56"
    }
  }
]