[
  {
    "text": "Hey devs! A few awesome HubDB private BETAs I wanted to throw on your radar if anyone wants to give them a try and provide some feedback\n\n1. :catcoder: *Source code access in rich text cells in HubDB* - long awaited and requested, the ability to edit the source code of a rich text cell in HubDB. \n2. :robot_face: *AI content assistant in rich text cells in HubDB* - similar to other rich text fields in the CMS, marketers can utilize slash and highlight commands, or select the \"AI content assistant\" option in the rich text toolbar to generate and modify content via AI. \n3. :file_folder: *File column type for HubDB* - a new column type for HubDB tables, that allows users to select a file from the Files tool, such as PDF, documents, images, videos, and more. The column can be set to show all files, or only document type files (PDFs, word, etc.)\nIf you are interested in any of these BETAs, please give me a slack with your account ID and which you are interested in. Thanks!",
    "time_stamp": "2024-05-17 07:31:22",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-05-17 08:22:25"
      },
      {
        "time_stamp": "2024-05-17 08:26:31"
      },
      {
        "time_stamp": "2024-05-21 12:18:45"
      },
      {
        "time_stamp": "2024-05-22 07:14:42"
      },
      {
        "time_stamp": "2024-05-22 07:14:45"
      },
      {
        "time_stamp": "2024-05-22 07:56:12"
      },
      {
        "time_stamp": "2024-05-22 11:05:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe Dee",
      "poster_handle": "jody2be"
    },
    "time_stamp": "2024-05-17 07:40:46",
    "text": "Oh, sorry for getting back so late. My issue was that They did not have unique id's. After adding unique id's for each I was able to two dnd_area's on the same page."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-05-17 08:22:25",
    "text": "um, can I signup for all 3?!"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2024-05-17 08:26:31",
    "text": "Of course! Send along any account IDs!"
  }
]