[
  {
    "poster": {
      "poster_name": "Wilbert Muza",
      "poster_handle": "titusmuza"
    },
    "time_stamp": "2020-05-08 05:26:40",
    "text": "<@U7SL518D6> I think it will be nice to _*Add an api endpoint that checks if an email/user have submitted Form*_ before or not. Currently you can check by looping the form submissions page after page which is tiresome.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-08 08:48:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-05-08 08:48:24",
    "text": "Hey <@URQV7LU79> can you post this to <https://community.HubSpot.com/t5/custom/page/page-id/ideaslandingpage|our community forums here>. Then edit your message and add the link to your idea into it. This will allow others to upvote on this idea if they think it is also beneficial."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-05-08 15:18:03",
    "text": "Originally posted in DND pages but this might be a better place for it.\n\nI know that there has been a few posts about it in the past but im wondering if there is any additional thought or future to adding custom class names to DND sections?\n\nMore so for quick styling purposes on the content editor’s side. My team works primarily with marketing agencies and we are retooling our old framework to work well with the new themeing capabilities of HubSpot.\n\nIt would be great if instead of needing to adjust toggles for each individual DND section to set background color they could just add a class to the section. This would take a bit of pressure off of their teem to remember all of the color codes etc for their clients and would def speed up web page/landing page builds.\n\nIt would also make it pretty easy to set up globals inside of fields.json so that they can just configure the settings once and be done.\n\nTo be clear - There is the class parameter that can be added when coding the sections. I am looking for this functionality to be added on the page editor view for content editors",
    "reply_count": 6,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-05-11 08:51:48"
      },
      {
        "time_stamp": "2020-05-11 09:01:42"
      },
      {
        "time_stamp": "2020-05-11 09:11:28"
      },
      {
        "time_stamp": "2020-05-11 12:36:26"
      },
      {
        "time_stamp": "2020-05-11 12:38:04"
      },
      {
        "time_stamp": "2020-05-14 14:07:52"
      }
    ]
  }
]