[
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2020-05-21 09:15:20",
    "text": "I'm not sure if this has been proposed, but it would be great to have a \"HubDB column\" filter on custom modules.\n\nUse case - I use a custom module to pull from a HubDB list of Resources. On the table, there's a \"Type\" column: Whitepaper, Webinar, eBook... etc.\n\nOn the custom module I'd like to add a dropdown filter where users can choose to only show resources of a specific type (e.g. Whitepaper). I can create that dropdown field manually but if the client adds a new option to the HubDB table, they also need to add it to the custom module.\n\nSo if I could pull in those column options on the custom module field, that would be great :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2020-05-21 09:38:25",
    "text": "would love to have a HubSpot to google Hangouts integration"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2020-05-21 09:54:01",
    "text": "I have some clients that are upset with Zoom and want to move over to Hangouts/Meet"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2020-05-21 09:54:36",
    "text": "seems like a lot of clients use GSuite / HubSpot … seems like a natural fit to tie these apps together"
  },
  {
    "poster": {
      "poster_name": "Daniel Alcanja",
      "poster_handle": "daniel898"
    },
    "time_stamp": "2020-05-21 10:28:40",
    "text": "<@U7SL518D6> is it possible to charge monthly fee for a custom module? as we do for currently for app…",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-21 14:42:51"
      },
      {
        "time_stamp": "2020-05-21 15:03:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2020-05-21 14:42:51",
    "text": "Hi Daniel! At this time it isn’t possible to charge a monthly fee for a custom module within HubSpot. The only way that you could charge a fee for a module is if the module was treated as a wrapper to a 3rd party app that required a monthly fee (so it wouldn’t really be the HS module charging the customer, but rather the app).\nWe have seen several providers take this approach with specific listings, but we encourage them to explicitly highlight that the module requires membership to 3rd party."
  },
  {
    "poster": {
      "poster_name": "Daniel Alcanja",
      "poster_handle": "daniel898"
    },
    "time_stamp": "2020-05-21 15:03:57",
    "text": "Thank you <@U22PWJ41G>"
  }
]