[
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-05-11 08:51:48",
    "text": "Hey <@UQWGKUEN7>, thanks for posting this. This is definitely something we’ve talked about in the page editor. One of the things that’s given us pause though, is exposing that in all cases. We were seeing the potential for having a class option driving a lot of support volume for marketers who may not have struct guidelines on how to use a field like that.\n\nHow do you see a field like that working? And where do you see it living in the page editor?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-05-11 09:01:42",
    "text": "Hey <@U8THBCFC4>,\n\nThanks for the response. A lot of the clients that I work with would def be able to understand the class feature. We actually have built a lot of custom modules with something similar in the past to give their teams a lot more flexibility with designs by using the same modules.\n\nWe just add a text field where a content editor can simply add a predefined class and then it will structure that module in a specific way.\n\nBut I also see your concern with it being unclear as to how to use it. Perhaps it can be a parameter on the DND Module itself? A boolean when the page is being created that will turn on or off the class name field for all of that DND module’s sections?\n\nAs far as the page editor goes I see it living in the “edit section styles” view when you click on the section. Currently there are 2 drop downs there. “Alignment and spacing” and then a “Background” tab.\n\nMaybe that aforementioned boolean turns on an “Advanced” dropdown that contains the class field and/or other fields that are more advanced in scope?"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-05-11 09:11:28",
    "text": "Thanks for this! We’re talking through some options so I’ll post here as I have updates!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-05-11 12:36:26",
    "text": "i agree, an option that needs to be actively  turned on so it can´t be used by people who “stumble upon it..”"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-05-11 12:38:04",
    "text": "in addition to that the docs could mention that there can´t be support for this, maybe?"
  }
]