[
  {
    "poster": {
      "poster_name": "Kishan Padhiyar",
      "poster_handle": "kishan720"
    },
    "time_stamp": "2025-01-24 02:05:14",
    "edited": {
      "time_stamp": "2025-01-24 04:55:01"
    },
    "text": ":rotating_light:\nHi everyone,\nCan anyone tell me if HubSpot has made any changes related to creating properties of type ENUM? From yesterday, I’ve been getting an error while creating a property in HubSpot for the contact object.\n\nI’m creating the property with empty options, and the error I got:\n```{\"status\":\"error\",\"message\":\"Property 'test_property' of object type '  0-  1' has no options but options are re (truncated...)```",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-31 14:38:48"
      },
      {
        "time_stamp": "2025-02-02 21:23:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bas Pouleijn",
      "poster_handle": "bpouleijn"
    },
    "time_stamp": "2025-01-24 05:01:03",
    "text": "it tried to give it a day but its still not visible. Funny thing if a update it manually in the HubSpot afterwards its get vissible again."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2025-01-24 13:08:44",
    "text": ":mega: *Announcement: Upcoming Change to this Developer Slack*\n\nHi everyone,\n\nWe have an important update to share about the future of this Developer Slack workspace. Starting *January 28th*, we’re transitioning this space to a free plan to better focus our efforts on improving your overall community experience. Here's what this means for you:\n\n• *A Focus on Peer-to-Peer Connections:* We want to focus on making this community a space for collaboration; troubleshooting with the community, peer to peer code vetting, and conversations and connection among developers like you. For specific questions about HubSpot products or bug reports, <http://help.HubSpot.com|HubSpot Support> and the <https://community.HubSpot.com/|HubSpot Community Forums> will be the best places to go.\n• *Message History:* Moving to a free plan means message history will now be limited to the last 90 days.\n• *No Changes to Beta Channels:* Beta channels for dev products will stay as they are, and we'll give you plenty of notice before any changes occur.\nWe’re making these changes to ensure we’re allocating resources where they’ll have the biggest impact.\n\nIf you have any questions or ideas to share, feel free to reach out. Thanks for being an invaluable part of this community!\n\n_PS - This Slack has been around since 2016, and we know so many of you have built important relationships because of it. Any decisions we make around here have all of you in mind - community is a beautiful thing and change can be hard. But we won't be making any further changes here until we're confident we can give this community the kind of home that continues to allow for the real time connection and collaboration that has made this space so special. And when we do, you'll have a lot of advance notice._\n\nSincerely,\n\n:sj: me, SJ Morris, your dev community guardian at HubSpot :HubSpotheart:"
  },
  {
    "text": "What’s up everyone!\n\nNew here and trying to solve for why I’m getting “Unknown User” errors on a custom event thats directly connected to VWO Split Testing.\n\nMade a quick Loom explaining the setup:\n\n<https://www.loom.com/share/804d04c3846244a1be47ea2fc3c4b0b2>",
    "time_stamp": "2025-01-24 13:21:06",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-31 15:02:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gonzalo Sabatino",
      "poster_handle": "gonzalo.sabatino"
    },
    "time_stamp": "2025-01-24 14:24:53",
    "text": "Hi everyone :hugging_face:\n*Context:* Once a day, I want to run an airflow task to update all our contacts in bigquery. We currently have approximately 7M contacts.\nWhat would be the best way to fetch these contacts for the update?\nWe’ve noticed that interacting directly with the API (<https://api.hubapi.com/crm/v3/objects/contacts>) to request all contacts at this scale tends to cause issues.\nThe options we’ve considered are:\n• Performing a search for the latest contact updates: <https://api.hubapi.com/crm/v3/objects/contacts/search>. In this case, is there a recommended time frame to use?\n• Adding contacts to a list and retrieving that list.\n• Using a webhook for updates. However, we think this might consume more resources than necessary since we only want to update our data warehouse once a day.\nAny feedback or other suggestions would be greatly appreciated!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-31 15:06:08"
      }
    ]
  }
]