[
  {
    "poster": {
      "poster_name": "Kat Elliott",
      "poster_handle": "katelliott81"
    },
    "time_stamp": "2025-01-09 01:14:05",
    "edited": {
      "time_stamp": "2025-01-09 02:42:45"
    },
    "text": "Hi everyone! I am using the Import API to ingest some objects and for most use cases that is working fine. In one of my use cases however I am importing objects which will have an association with a pre-existing object (i.e. not an object that is included within the import). The association definitions are set up already. My assumption was that I could both import the objects and create the associations at the same time, by using the following in the mapping JSON for the relevant CSV column:\n\n```{\"columnObjectTypeId\": \"2-137774576\", \"columnName\": \"brandid\", \"toColumnObjectTypeId\": \"2-137774399\",\"columnType\": \"FLEXIBLE_ASSOCIATION_LABEL\"},```\nHowever, that is returning the following error:\n\n```Response: {\"status\":\"error\",\"message\":\"toColumnObjectTypeId 2-137774399 for FlexibleAssociationColumn column brandid does not match provided objectTypes in import: [2-137774576]\",\"correlationId\":\"6fb4ddb9-94f0-448a-8591-ae5d0b7cad75\",\"context\":{\"toColumnObjectTypeId\":[\"ObjectTypeId{metaTypeId=2, innerId=137774399}\"]},\"category\":\"VALIDATION_ERROR\"}```\nI am confident that the object type IDs are correct. My hypothesis therefore is that in order to create the association at the same time as the import, I would need to have both the objects involved in the association within the import, and I should instead use the Associations API to create the association after the initial import. Is that correct? Or have I missed something?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-09 02:24:20"
      },
      {
        "time_stamp": "2025-01-09 02:33:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2025-01-09 02:24:20",
    "text": "I think before you can start associating records from 2 object types, you must first configure that those 2 objects types are associatable either from the UI or using the <https://developers.HubSpot.com/docs/reference/api/crm/associations/associations-schema|Association Schema endpoints>."
  },
  {
    "poster": {
      "poster_name": "Kat Elliott",
      "poster_handle": "katelliott81"
    },
    "time_stamp": "2025-01-09 02:33:03",
    "text": "Hi <@U058ZPH175H> thanks so much for the reply. The association definitions are already defined. I can also create objects of both types AND associate them from within the same import, but I cannot create an object of one type and associate it with an existing object of the other type - that's the scenario which generates the error."
  },
  {
    "poster": {
      "poster_name": "Kishan Mehta",
      "poster_handle": "kishan.mehta"
    },
    "time_stamp": "2025-01-09 03:50:57",
    "text": "Hello all! :sweat_smile:\n\nI have a question about the API endpoint /hcms/search?&amp;term=ge&amp;limit=3&amp;autocomplete=true&amp;analytics=true. It only matches words that start with \"ge.\" :thinking_face:\n\nFor instance, if there’s a word like \"EnerGenius,\" it won’t show up in the results. :weary: Similarly, searching for \"Genius\" won’t work either. :melting_face: The word only appears in the results if we search for \"Ener.\" :man-shrugging:\n\nIs there any way to add a like operator to this search? :crossed_fingers::sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Graham Newton",
      "poster_handle": "graham.newton"
    },
    "time_stamp": "2025-01-09 04:15:35",
    "text": "Hello :wave:\n\nI was wondering if anyone would be able to help me out with a Custom Schema update issue. I am using the HubSpot PHP SDK to update information relating to a custom schema, and I have been using this for a number of years now. However, today it has stopped working, and I am getting a 404 error of a non-valid scope which I don't recognise.\n\n```PATCH <https://api.hubapi.com/crm/v3/schemas/{name}>` resulted in a `404 Not Found` response:\n{\"status\":\"error\",\"message\":\"cobject-edit-all-1 is not a valid scope```\nDoes anyone know what the scope `cobject-edit-all-1` is, and how I would go about resolving it? I have already looked at the scopes which could be added, but unable to find anything which name comes close to `cobject-edit-all-1`."
  },
  {
    "poster": {
      "poster_name": "Kat Elliott",
      "poster_handle": "katelliott81"
    },
    "time_stamp": "2025-01-09 05:14:54",
    "text": "Hi all! :wave:\nIn the *Associations API* when using it to create associations between existing records, does the record ID used in the API call need to be the internal HubSpot identifier or can it use the external identifier that I have configured as an object property?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-09 15:11:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Logan Armstrong",
      "poster_handle": "logan565"
    },
    "time_stamp": "2025-01-09 07:47:46",
    "text": "is it possible to send a sequence via the API from an alias address? You can send from it via the UI but when trying in the API it gives a 'connected inbox not found...' error"
  },
  {
    "poster": {
      "poster_name": "Joao Pinto",
      "poster_handle": "a19836"
    },
    "time_stamp": "2025-01-09 09:31:59",
    "text": "Hello,\n\nI'm a new user at HubSpot and would like to personalize my site according with the visitor interests. The idea is to use the HubSpot API to register the visitor through its IP (or any other method), then personalize our site from the server side and return the personalized response to the client browser. Is this possible? Does this makes sense?\n\nI already added the HubSpot tracking code in my site, but this only saves the visitor after the pages loads on his browser. The idea is to do the steps I described, before the user sees the page - and so, before the tracking code runs.\n\nIf this is possible, what do I need to do and what should the next steps?\nCan someone help me please and provide an example please?\n\nThanks,\nJP"
  },
  {
    "poster": {
      "poster_name": "Sagar Dewan",
      "poster_handle": "sagar790"
    },
    "time_stamp": "2025-01-09 10:52:02",
    "text": "Hi Everyone,\n\nWe have a HubSpot public app, we are recently are receiving a lot of 503 errors on our Apis that clients are reporting\nHTTP Response Code: 530 - Cloudflare Error\n8ff5116dcdaca786-DEL - CF-Ray-Header\n\nWe checked from multiple IPs and we get the same error for some specific users but it works for some other users. Could someone help understand what we could do?",
    "reply_count": 13,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2025-01-09 12:24:27"
      },
      {
        "time_stamp": "2025-01-09 23:19:58"
      },
      {
        "time_stamp": "2025-01-10 09:44:09"
      },
      {
        "time_stamp": "2025-01-14 00:53:20"
      },
      {
        "time_stamp": "2025-01-14 00:53:33"
      },
      {
        "time_stamp": "2025-01-14 00:53:49"
      },
      {
        "time_stamp": "2025-01-14 02:58:33"
      },
      {
        "time_stamp": "2025-01-14 10:03:51"
      },
      {
        "time_stamp": "2025-01-14 15:50:06"
      },
      {
        "time_stamp": "2025-01-14 15:54:18"
      },
      {
        "time_stamp": "2025-01-15 08:37:00"
      },
      {
        "time_stamp": "2025-01-15 11:47:44"
      },
      {
        "time_stamp": "2025-01-15 22:41:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Wolfe",
      "poster_handle": "justin727"
    },
    "time_stamp": "2025-01-09 12:24:27",
    "text": "<@U074M1G3CG4> We're in the same boat—we have a public app and are suddenly getting unclear 530s in the last day or so and aren't sure what to do :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Colin Murney",
      "poster_handle": "cmurney"
    },
    "time_stamp": "2025-01-09 14:15:17",
    "text": "Hello!\n\nI'm wondering if anyone has ever had success with using the batch API endpoints to CREATE or UPSERT notes, or any other engagement type (calls, emails, meetings, tasks). I am looking for some reassurance that these endpoints do actually work. I have no issues with using the batch UPSERT endpoints for standard objects, custom objects, or associations, however, I am struggling with these endpoints for engagements.\n\nTo be clear, I am talking about these endpoints:\n- /crm/v3/objects/notes/batch/create\n- /crm/v3/objects/notes/batch/upsert\n\nThis is the documentation I'm referencing for batch operations for notes: <https://developers.HubSpot.com/docs/reference/api/crm/engagements/notes#batch>"
  },
  {
    "poster": {
      "poster_name": "Zach Klein",
      "poster_handle": "zach282"
    },
    "time_stamp": "2025-01-09 15:11:22",
    "text": "Hi <@U087R4L9GGM> :wave:\nAs far as I'm aware, these always need to be the internal HubSpot identifier. Hope that helps :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Beau",
      "poster_handle": "beau149"
    },
    "time_stamp": "2025-01-09 16:06:52",
    "text": "Hey all!\n\nDoes anyone know any reason why the property `hs_email_last_email_name` would not be returned when hitting GET `/crm/v3/properties/contacts` ?\n\nThanks,\nBeau"
  },
  {
    "text": "Hi, I have an urgent issue. I want to send contacts from Zapier to HubSpot trough Webhooks.\nI created the Private app, added all CRM permissions and created the Webhook step in Zapier. The test is successful and the contacts are getting created in HubSpot but without the email. Also the API calls in HubSpot are successful but the contacts are getting created without any emails. How can I solve this?",
    "time_stamp": "2025-01-09 18:18:19"
  },
  {
    "poster": {
      "poster_name": "Yuri Khmelevsky",
      "poster_handle": "yuri820"
    },
    "time_stamp": "2025-01-09 20:10:32",
    "text": "Hi there!\nIs it possible to create webhook in public app `deals.propertyChange` without specified what exactly property changed.  Or how I can notify my app when some of custom property of deal in connected account was changed."
  },
  {
    "text": "I got a reply from Support saying that they are fixing the issue with Cloudflare. They didn't say how long it's gonna take to fix it. I will update once I have any news",
    "time_stamp": "2025-01-09 23:19:58"
  },
  {
    "text": "Hi everyone! Can anyone help me with the “Custom Code” in HubSpot? We are connecting HubSpot to our event platform using the workflow and custom code. I got the code from an external source and it has always worked fine. But now HubSpot says that the language “NODE16X” is outdated and I have to select “Pyton 3.9”. Can I use the same code or does it need to be adapted? Thanks in advance!!! :slightly_smiling_face:   This is the code: // For instructions on how to use this snippet, contact:\n\n\n// Where to make the request\n\nconst endpoint = \"<https://virtualevents.movingimage.com/api/allowGuestInEvent>\";\n\n// The authorization Bearer\n\nconst bearer = process.env.Bearer;\n\nconsole.log(\"bearer: \"+process.env.Bearer);\n\n// Id of the event on which the guest will be added. This field is required.\n\nvar sessionId = \"itok27012025\";\n\n// First name of the guest.\n\nvar firstname = \"\";\n\n// Last name of the guest.\n\nvar lastname = \"\";\n\n// Email of the guest. This field is required and can't be duplicated with other guests.\n\nvar email = \"\";\n\n// List of roles separated by ; Possible values for the roles HOST and SPEAKER.\n\n//const roles = \"HOST\";\n\nconst roles = \"\";\n\n// List of tags separated by ; Each tag can have any custom value.\n\nconst tags = \"\";\n\n/*\n\nCan be one of the following values: REGISTERED or ALLOWED. By default it is ALLOWED, meaning the guest will be automatically allowed into the event. If you set it to REGISTERED, the user is not allowed automatically in the event. If parameter is not present, the guest will be automatically allowed in the event.\n\n*/\n\nconst status = \"ALLOWED\";\n\n//const status = \"REGISTERED\";\n\n/*\n\ntrue or false. In case of being true, the registration email will be triggered if the status value is REGISTERED and in case it is ALLOWED, the guest invite email will be triggered instead. If false no emails will be sent from the platform.\n\n*/\n\n//const triggerEmail = \"true\";\n\nconst triggerEmail = true;\n\nconst config = {\n\n    headers: { Authorization: `Bearer ${bearer}` }\n\n};\n\n// Import Axios library for easier HTTP request making\n\nconst axios = require('axios')\n\nexports.main = async (event, callback) =&gt; {\n\n  // Enable below to override hard coded values and use the values from the form instead\n\n  // sessionId = event.inputFields['sessionId'];\n\n  console.log(\"firstname: \"+event.inputFields['firstname']);\n\n  firstname = event.inputFields['firstname'];\n\n  console.log(\"lastname: \"+event.inputFields['lastname']);\n\n  lastname = event.inputFields['lastname'];\n\n  console.log(\"email: \"+event.inputFields['email']);\n\n  email = event.inputFields['email'];\n\nconst bodyParameters = {\n\n  sessionId: `${sessionId}`,\n\n  firstName: `${firstname}`,\n\n  lastName: `${lastname}`,\n\n  email: `${email}`,\n\n  roles: `${roles}`,\n\n  tags: `${tags}`,\n\n  status: `${status}`,\n\n  triggerEmail: triggerEmail,\n\nguestInvitedTemplateId: \"Z2vLz5N4mA\"\n\n};\n\n  axios\n\n    .post(endpoint,\n\n         bodyParameters,\n\n         config\n\n    ).then(response =&gt; {\n\n      // For the time being, display the query result. Note that the server returns a 406 (not acceptable) is the user already exists.\n\n      console.log(response.data);\n\n      // Use this to eventually return values from this script and use them in the workflow next steps\n\n      callback({\n\n        outputFields: {\n\n          /* A typical response.data looks like this below\n\n             2022-02-01T16:07:39.310Z   INFO    {\n\n                                                    result: 'ok',\n\n                                                    accessLink: '<https://virtualevents.movingimage.com/v/demo_event_october_sales/a/9bdc6729adf38955871940141c87623f/1kz4be0if>'\n\n                                                }\n\n          */\n\n          accessLink: response.data.accessLink // Return the unique access link to the event for the added guest\n\n        }\n\n      })\n\n    });\n\n}",
    "time_stamp": "2025-01-10 00:42:26"
  }
]