[
  {
    "poster": {
      "poster_name": "Oliver Morgan",
      "poster_handle": "oliver069"
    },
    "time_stamp": "2025-01-31 02:59:35",
    "text": "Hi all,\n\nI'm looking for a way to access the web activity for all contacts via the API. We currently have some reports to access the web activity for contacts filtered by the last 365 days and would love to replicate it through the API somehow. Any help would be much appreciated!"
  },
  {
    "poster": {
      "poster_name": "Devslopes Developer",
      "poster_handle": "developers164"
    },
    "time_stamp": "2025-01-31 08:16:44",
    "edited": {
      "time_stamp": "2025-01-31 08:25:18"
    },
    "text": "Hi everyone!\n\nI have a question about retrieving call transcripts by the call_id or by the transcript_id from HubSpot portal. Is there an endpoint I can use to retrieve a transcript?\n\nIn the call object properties I found the following items:\n\n- hs_call_has_transcript (returns a boolean if the transcript exists)\n- hs_call_transcript_audio_num_channels (returns a number of channels on the call audio)\n- hs_call_transcript_tracked_terms (not sure what that is but returns null all the time)\n- hs_call_transcription_id (is expected to return transcript id if hs_call_has_transcript has returned true, but constantly returns null regardless of the hs_call_has_transcript value)\n\nDocs I explored:\n\n• Calls API: <https://developers.HubSpot.com/docs/reference/api/crm/engagements/calls>\n• Recordings and transcripts: <https://developers.HubSpot.com/docs/guides/apps/extensions/calling-extensions/recordings-and-transcriptions>\n• Call to object associations: <https://developers.HubSpot.com/docs/guides/api/crm/associations/associations-v4#call-to-object>\nNeither of those docs pages seem to answer my question:\n\n• The retrieved call object doesn’t have a call transcript ID (returns null instead)\n• There is no association of a call to transcript in Associations API\n• The Recordings and Transcriptions API seems to help with adding call engagements which is not what I need as calls and transcripts are already in the HubSpot portal.\nI appreciate any help, thanks!"
  },
  {
    "poster": {
      "poster_name": "Courtney Williams",
      "poster_handle": "cwilliams"
    },
    "time_stamp": "2025-01-31 10:05:22",
    "text": "Does anyone know if it's possible to bulk opt in contacts for marketing emails on the back end in HubSpot? We discovered that when a new client of ours did a Pardot import, they inadvertantly opted 10k contacts out of all marketing emails."
  },
  {
    "poster": {
      "poster_name": "Scott Plomer",
      "poster_handle": "scott.plomer"
    },
    "time_stamp": "2025-01-31 10:26:47",
    "text": "Howdy ya'll! Since we're the Forms API instead of the HubSpot native forms, the 'form view' event is never sent to HubSpot, so the conversion cannot be calculated. Could we manually send this kind of event using the tracking code API (<https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code|Tracking code API overview | HubSpot>) or we off base? We're loosing that and our UTM paramas :/"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 14:15:54",
    "text": "Scenario 1 — sounds about right, if you know that the IDs did exist, then you could say they were deleted. It might be worth doing a test with a company/object record and merging it with another record. That may cause some issues. So I think that is worth testing on before you declare they are deleted.\nScenario 2 - looks like I didn’t read your entire question before I started to answer.\nI just did a test in a dev portal, I had The maria Johnson sample contact, id 1\n\nthen I merged with sample contact brian halligan,\n\nThis is just the basic lookup, not doing the batch, and it returned the new ID, where the original ID was `1`\n\n```{\n    \"id\": \"95856616470\",\n    \"properties\": {\n        \"createdate\": \"2022-05-27T17:50:19.953Z\",\n        \"hs_additional_emails\": \"<mailto:bh@HubSpot.com|bh@HubSpot.com>\",\n        \"hs_object_id\": \"95856616470\",\n        \"lastmodifieddate\": \"2025-01-31T21:08:25.569Z\"\n    },\n    \"createdAt\": \"2022-05-27T17:50:19.953Z\",\n    \"updatedAt\": \"2025-01-31T21:08:25.569Z\",\n    \"archived\": false\n}```\nI believe your assumption in part 2 is correct as well as I just did some merges. It appears that there is a property called `hs_merged_object_ids` that will also show your merged IDs, so that would give you a layer of security to check against.\n\n```{\n    \"id\": \"95875853750\",\n    \"properties\": {\n        \"createdate\": \"2022-05-27T17:50:19.953Z\",\n        \"firstname\": \"Test\",\n        \"hs_additional_emails\": \"<mailto:emailmaria@HubSpot.com|emailmaria@HubSpot.com>;bh@HubSpot.com\",\n        \"hs_merged_object_ids\": \"51;1;95856616470;1551\",\n        \"hs_object_id\": \"95875853750\",\n        \"lastmodifieddate\": \"2025-01-31T21:11:59.196Z\",\n        \"lastname\": \"Johnson (Sample Contact)\"\n    },\n    \"createdAt\": \"2022-05-27T17:50:19.953Z\",\n    \"updatedAt\": \"2025-01-31T21:11:59.196Z\",\n    \"archived\": false\n}```\nso that was the result of me merging three contacts together, it it appears that they are `;` seperated\n\nSo if you are also pulling `hs_merged_object_ids` you can check against that —\n\nI can’t think of any edge cases but that doesn’t mean they don’t exist lol — I think having some sort of notification system like maybe sending to a slack channel when you run into something you think could be odd — might be a way to go about that"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 14:27:23",
    "text": "Seems odd it affected a lot of people, it looks like this happened for private and public apps if I’m reading through the threads correctly. Were you able to get this resolved — Really seems like someone from HubSpot api support should be wrangled in on this"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 14:38:48",
    "text": "I just tested this a bunch of times and you can’t create an enum without options.\n\nThe entire error message is explaining that options are required.\n\n```{\n    \"status\": \"error\",\n    \"message\": \"Property 'testenumwithnovaluesvalues' of object type '0-1' has no options but options are required!\",\n    \"correlationId\": \"016572aa-fbb9-4cc3-b8bf-f7b5cf9e1b12\",\n    \"context\": {\n        \"property\": [\n            \"testenumwithnovaluesvalues\"\n        ],\n        \"objectTypeId\": [\n            \"0-1\"\n        ]\n    },\n    \"category\": \"VALIDATION_ERROR\",\n    \"subCategory\": \"PropertyValidationError.MISSING_OPTIONS\"\n}```"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:02:13",
    "text": "Great video Ryan — I can take a few guesses on why it isn’t consistent and the mostly have to do with race conditions being a possibility or maybe some sort of privacy blocker.\n\nThat being said, towards the end you showed the identify, to make that work correctly you have send the `trackPageView` or `trackEvent`\n\n```This function call stores the data in the tracker, but the data is not actually passed to HubSpot with this call. The data will only be passed when tracking a page view or an event (with either the trackPageView or trackEvent functions).```\nfrom this page: <https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl=1*1m3x6*_ga*ODc4ODYxNzU1LjE3MzgzNjAxOTA.*_ga_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.#identify-a-visitor|https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl[…]a_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.>\n\nSo after that identify you do something like\n\n```_hsq.push(['setPath', '/about-us']);\n_hsq.push(['trackPageView']);```\nyou would want to make sure you put the correct setPath in there that could cause some issues and do some duplicate work on your page views, so you could create a fake page and use `/identify-helper` or something like that for the path\n\nyou could also use the trackEvent - where you set up another custom event like identify helper event and add that in there.\n```_hsq.push(['trackEvent', {\n  id: 'custom_event_id',\n  value: 'optional_value',\n  properties: {\n    property1: 'value1',\n    property2: 'value2'\n  }\n}]);```\nThose are likely overkill for what you are trying to do, but might fix the issues you have.\n\nHere are some other things I saw in your video\n\nWhen you highlighted over the blue box there was no hutk passed through the url, so maybe yall aren’t gathering that. I’m not sure if you are using the HubSpot form submission api to send this, but to get the hutk you could use this to get that value and pass it into the form submission. If you are using the embed code this should do that for you.\n```getCookie('HubSpotutk')```\nI think you could attempt to go through the flow a few different ways to test this\n\nCreate a contact with a test email address, then open incognito window and go through offer flow, see if that shows up.\n— that would be if someone had filled a form out without a cookie, or was already in your system and you don’t have tracking on them\n\nTry 2 would be new incogntio window, run through the flow, see what happens\n\nTry 3 is use like ublock or ghostry and go through the flow and see what happens.\n\nSorry I don’t have a bullet proof answer for you, but those would be my next steps. great job on teh video and going through the whole thing"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:06:08",
    "text": "exports api is the best way to do this large amount of data\n\nSearch api has some different api limits so i’d refer to those. Search api also can be a little lagged behind, I mean by seconds, not minutes or anything\n\nYou could add all updated in past 24 hours to a list via a workflow and use it as a dynamic list. Might be a pain to do that.\n\nwebhooks would work if you send all that data to a queue / server then query that from your data warehouse\n\nExports api is going to make a csv you can easily parse\n<https://developers.HubSpot.com/docs/guides/api/crm/exports#limits>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:08:26",
    "text": "after you identify a user you have to submit a page view. angular isn’t pushing page views, so when you identity, you aren’t actually sending that to HubSpot\n\n• This function call stores the data in the tracker, but the data is not actually passed to HubSpot with this call. The data will only be passed when tracking a page view or an event (with either the <https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl=1*1m3x6*_ga*ODc4ODYxNzU1LjE3MzgzNjAxOTA.*_ga_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.#track-page-view|trackPageView> or <https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl=1*1m3x6*_ga*ODc4ODYxNzU1LjE3MzgzNjAxOTA.*_ga_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.#events-js-api|trackEvent> functions).\n• <https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl=1*1m3x6*_ga*ODc4ODYxNzU1LjE3MzgzNjAxOTA.*_ga_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.#events-js-api|https://developers.HubSpot.com/docs/reference/api/analytics-and-events/tracking-code?_gl[…]a_LXTM6CQ0XK*MTczODM2MDE5MC4xLjEuMTczODM2MDIyOC4yMi4wLjA.>\n```_hsq.push(['setPath', '/about-us']);\n_hsq.push(['trackPageView']);```\ndo that after your identiffy"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:12:00",
    "text": "they should deduplicate — I built a custom integration for someone and sent the event ids and it was all cleaned up when they were using some other things. I don’t know how that integration works so difficult to know if they WILL deduplicate\n\nIf that is absolutely wrong, is there a way for you to identify when you wouldn’t want to fire the GTM tag? Is there some UTM params you are sending to that page, you could exclude that from the GTM trigger. This would probably be the safer way to go"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:25:43",
    "text": "So a few things here, your value isn’t like a file id or anything like that, you are just pushing in the wrong value — I don’t want to make an assumption in how you are upload the file, do you have that example? I think you could return a file ID or something else.\n\nsigned urls only last for X amount of time and they go to a specific url — not something you would want to store in the CRM, you really want to put the file id into the file\n\nHere I uploaded a file to the CRM in a file property I just created\n```{\n    \"id\": \"95875853750\",\n    \"properties\": {\n        \"createdate\": \"2022-05-27T17:50:19.953Z\",\n        \"file\": \"185619257265\",\n        \"firstname\": \"Test\",\n        \"hs_additional_emails\": \"<mailto:emailmaria@HubSpot.com|emailmaria@HubSpot.com>;bh@HubSpot.com\",\n        \"hs_merged_object_ids\": \"51;1;95856616470;1551\",\n        \"hs_object_id\": \"95875853750\",\n        \"lastmodifieddate\": \"2025-01-31T22:22:14.379Z\",\n        \"lastname\": \"Johnson (Sample Contact)\"\n    },\n    \"createdAt\": \"2022-05-27T17:50:19.953Z\",\n    \"updatedAt\": \"2025-01-31T22:22:14.379Z\",\n    \"archived\": false\n}```\n\nAnd when I click on that from the CRM it takes me to this url: `<https://app.HubSpot.com/file-preview/22048782/file/185619257265/>`\n\nSo I think what you need to do from your file upload is get the ID of the file, then pop that into a “file” field. Does that make sense? It looks like you are attempting to put a url into a text property, but I’m just making terrible assumptions"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:26:51",
    "text": "your folder id or folderpath isn’t set up correctly.\nGo into file manager and click into your folder, you’ll see something like this\n<https://share.zight.com/9Zu6oKDl> use that id"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:27:35",
    "text": "best place is to check ideas forum <https://community.HubSpot.com/t5/HubSpot-Ideas/idb-p/HubSpot_Ideas>\n\nsearch, maybe it is on the map, or create a new one"
  },
  {
    "poster": {
      "poster_name": "Anantha Popuru",
      "poster_handle": "anantha.popuru"
    },
    "time_stamp": "2025-01-31 15:28:41",
    "text": "i have used the ID from the url but the body format is what was the issue"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:28:50",
    "text": "I’m not sure how the updating works --\n\nI would make sure that any properties you create you add something like danguenet_property_name as the internal id — that way they don’t conflict with anything else"
  },
  {
    "text": "",
    "time_stamp": "2025-01-31 15:29:38"
  },
  {
    "poster": {
      "poster_name": "Dan Guenet",
      "poster_handle": "dan425"
    },
    "time_stamp": "2025-01-31 15:31:33",
    "text": "Yeah I was going to do that and potentially make a property group (unless there is a limit on those). Thanks for the callout! It will also make finding it by search in the report builder easier I think. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-31 15:38:09",
    "text": "have you ttried placing the “folderId”: 234234 inside your options?"
  },
  {
    "poster": {
      "poster_name": "Anantha Popuru",
      "poster_handle": "anantha.popuru"
    },
    "time_stamp": "2025-01-31 15:38:30",
    "text": "i tried that resulted in the error"
  },
  {
    "poster": {
      "poster_name": "Gaia",
      "poster_handle": "oscar978"
    },
    "time_stamp": "2025-01-31 16:16:32",
    "text": "Hi there folks. We have an integration where we keep in sync the properties of deals and companies in our database. We try to be accurate to store things like data type, options, max length (in the case of strings), and also in case of fields that have a list of options, if they support multiple values or single ones. However, it seems the properties API doesn't return any indicator if the field supports multiple values or not. Is there a way or a hidden property that can be returned by the API, to know this? I can see there are data types like checkbox, booleancheckbox, select. The last 2 seem to accept only a single value, but in the case of checkbox, it may support or not multiple values, but from API perspective I cannot find this. I looked at the documentation but it has no detail about that <https://developers.HubSpot.com/docs/reference/api/crm/properties#get-%2Fcrm%2Fv3%2Fproperties%2F%7Bobjecttype%7D>"
  },
  {
    "poster": {
      "poster_name": "Norman Khine",
      "poster_handle": "nkhine"
    },
    "time_stamp": "2025-01-31 16:34:46",
    "text": "Hello,\nI have a HubSpot form and was wondering if it is possible to get the submit endpoint for the POST request? Or do I have to embed the form in my page?"
  }
]