[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 05:50:14",
    "text": "Keep in mind that listing pages are not real pages and can't be edited by the marketers unless you are using a global module to do it more accesible.\nAlso, to make it work, you need to call the module before the preload link and not in the body (won't be an issue because it won't output anything when you are using export_to_template_context). But it need to be parsed before the prelink, otherwise it won't exist on time"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 05:53:16",
    "text": "If you are using coded templates, maybe you can wrap it with {% require_css %} to load it from the head, I didn't tested, so let us now if that worked :).\nOtherwise you need to extend your base.html with a `&lt;head&gt;{% block head %}...` or something like that.\nIf you are using old dnd templates, you will need to put it in the head field."
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2021-04-19 07:42:50",
    "text": "To follow up, I discovered that I did not even need to worry about it. I just did a regular content loop in the header and then pulled the url for the feature image in the first blog post."
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 08:16:05",
    "text": "oh so you wanted to use the featured imge of the first post, yeah that is available since the begining."
  },
  {
    "poster": {
      "poster_name": "Bhréin Brannick",
      "poster_handle": "bhreinb"
    },
    "time_stamp": "2021-04-19 10:09:48",
    "text": "Reposting the original question as I’m hoping somebody can provide guidance on the below :point_down:. Many thanks in advance.\n\n<https://HubSpotdev.slack.com/archives/C2YH119N2/p1618500495199100>"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 11:31:13",
    "edited": {
      "time_stamp": "2021-04-19 11:31:44"
    },
    "text": "I believe the default behaviour for HubSpot is to always extend the context to children, so you can access all the available data from the parent on any children (macros, loops etc) but not the other way around.\nYou can although bypass the limitation with list and dict variables thanks to `append()` and `update()`.\n```{% set myList = [] %}\n{% for i in range(5) %}\n  {% do myList.append(i) %}\n{% endfor %}\n{{ myList }}```"
  }
]