[
  {
    "text": "Hey there, I'm trying to track an event that is a completed purchase. Triggering the event works. But I have two modules that have this code in them (in case they need to be used separately).\n\nRight now the modules are used on the same page. However, I believe this is causing the event to trigger twice - once for each product, even if you're purchasing a single product.\n\nI can't figure out how to separate the hs tracking info for each product with the code shown.\n\nThe code in the screenshot is for one product and the same code is in a different module but has a different tracking ID.",
    "time_stamp": "2021-05-11 08:18:39"
  },
  {
    "poster": {
      "poster_name": "Horea Piper",
      "poster_handle": "horea.piper"
    },
    "time_stamp": "2021-05-11 08:30:50",
    "text": "Hey there - I’m trying to create a select property that has over 13k options but it seems that there’s a 5k limit for this kind of property"
  },
  {
    "poster": {
      "poster_name": "Horea Piper",
      "poster_handle": "horea.piper"
    },
    "time_stamp": "2021-05-11 08:31:36",
    "text": "Does anyone have a solution for this?"
  },
  {
    "poster": {
      "poster_name": "Horea Piper",
      "poster_handle": "horea.piper"
    },
    "time_stamp": "2021-05-11 08:32:18",
    "text": "I’m trying to use this select property to show dependent cities based on the country the users selects"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-11 13:31:28",
    "text": "Generally speaking it is a better practice to write your JavaScript to include the click handler targeting an element class name. This has the benefit of being more performant since you’re not repeating the onclick and function call for every module.\n\nYou then won’t need to worry about the load order, nor need to do the script tag work around Reg suggested.\n\nAlso I would advise not putting a click handler on a div if you can use a semantic element instead.  <https://developers.HubSpot.com/docs/cms/guides/accessibility#use-semantic-markup>"
  }
]