[
  {
    "poster": {
      "poster_name": "Brent Worley",
      "poster_handle": "bworley"
    },
    "time_stamp": "2022-01-10 12:50:03",
    "text": "Hi all.  SmartBug Media is looking for a developer to work on integration and Ops Hub projects.  Details about the job can be found on this page:  <https://smartbugmedia.applytojob.com/apply/rbOJcOuLr5/Software-Developer-Integrations?referrer=20210915184318IKMAWWLMAI45ELEQ>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-07 05:08:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Travis A. Moser",
      "poster_handle": "travis.a.moser"
    },
    "time_stamp": "2022-01-10 14:11:57",
    "text": ":wave: Fusion Alliance is seeking a *HubSpot Architect* to build and implement HubSpot CMS Hub solutions while providing a great experience for our clients. This is a _*full-time salaried*_ position (not contract) and _*can be fully remote*_.\n\nFusion Alliance is a technology consultancy with offices in Indianapolis and Central Ohio. We employ consultants from all over the U.S. who serve clients from a wide range of industries and locations. See the thread for description and DM me if you or anyone you know would be interested.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-10 14:12:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Travis A. Moser",
      "poster_handle": "travis.a.moser"
    },
    "time_stamp": "2022-01-10 14:12:05",
    "text": "_*HubSpot Architect*_\n\nThe primary role of the HubSpot Web Architect is to build and implement HubSpot CMS Hub solutions while providing a great experience for our clients. The ideal candidate takes ownership and initiative of assigned tasks, thrives in change, is detail oriented, and is comfortable working across shifting priorities and differing levels of ambiguity to find solutions.\n\n• Assess and define the technical architecture of complicated websites and business applications \n• Designs, develops, implements, utilizes, and conforms to enterprise HubSpot CMS Hub  architecture application solutions, strategies, processes, and standards, focusing on expertise in HubSpot CMS Hub and comparable CMS technologies.  Ideal candidate has experience in HubSpot Sales Hub and Marketing Hub, as well as how these products integrate with CMS Hub. \n• Collaborates with business owners, analysts, engineers, development teams, and infrastructure services to define, establish, and communicate application architecture standards, policies, and directions. \n• Designs high quality application architectures and drives activities that are aligned to organization requirements and are consistent with enterprise application standards. \n• Designs and develops the CMS to balance the needs of developers with the needs of content creators through the module system, flex columns, and drag-and-drop areas \n• Analyzes technical choices and drive critical decisions for performance, security, and future scalability \n• Collaborates closely with client stakeholders, project managers, and business analysts. \n• Develops, refines, and assists with integrations between various applications via API. \n• Adhere to high-quality development principles while delivering solutions on-time and on-budget. \n• Involved in Digital solutioning and Sales support efforts by contributing to project approaches, timelines and estimates. \n_*Required Skills &amp; Experience*_ \n\n• Proven HubSpot CMS development expertise, including experience in the HubL language \n• At least 1 year of experience leveraging HubSpot’s suite of tools including Sales Hub, Marketing Hub and CMS Hub \n• 5+ years of front-end development, including HTML, CSS, and one or more JavaScript frameworks (Vue, React, etc.) \n• Has a technical development background in website architecture, dev ops, and cloud infrastructure \n• Has experience in API integrations \n• Ability to dive into code and understand how it works \n• Ability to contribute to project plans and estimate development effort \n• Strong documentation skills \n• Strong communication skills \n• Background in consulting or client-facing roles (preferred) \nFor more information about working for Fusion Alliance: <https://fusionalliance.com/careers/>"
  }
]