[
  {
    "poster": {
      "poster_name": "Srinivas Teja",
      "poster_handle": "srinivas"
    },
    "time_stamp": "2021-12-23 07:26:42",
    "edited": {
      "time_stamp": "2021-12-23 07:29:36"
    },
    "text": "Hi could some one help me on how to create ” *Mega Menu* ” in my exisiting theme."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-23 07:56:57",
    "text": "You can use custom theme templates for landing pages in both Marketing Hub Professional and CMS Hub Professional. All higher tiers also support it.\n\nMarketing Hub starter and CMS Hub Starter do not allow the use of custom Landing page templates. They instead get a bunch of default templates."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-23 08:02:12",
    "text": "Ah, okay, I guess I’ve just never worked with a portal that didn’t have Hub Professional, because I never noticed it before."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-23 08:04:11",
    "edited": {
      "time_stamp": "2021-12-23 08:06:45"
    },
    "text": "<@U7SL518D6> Do you know if there’s any way to create new Website pages with the API then? Right now I’m using a script to create new Landing pages automatically and then generate a screenshot for them for auto-generating preview images, then deleting the generated Landing page. That’s not ideal if Landing page custom templates aren’t available to everyone though. Even creating/deleting Landing pages with the API seems to be deprecated though."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-23 08:08:49",
    "text": "It is possible to create new web pages with the API. It’s a little bit complicated because you need the full structure. So I typically advise folks to take a get response and basically clone the page using the API.\n\nThat said I might be able to save you a lot of hassle. Your preview images don’t need to change based on the users settings changes. Showing everything in it’s default state is completely fine."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-23 08:10:00",
    "text": "&gt; Even creating/deleting Landing pages with the API seems to be deprecated though.\nIt’s not deprecated. The new version of the pages API is still in beta <https://developers.HubSpot.com/docs/api/cms/pages>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-23 08:13:24",
    "edited": {
      "time_stamp": "2021-12-23 08:14:45"
    },
    "text": "&gt;  That said I might be able to save you a lot of hassle. Your preview images don’t need to change based on the users settings changes. Showing everything in it’s default state is completely fine.\nOh yeah, it’s just the default state, but it goes through and creates a new page for each template, then takes a screenshot of it, saves it, and deletes the page. For the section previews, it creates a page using the section-previews template (which is auto-generated based on iterating through the sections), takes a screenshot and saves each section preview image, and then deletes that page."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-23 08:16:34",
    "text": "ahh, neat. As far as the LP templates you should be able to treat them the same as other templates in your theme"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-23 17:52:10",
    "edited": {
      "time_stamp": "2021-12-23 17:52:27"
    },
    "text": "Is there any way to limit the use of certain custom sections and certain custom modules to certain template(s)?"
  }
]