[
  {
    "poster": {
      "poster_name": "Martin Dahlén Jansson",
      "poster_handle": "martin631"
    },
    "time_stamp": "2021-12-13 04:16:39",
    "text": "Hi!\nI would like some input on one thing with our theme. :slightly_smiling_face:\nWe have three brands that should share the same basic templates and styles in HubSpot cms, however we need them to have different global headers and footers. What would be best best practice here? I would like to avoid copying the the theme for each brand if there for example is changes to a template I don't want to do it three times ^_^\n\nMy first solution is to make three different header partials and have an if statement checking for domain when including the header partial. But this will not work during development i think and the domains aren't connected.\n\nMy second solution is to skip templates all together and just have it all as modules and make a template for each brand that extends a different layout each with its own header/footer partials. This seems like the most robust solution to me, but some more work for the content creators.\n\nHow would you solve it? any input is greatly appreciated ^_^",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-13 07:33:52"
      },
      {
        "time_stamp": "2021-12-13 08:55:31"
      },
      {
        "time_stamp": "2021-12-19 08:11:21"
      },
      {
        "time_stamp": "2021-12-19 08:16:40"
      },
      {
        "time_stamp": "2021-12-19 09:47:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-12-13 07:33:52",
    "text": "Hey Martin - you could consider making 3 child themes of the theme and then upating the header and footers in the children (note: you'll need CMS Pro+ as CMS starter only allows for 1 child theme to be created in a portal). If there are more changes you want to make to thing outside the header/footer down the line, this should allow you to share the majority of the code across all 3 themes but selectively override for one domain"
  },
  {
    "poster": {
      "poster_name": "Martin Dahlén Jansson",
      "poster_handle": "martin631"
    },
    "time_stamp": "2021-12-13 08:55:31",
    "text": "Thanks, seems like the best solution ^_^\nWill take a look how it works"
  }
]