[
  {
    "poster": {
      "poster_name": "Frank Fava",
      "poster_handle": "frank.fava"
    },
    "time_stamp": "2021-11-18 03:44:12",
    "text": "Apologies <@U020009PKSL>, Will be fixed momentarily"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-11-18 08:24:15",
    "text": "<@U7SL518D6> i wanted to tag you in case you didn’t see my response above. let me know if HubSpot support would be a better avenue. thanks!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-18 09:41:05",
    "text": "Very very strange.\n\nAsking because I’ve seen someone do this before - are you using Dropbox/Google Drive/another folder sharing service to sync your dev assets amongst your team to your local machine? This seems like an issue you’d experience with that kind of set up."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-11-18 09:42:22",
    "text": "I am not. It actually happened to me again this morning. So much for the restart. :sob:"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-11-18 09:43:08",
    "text": "Our other dev couldn’t pinpoint it either. It happens so randomly."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-18 09:48:33",
    "text": "As far as whether to contact HubSpot support - they’ll be able to 1:1 troubleshoot a little faster than I can just because I’m 1 person vs there’s a ton of support folks.\n\nThat said, this is a really strange issue and without knowing what commands are happening before it occurs, it’s simply bizarre.\n\nYou explained it’s happening every morning and it happens regardless of a reboot. It kinda makes me wonder if there’s a security/IT software with a schedule to scan/do something on your work computers - and the config file is just getting mistreated."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-18 09:49:29",
    "edited": {
      "time_stamp": "2021-11-18 09:50:05"
    },
    "text": "I don’t even think the CLI has a mechanism for removing credentials from a config file. Just renaming, listing, and changing default"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-11-18 09:50:08",
    "text": "Sorry, that was a bit confusing. It’s not happening every morning with her…i was just saying she reboots every morning. The config file issue happens at random."
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-11-18 09:52:02",
    "text": "Well its good (kind of) to know its not just me. Let me know if you hear about this issue from anyone else."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-18 09:55:06",
    "text": "The best thing I can say right now is to pay close attention to what actions you’re taking using the CLI.\n\nIf you notice it happens after a specific command gets run, let us know right away what command it is -we’ll start digging through the code to try to figure it out.\n\nThe next step in the process would be that we’d want you to try re-authing one of the accounts that keeps dissapearing. Then run that specific command that causes the issue but do it with `--debug` at the end. This will cause it to provide debugging information I can give to the team.\n\nSo far your team’s case is the only one I’ve seen."
  },
  {
    "poster": {
      "poster_name": "Kam Jin",
      "poster_handle": "kam.jin"
    },
    "time_stamp": "2021-11-18 13:38:10",
    "text": "HELLO! Any idea on how to add a small close (x) button to the video popup window? The video I am talking about can be accessed by clicking on the product video button right in the hero banner:\nHere is the link to the page with the hero banner mentioned above: <https://www.realtimenetworks.com/assettracer/intelligent-lockers>\n-----------------------------------------------------------------------------\nThis is the code for the video button and video popup window function:\n&lt;div class=\"video-inner\"&gt;{% video_player \"embed_player\" overrideable=False, type='scriptV4', hide_playlist=True, viral_sharing=False, embed_button=False, autoplay=False, hidden_controls=False, loop=False, muted=False, full_width=False, width='1920', height='1080', player_id='48716169367', style='' %}&lt;/div&gt;\n&lt;/div&gt;"
  }
]