[
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-04-25 12:51:07",
    "edited": {
      "time_stamp": "2024-04-25 13:04:32"
    },
    "text": "Hey Folks! Having some challenges importing a blog csv. Most of the images come back\n`unable to download assets`\nI spot-checked and they’re 200\n\nSo I’d like to understand how the overwrite feature works - If overwrite is on, what happens? Let’s say the matched post has no  featured image, but successfully imports, do I get an image there? Or if an image existed on the post, but the asset retrieval fails this time, do I lose the image I previously had on the post?\n\nEDIT: grrrrr. it looks like ‘overwrite’ just overwrites, even if it’s wiping out existing images.  Are there any other tricks to getting these images imported, other than doing it manually? It’s a big blog.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-25 13:44:00"
      },
      {
        "time_stamp": "2024-04-25 17:50:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-25 13:44:00",
    "edited": {
      "time_stamp": "2024-04-25 13:44:26"
    },
    "text": "Hey Tony, short answer is yes, if this is a wordpress site then HubSpot have an importer for wordpress blogs. You just need to map some elements depending on your needs. Doing it manually is not a practical way for big blogs sites."
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-04-25 17:50:38",
    "edited": {
      "time_stamp": "2024-04-25 17:52:55"
    },
    "text": "unfortunately it’s adrupal 7 site. took me 3 hrs to export lol. And yes, I realize there are importers, I guess my issue is that everything is importing except the images, which are hit and miss. what’s the easiest way to batch all of these images in?"
  }
]