[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-04-30 04:36:23",
    "text": "Hi <@U03016GSEQ6>,\nIt's a great question.\nIf you already have all the operations in HubSpot, it's a sign that you should consider moving your website to HubSpot as well.\n\nRecently, HubSpot introduced Content Hub, which aims to make content creation consistent and effective across all marketing channels. This means that social media, emails, website pages, blogs, etc., are in sync in terms of brand assets (logo, colors) and content.\n\nOne of the key advantages of using HubSpot for your website is that it provides a unified tool for your marketing team. This can significantly streamline their work and enhance their productivity, as they won't need to switch between different tools.\n\n+ There are options for personalized content, A/B testing, etc., to enhance lead generation.\n\nI could go on with the reasons for moving to HubSpot CMS.\n\nBeing both a HubSpot CMS developer and a Webflow developer, I'd like to point out one issue that could stop switching platforms or at least be careful about. When building a website on HubSpot, one should be aware of website speed since HubSpot adds its own JavaScript and other stuff that could impact the performance. It's better to consider that beforehand by making cautious design and development choices.\n\nIf you have more questions about HubSpot CMS, feel free to DM\n\nThere are lots of websites using HubSpot.\nHere are some examples (our clients or businesses using our HubSpot themes from the marketplace):\n\n<https://www.amby.com/>\n<https://navigating.art/>\n<https://gatsby.ai/>\n<https://competitivegg.com/>\n<https://www.mastreforest.com/>"
  },
  {
    "poster": {
      "poster_name": "Jerry Dinsmore",
      "poster_handle": "jerry681"
    },
    "time_stamp": "2024-04-30 10:14:53",
    "edited": {
      "time_stamp": "2024-04-30 10:15:14"
    },
    "text": "Just want to add to <@UMZFZHVUJ> perfect response with HubSpot CMS and Marketing Hub users added an average of 122% more contacts than users with Marketing Hub only."
  },
  {
    "poster": {
      "poster_name": "Patrick Keo",
      "poster_handle": "patrick362"
    },
    "time_stamp": "2024-04-30 22:11:01",
    "text": "hi all, we've recently migrated a site across to HubSpot CMS and added GA4 to the integrations section in settings. However traffic data has dropped by nearly 90% in GA4. However in HubSpot traffic analytics it is around what was expected with the migration. Has anyone else had a similar issue before and how they resolved it? It looks like GA4 real-time data is accurate but not the overall stats.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-01 09:52:48"
      },
      {
        "time_stamp": "2024-06-03 17:46:02"
      },
      {
        "time_stamp": "2024-06-05 12:17:33"
      }
    ]
  }
]