[
  {
    "poster": {
      "poster_name": "Gustavo Barbosa",
      "poster_handle": "gbarbosa"
    },
    "time_stamp": "2024-04-26 11:42:14",
    "edited": {
      "time_stamp": "2024-04-26 11:43:21"
    },
    "text": "*Hey everyone*,\n\n I'm having trouble, because I don't want to migrate my site, I just want to use my domain for meeting links, I'd like to use a custom domain, like in the example in the picture below.\nBut I have a wordpress site, and I want to keep it there, but every time I tried to connect my domain even as a secondary, it asked for DNS type A records, making my site point to HubSpot now. I just want to be able to use my domain for meeting links without using a subdomain for that, you know?\n\nIf anyone knows how to solve this, I'd be very happy because I've been trying to solve it all week. So far the only solution that has worked is connecting a subdomain like <http://Lp.website.com|Lp.website.com> and I just want it to be <http://website.com|website.com> for meeting links and keep my site on wordpress in live.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-26 13:24:44"
      },
      {
        "time_stamp": "2024-04-26 13:46:35"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-04-26 11:44:40"
  },
  {
    "poster": {
      "poster_name": "Jerry Dinsmore",
      "poster_handle": "jerry681"
    },
    "time_stamp": "2024-04-26 13:24:44",
    "text": "That won't be possible with out a subdomain or migrating. tbh I don't think it matters what URL it is when it comes to booking meeting so use the default HubSpot url."
  },
  {
    "poster": {
      "poster_name": "Gustavo Barbosa",
      "poster_handle": "gbarbosa"
    },
    "time_stamp": "2024-04-26 13:46:35",
    "text": "Okay, if you really can't then thank you for saying so. I was just trying to find the truth."
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-04-26 15:14:52",
    "text": "Hey Folks! Having some challenges importing a blog csv. Most of the images come back\n`unable to download assets`\nI spot-checked and they’re 200\n\nSo I’d like to understand how the overwrite feature works - If overwrite is on, what happens? Let’s say the matched post has no  featured image, but successfully imports, do I get an image there? Or if an image existed on the post, but the asset retrieval fails this time, do I lose the image I previously had on the post?\n\nEDIT: grrrrr. it looks like ‘overwrite’ just overwrites, even if it’s wiping out existing images.  Are there any other tricks to getting these images imported, other than doing it manually? It’s a big blog, and Drupal 7, so the csv I have is what I have to work with."
  }
]