[
  {
    "poster": {
      "poster_name": "Santhoshkumar R",
      "poster_handle": "santhosh.kumar"
    },
    "time_stamp": "2024-11-05 01:23:42",
    "text": "Hello there, I just want to set the HS cookie when the visitor submits the HS form without accepting the cookie banner. Since we are notifying the visitor that the privacy policy will be accepting while submitting the form. For other's, the flow will be same as default. Could someone please help me?"
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2024-11-05 03:37:25",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-05 03:37:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2024-11-05 03:37:59",
    "text": "you can do that with a form"
  },
  {
    "poster": {
      "poster_name": "Karis Atkinson",
      "poster_handle": "karis.atkinson"
    },
    "time_stamp": "2024-11-05 07:47:05",
    "text": "Hi all. I'm attempting to set up a workflow to automate adding contacts to a Microsoft Teams Webinar after a HubSpot form submission. Upon enrolling a test contact, I keep bumping into the following error message where my contacts fail to enrol \"because of an error in the connected app..\", with a server response error - screenshot in thread.  Has anyone encountered this before or might now how to resolve? Thanks!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-05 07:47:14"
      },
      {
        "time_stamp": "2024-11-11 08:30:09"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-11-05 07:47:14"
  },
  {
    "poster": {
      "poster_name": "joe conery",
      "poster_handle": "joe277"
    },
    "time_stamp": "2024-11-05 09:31:22",
    "text": "idk.. the video wants me to sign in and it's in spanish"
  },
  {
    "text": "This is HubSpot's own example on a new portal, so yes the second option",
    "time_stamp": "2024-11-05 14:27:12"
  },
  {
    "text": "Hello All,\nI’m facing an issue with workflows where I’m trying to copy a sensitive field (single-line text) to a public property, but it’s not working. The workflow runs, but the sensitive field doesn’t get copied to the public property. It works fine with a date type property.\nHas anyone had this issue before or found a solution?\nI’ve attached a screenshot of the workflow for reference.",
    "time_stamp": "2024-11-06 00:49:42",
    "edited": {
      "time_stamp": "2024-11-06 00:50:27"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-11 08:22:36"
      }
    ]
  }
]