[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2019-05-01 07:53:17",
    "text": "Gobi -- Do you know if hubDB will be getting an update for the richtext editor to be inline with the other editors anytime soon? We have a lot of issues with clients using it to update content"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2019-05-01 07:55:37",
    "text": "Thats still in our pipeline to complete. I will inform u when I have more update on that."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2019-05-01 08:03:37",
    "text": "We have a client that is looking for us to scope out using tinymce editor. Basically looking at a password protected page in HubSpot, selecting the hubdb table, then being able to edit and save. Using a lambda/serverless function to send to the hubDB api. They would also like this to solve the problem with importing csvs into HubDB by using this -- updating by rows vs a clean import. I'm not sure if it is possible to get a timeline on either of these items right now. I'm scoping this out and I'm looking at a decent amount of money for this to be done, but if we are looking at a month or two until this is fixed, I think they would want us to hold off on it, but if we are looking at 6 months, then I woudl guess they would want us to do this.  Are you able to give any sort of timeline (like under 6 months, longer than 6 months, etc) so that I can include this. I'm not holding you to this timeline, and will say it isn't a real timeline, just an estimation, but I want to make sure I'm doing the client right as much as possible"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2019-05-01 08:14:04",
    "text": "My guess is &lt; 6 months, but no guarantees"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2019-05-01 12:11:09",
    "text": "thanks"
  }
]