[
  {
    "poster": {
      "poster_name": "Kobe Kapoor",
      "poster_handle": "kobe"
    },
    "time_stamp": "2023-10-19 06:21:33",
    "text": "If you haven’t got it Christian, try just a total count of the property create date for associated deals"
  },
  {
    "text": "It worked, thanks. In addition to that, is it possible to have a property that could be used like a counter? For example, I'd like to have the total number of deals in my account stored in a prop. Just like we can use count of deals in deals reports.\n\nI tried this with a workflow that increases by 1 my counter property for every deal known, so if there are 100 deals, this property should be equal to 100... but its not working. I feel like I'm missing something out",
    "time_stamp": "2023-10-19 07:54:58",
    "edited": {
      "time_stamp": "2023-10-19 07:58:36"
    }
  },
  {
    "poster": {
      "poster_name": "Tim Schaeppi",
      "poster_handle": "tim.s"
    },
    "time_stamp": "2023-10-19 10:14:42",
    "edited": {
      "time_stamp": "2023-10-19 12:03:11"
    },
    "text": "Hi All - Does anyone know of *a way to calculate / sum the Properties of Line Items on a Deal*? Here's the issue I have:\n\nI need to create a notification for each Product [Type] = \"Print\" on a Closed Deal. One of the biggest issues so far is that I can only reference the Most Recently Created, Most Recently Updated, and First Created Line Items. So if someone creates a Quote with 6 line items, the only available data for me is the first and last items, being that they \"save\" to the deal all at once after Quote creation.\n\nOpen to ideas, I've got a lot of workflow familiarity but not much into Custom actions. Willing to try anything."
  },
  {
    "poster": {
      "poster_name": "Sarvesh Khot",
      "poster_handle": "sarveshkhot"
    },
    "time_stamp": "2023-10-19 10:49:40",
    "text": "Hi,\nUsing HubSpot custom action where we are redirecting that to webhook,\nwant to pass all contact properties to the webhook from custom action in HubSpot\nIs there any way we can pass all contact properties to the webhook, is someone can help on me this",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-24 01:07:18"
      },
      {
        "time_stamp": "2023-10-24 02:48:18"
      },
      {
        "time_stamp": "2023-10-24 03:54:16"
      },
      {
        "time_stamp": "2023-10-24 04:45:41"
      },
      {
        "time_stamp": "2023-10-24 04:52:52"
      }
    ]
  }
]