[
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 14:54:51",
    "text": "Hi Trish, I'm a Technical Consultant for HubSpot. Do you have Operations Hub Professional subscription? You'll need that to run a custom coded action in a workflow.\n\nI think you may be able to skip storing an array on a record and instead use our <https://developers.HubSpot.com/docs/api/crm/search|CRM Search> endpoint to retrieve a subset of records and sort them.\n\nLet me know if you have any questions."
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 14:59:49",
    "text": "Hi Enrico, are you sure you're testing with a record that has a value for that property? What is he response returned after your test is sent?"
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:01:45",
    "text": "Can you pass the record ID of the current record in the workflow to the newly created record? Then, you'd be able to make an association matching on that value (be sure to clear it afterwards for future associations). Associ8 (marketplace app) can handle this for you for free up to a certain amount of associations."
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:02:39",
    "text": "Killean, is this in a developer portal?"
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:03:06",
    "text": "Hi Erik,"
  },
  {
    "text": "I'd recommend using this endpoint: <http://api.HubSpot.com/email/public/v1/events|api.HubSpot.com/email/public/v1/events>\n\nYou can make the request with a Webhook and allows to have low/no code in the workflow.\n\nYou get a response like the one below and you can use this data to retrieve more information about the email that was delivered.",
    "time_stamp": "2023-10-17 15:06:58"
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:08:50",
    "text": "Diana, you may be able to break this into a few custom coded actions that run after one another. If you use the callback function, you can take some data from an earlier custom coded action to use in a later one in the same workflow."
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:11:35",
    "text": "I like using Axios as well. It's nice because it allows for retry on failure.\n\nI'd recommend taking your working API request in Postman and the build-in code output w/ Axios. Then, paste into the custom coded action."
  },
  {
    "poster": {
      "poster_name": "Diana Contreras",
      "poster_handle": "dco"
    },
    "time_stamp": "2023-10-17 15:11:36",
    "text": "honestly I tried breaking it down into smaller chunks and it kept giving me the same error so I MacGyvered a different way using a custom object which I actually think works better for what we want"
  },
  {
    "poster": {
      "poster_name": "Diana Contreras",
      "poster_handle": "dco"
    },
    "time_stamp": "2023-10-17 15:12:03",
    "text": "but thank you for jumping in on this thread :heart: appreciate the insight"
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:12:43",
    "text": "Yeah, no problem. Glad you got it to work. I work for HubSpot as a technical consultant so trying to hop in here periodically to see if I can help out!"
  },
  {
    "poster": {
      "poster_name": "Trish Hinojosa",
      "poster_handle": "trish.hinojosa"
    },
    "time_stamp": "2023-10-17 15:16:55",
    "text": "Hey <@U048AH500QM> I do have Ops Hub Professional. I see your point.\n\nI can just bring in a list of companies then apply the sort and limit arguments?"
  },
  {
    "poster": {
      "poster_name": "Tyler Hanevold",
      "poster_handle": "thanevold"
    },
    "time_stamp": "2023-10-17 15:19:36",
    "edited": {
      "time_stamp": "2023-10-17 15:21:12"
    },
    "text": "Yep! You can include the sort right in the body of your request. Keep in mind that although it may seem like a GET request, this request actually uses the POST method."
  },
  {
    "text": "Here's a sample of a sort in the body of the request",
    "time_stamp": "2023-10-17 15:20:29"
  }
]