[
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-06-22 05:40:17",
    "text": "*5.* A better stylesheet support for *dnd email modules*.\n\n*Detail:* We have this awesome DnD email editor, but still no way for responsive optimizations for our modules. I have tried everything, and the only thing I can do is, add the \"display_block_on_small_screens\" class from the DnD-grid styles to my tables."
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-06-22 05:50:47",
    "text": "*6.* Domain Header Include for *KonwloageBase*.\n\n*Detail:* At least one way to include style or script files to the knowloage base. I would preffer if the domain header from site settings would work as aspected, this fix is overdue. But i would accept any way to apply custom stylsheets and scripts to a KnowlageBase."
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2022-06-22 08:50:50",
    "text": "One of my top needs for HubDB would be a module field for a HubDB select/multiselect column. I often find myself wanting to filter my queries within my templates by a particular value from a column, and at the present I enter those values manually into a choice field w/ the option label and value pairs.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-22 20:36:14"
      },
      {
        "time_stamp": "2022-06-23 09:07:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-06-22 08:53:14",
    "text": "Great points <@UK9BKNBD5>!"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-06-22 20:36:14",
    "text": "A module field for HubDB select columns is a cool idea to extend this sort of data filtering to marketers! We are actually working on a different concept to allow developers to extend data filters to marketers, such as selecting values for select/multi-select. Would love to chat about it and get your feedback, feel free to book me here <https://app.HubSpot.com/meetings/wspiro>"
  }
]