[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-06-24 04:36:20",
    "text": "A GUI for the them fields.json would be awesome, and/or some way of splitting it out into multiple files would be awesome, my file is getting a bit unwieldy at over 4000 lines long… It’s gonna be an awesome theme but blimey when I want to make changes in there it’s a bit of a headache, can’t make comments either!\n\nBut A GUI should surely be relatively simple to implement as it shouldn’t be too different from the module fields."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-06-24 04:36:43",
    "text": "Likewise i’m sure this has been asked before but being able to copy field groups between modules would be super useful without having to use the cli, even if we could access the module fields json in the DM would be so useful.\n\nEven better would be nested modules, at the moment I use macros as components for regularly repeating bit’s of code, but have to replicate the field groups everywhere I use them.\nDnD doesn’t solve this as there’s too much flexibility for awful layouts when put in the wrong hands, and at the same time not enough flexibility to get something looking just right! (Don’t get me wrong DnD is great just not a miracle solution)"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-06-24 05:18:27",
    "text": "How about a site manager to group settings for a domain? If you want to change an active theme for a domain... edit the site settings in the site manager. Want to change your domain for the site... edit the domain in the site manager. Want to test a new theme without breaking the live site? Create a staging site in the site manager. When done, push changes to the live site. If you agree upvote and share your ideas also --&gt; <https://community.HubSpot.com/t5/HubSpot-Ideas/Create-a-Site-Manager/idi-p/654981#M116166>"
  },
  {
    "poster": {
      "poster_name": "Kumar B",
      "poster_handle": "kumar.b"
    },
    "time_stamp": "2022-06-24 06:12:45",
    "text": "Hello\nI need message and calling between HubSpot contact and my own app reliable pbx.\nSo i ask you regarding SMS channel.\nor how to add custom call button in contact page, onclick call button called my own API with contact and owner contact.\nif anyone possible then give me proper solution."
  },
  {
    "poster": {
      "poster_name": "Vanessa BT",
      "poster_handle": "vanessa"
    },
    "time_stamp": "2022-06-24 12:05:00",
    "text": "has anyone built a calendar view from an events feed? I haven't seen any samples or threads on this but I have a client that we are developing a site for. They have will be adding events to the site which we will either do using HubDB or a post functionality. But they would like to be able to filter the viewer experience to show in a list view or a calendar view and also filter by event types on top of that.\n\nHas anyone done this yet?"
  },
  {
    "poster": {
      "poster_name": "Louise Tollisen",
      "poster_handle": "ltollisen"
    },
    "time_stamp": "2022-06-24 12:47:16",
    "text": "Hi everyone! Does anyone use HubSpot for a nonprofit org?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-24 13:12:07"
      },
      {
        "time_stamp": "2022-06-24 13:51:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Denis Lunev",
      "poster_handle": "denis636"
    },
    "time_stamp": "2022-06-24 13:12:07",
    "text": "Yes, there are plenty of nonprofits on HubSpot, who we worked with e.g. <https://tns.org>, <https://www.masshort.org/>, <https://www.taleefcollective.org/>, <https://www.eshelonline.org/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-24 13:51:16",
    "text": "We have a program specifically for non-profits, you can <https://www.HubSpot.com/nonprofits|learn about it here>."
  }
]