[
  {
    "time_stamp": "2022-06-15 11:00:06",
    "text": "Reminder: If you had a magic wand and could have any feature in HubSpot what would it be? Post your idea to the idea forum, then link to it from here so folks can help upvote your idea. Upvotes help HubSpotters quantify demand for functionality and influence our prioritization."
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2022-06-15 11:31:24",
    "text": "Along the lines of the message above, the Workflows team is spending the rest of this week paying extra attention to the ideas forum so make sure to create and/or upvote your favorite feature requests :otter:"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-06-15 12:12:59",
    "edited": {
      "time_stamp": "2022-06-15 12:13:36"
    },
    "text": "Why hasn't HubSpot verified their website on the GitHub org? :x",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-15 12:29:11"
      },
      {
        "time_stamp": "2022-06-15 12:44:51"
      },
      {
        "time_stamp": "2022-06-15 13:44:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-15 12:29:11",
    "text": ":shrug::skin-tone-2:  probably simply there isn’t much demand _to do_ it. Folks don’t tend to question whether our org is legitimate.\n\nOur engineers tend to focus on things that they are confident will provide customers external developers significant value. Not that this wouldn’t, it’s just a matter of spend the time to set this up and play with DNS settings to potentially increase trust very slightly OR work on something customers/developers are actively demanding. The latter tends to be where teams gravitate. Doesn’t mean they think it’s not worth doing, it’s just that the other thing is going to be more valuable."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-06-15 12:44:51",
    "text": "Yeah, I guess, this literally takes 60 seconds to do though."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-15 13:44:23",
    "edited": {
      "time_stamp": "2022-06-15 13:45:10"
    },
    "text": "In a small company it would. In a company our size, it gets a little more complicated - you gotta find the person with the keys to HubSpot’s DNS and convince them it’s worth it to take time out of their day to make some DNS changes then you need to do the GH side of the steps since they likely aren’t in the public GH org.\n\n:shrug::skin-tone-2:  Maybe one day."
  }
]