[
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2019-11-06 06:56:56",
    "text": "yeah, the second. and that’s exactly what they don’t want. UGH. but that’s all i can come up with as well."
  },
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2019-11-06 09:36:17",
    "text": "I’m building a HubSpot website that requires “Membership” functionality and trying to decide if HubSpot’s *Membership-Content With Marketing Hub Enterprise* can handle the job or if I’ll need to build some (or all) of this functionality off-HubSpot using a tool like Firebase.\n\nThe website’s functionality will require the following:\n\n*Member account creation*\nWebsite users should be able to fill out a form, establish a username and password and create an “account”, after which they will become a “Member” thereby giving them access to password protected pages and content.\n\n*Member access Password protected pages*\nLogged in users (aka: Members) will have access to a series of PW protected pages (and files like PDFs) on the site.\n\n*“Sessions”*\nWhen the Member is logged in, the user should not be asked to re-enter their login credentials upon accessing additional PW protected pages for the duration of the session.\n\n*Member account information updates*\nMembers should be able to update their account info (HubSpot API?)\n\n*Online directory*\nLogged in Members can search a “Member Directory” ( which in this case would basically be the HubSpot List of registered Members). I can imagine using HubSpot API to enable logged in members to search this Member List.\n\n*Paywall + subscription content*\nSome content will need to paid for one-time before viewing. Additionally, members can sign up for a paid subscription giving them access to all paid content. My client is open to using Stripe or another method if there’s me type of native integration available.\n\nA few questions I can thin of:\nHow much of this can I/should I build using HubSpot’s Membership-Content feature? I’ve read in the docs that it “shouldn’t be used in place of user accounts” but the docs also state that this feature can do most of what I’ve listed above.\n\nWill functionality like allowing Members to update their account information and search a “Member Directory” be achievable via the HubSpot API?\n\nIs there a recommended method for handling one-time payments as well as subscription sign ups - perhaps a Stripe integration?\n\nAny additional recommendations for building a system like this on HubSpot?\n\nThank you all !!\n\nAdditional resources:\n<https://www.HubSpot.com/product-updates/create-membership-content-using-marketing-hub>\n<https://knowledge.HubSpot.com/cms-pages-editor/control-audience-access-to-pages>"
  }
]