[
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-01-15 08:46:17",
    "edited": {
      "time_stamp": "2020-01-15 08:53:43"
    },
    "text": "Interesting — what would you want to put into that tab?\n\nYou’re right, it’s not supported. This is the first I’ve hearing of anyone wanting to customize it (~granted, it’s relatively new~ actually, not that new :slightly_smiling_face:). I’d love to hear more about what you’re looking to do."
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-01-15 08:47:36",
    "text": "It’s not possible to add a class like you describe without going into the source, but I wonder if a custom module could give you the flexibility you’re looking for?"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-01-15 08:49:21",
    "text": "See the note in yellow at the top of this article: <https://designers.HubSpot.com/docs/modules/getting-started>\nIt sounds like you may be able to create a field which your content team members could input a class into and pull in the styling they want."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-01-15 08:53:42",
    "edited": {
      "time_stamp": "2020-01-15 08:53:47"
    },
    "text": "At the moment users are able to customise the styles of HubSpot core modules via that tab . The introduction of “themes” is great, but as far as I understand (and i could be completely wrong here) you cannot access those variables from a module. I imagine in some custom modules people are using fields.json to add fields which are more related to the the design of a look and feel of the module."
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-01-15 08:56:22",
    "text": "Not sure I follow - are you looking to customize the design of one particular module while using a Theme? And make that option available to a non-developer?"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-01-15 09:02:55",
    "edited": {
      "time_stamp": "2020-01-15 09:04:12"
    },
    "text": "Sorry didnt explain that well. I read in the <#CSFGKSHT7|themes> that if i setup a themes.json and a fields.json at the top level of a theme those variables will be accessable in JS files, CSS files and template files. However, I don’t think that includes CSS/JS and templates inside modules, does it?\n\nIf that is true, currently the only option at the moment to allow users to tweak the look and feel of a custom module is to add it as a field in fields.json for the custom module. This is fine, and it works, and I imagine many people are doing this. However, would it not be cleaner to allow developers to specify if a field in a custom module is a “style” or data field?\n\nMaybe a custom “slider” module as an example:\n\n• Repeater field for “slides”\n• Autoplay speed\n• Show arrows (bool)\n• Show dots (bool)\n• Transition type\n• Overlay\nSome of these fields are data, and others effect the “styles”, so I feel it would be nice to allow us to drop them in the styles tab."
  },
  {
    "poster": {
      "poster_name": "Tim Loden",
      "poster_handle": "tim.loden"
    },
    "time_stamp": "2020-01-15 10:02:52",
    "text": "A custom module would work but I want to be able to put it inside a rich text field or more specifically a blog post"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-01-15 15:40:37",
    "text": "Hey Tim, we should talk! We might have something cooking that will help with this…. DM-ing you."
  },
  {
    "poster": {
      "poster_name": "Tim Loden",
      "poster_handle": "tim.loden"
    },
    "time_stamp": "2020-01-15 15:43:44",
    "text": "awesome!"
  }
]