[
  {
    "poster": {
      "poster_name": "Hassam",
      "poster_handle": "hssmmalik"
    },
    "time_stamp": "2021-09-13 02:02:58",
    "text": "Hi everyone,\nIs there any way to add guests/participants to an existing engagement/meeting using HubSpot apis?"
  },
  {
    "poster": {
      "poster_name": "Germán López-Campos",
      "poster_handle": "german.lopezcampos"
    },
    "time_stamp": "2021-09-13 06:57:09",
    "text": "Hello, is it possible to see on the table view of Custom Objects the associated contacts as a clickable column? Currently in order to observe this, we need to click on the object and once there we can click to the contact"
  },
  {
    "poster": {
      "poster_name": "Vitor Santos",
      "poster_handle": "vitor.santos"
    },
    "time_stamp": "2021-09-13 08:05:50",
    "text": "Hi everyone, we've been used Fivetran app to integrate the data and now we're trying use SDK directly, but we don't getting take the historical data, after 10 thousand register, the SDK blocked us.\nCould we get the historycal data in a CSV file only one time?"
  },
  {
    "poster": {
      "poster_name": "Maxime Blaszka",
      "poster_handle": "mblaszka"
    },
    "time_stamp": "2021-09-13 08:27:11",
    "text": "Hello, i would like to change the display order in my product properties. When i click on create new line item from existing product, i've groups with properties inside. I executed via the API, a PATCH call for change the value of \"displayOrder\". I've put 1 for test in a field. No errors, good response. But the display has no effects in HubSpot UI app. And a thing more strange, the property has change display order at 5th position in the groupe instead of 15. Can you help me please. Thanks"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-09-13 08:28:38",
    "text": "I’ll work on getting our docs and validation updated to make this clear. Thanks for flagging :+1:"
  },
  {
    "time_stamp": "2021-09-13 10:00:47",
    "edited": {
      "time_stamp": "2021-09-13 10:00:52"
    },
    "text": "Reminder: *Want to be the first to know when a new API is available or an existing API has a new version?*  We publish all of that on our <https://developers.HubSpot.com/changelog|Developer Changelog>.  While we do our best to avoid <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes> to our APIs, sometimes for security, and reliability we have to. The Changelog is where we’ll post announcements ahead of time about it. <https://developers.HubSpot.com/changelog|Subscribe to the Developer Changelog> to stay up-to-date on what’s happening in the world of HubSpot development."
  }
]