[
  {
    "text": "Hello !\nIs this possible to turn off auto form focus on HubSpot? Right now I’m creating an application that simultaneously sends a user to the database and creates a user on the CRM HubSpot. When I tried send request it is sent twice because HubSpot creating contact automatically. When I delete backend and left that autofocus on forms I have problems with creating  contacts. HubSpot put all new email into one contact. It work properly when I send requests on my own but I don’t know how to turn off that auto focus.",
    "time_stamp": "2021-09-16 04:27:55"
  },
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2021-09-16 05:03:35",
    "text": "can we import contacts from third party api in HubSpot using serverless functions ?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-16 07:47:36"
      },
      {
        "time_stamp": "2021-09-16 07:49:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2021-09-16 07:47:36",
    "text": "HubSpot api allows contact imports, both single and in bulk, so depending on you other system, and given that you can provide the HubSpot api the data in json format, this is possible to achieve"
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2021-09-16 07:49:35",
    "text": "<https://developers.HubSpot.com/docs/api/crm/contacts>"
  },
  {
    "poster": {
      "poster_name": "Rob Butler",
      "poster_handle": "rob.butler"
    },
    "time_stamp": "2021-09-16 08:36:02",
    "text": "Hi all, have a question in regards to the limits of HubSpot and if anyone has had any experiences here:\nWe use a lot of Custom Properties on the contact database for various reasons, and will be requiring more than the the limit of 1,000. Is this a hard limit or is there an option to get this limit raised at all?"
  },
  {
    "text": "Anyone know how to get the app logo displayed in the crm card like the docs show?\nI have the card working and a logo set, but it doesn’t show in my card.",
    "time_stamp": "2021-09-16 12:16:16",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-09-27 02:16:26"
      },
      {
        "time_stamp": "2021-10-01 09:33:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Isabelle de Laperouse",
      "poster_handle": "isabelle"
    },
    "time_stamp": "2021-09-16 14:05:18",
    "text": "Hi All - I am building a Shopify app and would like to integrate HubSpot into our app to create automatica marketing workflows once someone downloads the app. I understand that with Shopify you need to request persmission for specific data like email but once that is authorised what APIs do I use to connect the merchants emails to a HubSpot workflow and CRM"
  },
  {
    "poster": {
      "poster_name": "Isabelle de Laperouse",
      "poster_handle": "isabelle"
    },
    "time_stamp": "2021-09-16 14:06:14",
    "text": "I have been told by support to use two different APis - marketing API or eCommerce bridge - what do you suggest?"
  }
]