[
  {
    "poster": {
      "poster_name": "Mitesh Koshiya",
      "poster_handle": "miteshkoshiya5854"
    },
    "time_stamp": "2023-11-27 06:38:34",
    "text": "Hi Devs,\n\nIs it possible to save/keep log of workflows for debugging?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-27 19:10:43"
      },
      {
        "time_stamp": "2023-11-28 01:26:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arno Teigseth",
      "poster_handle": "arno.teigseth"
    },
    "time_stamp": "2023-11-27 11:34:42",
    "text": "Hi, is it possible to trig a workflow on a change in HubSpot User? (not Contact, User). I'd like to fire a webhook on changes to users' Main Team.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-27 14:31:43"
      },
      {
        "time_stamp": "2023-11-27 14:32:02"
      },
      {
        "time_stamp": "2023-11-27 14:32:49"
      },
      {
        "time_stamp": "2023-11-27 15:53:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arno Teigseth",
      "poster_handle": "arno.teigseth"
    },
    "time_stamp": "2023-11-27 11:35:06",
    "text": "(or otherwise trig some event, doesn't have to be a Workflow)"
  },
  {
    "poster": {
      "poster_name": "Sam Bell",
      "poster_handle": "sam.bell"
    },
    "time_stamp": "2023-11-27 14:31:43",
    "text": "Hi Arno, for the company that I work for we have multiple teams e.g. sales, customer success and then we have a holding team that we put people into when they are off work so deals etc don't get assigned to them.\n\nThe workflow that I wrote is triggered if a user is in our holding team and they have a meeting booked to send a cancellation and re-booking request."
  },
  {
    "text": "",
    "time_stamp": "2023-11-27 14:32:02"
  },
  {
    "poster": {
      "poster_name": "Sam Bell",
      "poster_handle": "sam.bell"
    },
    "time_stamp": "2023-11-27 14:32:49",
    "text": "Hope this goes a little way to show that it is possible to trigger workflows based on the team the user is in"
  },
  {
    "text": "Did anyone else experience issues running custom code in workflows today around between ~1 to 3pm EST?",
    "time_stamp": "2023-11-27 14:59:30",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-11-27 19:05:19"
      },
      {
        "time_stamp": "2023-11-28 08:33:47"
      },
      {
        "time_stamp": "2023-11-28 09:26:27"
      },
      {
        "time_stamp": "2023-11-28 09:48:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arno Teigseth",
      "poster_handle": "arno.teigseth"
    },
    "time_stamp": "2023-11-27 15:53:17",
    "text": "ah ok nice, thanks!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:05:19",
    "text": "yes. this happened and was confirmed by support. we had a bunch of wonky things happen and records got a bit weird. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:10:43",
    "text": "you can console log items and then when you review the activity logs you can review them\n\nanother way is to create a serverless function to receive requests. in the function you can append lines to a file and update that. you could also use a bunch of different logging packages /vendors and send data there as well"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:13:04",
    "text": "you would reach out to them and ask about how they handle these. if you were building this you would set up proper error handling and possibly keep a log etc. if you aren’t developing this you likely may find more questions then answers"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:15:15",
    "text": "if you were to save the date/time you need to process this in a property you could trigger off that property and then send. \n\nmay take some custom code "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:20:20",
    "text": "i’d recommend setting this up manually in postman and then generating the code and comparing it\n\nalso search api has some limitations on how soon updates show up via the api as well as rate limits are much shorter. \n\nmight be easier to look up people via contact api and using the idProperty setting and setting that to your custom property. \n\napologies, i can read python and could hack a bit away at it but it isn’t something i could debug, especially without your actual call details and error message"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:41:21",
    "text": "workflows will likely fail if you are doing that many at a time. HubSpot doesn’t back them off. if you throw an error properly you will get the response and HubSpot will try again later. \n\ni recommend breaking the calls up into individual custom code blocks and outputting the results to the next custom code action. this will help you prevent errors happening in two different calls and that workflow action being recalled and doing extra work. \n\ni generally output a jason string to a string and then parsing it in the next workflow. \n\nwhen you process this many you should see maybe one or two retries. \n\nthat may get you a bit further in this. \n\nnow, if that doesn’t satisfy your requirements, then i recommend a background serverless function like i use netlify for these personally, but there are plenty of cloud function providers that do this as well. this would allow for api calls to happen as background functions and would allow you to do a queue,or exponential back off in your code requests and not deal with the the limitations of request timeouts in HubSpot. \n\nanother option i have considered is creating some delays in between code actions. assign your random number, delay for some time but branch them on that random number. using the go to action will allow you to minimize duplicative code but it will become a silly looking workflow in the end. \n\n<@U065WUPUG3U> this is inside a custom coded workflow. so each time a record triggers the workflow they get put into this. the loop happens inside HubSpot… technically "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-27 19:42:16",
    "text": "yeah send stuff in the header or create some api credentials. "
  }
]