[
  {
    "poster": {
      "poster_name": "Mauricio Murillo",
      "poster_handle": "mmurillo"
    },
    "time_stamp": "2022-02-23 05:21:46",
    "text": "I'd have to re-watch, but I'm pretty sure that for that demo, they created a custom object \"Cars\" so it would show up under contacts."
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-02-23 07:24:34",
    "text": "Oh right, they put it in the database forgot about that. Thanks Mauricio"
  },
  {
    "text": "I could use some help with something. I have a custom module I built for some pricing cards. On this, I have a boolean field on each card to elect if it is featured or not (all the featured option does is add a class in html to change some colors in css). When I add the module to a page it loads the field defaults normally but when I turn the featured boolean on (on any card). It removes the defaults (just from the dom, not the defaults in the editor) from all the cards in the module and I have to manually enter everything in again.",
    "time_stamp": "2022-02-23 10:16:18",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-02-23 10:44:39"
      },
      {
        "time_stamp": "2022-02-23 10:45:23"
      },
      {
        "time_stamp": "2022-02-23 10:53:02"
      },
      {
        "time_stamp": "2022-02-23 10:56:35"
      },
      {
        "time_stamp": "2022-02-23 16:15:12"
      },
      {
        "time_stamp": "2022-02-23 18:17:48"
      },
      {
        "time_stamp": "2022-02-23 18:21:36"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2022-02-23 10:17:54"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-02-23 10:44:39",
    "text": "This is interesting. I don’t think that this is expected behavior. If you toggle the featured on and then reload the editor does it then display them without the defaults?\n\nHave you been working on the module’s code while it was on the page? Sometimes I notice that with certain modules(im not sure the rhyme or reason) if I edit them while they are on page I have needed to delete the module entirely, refresh the page, and then drag the module in for it to “reset” with expected functionality."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-02-23 10:45:23",
    "text": "Also worth popping open the console while in the editor to see if there are any errors showing up on the HS side when you toggle that boolean. Might help figure out what is going on."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-02-23 10:53:02",
    "text": "Re-loading doesn't help it, Only way I have found to bring them back is to remove the module and re-add. But then if I toggle it again, same thing happens on the new instance. I  see what you mentioned with working in the code quite often. I'll have to remove and re-add the module and then its good to go. Unfortunately this is a different issue.\n\nI have not checked the console on the editor. let me try that."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-02-23 10:56:35",
    "text": "Not seeing any issues there either."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-02-23 12:15:24",
    "text": "Why isn’t HubSpot a choice when importing blog posts from a current blog platform? ._.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-23 12:22:29"
      },
      {
        "time_stamp": "2022-02-23 16:18:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-02-23 12:22:29",
    "text": "It is a bit silly. Ive a method of generating a CSV that ive used a handful of times but it takes a bit of massaging to get it to work correctly depending on all of the fields you are using in the blog.\n\nNot sure if youre already working on a solution but this might speed up the process.\n\n<https://devbeej.com/library/advanced-exporting-HubSpot-blogs/>"
  },
  {
    "poster": {
      "poster_name": "Tyler Toyn",
      "poster_handle": "ttoyn"
    },
    "time_stamp": "2022-02-23 13:17:52",
    "text": "Question. My company uses Pendo for one of our platforms. Pendo will pull data from HubSpot, but I don't know of a way to pull data from Pendo to HubSpot. Does anyone know of a tool or API that will allow HubSpot to pull data from Pendo? Has anyone ever used Pendo?"
  },
  {
    "poster": {
      "poster_name": "Scott Underhill",
      "poster_handle": "underhill.scott"
    },
    "time_stamp": "2022-02-23 14:24:02",
    "text": "<https://developers.pendo.io/docs/?bash#>"
  },
  {
    "poster": {
      "poster_name": "Scott Underhill",
      "poster_handle": "underhill.scott"
    },
    "time_stamp": "2022-02-23 14:24:14",
    "text": "What type of data are you going to push from Pendo to HubSpot"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-23 16:15:12",
    "text": "My best guess would be you previously had a module with the same ID on that page (with different or no default content attached to that module) and once you override one default on that module the page then “remembers” the old modules content and erases the other defaults. \n\nBest way to test this would be to install the module on a new page and see if the behavior persists"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-23 16:18:55",
    "text": "Additionally, HubSpot blog schemes are going to vary from instance to instance, at least that's was historically true. I believe DND areas in blog posts also may be coming on the roadmap (not confirmed, I just think I remember that being discussed) so blog data would get pretty messy again. Basically the issue is that if the source portal and destination portal blog templates don't have the same fields, then you're losing data.\n\nAlso, the web scraper import tool does work with HS sites, so you could do that for simple post bodies, titles, publish dates and the like."
  },
  {
    "poster": {
      "poster_name": "Scott Underhill",
      "poster_handle": "underhill.scott"
    },
    "time_stamp": "2022-02-23 16:25:11",
    "text": "Anyone need to ad product lines in workflows?   I have built a plugin for this, and looking for some feedback"
  },
  {
    "poster": {
      "poster_name": "Scott Underhill",
      "poster_handle": "underhill.scott"
    },
    "time_stamp": "2022-02-23 16:25:32",
    "text": "• Also, create notes in workflows, and association labels in workflows :wink: ",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-24 06:55:14"
      },
      {
        "time_stamp": "2022-02-24 08:53:05"
      },
      {
        "time_stamp": "2022-02-24 14:54:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-02-23 18:17:48",
    "text": "<@U26BLKGE4> I've seen that issue before (real annoying one to debug). That was one of the early steps I tried to debug, unfortunately it didn't work."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-02-23 18:21:36",
    "text": "<@U26BLKGE4> <@UQWGKUEN7> My co-worker and I finally figured out what the issue was here. As I was building the module, I changed some variable names in the design manager. For some reason, through all the changes I made and all the pushes and pulls from the cli, those variable names did not change in the fields.json. (even though they showed the correct variable names in the design manager). So essentially, When  I added the module to the page, it would pull the correct variables but when I flipped that boolean it would try to pull from the old variables instead... :man-facepalming::man-shrugging:"
  }
]