[
  {
    "poster": {
      "poster_name": "Georgiana Costache",
      "poster_handle": "georgiana.costache"
    },
    "time_stamp": "2022-02-25 09:24:22",
    "text": "Hey everyone,  I am hoping to get some tips on how to track buttons with GTM for GA4 events, from HubSpot embedded forms and HubSpot LPs. Any help and input will be massively appreciated"
  },
  {
    "text": "So my entire theme just broke, I'm importing a macros.html file. Its been working fine, but as of today the import no longer works. `{% import \"../../templates/macros.html\" as macros %}`",
    "time_stamp": "2022-02-25 10:30:41",
    "edited": {
      "time_stamp": "2022-02-25 10:30:54"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-02-25 10:48:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2022-02-25 10:48:39",
    "edited": {
      "time_stamp": "2022-02-25 10:49:23"
    },
    "text": "If i change the import to this `{% import \"/sr/templates/macros.html\" as macros %}`\n\nit works... \n\nBut the issue there is the root folder 'sr' may get renamed or be a child theme"
  },
  {
    "poster": {
      "poster_name": "Krittiya Clark",
      "poster_handle": "kclark"
    },
    "time_stamp": "2022-02-25 11:39:19",
    "text": "VSCode extension question, I installed an Auto Close Tag and added an HTMLHubL item in Emmet Included Languages but it still doesn't auto close the tag unless I change from HTML-HubL to HTML on the bottom right on VSCode, any thoughts on this? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2022-02-25 16:47:08",
    "text": "In regards to the Cooking Tracking, if I have a site on both the HubSpot CMS (blog + landing pages) and WordPress (main site) does a user have to accept the cookie consent on both? Or if a user was to accept on a HubSpot page, when you navigate to the WordPress site, will the banner display again?"
  },
  {
    "poster": {
      "poster_name": "Ajith R",
      "poster_handle": "ajith.r"
    },
    "time_stamp": "2022-02-26 00:51:56",
    "text": "Hello All,\nRecently we got notification that, *Action Needed: Update to your app required by February 28 for* granular CRM scopes migration. If I check my application the scopes are already changed to latest crm.xxxxxx. Do we need to change only on code scope with latest or any other changes required in HubSpot App?"
  }
]