[
  {
    "poster": {
      "poster_name": "Amanda Althaus",
      "poster_handle": "aalthaus"
    },
    "time_stamp": "2022-02-18 05:03:43",
    "text": "Do you have Ops Hub Pro? If so, you could create a scheduled workflow. "
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-18 08:49:16",
    "text": "Hi everyone, i try to redirect data from form submition to an endpoint api outside the HubSpot on nodejs ? anyone have an idea, i try to put redirection link of the form to my endpoint but i get no data there",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-18 09:00:46"
      },
      {
        "time_stamp": "2022-02-18 09:03:32"
      },
      {
        "time_stamp": "2022-02-18 09:04:36"
      },
      {
        "time_stamp": "2022-02-18 09:08:08"
      },
      {
        "time_stamp": "2022-02-18 09:17:01"
      },
      {
        "time_stamp": "2022-02-18 09:33:18"
      },
      {
        "time_stamp": "2022-02-18 09:43:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-18 09:00:46",
    "text": "There are a few ways to do this.\nThe easiest is likely using something like Zapier to listen for submissions on a certain form and then forwarding that data to your endpoint.\n\nThe lighter-weight solution would be to use the <https://legacydocs.HubSpot.com/global-form-events|global form event listeners> to get the form data on submission and then POST to your endpoint using AJAX."
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-18 09:03:32",
    "text": "What i need do is to get form data make some changes to them and then redirect user to new page, i don't know if this is possible, my client use a external paiment platform, and i need to create a security key, and i can't do that in javascript on client side, i need something between HubSpot and the paiement solution"
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-18 09:04:36",
    "text": "so when the user will fill up the form and submit i need to redirect him to this middlewhere page make the changes and then redirect him again to the paiement page"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-18 09:08:08",
    "text": "In that case, you’ll need some kind of middleware as you state. That could be something like Zapier, or if the client is on Enterprise you may be able to use Serverless Functions. Otherwise, you can roll-your-own middleware using something like Firebase, Lambda, or Azure serverless functions."
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-18 09:17:01",
    "text": "No, my client don't have the Entreprise Hub, do you have some tuto or something like that for the serverlesse functions ?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-18 09:33:18",
    "text": "Not with HS specifically, but they basically just let you write Node scripts with environment variables for your API keys. I prefer the Firebase developer experience, but they all work similarly.\n\nThis should get you started: <https://firebase.google.com/docs/functions>"
  },
  {
    "poster": {
      "poster_name": "Denis Jankovic",
      "poster_handle": "jankovicdenis.jd"
    },
    "time_stamp": "2022-02-18 09:43:10",
    "text": "Thank you"
  },
  {
    "poster": {
      "poster_name": "Wes Corman",
      "poster_handle": "wes.corman"
    },
    "time_stamp": "2022-02-18 11:30:52",
    "text": "Happy Friday everyone!\n\nFor enabling app links on android, we need to place a json file at this location on our server:\n<https://www.domain.com/.well-known/apple-site-association.json>\n\nI can do this through the HubSpot file manager, but the issue is that we need the file to return with a  `Content-Type:`  header of `application/json` , right now it’s being returned with a `application/octet-stream` Content-type.\n\nHas anyone solved a similar issue before? Thank you! :yellow_heart:"
  },
  {
    "poster": {
      "poster_name": "Adam Stahl",
      "poster_handle": "adam866"
    },
    "time_stamp": "2022-02-18 13:01:19",
    "text": "Hi Amanda - thanks for the response! I haven't quite defined that formula yet which is part of what I was looking to pick folks brain about as well.\n\nThis is me effectively playing in a sandbox for potential use case but some of the variables I'd be looking to use I wasn't finding in those formula options.\n\nAnd that's when it occurred with to me that I could even be logically thinking about the data the wrong way :sweat_smile:\n\nSome of the properties also weren't populating the way I assumed they would (for example Deal Amount was showing Deal Count, not $ or deal value (which Deal Amount said it is)"
  }
]