[
  {
    "poster": {
      "poster_name": "Siew Siew",
      "poster_handle": "siew.siew"
    },
    "time_stamp": "2022-02-14 01:25:47",
    "text": "within same portal"
  },
  {
    "poster": {
      "poster_name": "Christopher Chiha",
      "poster_handle": "christopher051"
    },
    "time_stamp": "2022-02-14 02:22:09",
    "text": "Hello All,\n\nI am currently configuring multiple footers for my comms, footer per country was simple. But regarding creating footer per recipients, i might use some guidance on the best approach.\n\nBasically i want to create footers for promotional comms, transactional comms, partner comms...\nNoting that for transactional footer for example, unsubscribe link is not applicable.\n\nOne more thing regarding footers, if i am planning on adding a link other than the unsubscribe &amp; manage preference links, where is the best place to add it ? in the same GUI footer interface ? As the existing fields are only for location text ideally.\n\nNB: I am using Enterprise\n\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Sam Sharples",
      "poster_handle": "sam.sharples"
    },
    "time_stamp": "2022-02-14 02:53:57",
    "edited": {
      "time_stamp": "2022-02-14 02:57:45"
    },
    "text": "*HubDB Question:*\nWhen I go to add a video file to a HubDB column it brings up the file explorer window and shows the folder structure from File Manager but it DOES NOT show the videos that I have uploaded via File Manager, it only shows videos that I have uploaded via the HubDB upload video window.\n\nHow can I share videos from the File Manager to HubDB?"
  },
  {
    "poster": {
      "poster_name": "Scott Hemmeter",
      "poster_handle": "scott362"
    },
    "time_stamp": "2022-02-14 10:52:16",
    "text": "(new to HubSpot question)... If I create a custom object in HubSpot, am I able to create a reference/association field to that object from a Company or a Ticket? It appears that the answer is No, but I wanted to double check. If the answer is No, can anyone recommend an approach for simulating this as best as possible? Even if it means creating an App to help in the process."
  },
  {
    "poster": {
      "poster_name": "Eric Solari",
      "poster_handle": "eric894"
    },
    "time_stamp": "2022-02-14 14:37:17",
    "text": "Is it possible to update the default HubSpot contact search field to include additional properties? I know I can use the \"additional filters\" to match on other properties but would be nice if we could have HubSpot Id into the default search field."
  },
  {
    "poster": {
      "poster_name": "Raman Amatya",
      "poster_handle": "ramatya"
    },
    "time_stamp": "2022-02-14 21:00:25",
    "text": "Hello guys, how do we know the webhook that is triggered in my node app is from HubSpot ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-02-15 01:28:28"
      }
    ]
  }
]