[
  {
    "poster": {
      "poster_name": "Surinder Singh",
      "poster_handle": "surindersingh"
    },
    "time_stamp": "2022-02-11 01:00:05",
    "text": "<#C22PU4LV8|general> Hello everyone!\nI am developer using HubSpot Tracking code js.\nI have my custom Cookie Consent banner with user can allow/disallow each category cookies to be stored or not.\nBased upon users consent I have want to pass consent levels to HubSpot so that HubSpot stores cookies according to provided consent level instead of loading all categories cookies.\nCan anyone help on on this ? OR suggest specific channel where i can ask for help.\nThanks !",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-14 08:22:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2022-02-11 04:24:57",
    "text": "Hello everyone would just like to ask if anyone has had to manage over 200 workflows. One of the criteria for a job I was asked to consider said they need someone to manage 200 workflows and create more. This isn’t big company so it struck me as very odd. Thoughts?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-02-11 06:57:42"
      },
      {
        "time_stamp": "2022-02-11 10:03:44"
      },
      {
        "time_stamp": "2022-02-11 12:50:15"
      },
      {
        "time_stamp": "2022-02-13 06:39:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2022-02-11 06:57:42",
    "text": "I got about 450 workflows with 250ish on right now.  Do you know what they are doing with workflows? Maybe they break out workflows on an individual basis and not grouped."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-02-11 07:24:03",
    "text": "Hi Chris, can you submit this to the in-app support? They should be able to assist with looking into this."
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2022-02-11 08:55:39",
    "text": "<@U2H3TT8F2>, we did open a Support ticket but they currently have not be able to assist us"
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2022-02-11 10:03:44",
    "text": "I didn’t get that far in our conversation. Thanks for the feedback."
  },
  {
    "poster": {
      "poster_name": "Kyle Grover",
      "poster_handle": "kyle943"
    },
    "time_stamp": "2022-02-11 10:13:41",
    "text": "how can a developer test calling using twilio? it says i \"need a sales hub account\". don't i have one as a dev?"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2022-02-11 11:35:47",
    "text": "<@U2H3TT8F2> so Support and our Tech consult is saying that /hubfs paths are not allowed for redirect pages but what would be a viable solution if we do not want a File that was deleted from File Manager to not 404, and actually get redirected to a webpage, like if it was a Legal PDF and now we have a Legal page to represent that? what would be your solution to solve this issue?"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2022-02-11 12:50:15",
    "text": "Gotcha, depending how they use them could be but I would not see it as a red flag from my end. Marketing workflows, sales, customer service it all can add up."
  }
]