[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 02:06:03",
    "text": "Hi everyone! It would be great if someone could help me understand this. So lets say there is a theme in the marketplace. Someone has built a site with it. What i dont know is: do all updates get treated the same way? Does deleting a module in the marketplace also update the bought instances and delete it for people that have bought that theme? this would mean that pages using said module would loose content based on this, right? Last question: I reckon that settings only get updated and can be used in “future pages” as the existing pages ( and their  existing modules), are “unlinked”. Is that assumption correct?",
    "reply_count": 22,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-03-02 02:15:54"
      },
      {
        "time_stamp": "2021-03-02 02:15:57"
      },
      {
        "time_stamp": "2021-03-02 07:13:49"
      },
      {
        "time_stamp": "2021-03-02 07:53:50"
      },
      {
        "time_stamp": "2021-03-02 07:56:24"
      },
      {
        "time_stamp": "2021-03-02 11:48:12"
      },
      {
        "time_stamp": "2021-03-02 11:49:55"
      },
      {
        "time_stamp": "2021-03-02 11:50:13"
      },
      {
        "time_stamp": "2021-03-02 11:50:25"
      },
      {
        "time_stamp": "2021-03-02 11:50:49"
      },
      {
        "time_stamp": "2021-03-02 11:51:36"
      },
      {
        "time_stamp": "2021-03-02 11:52:52"
      },
      {
        "time_stamp": "2021-03-02 11:53:21"
      },
      {
        "time_stamp": "2021-03-02 11:53:29"
      },
      {
        "time_stamp": "2021-03-02 11:53:47"
      },
      {
        "time_stamp": "2021-03-02 11:54:32"
      },
      {
        "time_stamp": "2021-03-02 11:56:09"
      },
      {
        "time_stamp": "2021-03-02 11:56:12"
      },
      {
        "time_stamp": "2021-03-02 11:58:17"
      },
      {
        "time_stamp": "2021-03-02 12:04:33"
      },
      {
        "time_stamp": "2021-03-02 12:06:39"
      },
      {
        "time_stamp": "2021-03-02 13:23:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-02 02:15:54",
    "text": "As per FAQs on marketplace - “When you update to the latest version of a template or module, a new version of the template or module will be created in your account. This ensures that any customizations that you’ve made to the template or module don’t get overwritten automatically.”"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-02 02:15:57",
    "edited": {
      "time_stamp": "2021-03-02 02:16:01"
    },
    "text": "<https://knowledge.HubSpot.com/resources/marketplace-customers-frequently-asked-questions>"
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-03-02 07:13:49",
    "text": "Hi Andreas - we do not delete any files upon theme updates. What Kieran linked is true for templates, packs, and modules. Themes are a bit different since we deliver them as read only. We do overwrite so upon update if you're using a module and it gets updated, your page will pull in the new version. However, if you are using a module and that module doesn't exist in the new version, we do not delete it from your account"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 07:53:50",
    "text": "Thanks a lot Mitchell!"
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-03-02 07:56:24",
    "text": "We'll get those docs updated to be more accurate. Thanks for spotting them Kieran!"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-02 08:24:55",
    "text": "fields.json question - when you reset the values to the themes default (top level / at a group level / individual field level) does it reinstate the inherited value relationship?"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:48:12",
    "text": "Piggy backing off this, some people clone the theme before they build their site with it. In case they want to make any updates.\n\nDoes this mean they cannot get the theme updates?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:49:55",
    "text": "Hi Bradley, are you referring to updates of some modules?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:50:13",
    "edited": {
      "time_stamp": "2021-03-02 11:50:25"
    },
    "text": "if so, this does not warrant to clone the whole theme, right?"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:50:25",
    "text": "Yeah modules/templates/css/js. any part of it really"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:50:49",
    "text": "well, if it is only one module, i would only clone that"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:51:36",
    "text": "But in many cases they are using modules in multiple places. If fix a bug or add a feature, the only way would be to re add it to all the pages it is used on."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:52:52",
    "text": "not sure if that is correct, but from my understanding the cloned modules would not be updated then"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:53:21",
    "text": "is this correct <@UKHNRHVC7>?"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:53:29",
    "text": "typically people are cloning the whole theme, not just modules"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:53:47",
    "text": "got it"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:54:32",
    "edited": {
      "time_stamp": "2021-03-02 11:54:37"
    },
    "text": "`We purchased the Sprocket Rocket Theme in HubSpot Marketplace and we’ve seen that there were some updates on the original theme.\nWe updated it, but we only see the changes on the Marketplace theme and not on the clone of the theme we did for our website.\nIt would be nice to include a “How to” or “Best practices” article on how to update the clones of the Theme with the updates done on the HubSpot Marketplace, without having to clone it again, make the changes to the theme again and losing our custom code, since we also customized it for us a bit.`\n\nThis is one clients feedback"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 11:56:09",
    "text": "yeah, that is what i expected because the cloned is not linked to the original in any way iirc"
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-03-02 11:56:12",
    "text": "Yes that's correct, we do not update clones, the clone is a sever. That said, we've got a beta just starting now which enables you to both make customizations to marketplace themes (or default HubSpot themes) while still pulling in future updates. It's very early stages right now, but happy to get you enrolled and send over some docs if you're interested in this! (cc: <@ULCSUPTGU>)"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2021-03-02 11:58:17",
    "text": "We're actually already in the beta, It does look promising! I guess we'll just have to wait for that. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-02 12:04:33",
    "edited": {
      "time_stamp": "2021-03-02 12:05:37"
    },
    "text": "So I do think this is something that needs to be clarified on the HubSpot side. When I did some initial research some theme owners mention the first thing you should do is clone the theme. At the moment I imagine to get latest updates you’ll need to pull down both themes and merge them locally using a diff tool and them push them back up - but the risk here is really down to how careful the theme developer is to not make breaking changes/conflicts.\n\nIf there was some merging functionality handled by HubSpot - how would it work with the lack of environments - If a theme developer pushed an update to a modules field.json with a new field and some default content - how would this behave once merged and would it go live right away. I feel there would need to be a way to rollback and make the fact there is an update much more prominent."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-03-02 12:06:39",
    "text": "Very good points <@UQERM7BLY>!"
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-03-02 13:23:42",
    "text": "Yeah that's an excellent point Kieran! Our goal with this child theme beta is to avoid the need to clone the theme entirely, that way no one has to handle diffing/merging/pushing. That said, I think you're making some excellent points about updates and rollbacks with regards to environments. Making sure providers can safely push updates, that they are backwards compatible, and that instantaneous rollbacks are possible if necessary is  definitely something we need to support"
  }
]