[
  {
    "poster": {
      "poster_name": "James Marriott",
      "poster_handle": "james442"
    },
    "time_stamp": "2023-02-09 01:30:51",
    "text": "Seriously? Noooo. I thought I was just being dumb.\n\nNo way to mock this locally? I am used to making web apps in React etc.\n\nSo I have to develop my code locally. Then push to a HubSpot sandbox account.\n\nWait for it compile. Test it out with the ugly interface. Go back to my terminal. Commit. Put in a PR. Tell the reviewer that they have to go through the same painful process so they can check it out. Wait for it be approved so we can merge it to main and it can be used."
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-02-09 01:35:22",
    "text": "Yep I know, main reason why I stopped working locally on HubSpot websites"
  },
  {
    "poster": {
      "poster_name": "James Marriott",
      "poster_handle": "james442"
    },
    "time_stamp": "2023-02-09 02:54:25",
    "text": "Great. We’re paying 2,000 euros a month for this. I know its mainly for marketing and not really aimed at developers but still … grr.\nI wonder if I can persuade marketing to go back to wordpress!!"
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-02-09 03:31:35",
    "text": "They announced a beta at the last developer day (october 2022) where they showed a new cli version where you (theoretically) could preview changes on local before pushing everything to production, but there has not be any news on this topic since then sadly"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-02-09 13:25:01",
    "edited": {
      "time_stamp": "2023-02-09 13:29:57"
    },
    "text": "the cms-dev-server is available as of 8 days ago to install from npm and get running locally, but it is still in private beta so there is no documentation for it: <https://www.npmjs.com/package/@HubSpot/cms-dev-server>\n\nso, this is on the way"
  }
]