[
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-03-07 09:10:00",
    "text": "lol, that'll affect things"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-03-07 09:31:44",
    "text": "Hey all, hope everyone’s having a great week!\n\nI’m currently giving my personal brand an overhaul (as evidenced by that spiffy new profile pic :wink: ) and as a part of that effort I’m going to be producing some developer-focused content that I hope you guys will find useful.\n\nI have a list pulled together of topics I think devs in this community will find interesting, like VueJS + HubSpot, CSS Grid, CodeKit, and Gulp build tools, but I wanted to ask you guys as well if you have any questions or topics you would like to see covered. Maybe there’s a particular API you’d like to see an example of, or a list of Jinja methods that also work in HubL, or just general workflow overviews... I’m pretty much game for anything.\n\nIf you have any topics or tutorials  you would like to see explained in a video or accompanying blog post, drop them in a thread below, I’m super interested in any thoughts you might have. :pray::the_horns:",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-03-07 10:02:21"
      },
      {
        "time_stamp": "2019-03-07 10:53:15"
      },
      {
        "time_stamp": "2019-03-11 17:37:23"
      },
      {
        "time_stamp": "2019-03-11 17:39:42"
      },
      {
        "time_stamp": "2019-03-11 17:40:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-07 10:02:21",
    "edited": {
      "time_stamp": "2019-03-07 10:02:34"
    },
    "text": "Hey Mark, we should chat on this, I too have some stuff I’m working on very much in line with what you’re talking about.\n\nI’ll DM you"
  },
  {
    "poster": {
      "poster_name": "Louie Gerodiaz",
      "poster_handle": "louiegerodiaz"
    },
    "time_stamp": "2019-03-07 10:53:15",
    "text": "That's really interesting to hear! I'm already hyped up with the topics you've already mentioned :exploding_head:"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-03-07 11:48:28",
    "text": "I was working on a solution for a blog where I had the comments expiring on the blog after 5 days. However the issues that I was having was the blog title was still showing after the comments form has been removed. To solve that I wrote a simple if statement that checked to see if the content.publish_date was less than 5"
  },
  {
    "text": "",
    "time_stamp": "2019-03-07 11:48:39"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-03-07 11:48:44",
    "text": "worked really well"
  }
]