[
  {
    "poster": {
      "poster_name": "Pratik Bhatt",
      "poster_handle": "pratik"
    },
    "time_stamp": "2022-08-30 02:54:06",
    "text": "Hi <@U03BS7JAHFU>,\nI have a team of Landing page specialists in Pardot, Marketo, Unbounce, HubSpot, Maichimp, and many more.\nLet's connect and discuss."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2022-08-30 19:21:30",
    "text": "We’re looking to fill an exciting new role that will help us scale further at Impulse Creative \n\n:small_orange_diamond::small_orange_diamond::small_orange_diamond:Director of Development  (US Based remote position):small_orange_diamond::small_orange_diamond::small_orange_diamond:\n\nWant to lead a team that pushes the boundaries of what’s possible on HubSpot?\n\nImpulse Creative is known as “the team that can build it on HubSpot even when HubSpot says it can’t be done”. \nOur team is looking for a Director of Development to lead our technical team of 9 full-time developers and implementation specialists. In this role, you’ll be responsible for mentoring, scaling, and leading the team to keep up with the agency’s growth. We’ll also give you some time to work on your craft and contribute to client and internal projects. \nFrom building amazing websites to taking on projects that extend the HubSpot CRM to custom CMS portals (and more!), we want this new hire to think big and push the boundaries of HubSpot. \n\n&gt;&gt; You’re an ideal candidate if you… \n:orange_heart: Are well-versed in the HubSpot Platform - both the CMS and the CRM\n:orange_heart: Have notable experience building on HubSpot \n:orange_heart: Can serve as a translator between “development world,” “marketing world,” and “client world” \n:orange_heart: Love leading and managing teams in a way that makes everyone successful–and have experience doing just that.  \n\n\n<https://impulsecreative.bamboohr.com/jobs/view.php?id=34|https://impulsecreative.bamboohr.com/jobs/view.php?id=34>"
  }
]