[
  {
    "text": "Hello!\nI have a rich text module in a custom theme template, however in the published page appears the characters \"\\n\" after closing any html tag. another additional fact is that in the drag &amp; drop editor view does not appear this character. is it possible to remove or fix this problem? (see screenshot)",
    "time_stamp": "2023-01-10 11:26:29",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-01-10 12:15:19"
      },
      {
        "time_stamp": "2023-01-10 12:46:50"
      },
      {
        "time_stamp": "2023-01-10 12:48:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-01-10 12:15:19",
    "text": "I’ve done some testing, and think I have an idea of what might be going on here. I can replicate this exact behavior by adding `\\n` to the source of a rich text module. However, I can’t get the `\\n` sequence to appear without inputting it directly.\n\nThe confusion here seems to come from the inconsistent output between the page editor and the final page generator. The page editor is using the HubL behavior, where those escape sequences are meaningful. The final rendered page is using the HTML behavior, where those sequences have no special significance.\n\nSome questions for you to help narrow this down:\n1. Is this text being copied and pasted from another formatted source? A Word doc, Google Doc or Wordpress post, for example.\n2. The `\\n` sequences don’t appear in the editor view, but do they appear if you view the rich text markup using the rich text module’“s Advanced &gt; View Source” functionality?\nMy guess is that you’re bringing in formatting from another source which uses escape sequences like `\\n`. You should be able to remove them using the “View Source” menu, and avoid carrying them over in the future by using the “Paste Without Formatting” function when pasting text."
  },
  {
    "poster": {
      "poster_name": "Eliu Pat Ojeda",
      "poster_handle": "eliu594"
    },
    "time_stamp": "2023-01-10 12:46:50",
    "text": "Thanks Evelyn. 1.- No, the this was formated with rich text editor. 2.- No."
  },
  {
    "poster": {
      "poster_name": "Eliu Pat Ojeda",
      "poster_handle": "eliu594"
    },
    "time_stamp": "2023-01-10 12:48:44",
    "text": "Even when I generate a preview or staging page, the characters do not appear. It only happens on the live page"
  }
]