[
  {
    "poster": {
      "poster_name": "Marc Gandillon",
      "poster_handle": "marc.gandillon"
    },
    "time_stamp": "2021-01-28 10:02:29",
    "text": "Hello Everyone. I’m trying to build a serverless function that gather data into my ERP to display it in a membership webpage. To query my ERP I need to first identify myself using OAuth2 because there is no key based authentication. Has anyone implemented such an OAuth2 authentication in a serverless function prior to querying a webhook?"
  },
  {
    "poster": {
      "poster_name": "Matthew Scheppmann",
      "poster_handle": "matthew360"
    },
    "time_stamp": "2021-01-28 17:08:36",
    "text": "I am thinking around a project for a HubSpot membership portal I am building, wanted to see if anyone had insight on my idea as it touches on some different areas...\n\n*Pre-reqs.*\n• syncronized media files out of WordPress, to HubSpot files.  Mimicking WordPress media tables into HubDB for things like the image ID (from wordpress).\n*Goal*\nIf our HubSpot CMS membership users are logged in via hscookie and navigating our *WordPress* website for the business, then allow users to hover over specific images and \"Like\" them.  Perhaps a heart icon they can click on.\n\nI think that by getting the WP media library/meta added into HubSpot and constantly sync'd... it should be possible?  I am pretty sure that with the HubSpot WP plugin, I would have access to check against the users logged in state, right?  I would then imagine building out a WP plugin that will validate the cookie, enable the 'like' feature over WP images with JS if they validate, then user 'likes' photo, wordpress responds with an image ID, which then fires to a serverless function.  But then the part I get lost at... associating those media files (or IDs from WP) to the contact specifically, and displaying them as private content in the CMS Portal at HubSpot I am building.   I know how to access everything under the sun as far as the contact's record properties... but making the association is a bit fuzzy to me.  Any guidance on the best way to associate media files with a contact record for this purpose?  Appreciate it!!!"
  }
]