[
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2020-05-14 13:10:14",
    "text": "My asset panel keeps closing itself, and it's incredibly annoying. Is this happening to anyone else?"
  },
  {
    "poster": {
      "poster_name": "Lindsey Newman",
      "poster_handle": "lindseyn"
    },
    "time_stamp": "2020-05-14 14:39:59",
    "text": "Is there no way to wrap text in the design manager code editor?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-15 06:45:57"
      },
      {
        "time_stamp": "2020-05-15 07:08:27"
      },
      {
        "time_stamp": "2020-05-15 08:28:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Renessa Ciampa",
      "poster_handle": "renessa"
    },
    "time_stamp": "2020-05-14 15:41:55",
    "text": "Hi <@U013GG8K612>, thank you for the information! What I was trying to achieve is a paragraph style that is built into content blocks for client-side staff to use in emails so that they don't have to fuss with the font styles in the email editor's WYSIWYG, and so that the font styles will always be consistent. I wonder if I can make a custom module and then place that into a drag &amp; drop email? (they would then duplicate that drag &amp; drop email template each time)"
  },
  {
    "poster": {
      "poster_name": "Tirso Robles",
      "poster_handle": "isctirso"
    },
    "time_stamp": "2020-05-14 15:43:30",
    "text": "<@UMH22MWD8> yes, you can do a custom module and see over there i send you an image with one custom module example"
  },
  {
    "poster": {
      "poster_name": "Renessa Ciampa",
      "poster_handle": "renessa"
    },
    "time_stamp": "2020-05-14 15:43:58",
    "text": "<@U013GG8K612> That is so helpful! Thank you!"
  },
  {
    "poster": {
      "poster_name": "Tirso Robles",
      "poster_handle": "isctirso"
    },
    "time_stamp": "2020-05-14 15:45:53",
    "text": "If you dont see the modules, talk with support because i have that problem but when i talk with they only activate the custom block visible or something, its because the drag and drop keep in beta mode and have a little things weard and not work well <@UMH22MWD8>"
  },
  {
    "text": "is strange because i dont see the custom modules again, just talk with support please <@UMH22MWD8>",
    "time_stamp": "2020-05-14 15:50:59"
  },
  {
    "text": "",
    "time_stamp": "2020-05-14 15:51:19"
  },
  {
    "text": "the custom module name is the same to the first image i send",
    "time_stamp": "2020-05-14 15:53:32"
  },
  {
    "poster": {
      "poster_name": "Tirso Robles",
      "poster_handle": "isctirso"
    },
    "time_stamp": "2020-05-14 15:55:38",
    "text": "this is a email recomendation you can translate plese in google traductor or something?? <@UMH22MWD8>\n\nSi sigues sin poder observar los módulos dentro del correo, este tipo de problemas suceden a menudo cuando se utiliza el mismo navegador por varios días seguidos para acceder a HubSpot, cuando no cierras la sesión seguido, o por la historia de búsqueda, cookies y cache en tu navegador. Te recomiendo tomar las siguientes acciones para evitar este tipo de situación:\n1- Limpiar tu historial de búsqueda, caché y cookies como se instruye <https://support.google.com/accounts/answer/32050?visit_id=637124382356811375-1691625227&amp;rd=1&amp;hl=es|aquí>.\n2- Cerrar tu sesión en HubSpot y reiniciarla periódicamente.\n3- Abrir tu cuenta en modo <https://support.google.com/chrome/answer/95464?|incógnito >en Chrome, o en modo <https://support.mozilla.org/es/kb/navegacion-privada-Firefox-no-guardar-historial-navegacion#w_how-do-i-open-a-new-private-window|Privado >en Firefox para confirmar que el problema no ocurre en estos modos de navegación.\n4- Evitar usar el mismo navegador por muchos días, trata de usar una nueva ventana de navegación diario o tan frecuentemente como te sea posible.\nTomar estas medidas prevendrá inconsistencias sobre cambios o búsquedas de información hechos en tu cuenta. Por favor procede a tomar estas medidas e intenta de nuevo.\nEspero que esta información te sea útil, pero déjame saber si tienes dudas al respecto."
  },
  {
    "poster": {
      "poster_name": "Renessa Ciampa",
      "poster_handle": "renessa"
    },
    "time_stamp": "2020-05-14 15:58:02",
    "text": "<@U013GG8K612> Ah thank you, I will try that or call support!\n\nHere is the translation I got, for anyone else who would like to see it in English!\n\n_If you still cannot see the modules in the mail, these types of problems often happen when you use the same browser for several days in a row to access HubSpot, when you do not log out often, or because of the history of search, cookies and cache in your browser. I recommend you take the following actions to avoid this type of situation:_\n_1- Clear your search history, cache and cookies as instructed here._\n_2- Close your session in HubSpot and restart it periodically._\n_3- Open your account in incognito mode in Chrome, or in Private mode in Firefox to confirm that the problem does not occur in these browsing modes._\n_4- Avoid using the same browser for many days, try to use a new browser window daily or as often as possible._\n_Taking these measures will prevent inconsistencies about changes or searches for information made in your account. Please proceed to take these steps and try again._\n_I hope this information is useful to you, but let me know if you have any questions._"
  },
  {
    "poster": {
      "poster_name": "Muskaan",
      "poster_handle": "muskaantayal"
    },
    "time_stamp": "2020-05-14 23:25:49",
    "edited": {
      "time_stamp": "2020-05-14 23:33:53"
    },
    "text": "hello everyone....i am facing some issues in HubSpot...all the saved folders and files from my account are missing.. i had a chat with them and they confirmed that no file has been deleted in the past 30 days...no idea whats the problem..can anyone help me?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-15 07:53:28"
      }
    ]
  }
]