[
  {
    "text": "It’s odd it doesn’t work with a rich text field, i’ve set this up in the past, I create add to calendar links and add them to a rich text field with the api,\n\nWe then email these out to people, (I’ve built a bespoke booking system)",
    "time_stamp": "2024-06-17 02:31:46",
    "edited": {
      "time_stamp": "2024-06-17 02:31:58"
    }
  },
  {
    "text": "Hi Matt, I really appreciate your time and thanks for reaching out. It should work for me too. My conclusion is that I'm doing something fundamentally wrong. For example, when I edit rich text field. I can only see HTML code. How did you add buttons to rich-text field?\nFor now, I'm editing properties in the portal (for testing) so there might some string manipulation happening in the UI?",
    "time_stamp": "2024-06-17 02:54:16"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-06-17 03:01:51",
    "text": "I’m doing it through an API,\nbut in the json it’s basically:\n```{\"properties\": \n  {\n    \"calendar_links\":\"&lt;a href='...'&gt;Button&lt;/a&gt;\"\n  }\n}```\nShould be able to add whatever html you like, I actually add mine in a table to appease the email gods :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Jiří Spilka",
      "poster_handle": "jiri.spilka"
    },
    "time_stamp": "2024-06-17 08:29:41",
    "text": "<@UDJV5B73R>, I finally got it working! The fundamental mistake I was making was trying to edit the rich text property in the portal. When you do that, the HTML gets surrounded by `&lt;p&gt;` tags and is escaped, making it impossible to unescape. Thanks for the hint about the API call. Once I implemented that, it started to work. The only issue I had to solve was that the rich text field cannot be included in the form, so I’m now copying the multi-line field into the rich text field using a workflow.\n\nThank you very much for your help. I really appreciate it. I would love to reward you somehow. Can I buy you a coffee or a drink? Or are you going to Prague any time soon? :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-06-17 08:54:09",
    "text": "Glad you got it working!\nNo immediate plans but i’ll let you know if i’m heading over that way!"
  },
  {
    "poster": {
      "poster_name": "Jiří Spilka",
      "poster_handle": "jiri.spilka"
    },
    "time_stamp": "2024-06-18 00:24:46",
    "text": "Please let me know. I would be happy to meet you!"
  }
]