[
  {
    "poster": {
      "poster_name": "Vitalii Sili",
      "poster_handle": "v.sili"
    },
    "time_stamp": "2024-06-18 01:20:02",
    "text": "There was a problem with module is not rendering on the page correctly, I found some code on GitHub and implement it, the funny fact was my code was absolutely the same just name of the fields change. In the end, I solve it thanks for asking, I appreciate that."
  },
  {
    "poster": {
      "poster_name": "Prachi Khandekar",
      "poster_handle": "prachi.khandekar"
    },
    "time_stamp": "2024-06-18 15:42:52",
    "text": "Hi there, we are attempting to set up our custom Email Subscription Preferences Page HTML + HUBL template, that just requires the `contact.email` personalized token to be populated. However, the `contact.email` personalized token is showing up as `NULL` for the contact, even though we're using a contact who has an email on HubSpot. For reference, the way we are testing this HTML+ HUBL template is by setting up an email linked our template, and sending a test email with the \"Review email previewing\" field set to a contact that does have an email. Could someone advise us on how to get this `contact.email` personalized token to not be empty in our custom Email Subscription Preferences Page HTML + HUBL template?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-18 15:45:06"
      },
      {
        "time_stamp": "2024-07-04 18:24:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Prachi Khandekar",
      "poster_handle": "prachi.khandekar"
    },
    "time_stamp": "2024-06-18 15:45:06",
    "text": "I also printed out the entire contact personalized token via `{{contact|pprint}}`, and the output of the print statement was `{firstname=there, HubSpot_owner_id=516244132}`. Neither of these fields correspond to the contact that I sent the test email as, so I'm not sure where these contact fields are coming from. Are we not allowed to use the contact personalized token within custom Email Subscription Preferences Page HTML + HUBL templates?"
  }
]