[
  {
    "poster": {
      "poster_name": "amylaun",
      "poster_handle": "amylaun"
    },
    "time_stamp": "2020-08-04 11:39:11",
    "text": "<@U01859UDGSX> <@U26BLKGE4> Thank you for the response! So in that case (lists+smart modules) would we need to have separate emails set up, and then segment conditionally in lists? Or are smart modules able to be conditionally shown/hidden based on lists within one email template? Hoping for the latter :crossed_fingers: that would definitely be helpful!"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-08-04 11:47:07",
    "text": "Unfortunately the former. You could use smart content in rich text modules where one condition is blank, but the table markup/spacing will still show :confused:"
  },
  {
    "poster": {
      "poster_name": "amylaun",
      "poster_handle": "amylaun"
    },
    "time_stamp": "2020-08-04 11:50:43",
    "text": "Boo - okay thanks so much! I am going to explore it today to see if that will work for us (I think it will have to :wink:)"
  },
  {
    "poster": {
      "poster_name": "Marian Ladenburg",
      "poster_handle": "marian110"
    },
    "time_stamp": "2020-08-05 00:03:45",
    "edited": {
      "time_stamp": "2020-08-05 00:05:08"
    },
    "text": "Hi all :raising_hand::skin-tone-2:,\n\nI have a deep and painful history with creating RSS emails. My current issue is also an old one. Here is the template I'm working with:\n<http://poppinpay-3404911.hs-sites.com/?hs_preview=UNMjsqPl-33258371322>\n\nImmediate questions:\n1. how do I get rid of the \"the post [title] appeared first on...?\" I'm including the source code for anyone capable of helping me limit characters or whatever I need to do to get weird of that thing which must be a part of the post summary.\n2. The blog is a WP site, so am I correct in assuming we still haven't implemented functionality of autopulling the featured image from externals blogs (i.e. like on HubSpot?)\n3. I'd like to create a kick-booty RSS email template, let me know if you are interested and we can team up and put it on the marketplace.\nOther questions:\n1. Where did the <https://community.HubSpot.com/t5/CMS-Development/RSS-Email-Help/td-p/4875|RSS listing> module go? I'm getting a 404 when I go to the linked listing in this community post. Which is a bummer because that's me at the bottom saying thanks so much years ago and using the information.\n2. I see many other developers have work-arounds that haven't been shared. Please share!\n<@U2H3TT8F2>, <@U24DCSJBE>",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-08-05 09:12:39"
      },
      {
        "time_stamp": "2020-08-05 10:51:16"
      },
      {
        "time_stamp": "2020-08-06 13:38:30"
      },
      {
        "time_stamp": "2021-09-07 20:29:48"
      },
      {
        "time_stamp": "2021-09-08 07:15:11"
      }
    ]
  }
]