[
  {
    "poster": {
      "poster_name": "Andy Law",
      "poster_handle": "andy270"
    },
    "time_stamp": "2022-06-27 03:41:59",
    "text": "Hi all, I’m looking into setting up API calls to HubSpot for an existing web app. I’m falling at the first hurdle though with authentication.\n\nAll I’d like to do is to write <https://developers.HubSpot.com/docs/api/crm/timeline|timeline events> to a client so we can see when our customers have logged in and carried out some specific user events. It seems like the easiest way to do this would be to use an API key, but that is being deprecated in November in favour of private apps. Unfortunately it looks like private apps don’t support timeline events at the moment so this isn’t an option. But does anyone happen to know if timeline events will be supported by this method by the time API keys are deprecated, as a public app also don’t seem like a feasible solution for my use case at the moment"
  },
  {
    "poster": {
      "poster_name": "Abdullah Ba Abbad",
      "poster_handle": "baabbad"
    },
    "time_stamp": "2022-06-27 03:45:50",
    "edited": {
      "time_stamp": "2022-06-27 03:46:36"
    },
    "text": "Hello guys, I want the property of total discount in the quote api, I am not able to find the name. can anyone help?"
  },
  {
    "poster": {
      "poster_name": "Wiktoria Rebacz",
      "poster_handle": "wiktoria"
    },
    "time_stamp": "2022-06-27 04:41:22",
    "text": "Hi all! I know it’s possible to manually exclude certain email addresses from receiving some email notifications. I wonder - is it possible to do it via API or only <https://knowledge.HubSpot.com/email/how-do-i-create-an-email-suppression-list#:~:text=In%20your%20HubSpot%20account%2C%20navigate,lists%20and%2For%20individual%20contacts.|manually>?"
  },
  {
    "poster": {
      "poster_name": "Abdullah Ba Abbad",
      "poster_handle": "baabbad"
    },
    "time_stamp": "2022-06-27 04:45:26",
    "text": "Is discount api working currently?"
  },
  {
    "text": "Hi Marco,\n\nYou can use this <https://developers.HubSpot.com/docs/api/crm/tasks> API to create engagement for task on HubSpot and then in the response you will get a engagement ID and you can use that ID to associate it with the contact or any other object, please refer the screenshot",
    "time_stamp": "2022-06-27 14:09:41"
  },
  {
    "poster": {
      "poster_name": "Durga Shankar",
      "poster_handle": "durgashankar000"
    },
    "time_stamp": "2022-06-27 23:41:29",
    "text": "Hi guys, In the search API is there a way to compare two properties ?. like the date is greater than start_date and less than end_date.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-06-28 03:58:05"
      }
    ]
  }
]