[
  {
    "text": "Hi, I have a quick question. I am trying to modify my card so that clicking a button will execute an action, but not necessarily open an IFRAME. I gues i must change the type, but I couldn't find any doc showing the different options for type. Any Ideas?",
    "time_stamp": "2022-06-10 02:51:27",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-06-10 16:21:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kamal Hami-Eddine",
      "poster_handle": "kamal.hami-eddine"
    },
    "time_stamp": "2022-06-10 02:57:07",
    "text": "Hi everyone, new to this slack :slightly_smiling_face:\nI have a first question. We regularly import companies to HubSpot, and we struggle a bit with deduplication. So we want to create a quick import script, that would check if a company with similar domain name already exists. However domains are not necessarily all formatted the same way in HubSpot.\nSo we would like to search via API something like &lt;domain&gt; contains \"string\", in order to retrieve companies without having to exactly know the url stored in HubSpot. As some may contain, www., some not etc.\n\nIs there an operator in the API that does that? I saw the \"CONTAINS_TOKEN\" operator on company/search endpoint but it is unclear what token means here."
  },
  {
    "poster": {
      "poster_name": "Jeff Severns Guntzel",
      "poster_handle": "jeff347"
    },
    "time_stamp": "2022-06-10 08:02:00",
    "text": "Hi folks. I've been a lurker here for some time and I am so grateful. I have a rather urgent question. I have been using a cURL call with filtering in the body to monitor a specific custom property. What I want to do now is see a list of all the values entered by clients. I do not need the values to be associated with clients. I just need to see the list. I know this is only in the neighborhood, but what I've been using to come at the data less directly is this:"
  },
  {
    "poster": {
      "poster_name": "Jeff Severns Guntzel",
      "poster_handle": "jeff347"
    },
    "time_stamp": "2022-06-10 08:02:06",
    "text": "```curl --request POST \\\n  --url '<https://api.hubapi.com/crm/v3/objects/contacts/search?hapikey={}>' \\\n  --header 'content-type: application/json' \\\n  --data '{\n  \"filterGroups\": [\n    {\n      \"filters\": [\n        {\n          \"groupName\": \"CUSTOM_GROUP\",\n          \"value\": \"CUSTOM_VALUE\",\n          \"propertyName\": \"CUSTOM_PROPERTY\",\n          \"operator\": \"EQ\"\n        }\n      ]\n    }\n  ]\n}'```"
  },
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2022-06-10 09:42:04",
    "text": "I have a custom object with some file upload properties. Getting the custom object via api only returns the signed url of the image in the property. Is there an easy way to get the id of the image along with the url?"
  },
  {
    "poster": {
      "poster_name": "Jason Kiesling",
      "poster_handle": "jason249"
    },
    "time_stamp": "2022-06-10 16:21:54",
    "text": "The docs on this leave a lot to be desired. I found <https://m.youtube.com/watch?v=KP6H4QiBbFs&amp;feature=youtu.be|https://m.youtube.com/watch?v=KP6H4QiBbFs&amp;feature=youtu.be> to be helpful."
  }
]