[
  {
    "text": "Here is the results of the Response. As you can see I am getting a \"Forbidden\", can't see any timeout errors or anything like that",
    "time_stamp": "2022-06-01 01:49:16"
  },
  {
    "poster": {
      "poster_name": "Erno Pyykko",
      "poster_handle": "epyykko"
    },
    "time_stamp": "2022-06-01 03:23:41",
    "text": "Hello folks, has anyone worked on solutions to keep track of unsubscribes? If so, I've got a tricky challenge I've been able to crack by Googling and asking people in our org. I'd like to know which contacts in our HubSpot instance have unsubscribed using the native Gmail unsubscribe link.\n\nHow does HubSpot receive that request from Gmail and how can I see for which email address it was sent?"
  },
  {
    "poster": {
      "poster_name": "Sarah Tavares",
      "poster_handle": "sarah.tavares"
    },
    "time_stamp": "2022-06-01 05:23:22",
    "text": "Good morning, I would like to know why the behavioral event property filter does not work on active lists. Create a create_account behavioral event and a behavioral event property called Event Date (of type date picker). Send the event with the property via API as you can see the attached images. After that, I wanted to create an active list with contacts who received the event after certain data (behavioral event property). However the list does not bring results. Can you help me please?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-06-01 05:58:25",
    "text": "Good morning does anyone know if there’s a way to access contact timeline data via api’s\n\nI’m using the Eventbrite integration, but it doesn’t store any data other than last registered name and date in contact properties, I want to create a custom object with the event name when they register and be able to associate multiple contacts to the custom object if multiple people register for the event. The event that does get created in HubSpot is very limited in the information it gives and that we’re able to report on, we can’t create lists for each event because there would be too many events.\n\nI think if I could use a workflow to run when someone is registered and then run a webhook which can get this info out of the timeline I could create custom event objects using the information."
  },
  {
    "text": "I feel like the Marketing Events Object is way too limited if it behaved more like a proper object it would be so useful, Contacts could be associated with them I would be able to use api’s to access the data but at the moment Marketing Event Objects just tell you how many have booked on with out telling you who has or what companies etc",
    "time_stamp": "2022-06-01 06:02:53"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-06-01 07:38:47",
    "text": "i can’t find the docs for the endpoint you’re trying to use. Where do you see that information? I wonder if it’s a legacy endpoint that is no longer supported?"
  },
  {
    "poster": {
      "poster_name": "Anthony Banks",
      "poster_handle": "anthony.banks"
    },
    "time_stamp": "2022-06-01 08:00:36",
    "text": "Has anyone gotten any issues calling <https://forms.HubSpot.com/uploads/form/v2/> API endpoint? I'm getting a StatusCode of PaymentRequired but I'm unsure on how to rectify it."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-06-01 08:04:39",
    "text": "The Postman import for Notes api is broken:"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-06-01 08:04:40",
    "text": "<https://developers.HubSpot.com/docs/api/crm/notes>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-06-01 15:13:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-06-01 08:04:50",
    "text": "It's imports the contact collection"
  },
  {
    "poster": {
      "poster_name": "Matt Swanson",
      "poster_handle": "matt353"
    },
    "time_stamp": "2022-06-01 09:20:44",
    "text": "Anyone else seeing an increase in 502 Bad Gateway errors this morning on API calls?"
  },
  {
    "poster": {
      "poster_name": "Jessi Style",
      "poster_handle": "jessi.style"
    },
    "time_stamp": "2022-06-01 11:26:27",
    "text": "Hi! is it safe to assume the `discarded` section in the `POST /contacts/v1/lists/:list_id/add` response would include all emails/ids &gt;500"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-06-01 15:13:32",
    "text": "thanks for the callout!"
  },
  {
    "poster": {
      "poster_name": "Abdullah Ba Abbad",
      "poster_handle": "baabbad"
    },
    "time_stamp": "2022-06-02 00:43:28",
    "text": "Hello!\nThis is Abdullah, I am new to HubSpot and I have a task to integrate it with the company I am working in.\nI have a question here: I have created a new custom field in Deals but unfortunately it doesn't get rendered in the response. Can you help me in this?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-02 06:30:05"
      },
      {
        "time_stamp": "2022-06-02 07:02:41"
      }
    ]
  }
]