[
  {
    "poster": {
      "poster_name": "Mauricio Voto",
      "poster_handle": "mauricio836"
    },
    "time_stamp": "2025-02-06 12:35:43",
    "text": "Hello everyone! I am looking for some advice. This is my situation: I have built an OAuth/Public App as I need the app credentials and also the custom timeline event templates functionality.\nHowever, we offer this app/integration to only certain customers who are on specific pricing plans. Meaning that we don't want the app to be listed/published in HubSpot.\nI've just found out that it's possible to get the app listed, but with the \"Contact Us\" type of plan. That would be ideal if this prevents people from installing the app, is this the right approach in this case?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-02-06 12:36:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mauricio Voto",
      "poster_handle": "mauricio836"
    },
    "time_stamp": "2025-02-06 12:36:07",
    "text": "And also, wanted to check how long does it usually take for HubSpot to review an app listing."
  },
  {
    "poster": {
      "poster_name": "Pete Nicholls (HubDo)",
      "poster_handle": "pete970"
    },
    "time_stamp": "2025-02-06 12:38:46",
    "text": "Hi Mauricio, why list it at all? You could keep it unlisted and just share the install link with your customers when required. You could also set your install process to prevent the app running unless the portal ID is preapproved ",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-06 12:53:16"
      },
      {
        "time_stamp": "2025-02-06 16:03:21"
      },
      {
        "time_stamp": "2025-02-06 16:12:08"
      }
    ]
  },
  {
    "text": "Hey <@U037QED9TR6> thanks for the quick reply. We do have an interface for the installation and for customers to connect their HS account. However, this message is bad for the credibility of the app/integration we are building.\n&gt; You could also set your install process to prevent the app running unless the portal ID is preapproved\nI am not sure if I followed or if it's even possible in our scenario.",
    "time_stamp": "2025-02-06 12:53:16"
  },
  {
    "poster": {
      "poster_name": "Pete Nicholls (HubDo)",
      "poster_handle": "pete970"
    },
    "time_stamp": "2025-02-06 16:03:21",
    "text": "Customers will still see that warning until the app is certified. But that requires 60 active installs and six months of being listed, then passing certification checks.\nThere are many public apps not listed on the marketplace. \nIf your app can’t be controlled/limited per portal then it would be worth considering adding those controls. \nBecause once your app install link is public, you cannot force an uninstall."
  },
  {
    "poster": {
      "poster_name": "Mauricio Voto",
      "poster_handle": "mauricio836"
    },
    "time_stamp": "2025-02-06 16:12:08",
    "text": "&gt; Customers will still see that warning until the app is certified. But that requires 60 active installs and six months of being listed, then passing certification checks.\nHmm, so even if we start the listing process, it will take some time for that banner message to disappear :thinking:\nWe basically have the app in place for the sake of building an integration with our platform and HubSpot. That's why we need the Auth portion in place/configured and the same as the Timeline Event Templates.\nWe offer the HubSpot integration with a 3rd party provider, which requires this app information, and the connection is configured within this provider as well."
  }
]