[
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2024-10-10 02:41:35",
    "text": "I think it will alwasy associate them together. Not sure about custom objects though."
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-10-10 03:07:43",
    "text": "<@U07ND86URS6> We use this kind of logic on a form.\n\nYou can deduplicate contacts based on emails and then add a new associated object to this contact.\n\nWe use it with Custom objects. So if contact email is known -&gt; the contact just gets the associated with the new object.\n\nYou just have to be careful with custom objects bc you also need the Name of the object filled or the custom object will not be created. (the form still goes through)"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-10-10 03:09:21",
    "text": "<@U02ST0J24UD> you can also probably use the formula base on the custom report builder itself to add it there\n\nthat way you dont have to create a new property/code it"
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-10-10 07:23:55",
    "text": "If you need help let us know!"
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2024-10-10 12:55:40",
    "text": "Thank you both!! "
  },
  {
    "poster": {
      "poster_name": "Joshua Hughes",
      "poster_handle": "josh799"
    },
    "time_stamp": "2024-10-10 18:42:02",
    "text": "Hello All! I am new to this channel but I am hoping maybe someone can get me started with a custom code workflow to assign property values. The concept is simple, but HubSpot is pretty rigid in this regard. I need an easy way to track and trigger based off customer spending, primarily 30, 60, and 90 days.\n\n I want to build a workflow that rolls up all customer closed deals during a 30 day period and assigns them to a property called \"30 day spending\" and the same for 60 and 90. Only customers in a list will be enrolled in this workflow.\n\nAnyone that could get me started on this? Thanks a lot in advance!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-10 21:11:34"
      },
      {
        "time_stamp": "2024-10-10 21:12:07"
      },
      {
        "time_stamp": "2024-10-11 10:45:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-10-10 21:11:34",
    "text": "Hi Josh, I am happy to help you. I think the best way to start is to write down the “algorithm” you plan to employ, work out the triggers, and make the custom properties you are referencing."
  },
  {
    "poster": {
      "poster_name": "Bill Barlas",
      "poster_handle": "bbarlas"
    },
    "time_stamp": "2024-10-10 21:12:07",
    "text": "From there we can work out together the proper code to accomodate your goal!"
  }
]