[
  {
    "text": "Hi! Is it possible to read External Object IDs that Data Sync integrations uses? For example the contact's or company's Salesforce ID or Odoo ID? I can't find that information from the list of properties and still HubSpot shows it under the sync settings.\n\nPS. There is no specific channel for data sync, so I ask here. Let me know if there is a better place to ask.",
    "time_stamp": "2024-10-16 04:42:13",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-16 04:44:55"
      },
      {
        "time_stamp": "2024-10-16 10:17:40"
      },
      {
        "time_stamp": "2024-10-17 02:33:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2024-10-16 04:44:55",
    "text": "I have discussed this with HubSpot support, but they repeatedly confuse this particular ID with custom properties. And I can't get any further."
  },
  {
    "poster": {
      "poster_name": "Sierra Howard",
      "poster_handle": "showard"
    },
    "time_stamp": "2024-10-16 08:27:51",
    "text": "Hey everyone :5065-hello:,\n\nI wanted to send one last call to provide feedback on your experience with the <https://developers.HubSpot.com/docs/api/automation/custom-workflow-actions|custom workflow action API> and any other wishlist items you have to build, customize, and manage automation for your apps in the <https://docs.google.com/forms/d/e/1FAIpQLSegfw484-sfPWfRPy5Msn0jvy5cx4-ZH60O0l0XpdtyJaE9Gw/viewform|form here>.\n\nI've gotten some great feedback and have had a few calls so far based on some of the feedback. Just want to ensure I continue to hear your requests!"
  },
  {
    "poster": {
      "poster_name": "Frans Leys",
      "poster_handle": "fleys"
    },
    "time_stamp": "2024-10-16 10:17:40",
    "edited": {
      "time_stamp": "2024-10-16 10:18:03"
    },
    "text": "hi - data sync PM here.\nit's my dream to some day expose the values of what you're showing in that screenshot in an API. :slightly_smiling_face:\n\nbut I can already announce those ID's will be available in data sync's field mapping this quarter - the code is going through QA right now.\n\nit's been particularly tricky to reliably expose those in a sync."
  },
  {
    "poster": {
      "poster_name": "Ed Smith",
      "poster_handle": "esmith"
    },
    "time_stamp": "2024-10-16 16:58:51",
    "text": "Hi Everyone! We're working on a workflow that calls a webhook and having trouble getting it over to our internal api endpoint: <htttps://dev-api.gohfd.com/integ/v0/sdc-settlement>\n\nI recognize it can be a range of ip's and even multiple domains.  Is there a full list of domains it may fall under so we can set up a CORS policy to always allow HubSpot webhooks in?"
  }
]