[
  {
    "poster": {
      "poster_name": "Nick Garrett",
      "poster_handle": "nick.garrett"
    },
    "time_stamp": "2024-10-28 08:04:11",
    "text": "Hi all, good morning. Starting off I am not a huge developer but know enough to be dangerous. We're wanting to get some billing stats for customers inside of HubSpot for future use and possibly integration to other systems.\n\nWe have a billing query script for our services that reach out to our customers' instances on our infrastructure that is currently based in Pipedream. This will be kicked off with a workflow based on a dependent property in a company, and then post the results as properties back to the company/customer.\n\nI've gone back and forth between Python and Node.js. I have it working now with Javascript, but I keep getting an error that the data I'm looking for is not defined in the code it says.\nI've tried a few different things and even chatted with ChatGPT about it.\n\nThe data is that I need is returning and I have some logging in the code that illustrates the data that I want returned.\nI keep getting an error that the data I'm looking for is not defined in the code it says. I have tried outputting just one result.\n\n\nLast few lines of the code:\n    queryTime: getChicagoTime() // Include the query time in the output\n  };\n\n  console.log(\"Final output being sent to HubSpot:\", outputFields);\n\n  // Return the output object in the required structure for HubSpot\n  return { outputFields };\n};\n\n\nMy log from the code:\n2024-10-26T02:45:06.965Z INFO Received Customer ID: XXX\n2024-10-26T02:45:07.000Z INFO Query Time (Chicago): 2024-10-25T21:45:07.000Z\n2024-10-26T02:45:08.443Z INFO Data extraction completed. Preparing to return data...\n2024-10-26T02:45:08.459Z INFO Final output being sent to HubSpot: {\nexpcustname: 'XXX,\nexp_trunk_notify: '25',\nexp_trunk_calls: '50',\nexpfull: 39,\nexpclass: 0,\nexpapp: 3,\nexpnoreg: 2,\nexpmailbox: 4,\nexpresident: 2,\nexphotel: 0,\nexpteams: 0,\nexpagent: 14,\nexphotdesk: 0,\nqueryTime: '2024-10-25T21:45:08.459Z'\n}",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-28 08:14:27"
      },
      {
        "time_stamp": "2024-10-28 10:23:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-10-28 08:14:27",
    "text": "Hi <@U07TT0DJ9T4> I will be happy to take a look. Please DM to discuss."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-10-28 09:50:30",
    "text": "Hi,\nWe tried making the call with Nodejs and the result was the same.\n\nAny idea how to solve being able to parse the URL and make the GET work in HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Nick Garrett",
      "poster_handle": "nick.garrett"
    },
    "time_stamp": "2024-10-28 10:23:19",
    "text": "Got this figured out now.\n\nNow using a callback function to return the output fields.\n\n```  console.log(\"Final output being sent to HubSpot:\", outputFields);\n\n  // Use callback function to return the output object\n  callback({ outputFields });\n};```"
  }
]