[
  {
    "poster": {
      "poster_name": "Jezabel Eljuri",
      "poster_handle": "jezabel.eljuri"
    },
    "time_stamp": "2024-10-25 05:01:57",
    "text": "Hello,\n\nWe have a custom object that has a file field that allows uploading multiple files.\n\nSince we need to process this information to send it via API to another system outside of HubSpot, we created a custom code that reads the information and since it is a file declared private, we must obtain the signed URL and obtain the binary file to send.\n\nUntil now we have not had a problem, however we have a record in which there are several files that have \"commas\" in their names and when doing the GET and processing there are changes with the handling of upper and lower case when parsing the comma and it does not find the file within HubSpot, returning error 404.\n\nIn this video, we explain the situation better: <https://share.vidyard.com/watch/zG8ip9CLvsztngQPz53gUv>\n\nAny solution that we can apply? We have already tried to apply the urlencode but without success.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-28 09:50:30"
      },
      {
        "time_stamp": "2024-11-01 07:17:19"
      },
      {
        "time_stamp": "2024-11-05 09:31:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Selnekovic",
      "poster_handle": "jselnekovic"
    },
    "time_stamp": "2024-10-25 11:57:52",
    "text": "is it possible to enroll a workflow based on the removal of an association?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-28 00:20:47"
      },
      {
        "time_stamp": "2024-10-31 02:27:25"
      },
      {
        "time_stamp": "2024-10-31 02:28:37"
      },
      {
        "time_stamp": "2024-10-31 04:31:21"
      },
      {
        "time_stamp": "2024-10-31 13:33:16"
      },
      {
        "time_stamp": "2024-11-04 01:30:04"
      }
    ]
  },
  {
    "text": "Hey everyone, I need some help with Custom Workflow Actions where I have external data for a Select field (fetching data from my app)\n\nI cannot for the life of me get the V2 hash to match the inbound signature header - is there something externally from my code here that may cause them to not match?\n\nI tried the SDK approach, as well as manually building and hashing",
    "time_stamp": "2024-10-25 15:11:26"
  }
]