[
  {
    "text": "Hi guys!\nI need to generate an access key to upload a project, but I don't know what permission I must grant for this option to be activated.\n\nI would be very grateful if someone can guide me with this please.\n\nthank you.",
    "time_stamp": "2024-03-08 05:47:19",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-03-08 06:46:34"
      },
      {
        "time_stamp": "2024-03-08 06:51:56"
      },
      {
        "time_stamp": "2024-03-08 06:52:35"
      },
      {
        "time_stamp": "2024-03-08 07:04:22"
      },
      {
        "time_stamp": "2024-03-08 07:11:53"
      },
      {
        "time_stamp": "2024-03-08 07:14:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Oleh Rabchuck",
      "poster_handle": "winner.dev.20"
    },
    "time_stamp": "2024-03-08 06:46:34",
    "text": "When you generate a personal access key in HubSpot, you can choose the permissions you want to assign to this key. You are only allowed to have 1 password per user per HubSpot account. Once the access key is generated, an application called \"HubSpot Local Development Tools\" will be connected to your HubSpot account. This first-party application from HubSpot facilitates authentication for different activities, such as viewing and downloading data from the CMS, reading data from custom objects in the CRM, uploading and downloading templates, modules and files required for websites and emails, among other permissions.\nYou can learn more about HubSpot personal access keys at (<https://developers.HubSpot.com/docs/cms/personal-access-key>)."
  },
  {
    "poster": {
      "poster_name": "Gaston Galaz",
      "poster_handle": "gaston765"
    },
    "time_stamp": "2024-03-08 06:51:56",
    "text": "thx!"
  },
  {
    "poster": {
      "poster_name": "Oleh Rabchuck",
      "poster_handle": "winner.dev.20"
    },
    "time_stamp": "2024-03-08 06:52:35",
    "text": ":grinning:"
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-03-08 07:04:22",
    "text": "In order to have access to developer projects both in app and via a personal access key, your user needs Super Admin Access."
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-03-08 07:11:53",
    "text": "So another Super Admin in your account will need to give you that access, then you'll want to log out and back in and the checkbox should be checkable"
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-03-08 07:14:58",
    "text": "We're hoping to have a separate permission available soon, but the timeline is still TBA"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-03-08 13:31:58",
    "text": "It's threads like this why I love this slack. When I can't find the answers to on Google, someone has already had the problem before and asked about it in here."
  }
]