[
  {
    "poster": {
      "poster_name": "Shawn Bristow",
      "poster_handle": "captshawn"
    },
    "time_stamp": "2018-04-26 09:29:49",
    "text": "Thanks for the feedback <@U26BLKGE4>. I will pass it along to the right folks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-05-03 14:20:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-26 09:42:49",
    "text": "Not sure if it’s technically possible - but it’d be cool if there was a toggle switch when editing a form field in a form to enable/disable autocomplete from the browser for that field. HS inserts an auto complete string, which it appears the browser is using to remember that field. regardless of if you use the HubSpot options to disable the cookies etc."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2018-04-26 10:19:46",
    "text": "It'd be nice if they overhauled form controls"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-26 11:17:42",
    "edited": {
      "time_stamp": "2018-04-26 11:17:58"
    },
    "text": "talked to support about bulk deleting form submissions found two things that HubSpot direly needs for forms. I will post as separate messages so people can upvote them separate on here if they like them.\n\n-*We need the ability to bulk delete entries to a form(surprisingly it’s not possible, meaning test submissions disrupt the analytics of a form)*"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-26 11:19:18",
    "edited": {
      "time_stamp": "2018-04-26 11:19:34"
    },
    "text": "-*There should be a test mode which when active drops submissions into a “test submissions” log so it doesn’t affect the form’s analytics. This should be toggleable in the form as well as in the javascript api/embed code there should be a parameter for it.*"
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-04-26 11:26:40",
    "text": "<@U8ZE2AMJ4> ^^"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-26 11:27:09",
    "text": "Use case scenario: the app I’ve talked about over the last 2 weeks that we’ve been building, is a single page app that is used on a human sized touch screen kiosk at a tradeshow as well as iPads. We ran into a lot of device specific issues we had to troubleshoot as well as some challenges with making the forms work for this use-case(we had to submit and reset forms without loading a new page), we also had HS workflows attached to forms which we had to test. Causing tons of test submissions to be done (over 100) meaning our analytics for the forms are completely useless"
  },
  null,
  {
    "poster": {
      "poster_name": "Marco",
      "poster_handle": "mbevacqua"
    },
    "time_stamp": "2018-04-26 15:09:30",
    "text": "<@U7SL518D6> would you need both features or just one of the two would be enough for your use case?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-04-26 15:47:38"
      },
      {
        "time_stamp": "2018-04-26 16:09:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-04-26 15:24:39",
    "text": "Anyone been able to programmatically add “add to calendar” buttons for events/confirmations/etc in either emails or landing pages?"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-04-26 15:27:01",
    "text": "Using <http://addevent.com|addevent.com> we can create URLs to add an event i.e. webinar, in-person event, and for some HubSpot landing pages we would simply have this be what shows after a form is filled in. Clicking it saves the event to the calendar of the person who converts. However, we have to manually add each link right now. It would be AWESOME if there was an ability to have a flex-field or something where you could add modules in the Thank You page inline thank you message screen"
  },
  {
    "text": "<@U98RGFUQZ> uploaded a file: <https://HubSpotdev.slack.com/files/U98RGFUQZ/FAF1FFV5L/screen_shot_2018-04-26_at_5.27.06_pm.png|To make this more efficient>",
    "time_stamp": "2018-04-26 15:27:26"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-04-26 15:47:38",
    "text": "Ideally both as not everyone testing forms is going to be a developer and wouldn't likely know about a test environment"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-04-26 15:55:02",
    "text": "Hubdb?"
  },
  {
    "poster": {
      "poster_name": "Marco",
      "poster_handle": "mbevacqua"
    },
    "time_stamp": "2018-04-26 16:09:46",
    "text": "I was asking because allowing test submission might be something we'll be able to look into.\nWhile deleting analytics data after the fact is not possible."
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-04-26 17:22:57",
    "text": "I wish. No website add-on…"
  }
]