[
  {
    "poster": {
      "poster_name": "Ankit Patel",
      "poster_handle": "ankitpatelak2017"
    },
    "time_stamp": "2024-09-16 06:59:14",
    "text": "Hi All,\n\nI hope this message finds you well.\n\nI am reaching out to inquire about a specific requirement related to the handling of form submissions on our HubSpot platform, particularly with HubSpot's embedded forms. We need to execute a custom API call after a user submits a form but before they are redirected to the HubSpot thank you page. Please note that the API call may take a few seconds to respond.\n\nWe have attempted to use HubSpot's `onBeforeFormSubmit` hook to add our API call, as illustrated below:\n```javascript\n\n\nonBeforeFormSubmit: async ($form, submissionValues) =&gt; {\n    // Extract form data from submissionValues\n    const formData = submissionValues.reduce((acc, field) =&gt; {\n        acc[field.name] = field.value;\n        return acc;\n    }, {});\n\n    try {\n        // some api calls\n        await this.sendConfirmationEmail(formData);\n        console.log(\"Email sent successfully, proceeding with form submission.\");\n    } catch (error) {\n        console.error(\"Error sending email:\", error);\n    }\n}```\nDespite this implementation, the form submission still proceeds to the thank you page without waiting for the API call to complete.\nCould you please provide guidance on the following:\n1. *API Call Execution*: We need to ensure that the external API call completes before the user is redirected to the HubSpot thank you page. Any suggestions on how to properly integrate our custom API call with the embedded form submission process would be helpful.\n2. *Integration Points*: Are there specific hooks, custom scripts, or API endpoints provided by HubSpot that can assist with this requirement?\n3. *Implementation Details*: If you have best practices or code examples for handling this scenario within HubSpot’s embedded forms, we would greatly appreciate your assistance."
  }
]