[
  {
    "poster": {
      "poster_name": "Célia Bourial",
      "poster_handle": "me1374"
    },
    "time_stamp": "2019-08-29 02:07:12",
    "text": "hey everyone! I’m new to HubSpot, and I’m working on a coded template.\nI’m still trying to figure out some stuff, as I’m using a specific CSS framework (Material BS4), from what I’ve understood we’d loose the ability to use the drag and drop template creation feature, which is fine, but I can’t find any documentation as to how further implement forms in the file. As you might know, BS requires some divs to include the &lt;input&gt; in, and I can’t find the ressources on how to tackle this... same for images ; has anyone ever had to do this? Thanks in advance! :smile_cat:",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-08-29 05:42:01"
      },
      {
        "time_stamp": "2019-08-29 05:50:11"
      },
      {
        "time_stamp": "2019-08-29 06:05:17"
      },
      {
        "time_stamp": "2019-08-29 06:12:45"
      },
      {
        "time_stamp": "2019-08-29 06:18:13"
      },
      {
        "time_stamp": "2019-08-29 07:55:22"
      },
      {
        "time_stamp": "2019-08-29 07:55:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-08-29 05:42:01",
    "text": "You cannot change HubSpot form html without rewriting the form to use custom html and submit through the forms api instead. Doing so however makes your form no longer editable in the form editor"
  },
  {
    "poster": {
      "poster_name": "Célia Bourial",
      "poster_handle": "me1374"
    },
    "time_stamp": "2019-08-29 05:50:11",
    "text": "Alright, thanks for the information. Another question, is there a cleaner way than using HubSpot generated URLs to access image assets from the code?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-08-29 06:05:17",
    "text": "The file manager allows you to set the domain your images will pull from, so if you are worried about it showing HubSpot in the domain that is changeable. In addition you can use `resize_image_url` to  customize how HubSpot resizes the image <https://designers.HubSpot.com/en/docs/hubl/hubl-supported-functions#resize-image-url>"
  },
  {
    "poster": {
      "poster_name": "Célia Bourial",
      "poster_handle": "me1374"
    },
    "time_stamp": "2019-08-29 06:12:45",
    "text": "Alright, so there’s no cleaner way than using the direct URL inside of the coded template, right?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-08-29 06:18:13",
    "text": "If you are meaning you are wanting something akin to how Shopify’s `asset_url` works you don’t really need to do that. If you rename or move the file HubSpot handles it automatically.\n\nin custom modules, there is a function similar to that called `module_asset_url()` which is used for images that are added as linked assets to the module."
  },
  {
    "poster": {
      "poster_name": "Célia Bourial",
      "poster_handle": "me1374"
    },
    "time_stamp": "2019-08-29 07:55:22",
    "text": "Thank you for the informations, have a nice day Jon"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-08-29 07:55:37",
    "text": "you too"
  }
]