[
  {
    "poster": {
      "poster_name": "Matt Martelli",
      "poster_handle": "mmartelli"
    },
    "time_stamp": "2021-06-26 23:06:53",
    "text": "We are a call center essentially so some of our leads that come from outside vendors do not have an email associated. We are about to implement HubSpot CRM companywide so it is imperative that we can create a record without an email.\n \nI am guessing we can create a workflow with the new Operations Hub custom coding to associate records or merge based on another key field. Would this be a correct assumption?\n \nLet us assume that our logic is:\n \n1. Format First and Last name criteria into sentence case.\n2. Check both records to see if first and last name match. If yes, go to step 3.\n3. Format phone numbers to be consistent on both records looking to be merged.\n4. Check to see if phone numbers match. If they do then merge records.\n5. If there are two different emails, the most recent submission’s email would be Primary email and the second would be secondary email field.\n6. If both full name and phone do not match, then we would look to manually dedupe the leftover records.\nRight now, about 90% of our duplicates would be resolved with the aforementioned logic. Most contacts share same phone number and name but have different email. A majority of the similar emails are incorrect by minor spelling, an added digit or same prefix but different domain (<http://yahoo.com|yahoo.com> vs <http://gmail.com|gmail.com>), etc.\n \nThis is a typical example:\n\n \nOther notes:\n• Emails need to be formatted the same before being merged\n• Phone number needs to be formatted the same before being merged\n• Format contact name to sentence case and merge\nDoes anyone have a similar situation or knows the best way for us to create these workflows that do not rely on the primary email. I’d like to ask the community for your help!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-07 21:37:29"
      }
    ]
  }
]