[
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2022-05-02 09:00:02",
    "text": ":sprocket-dance: Hello HubSpot Developers! :sprocket-dance:\n\nIt’s no secret there there are lots of open questions in the the HubSpot Developer Slack. We know this, we see this, and we want to make your experience better.\n\n:broom: In an effort to streamline this community and make it easier to connect with your fellow developers, *we’re going to be archiving the total number of public channels, as well as renaming others.* (sneak peek at the changes <https://docs.google.com/spreadsheets/d/1fnwCzrYD2fLNPCYP7NNshTJi4gM36vWpHBTU0ALQaSQ/edit#gid=1564945604|here>):broom:\n\nWe’ll be providing updates in every channel impacted in advance of these changes, and the updates will go live in one week, on *May 9th*. We will be archiving channels (meaning they will still be searchable, none of your previous posts will be lost), so if we get feedback from y’all that any channel we’ve archived needs to be brought back, we will do so.\n\n:sparkles:We’re hopeful this will be the first of many steps designed to help connect HubSpot developers allover the world and help you build with us more effectively!:sparkles:",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-05 10:33:47"
      },
      {
        "time_stamp": "2022-05-09 07:59:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 09:48:24",
    "text": "Anyone with a solid grasp of the icon field able to help me?",
    "reply_count": 9,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-05-02 11:01:04"
      },
      {
        "time_stamp": "2022-05-03 12:35:43"
      },
      {
        "time_stamp": "2022-05-03 15:21:12"
      },
      {
        "time_stamp": "2022-05-03 21:48:10"
      },
      {
        "time_stamp": "2022-05-04 11:41:42"
      },
      {
        "time_stamp": "2022-05-04 11:51:23"
      },
      {
        "time_stamp": "2022-05-23 17:51:27"
      },
      {
        "time_stamp": "2022-05-23 17:52:56"
      },
      {
        "time_stamp": "2022-05-31 16:02:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:11:17",
    "text": "<@UBT0AHWLD> <@U01QA9LNN2V>, I have run into several issues with the video embed. As lincoln said, since it is an iframe, there is no way to interact directly with the video. That means no attribute targeting and also no JS interaction with it. My workaround was this... Just don't use the video field. If you set a file field instead, you can tell it that you only want video files. Then just add that file as your source to a standard html `&lt;video&gt;` tag. The big caveat with this is that in the HubSpot file manager you have to turn off the advanced features on the video file."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-05-02 10:22:34",
    "text": "Thanks <@U01DQEZ7BCZ> for sharing that workaround!"
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:23:03",
    "text": ":wave: hi Kevin, the File field might be a good approach for cases where a plain `&lt;video&gt;` tag is desired; video backgrounds is one example i've seen. but there are some key caveats\n\n• Cannot take advantage of adaptive HLS streaming, some browsers do not support add video codecs\n• No play or retention tracking\n• Form/CTA overlays are not supported\n• Sizing &amp; alignment are up to the developer\nhowever you shouldn't have to turn off Advanced Features to use this strategy, all videos should show in the File field regardless. turning off Advanced Features would prevent that video from being used in other places which desired those benefits."
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:27:46",
    "text": "<@U01DQEZ7BCZ> would you mind spinning up a new thread with the issues you're having? We're currently releasing a ground-up rewritten Video player and always looking to learn &amp; improve :slightly_smiling_face:\n\n<@UBT0AHWLD> i'm actively working on a way to opt-in to lazy loading behavior that should appease lighthouse, and how we can be more efficient overall here. we've thought more about video quality and minimizing buffering time than lighthouse and the overall page load time to date but acknowledge this is an important balance"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:29:16",
    "text": "Hey Lincoln, There are definitely some issues with the workaround. But it seems like you kind of have to 'pick your poison\" if you will. I ran into an issue where my clients videos where inside a modal. The problem they had was that the video kept playing when the modal was closed. With the embed, I couldn't target the video in JS to set a trigger on the play/pause method."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:29:38",
    "text": "Oh sure, I will put a new one up."
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:33:50",
    "text": "thank you, i have seen this issue with modals / sliders as well and have something to offer. it will be much easier for others to search for in a new thread though."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:41:24",
    "text": "I am having some issues with the HubSpot video embed. Currently, the embed uses an iframe handle the video but brings along a few issues with targeting the video parameters and targeting. One example is this: I ran into an issue where my clients videos where inside a modal. The problem they had was that the video kept playing when the modal was closed. With the embed, I couldn't target the video in JS to set a trigger on the play/pause method.",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-05-02 10:44:25"
      },
      {
        "time_stamp": "2022-05-02 10:45:38"
      },
      {
        "time_stamp": "2022-05-02 11:04:20"
      },
      {
        "time_stamp": "2022-07-06 10:37:22"
      },
      {
        "time_stamp": "2022-07-06 11:06:32"
      },
      {
        "time_stamp": "2022-08-05 13:28:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:44:25",
    "text": "there is a recent SDK method to pause all currently playing players\n```hsVideoApi.pauseAllPlayers()```"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:44:57",
    "text": "New thread is up. I also have another question up that I was wondering if you might be able to help me with if you are pretty comfortable with the icon field. There is a thread up for it so if you are able to help we can take it there."
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:45:38",
    "text": "we also now pause any other players when a user plays, starting about a week ago"
  },
  {
    "poster": {
      "poster_name": "Lincoln Bryant",
      "poster_handle": "lbryant"
    },
    "time_stamp": "2022-05-02 10:47:05",
    "text": "i don't have knowledge there but you're in the right channel &amp; i can forward to the owning team"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 10:47:26",
    "text": "That would be great! Thanks."
  },
  {
    "text": "Btw, I meant to comment on this above. I don't know if it was a bug but when I set up the file field, no videos that had the advanced features selected would show in the picker.",
    "time_stamp": "2022-05-02 10:54:21"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 11:01:04",
    "edited": {
      "time_stamp": "2022-05-02 11:02:56"
    },
    "text": "This issue I am having is that when I switch the icon format to unicode, It seems like half of the icons just don't render. Some work perfectly fine, some not at all. After a ton of messing around with the embed code, it seems like there might be something wrong with the icon names. One example is: none of the icons that start with \"Alternate\" work at all as well as many others. When I print out the icon field as a whole the icon name on these is in capital case instead kebab case, whereas in font awesome, these same icons (as well as the ones in the icon field that work) are all in kebab case. Again, not sure if the name is the problem or if I'm overlooking something but that's just what I'm seeing after my investigation."
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 11:04:20",
    "edited": {
      "time_stamp": "2022-05-02 11:04:44"
    },
    "text": "Oh cool! The second gets me half way there. The only issue at that point is if they close the modal but don't play another video. However with the first, I should be able to run that method on any trigger I want. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Raquel Graça",
      "poster_handle": "raquelngraca"
    },
    "time_stamp": "2022-05-02 13:11:04",
    "edited": {
      "time_stamp": "2022-05-02 14:09:26"
    },
    "text": "Hello folks, I’ve just started my first Hubl project. I would like to display a custom Quote Total, filtering the Amount by product_name. I was able to set a variable where the values are being displayed. But I can not find a way to add them up. I have tried:\n        `{% set sum_up = sum_up|add(product_price) %}`\nand\n        `{% set sum_up = sum_up + product_price %}`\n\nThis is inside the line_items_table module - inside the unit loop.\n\nAlso I just noticed that the value saved inside the loop:\n              `{% set up_front_price = unit[item.column_property] %}`\nIs not available outside?! Why?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-02 19:06:34"
      },
      {
        "time_stamp": "2022-05-02 19:14:39"
      },
      {
        "time_stamp": "2022-05-03 10:54:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 19:06:34",
    "text": "What it looks like you're trying to do is in the loop, add the `product_price` to the value of `sum_up` then return sum_up with the new value correct?"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-05-02 19:14:39",
    "text": "If that is the case then I have a solution for you. As far as I've figured out so far, There is no way to return an updated value of a variable to use outside of a loop like you can in JS; That new value becomes local to the loop only. The solution would be to set a variable array, inside the loop append the value you need to the array, then you have access to that value outside the loop and there is a filter to sum the values in the array.\n```{% set product_price_arr = [] %}\n{% for item in repeater %}\n  {% do product_price_arr.append(item.product_price) %}\n{% endfor %}\n{% set sum_up = product_price_arr|sum %}```"
  },
  {
    "text": "I know this is a few days old but it looks like you are trying to use this with a rich text module on a template? Look through this <https://developers.HubSpot.com/en/docs/cms/building-blocks/modules/using-modules-in-templates|page> on the docs. There is a `module_attributes` method you can use to render the html instead of a string.",
    "time_stamp": "2022-05-02 19:26:24"
  }
]