[
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-09-21 08:56:23",
    "text": "Yes, this is possible <@UTS5PEGF6> Do you have some questions regarding implementation?"
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2023-09-21 08:58:14",
    "text": "Would be interesting to know what method you used to implement it and if you managed to get it to populate automatically or if you had to do it manually per page"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-09-21 10:52:23",
    "text": "I have a landing page that is supposed to be published, but not to be indexed by google. I just added the \"robots noindex\" meta tag in the &lt;head&gt; of the page.\n\n1. How long will this take to go into effect?\n2. What else, if anything, do I need to do to remedy this??",
    "reply_count": 17,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-09-21 11:24:19"
      },
      {
        "time_stamp": "2023-09-21 11:25:11"
      },
      {
        "time_stamp": "2023-09-21 12:02:19"
      },
      {
        "time_stamp": "2023-09-21 16:52:11"
      },
      {
        "time_stamp": "2023-09-21 16:53:37"
      },
      {
        "time_stamp": "2023-09-21 16:59:46"
      },
      {
        "time_stamp": "2023-09-21 17:00:06"
      },
      {
        "time_stamp": "2023-09-22 10:03:34"
      },
      {
        "time_stamp": "2023-09-22 10:25:44"
      },
      {
        "time_stamp": "2023-09-22 10:25:59"
      },
      {
        "time_stamp": "2023-09-22 10:26:41"
      },
      {
        "time_stamp": "2023-09-22 10:27:31"
      },
      {
        "time_stamp": "2023-09-22 10:27:54"
      },
      {
        "time_stamp": "2023-09-22 10:28:03"
      },
      {
        "time_stamp": "2023-09-22 10:29:29"
      },
      {
        "time_stamp": "2023-10-05 12:26:03"
      },
      {
        "time_stamp": "2023-10-05 15:10:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-09-21 11:24:19",
    "text": "When you add a `noindex` meta tag to a page, you’re instructing search engines not to index that specific page. Here’s what you need to know regarding its effectiveness and other potential steps to consider:\n1. How long will it take to go into effect?\n    ◦ If the page has not been indexed yet: The next time Googlebot crawls your page, it will see the `noindex` tag and should not add the page to its index.\n    ◦ If the page has already been indexed: The next time Googlebot re-crawls the page and notices the `noindex` tag, it will schedule the page for removal from its index. This process can take anywhere from a few days to several weeks, depending on various factors like the crawl frequency of your site.\n2. What else can you do?\n    ◦ Robots.txt: If you want to prevent Googlebot from even accessing the page, you can use the `robots.txt` file to disallow crawling of that page. However, remember that if a page is disallowed in `robots.txt`, but it has already been indexed, it might not be removed from the index because Google can’t see the `noindex` directive if it’s blocked from crawling the page. In this case, allow crawling but keep the `noindex` tag on the page.\n        i. Google Search Console: If the page has already been indexed and you want to expedite its removal, you can use Google Search Console. After logging in:Go to the ‘Removals’ tool.\n        ii. Click on the ‘New Request’ button (it might be labeled slightly differently based on updates).\n        iii. Enter the URL of the page you want to be removed.\n    a. Google will usually process these requests within a day, but the removal is temporary (about 6 months). So, ensure the `noindex` tag remains in place to prevent future indexing.\n    ◦ Check Other Search Engines: While Google is the dominant search engine, don’t forget about others like Bing, DuckDuckGo, etc. If you want the page to be non-indexable across all search engines, ensure that the `noindex` directive is universally recognized.\n    ◦ Check for Incoming Links: If other websites link to your landing page, search engines might find it faster. So, be cautious if you have shared this link elsewhere.\n3. Regularly Monitor: Use site:<http://yourdomain.com|yourdomain.com> in Google Search to check what pages from your domain are indexed. This can help you monitor whether your noindex-tagged page appears or remains in search results.\nRemember to always ensure your noindex directive is correctly placed, and consider periodically auditing your website to ensure that indexing settings are as you intend them to be."
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-09-21 11:25:11",
    "text": "made possible by the one and only chatGPT^ :v:"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-09-21 12:02:19",
    "text": "thank you!!"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-09-21 16:50:44",
    "text": "manually per page. I typically have the most success hard coding the structured data on each page in the backend of HubSpot."
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-09-21 16:51:15",
    "text": "Not that I know about <@U05NNKRAF35>"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-09-21 16:52:11",
    "text": "TL:DR - a few days to a couple of weeks"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-09-21 16:53:37",
    "edited": {
      "time_stamp": "2023-09-21 16:53:57"
    },
    "text": "Does the page currently receive a lot of Organic traffic? How long has the page been published, and indexed in Google Search? Typically a newer page takes less time to remove."
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-09-21 16:59:46",
    "text": "It was published maybe 2 weeks ago? It's fairly new. Its a landing page for a client's new launch of something, so no one truly knows about it yet"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-09-21 17:00:06",
    "text": "But we want to avoid preliminary traffic haha"
  }
]