[
  {
    "poster": {
      "poster_name": "sahil dhiman",
      "poster_handle": "sahildhimansanour686"
    },
    "time_stamp": "2021-07-19 03:50:55",
    "text": "Thank you so much <@U027VCNTBHQ>"
  },
  {
    "poster": {
      "poster_name": "George Karakitsios",
      "poster_handle": "gkarakitsios"
    },
    "time_stamp": "2021-07-19 13:12:19",
    "text": "Hello everyone, i am totally new in HubSpot coding, so i have develped an HTML + CSS landing page which includes a HubSpot form. What i need to do is be able to import this template into HubSpot and then have some sections of the page dynamically change per case of use. For example, for purpose 1 i need to be able to change the image and the text and for purpose 2 i need to change the text color and size. How can i reuse the same template without modifying its core code? Is there a way to create a \"placeholder\" section so i han modify it from the editing panel and not from the design manager?\n\nthank you in advance",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-19 14:42:14"
      },
      {
        "time_stamp": "2021-07-19 14:44:07"
      },
      {
        "time_stamp": "2021-07-19 14:44:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-07-19 14:42:14",
    "text": "Hey George, it sounds like you would be wanting to use our Smart Content feature in the page editor. Please check here and see if this would solve for you use case:\n<https://knowledge.HubSpot.com/website-pages/create-and-manage-smart-content-rules>"
  },
  {
    "poster": {
      "poster_name": "George Karakitsios",
      "poster_handle": "gkarakitsios"
    },
    "time_stamp": "2021-07-19 14:44:07",
    "text": "Hey AJ, thank you. What i did was to add these\n`{% module \"dealer_subtitle\" path=\"@HubSpot/text\" label=\"Dealer Subtitle in Green\" %}`\n\n`{% module \"dealer_image\" path=\"@HubSpot/linked_image\" label=\"Dealers Image\" %}`"
  },
  {
    "poster": {
      "poster_name": "George Karakitsios",
      "poster_handle": "gkarakitsios"
    },
    "time_stamp": "2021-07-19 14:44:17",
    "text": "and it works great :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ana Madeira",
      "poster_handle": "ana.madeira"
    },
    "time_stamp": "2021-07-19 14:58:28",
    "edited": {
      "time_stamp": "2021-07-19 14:59:00"
    },
    "text": "Hi <@UTQQ4TXCH> sorry my delay…I was redirected to other projects. Returning to it now.\n\nI didn’t add just a module, I use Clean 6 in my website, then we updated for the 6.1 version, and I’m redoing all our layout on the new version, to use the more update codes. However I’m doing all at the same way I did before, and when I try save my this errors happens. Before I never had this issue.\n\nI can check on code, but I can change it, because the code is for view only, as is a theme.\n\nTried incognito, cache, etc, cloning the template as you mentioned…I guess my option will talk with someone on HS for sure, because doesn’t make sense the error. I posted here, because probably one of the HS representatives that participes here could give a hand to understand it better.\n\nThanksssss…"
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-07-19 15:40:38",
    "edited": {
      "time_stamp": "2021-07-19 15:40:56"
    },
    "text": "\"but I can (think you mean \"can't\") change it, because the code is for view only\" that right there makes me think you are trying to edit the original that you bought. You have to make a clone of the whole package you purchased then use that one to build your new site."
  },
  {
    "text": "Hi guys~!\ni have a queustion.\ni made HubSpot blog using hubl.\n\ni checking css in preview. and very well.\nbut i write blog NO CSS …\n\nWHY….?",
    "time_stamp": "2021-07-19 20:54:00"
  }
]