[
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-07-28 08:00:48",
    "edited": {
      "time_stamp": "2021-07-28 08:03:03"
    },
    "text": "That’s not possible in the blogs as far as I know… my team uses storybook to create “blog widgets” (components like quote callouts). Our content authors can visit our storybook docs site, fill their content into the widget component, copy the output html from the storybook addon and paste that into the rich text editor source code. That html picks up the global css."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-07-28 08:02:35",
    "text": "In the past, before we used storybook, I created a spreadsheet that would essentially do the same thing (without the preview). Authors enter their content into the appropriate fields, and it outputs a chunk of html they can paste in there."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-07-28 08:06:29",
    "text": "It’s not ideal, because the html is hard-coded in there, thus ever updating it gets sticky.  But the big advantage is you can always globally update the css styling."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-07-28 10:40:13",
    "text": "Why do you need the drag and drop functionality? Are all of your blog posts different?You can still create custom fields for your blog posts and use those to manipulate the layout of the page to some degree. I guess what part of the drag and drop functionality do you need? Is it that every page is styled differently? Or is it that you just need to include custom moduels on all of them and want to swap out the images/content etc?"
  },
  {
    "poster": {
      "poster_name": "Rebecca Steinel",
      "poster_handle": "rebecca136"
    },
    "time_stamp": "2021-07-28 12:08:10",
    "text": "Hello! I am looking to create a blog listing page with different sections for each category. I have four categories, so that would be four sections. I guess the goal is to have four feeds on the listing page filtered by category. Does anyone know how I can accomplish this?"
  },
  {
    "poster": {
      "poster_name": "Ian Hoyte",
      "poster_handle": "ian135"
    },
    "time_stamp": "2021-07-28 12:37:41",
    "text": "Am I going crazy, or does `content.template_path` return false on a blog post template?"
  }
]