[
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 17:31:05",
    "text": "<@U0326LP3J0P> We currently have 5000 HubSpot customers using our app that require update capabilities as this is one of the key features of our app. Would HubSpot be communicating to them that the service will no longer be available by the end of the year? It doesn't feel like a lot of research has been made before making this call,  I would strongly recommend this gets reviewed.",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-02 17:51:49"
      },
      {
        "time_stamp": "2024-05-02 17:59:39"
      },
      {
        "time_stamp": "2024-05-02 18:02:56"
      },
      {
        "time_stamp": "2024-05-02 18:05:07"
      },
      {
        "time_stamp": "2024-05-02 18:06:04"
      },
      {
        "time_stamp": "2024-05-02 18:08:02"
      },
      {
        "time_stamp": "2024-05-02 18:10:08"
      },
      {
        "time_stamp": "2024-05-02 18:10:29"
      },
      {
        "time_stamp": "2024-05-02 18:10:39"
      },
      {
        "time_stamp": "2024-05-02 18:11:07"
      },
      {
        "time_stamp": "2024-05-02 18:11:22"
      },
      {
        "time_stamp": "2024-05-02 18:16:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Austin Pilz",
      "poster_handle": "apilz"
    },
    "time_stamp": "2024-05-02 17:51:49",
    "text": "HI Walter. Thanks so much for writing in here. I totally hear your concerns regarding the number of customers utilizing your application.\n\nI'm going to tag in my friend <@UAVHG3EHG> here who might be able to assist more with information around the announcement and communications.\n\nLars can correct me if I'm wrong, but from what I understand, the communication on this deprecated was provided to our developer community (which sounds like you are, also). The belief may me that since our customers utilize your applications, the notification may be more appropriate coming from the application owner since the outcome/impact differs on an app by app basis."
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 17:59:39",
    "text": "<@U0326LP3J0P> <@UAVHG3EHG> you think I should email all my customers and tell them that their app will no longer work as intended due to some decision HubSpot made unilaterally without ever considering them? It doesn't seem like a great idea. I know there's no \"legal ground\" for me or them to \"demand\"  anything as per the partner agreement you can  basically do whatever you want with the API, but as you can understand this wont look good on either of us. I hope there's an opportunity to review this as it happened before with other changes/deprecation that were reviewed (of the top of my mind I remember that lists creation endpoint which were scheduled for deprecation but that decision was reverted when I shown you that my app and my customers were using that). The app that uses this endpoint is App ID: 189911, you can check the # of API calls we make to that endpoint you are planning to deprecate, it's probably in the tens of thousands per day"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:02:56",
    "text": "BTW, what do you mean by \"users who currently modify events will need to update their migrations.\"?"
  },
  {
    "poster": {
      "poster_name": "Austin Pilz",
      "poster_handle": "apilz"
    },
    "time_stamp": "2024-05-02 18:05:07",
    "text": "&gt;  what do you mean by \"users who currently modify events will need to update their migrations.\"?\nThis is referencing an apps who are using the V1 endpoints that perform mutations. It's just saying those apps will need to migrate their usages of these mutation endpoints to either\n\nA.) An app structure that supports immutability of events created via the timeline. OR,\nB.) Discontinue calling the V1 mutation endpoints as they'll begin to return errors to you once the deadline passes"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:06:04",
    "text": "Sorry, I still don't understand what that means. Posting and updating events is a core feature of the app we provide to thousands of HubSpot customers."
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:08:02",
    "text": "I do not get what the proposed workaround is and I get that you may not be the right person to discuss this with (neither this be the right channel). Can you connect me with the product manager that decided to deprecate this so I can share the use case we have?"
  },
  {
    "poster": {
      "poster_name": "Austin Pilz",
      "poster_handle": "apilz"
    },
    "time_stamp": "2024-05-02 18:10:08",
    "text": "I think to distill it further would be to say:\n\nIf your app can function with immutability, we'll ask you to move from V1 to V3 endpoints and you'll have no issues with ongoing use.\n\nIf your app cannot function without immutability (which sounds like might be your app use case), you will not be able to continue using V1 endpoints to mutate events. You can continue creating new events, but you cannot modify existing events. There is no workaround."
  },
  {
    "poster": {
      "poster_name": "Austin Pilz",
      "poster_handle": "apilz"
    },
    "time_stamp": "2024-05-02 18:10:29",
    "text": "I hope that helps. Lars will follow up sometime soon"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:10:39",
    "text": "Sorry, but i'm not following you"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:11:07",
    "text": "you are basically telling me that I must shut down my business"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:11:22",
    "text": "I hope this is some kind of sick joke"
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2024-05-02 18:16:06",
    "text": "I fully understand this was not your call neither you have a saying on this, that's why I asked for a PM to reach out. You may not be aware of this but as mentioned before, this is not the first time something like this gets rolled back after you realize there's plenty of people that require this for their normal operation."
  }
]