[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-08-17 05:39:35",
    "text": "Hey <@U01429FHYA2>, to confirm, you are getting data from a third party API to list all of the datas instances on this page (what is the API, I am not seeing the list happening right now?), and then you want to be able to have a unique page per instance of the data that shows details about the particular instance the user clicks on? And the detail pages for data ideally have their own URL based off of the title of the data instance?"
  },
  {
    "poster": {
      "poster_name": "M.B",
      "poster_handle": "mboutemy"
    },
    "time_stamp": "2020-08-17 08:02:24",
    "text": "Hi, can i get the userID when get the token ? I want use this ID for link the HubSpot user at my app user.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-18 13:45:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sean Matthews (Left Hook)",
      "poster_handle": "sean.matthews"
    },
    "time_stamp": "2020-08-17 09:49:25",
    "text": "Hey team- CRM Extensions… It used to be limited to 5 Items only displayed (5 “Card properties”, which I think of or refer to as cards themselves) and that any overage would be indicated with something like “5 of 10 items shown”\n\nHowever I’m testing live right now with playing around with response data and seeing that 7 items are being shown…\n\nIs this because it’s a private app? Or has the restriction on number of items been removed or raised?"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2020-08-17 11:37:41",
    "text": "is there any APIs for HubSpot CTA buttons to potentially get data for CTA buttons to write a script to copy CTA buttons from one portal to another?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-08-17 12:51:27",
    "text": "Yup. Where I'm stuck at is that there seems to be no mention of where and how to access the account's hub id post oauth."
  },
  {
    "poster": {
      "poster_name": "James Truty",
      "poster_handle": "james602"
    },
    "time_stamp": "2020-08-17 15:22:06",
    "text": "Apparently if you call this endpoint with the token: `/oauth/v1/access-tokens/{token}` the hub_id is included in the response, along with the user’s email. I was stuck here as well."
  }
]