[
  {
    "poster": {
      "poster_name": "Nick Swekosky",
      "poster_handle": "nick554"
    },
    "time_stamp": "2020-08-26 09:48:58",
    "text": "Hello! I would like to track the UTM campaign in the URL when a user submits a form. Then I would like to identify that UTM campaign for each lead from the API. Are both of these 2 things possible?"
  },
  {
    "poster": {
      "poster_name": "Travis Chapman",
      "poster_handle": "travis.chapman"
    },
    "time_stamp": "2020-08-26 10:36:05",
    "text": "<@UQ922BSPP> What did you mean when you said \"Full Control\"? If you send us 80K requests, we are going to have to get the contact info and burn through our rate limits just getting the contact data. Can you clarify what we need to do?"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 11:11:58",
    "text": "<@U012W4YEUTX> I found that *I am able to create a _new_ property and set hasUniqueValue to True, but that existing properties cannot have this setting edited* (did find some notes on this in the documentation on the \"create property\" endpoint).\n\nOne issue I'm finding is I can no longer edit other features of that property in the UI - e.g., I can't update the property _description_ -- not sure if this is related to the fact that I created it as unique, or some other issue.\n\nWith such a property, I'm finding it will not save an update to this field if another record already has the value entered, but *there is no helpful error message indicating why the save failed*, just \"Sorry, there was an issue saving your change. Please try again.\"  I'm not sure if there is a way to set a custom error message when creating it via the API"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 11:12:56",
    "text": "Batch-and-paginate the requests for the backing data on the webhook hits?"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 11:14:45",
    "text": "Yikes.... yeah... something definitely messed up there... might have to make a support ticket\n\nI have had some weird experiences where the pre-existing properties used to be more editable in the UI when I first began using HubSpot than they have been recently\n\nBut I am not surprised it is impossible to change the uniqueness settings on their existing properties... lots of things cannot be updated on those in general"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 11:14:49",
    "text": "I'm wondering if it's expected that a hasUniqueValue property would no longer be editable within the UI (not this particular setting, but other features of the property), or if this is a bug"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 11:15:21",
    "text": "I am going with bug... trying to edit should not raise a general system error... it should raise a specific error if X action is not allowed..."
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 11:16:00",
    "text": "yeah but even editing the description -- this is independent of the issue where the error message for \"sorry this value must be unique\" is not helpful"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 11:16:30",
    "text": "Agreed... nothing should ever just say \"Sorry, there was an issue saving your change. Please try again.\""
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 11:17:25",
    "text": "the generic error message comes up when attempting to edit this field on a particular record (but providing a non-unique value).\n\nThe other issue comes up when trying to edit the property itself (e.g., description), in which case it says:\n\n\"*There was a problem updating this property.*\nPlease try again, or refresh the page.\""
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 11:18:48",
    "text": "Yeah... that's deffo time for a support ticket"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 11:20:23",
    "text": "I've found that the support team doesn't really support on API-level stuff"
  },
  {
    "text": "Does anyone know if there is a parameter to define a number property as \"formatted\" versus \"unformatted\" (basically whether to show commas after the thousands digit) when creating a number property via the API?\n\nI'm finding there is a boolean parameter for \"showCurrencySymbol\" but not seeing any differing parameters when GETting these two properties:",
    "time_stamp": "2020-08-26 11:26:57",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:30:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2020-08-26 12:15:33",
    "text": "Actually found a pretty helpful Support rep.  We did some testing and it does seem that it is the hasUniqueValue property that is rendering the property uneditable.  HS Support agreed this seems to be a bug, they are following up"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2020-08-26 19:05:29",
    "text": "I don't like sending API requests to support either TBH, but this one was so specifically busted I didn't see a good way around it."
  }
]