[
  {
    "poster": {
      "poster_name": "Eray Ayduran",
      "poster_handle": "eray.ayduran"
    },
    "time_stamp": "2020-08-27 05:12:33",
    "edited": {
      "time_stamp": "2020-08-27 05:19:17"
    },
    "text": "Hello, I have question about the form submission. I need to get the total number of form submissions for the specific form. When I check the Form API definition, there is a method \"Get submission for a form\", I get the total number of submissions by checking the size of the array. It is okey but if there are a lot of submissions, it will give me so big bulk data and according to the performance this may cause an issue for us. Is there an easier way to just get the total number of the form submission? Thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Sanjay",
      "poster_handle": "sjay"
    },
    "time_stamp": "2020-08-27 06:04:33",
    "edited": {
      "time_stamp": "2020-08-27 06:05:22"
    },
    "text": "Thank you so much <@U6W3H6YN8> for understanding my exact requirement and your help.\n\nIs there any way to generate a detail page when we click on the link on the listing page with the current logic with the SEO-UserFriendly-URL instead of query string?\n\nOr\n\nif this possible with only dynamic HubSpot DB pages,\nIs there any way to sync between my both data source and  HubDB tables.\n\nData Source: <https://newsrelease.columbusit.com/api/json/v2/releases>\n\nListing page:\n<https://www.columbusglobal.com/en/news-detail>"
  },
  {
    "poster": {
      "poster_name": "Prasanna",
      "poster_handle": "prasanna.hegde"
    },
    "time_stamp": "2020-08-27 07:59:39",
    "text": "Hi, Can I get a sample input value for contact search api? Could not figure this out from the API document page",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:32:21"
      },
      {
        "time_stamp": "2020-09-03 15:34:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adrianna Valle",
      "poster_handle": "avalle"
    },
    "time_stamp": "2020-08-27 11:23:28",
    "text": "hello everyone! Ive been working on an integration software for HubSpot and couldnt really find a lot of information on archiving objects and what exactly happens. How long can an object be archived? How do we recall archived objects? is it seen at all on the HubSpot platform? we are looking to offboard contacts but we dont actually want to remove them since there are a lot of properties HubSpot doesnt let u modify that we wouldnt be able to return back to its original state. Any resources or advice is much appreciated!"
  },
  {
    "poster": {
      "poster_name": "AntonL",
      "poster_handle": "anton961"
    },
    "time_stamp": "2020-08-27 20:07:17",
    "text": "Hello! is there an api to load all task queues? I see that UI makes a call to `engagements/v1/queues/owner/:ownerId?portalId=:portalId` endpoint, which looks to be available to public, but it includes the ownerId, so i am not quite sure what does it return.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:33:40"
      },
      {
        "time_stamp": "2020-11-02 16:01:34"
      },
      {
        "time_stamp": "2020-11-02 18:20:14"
      }
    ]
  }
]