[
  {
    "poster": {
      "poster_name": "Rowan Reid",
      "poster_handle": "rowan.reid"
    },
    "time_stamp": "2020-08-31 03:51:55",
    "edited": {
      "time_stamp": "2020-08-31 03:52:08"
    },
    "text": "The v2 API allows bulk/batch creation of contacts via this endpoint: <https://legacydocs.HubSpot.com/docs/methods/contacts/batch_create_or_update>\n\nDeals may be batch updated (but not created) via this endpoint: <https://legacydocs.HubSpot.com/docs/methods/deals/batch-update-deals>\n\n*Question* - is anyone aware of any plans to support bulk/batch deal creation in this way, or is the only way to batch create deals going to be the new v3 way?  (v3 way - <https://developers.HubSpot.com/docs/api/crm/imports>)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:35:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Saurabh Parashar",
      "poster_handle": "saurabh.parashar"
    },
    "time_stamp": "2020-08-31 08:51:28",
    "text": "I am working on pushing data to HubSpot through API, running into throttling at 10/sec on dev instance. Does anyone know the limits on enterprise account?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:36:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jeremy Hong",
      "poster_handle": "jeremy785"
    },
    "time_stamp": "2020-08-31 13:01:11",
    "text": "Hello, hoping to be pointed in the right direction. I’m not a technical developer by any means, so hopefully my explanation makes sense...Our client has a subscription based business, and uses a proprietary database to store customer data (account activity, purchases, genre preferences, etc). Essentially, they would like to know whether it’s possible to use their database to “spit out” CSV files of contacts that meet specific criteria (ie. no activity in X days), then update those contacts in HubSpot via FTP. They want to avoid developing on the HubSpot API, and want everything automated.\n\nA few questions:\n1. Is FTP even the right thing to use in this scenario? In my research, it seemed like FTP was primarily used for the CMS (design manager and “files”), rather than the CRM. I also understand FTP was replaced by CMS CLI, however the CMS Hub is out of the question. \n2. What other solutions exist? Is it safe to assume that we’ll need to tap into the API in one form another? I was thinking this could potentially be accomplished via an IPaaS solution, but I’m hoping to hear some other ideas.\nThanks in advance!",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-08-31 13:43:22"
      },
      {
        "time_stamp": "2020-08-31 17:34:05"
      },
      {
        "time_stamp": "2020-08-31 19:06:03"
      },
      {
        "time_stamp": "2020-09-01 10:39:49"
      },
      {
        "time_stamp": "2020-09-03 15:37:52"
      },
      {
        "time_stamp": "2020-09-03 15:38:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-08-31 13:43:22",
    "text": "using csv files, you will likely need to do manual import of contacts.. you won’t be able to upload contacts via ftp.\n\nWhy do they want to “avoid developing on the HubSpot api”\n\nDepending on what their proprietary database is, they might be able to use an ipaas, but if it is really one of a kind, they are going to need some sort of api built"
  },
  {
    "poster": {
      "poster_name": "Sena McCarthy",
      "poster_handle": "sena"
    },
    "time_stamp": "2020-08-31 15:15:36",
    "text": "Hi All - Hope you are well. This is partly an email templating question &amp; partly an API question. Do you know id the custom fields set up in a market email template can be set though a marketing email API endpoint? And then secondly, when custom objects are rolled out will they be available as a 'select' field when creating an email tempate?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-31 15:16:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sena McCarthy",
      "poster_handle": "sena"
    },
    "time_stamp": "2020-08-31 15:16:57",
    "text": "Looking at the Clone Email endpoint docs and it doesn't look like I can change any of those custom field values <https://legacydocs.HubSpot.com/docs/methods/cms_email/clone-a-marketing-email>"
  },
  {
    "poster": {
      "poster_name": "Jeremy Hong",
      "poster_handle": "jeremy785"
    },
    "time_stamp": "2020-08-31 17:34:05",
    "text": "Hey <@U25PYL3Q8>, appreciate the response. Honestly, they just want to avoid development if at all possible, as this is needed for marketing initiatives ASAP, and their developer pipeline is backed up for quite a while.\n\nIf there's a no code/low code solution, that would be ideal.\n\nSo far, it seems like we'll have to do these update imports manually for the moment, as you've already alluded to. :man-facepalming:"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-08-31 19:06:03",
    "text": "I don’t know of any ftp &gt; contacts… I wonder how many other companies run like this and if there would be a market for a product like this"
  },
  {
    "poster": {
      "poster_name": "framelah",
      "poster_handle": "frans.meang99"
    },
    "time_stamp": "2020-08-31 21:01:43",
    "text": "Hi All, I am trying Owners API <https://developers.HubSpot.com/docs/api/crm/owners> , to get owner detail based on ownerId\nbut it response `Error 404 Not Found`\nis any update or any issue the same as me?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-03 15:39:44"
      }
    ]
  }
]