[
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-04-11 03:31:37",
    "edited": {
      "time_stamp": "2024-04-11 03:35:01"
    },
    "text": "<@UD53A9UUR>\n\nSo, a brief update. I have two devs who cannot get it to work even with the approach you suggested above. What steps are available from here?\n\nWe cannot add hubdb in our key score.\n\nIs it an issue that our own account is not currently PRO (hasn’t been for a while though)? It hopefully will be shortly when we roll back into the partner programme"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-11 07:02:07",
    "text": "Hey all! This feels like a cheeky ask but I'm clearly missing something and there is only so much googling and trial/error one can do... but does anyone have any reputable links to videos or even screen recordings that show deploying a project with private app locally? (preferably one that shows how to handle secrets too as this is what I was initially struggling with)\n\nI've managed to deploy via github absolutely perfectly, but don't want to hold secrets there and would prefer to develop locally. Something just isn't working when I try to upload my project and my error is that the project failed validation, even though it is set up in the exact same way as my github repo which syncs with my HubSpot account and works like a dream...?\nHope that is not asking too much, and i really do appreciate any help! I am following the setup in HubSpot but for whatever reason I cannot get it to upload (the private app creates so I know it is at least properly linked to my account, but the project is not created...)",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-11 09:15:36"
      },
      {
        "time_stamp": "2024-04-11 09:20:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-04-11 09:15:36",
    "text": "Hi <@U06H94JKK1P> this youtube video from one of our developers might be what you are looking for <https://www.youtube.com/watch?v=GiGyNxni6oY>"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-11 09:20:19",
    "text": "Thank-you so much! I'll give that a go and hopefully i'll get to grips with this :slightly_smiling_face: Way too many hours on codecademy don't even half-way add up to doing these things alone so I really appreciate it!"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-11 09:39:26",
    "text": "did you submit a ticket yet?\nyou shouldnt have to add hubdb scope to the key as you can see with my above example."
  },
  {
    "poster": {
      "poster_name": "Dario Panev",
      "poster_handle": "dario274"
    },
    "time_stamp": "2024-04-11 15:02:07",
    "text": "Hey HubSpot Developers i have suggestion for you:\nToday i started creating a workflow in which i want:\n1. Contact who filled a form older than 3 months\n2. Clear Property Data `Contact Owner`\n3. Send to my recruiters who are 17 users.\n4. Send for example 3 contacts per day per Recruiter\n5. I have 15 000 contacts older than three month who fill the criteria.\n6. You still dont have option to limit contact enrolls per day per user.\nA think that would be perfect to have it on HubSpot"
  }
]