[
  {
    "poster": {
      "poster_name": "JP Naude",
      "poster_handle": "jpdevtester"
    },
    "time_stamp": "2024-04-01 11:22:13",
    "text": "Hi team, so straight to the point im a freelancer looking to use HubSpot, before I dedicate time on it im curious is it possible:\n\n`Create a page on HubSpot, where the user can customise a 3D model of a car, when they select from a list of car parts it should visually update the part on the 3D model of the car. There are a lot of car companies that do this,`\n\nIs this possible to do on HubSpot? My initial impression of HubSpot is that its really great for creating static content and then swopping it out with variables, classic CMS tool :slightly_smiling_face:  but this seems something a little more complex for HubSpot to handle. Any information would be greatly appreciated :pray:",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-01 11:25:17"
      },
      {
        "time_stamp": "2024-04-01 11:29:35"
      },
      {
        "time_stamp": "2024-04-01 11:39:00"
      },
      {
        "time_stamp": "2024-04-01 11:47:11"
      },
      {
        "time_stamp": "2024-04-01 11:50:26"
      },
      {
        "time_stamp": "2024-04-01 11:59:12"
      },
      {
        "time_stamp": "2024-04-10 05:23:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-04-01 11:25:17",
    "edited": {
      "time_stamp": "2024-04-01 11:26:19"
    },
    "text": "No matter what platform this is developed on, it will require quite a bit of difficult ThreeJS (or other 3d rendering library) development to create a customizable interactive 3d model of car/parts. And this is assuming you already have working 3d models that you can load into the viewer... On the whole, a lot of work.\n\nBut yes, it can be developed as a HubSpot module."
  },
  {
    "poster": {
      "poster_name": "JP Naude",
      "poster_handle": "jpdevtester"
    },
    "time_stamp": "2024-04-01 11:29:35",
    "text": "Thanks Nich for your quick response :pray: Yeah thats a good point, perhaps as a starter just have a static image that gets swopped out but that creates a n*n problem because there can be so many variations :confused: not ideal either.\n\nSo there isnt a limitation to create a react project , use a library like threeJS and import it into HubSpot to run on a separate web page?"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-04-01 11:39:00",
    "edited": {
      "time_stamp": "2024-04-01 11:39:26"
    },
    "text": "ThreeJS does not require react. But yes you can implement on HubSpot as react or non-react– and import 3rd party libraries as needed"
  },
  {
    "poster": {
      "poster_name": "JP Naude",
      "poster_handle": "jpdevtester"
    },
    "time_stamp": "2024-04-01 11:47:11",
    "text": "Yeah react is just more familar to me, I could just run everything on a plain javascript file but would rather not do that. Thanks Nich for all the information :pray:\n\nI just needed to know if HubSpot has any issues running react or a 3rd party library, and it doesnt seem so :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-04-01 11:50:26",
    "edited": {
      "time_stamp": "2024-04-01 11:52:35"
    },
    "text": "Nope, you're good! As long as you know what you're doing. There are few differences to know about running react on HubSpot. I'm certainly not an expert in that area yet, but I would recommend checking this out: <https://github.HubSpot.com/cms-react/>"
  },
  {
    "poster": {
      "poster_name": "JP Naude",
      "poster_handle": "jpdevtester"
    },
    "time_stamp": "2024-04-01 11:59:12",
    "text": "Thanks for the resource :slightly_smiling_face: will read through it"
  }
]