[
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2023-06-16 04:08:25",
    "text": "Have you considered an App and listening to that field by a webhook and push from there?"
  },
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2023-06-16 04:23:12",
    "text": "but doesn’t custom code solve that whole problem?"
  },
  {
    "poster": {
      "poster_name": "Sam Carey",
      "poster_handle": "sam031"
    },
    "time_stamp": "2023-06-16 10:05:14",
    "text": "Hi thomas - Yes to custom code. Chat GPT for the win on this one. // Retrieve data from the custom object\nvar customObjectId = {{customObject.customObjectId}};\nvar customObjectField = {{customObject.fieldName}};\n\n// Update the company object field\nvar companyId = {{contact.company.companyId}};\nvar companyFieldToUpdate = {{contact.company.fieldToUpdate}};\n\n// Perform the synchronization\ncompanyFieldToUpdate = customObjectField;"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-16 10:06:23",
    "text": "That code definitely won't run"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-16 10:06:34",
    "text": "I think GPT is trying to build out a module"
  },
  {
    "poster": {
      "poster_name": "Sam Carey",
      "poster_handle": "sam031"
    },
    "time_stamp": "2023-06-16 10:08:34",
    "text": "It's a baseline, as all first responses are. But at least we know it's doable with custom code"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-16 10:10:49",
    "text": "Yeah while it is possible with custom code, I wouldn't really trust gpt to write it, that code isn't a baseline (it's not even JS (it's some HubL and JS hybrid)). I'll help you write that code or at least help get you an actual baseline if you want."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-16 10:12:38",
    "text": "You're looking to do a couple of things in the custom code.\n1. Get all associated objects with the filter (use the search api for this with the search through associations parameter)\n2. Then update all the custom objects that were returned from the search api, with the company select property. (Definitely want to use the batch endpoint for this)"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-06-16 10:15:40",
    "text": "Not hating on the method of using GPT to get a baseline just want to make sure you know that that code is not even in the right language, so GPT is going to just keep giving crappy answers as you proceed down that path"
  },
  {
    "poster": {
      "poster_name": "Sam Carey",
      "poster_handle": "sam031"
    },
    "time_stamp": "2023-06-16 10:26:58",
    "text": "Understood. Definitely have a real human writing the code. Appreciate the insight."
  },
  {
    "poster": {
      "poster_name": "Calvin Lapp",
      "poster_handle": "calvin990"
    },
    "time_stamp": "2023-06-16 11:33:35",
    "text": "Hello, I am trying to test out a new action for workflows. Currently, I can only see published actions in the workflow using a developer testing account and I would like to be able to test out an unpublished action first.\n\nI have tried to use a developer testing account associated with the same account which is publishing the app and I cannot see the unpublished actions. I have also tried to create a development sandbox environment using the CLI, however when I generate my public access key it does not have the required scopes for creating a sandbox. In another attempt to test out this action I created a dummy app to host the actions so I could test them without worrying about publishing them, however I am unable to use this app in a workflow presumably because it is not published (even though I am in a development test account).\n\nDoes anybody have any recommendations for which steps I should take so I can successfully test out an action before publishing it?"
  },
  {
    "poster": {
      "poster_name": "Amalia",
      "poster_handle": "amalia.reodica"
    },
    "time_stamp": "2023-06-16 15:24:16",
    "edited": {
      "time_stamp": "2023-06-16 15:29:02"
    },
    "text": "I have a custom coded action in a workflow, in the actual action when testing the code works. When contact enroll and goes through the following: does run - no issues, does run - says there is an issue (the error is for a graphQL call and says that the property I’m returning a syntax error but when I retry it within the action it works), doesn’t run/skips the CCA entirely. I’ve escalated this to HubSpot support and they say they don’t support on CCA.\n\nAnyone know what I’m doing wrong?"
  }
]