[
  {
    "poster": {
      "poster_name": "Emma Golborne",
      "poster_handle": "egolborne"
    },
    "time_stamp": "2023-06-21 08:30:12",
    "edited": {
      "time_stamp": "2023-06-21 08:31:04"
    },
    "text": "Our Custom Workflow Actions are what we call them now. Here you go: <https://developers.HubSpot.com/docs/api/automation/custom-workflow-actions>"
  },
  {
    "poster": {
      "poster_name": "Emma Golborne",
      "poster_handle": "egolborne"
    },
    "time_stamp": "2023-06-21 08:30:31",
    "text": "I think we can make that a lot clearer though, so thanks for pointing out that confusion!"
  },
  {
    "poster": {
      "poster_name": "Michael Taggart",
      "poster_handle": "mtaggart"
    },
    "time_stamp": "2023-06-21 08:52:34",
    "edited": {
      "time_stamp": "2023-06-21 08:53:13"
    },
    "text": "Thanks for the reply! The Custom Workflow Actions can only be accessed with an Operations Hub Professional HubSpot account right?\n\nThe Custom Workflow Actions is only able to be created with the Custom Code action?"
  },
  {
    "poster": {
      "poster_name": "Michael Taggart",
      "poster_handle": "mtaggart"
    },
    "time_stamp": "2023-06-21 09:01:04",
    "text": "Nevermind. It looks like I can add them to the application that we already have."
  },
  {
    "poster": {
      "poster_name": "Chris Amoroso",
      "poster_handle": "chris.amoroso.petalfa"
    },
    "time_stamp": "2023-06-21 12:06:33",
    "text": "Hey all,\nPretty new to building custom code in workflows and I have a few questions.\n1. I am trying to write custom code (in Python) for an action that makes changes to a property in an object outside of the object that the workflow is based in. What would be an example of a script for that?\n2. For purposes of referencing objects/properties outside of the object the workflow is based in, is there a \"glossary\" anywhere that shows how all current objects and properties should be written in custom code? \n    a. For example, a custom object named \"Brand Feedbacks\" obviously can't have a space in it when referencing it in code. Would it need to be written as \"brand_feedbacks\"? (Also, as there are singular and plural versions of the object name, which version would need to be used when writing the code?)\n3. If I wanted to aggregate a filtered list of names in the current workflow and use those values to replace the dropdown options for a property in another object, is that possible? If so, what would be the correct syntax to reference those dropdown options in the script?\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Scott Burton",
      "poster_handle": "scott.burton"
    },
    "time_stamp": "2023-06-21 12:27:58",
    "text": "Crossposted from General, this is probably the more appropriate forum."
  }
]