[
  {
    "poster": {
      "poster_name": "Matt",
      "poster_handle": "mtunney"
    },
    "time_stamp": "2023-08-03 10:31:58",
    "text": "Is there any documentation for creating custom modules and layouts for drag and drop emails?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-03 11:16:55"
      },
      {
        "time_stamp": "2023-08-03 11:51:17"
      },
      {
        "time_stamp": "2023-08-04 10:12:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-03 11:16:55",
    "text": "There isn’t specific documentation — it mostly follows the same process as creating website theme modules, but with additional restrictions. Both the CLI and Design Tools will _typically_ warn you if you try to use a feature that isn’t available for use in email.\n\nThere are a few big things to know when making modules for email:\n• Neither `require_head` or `require_css` work in the context of the email builder, but they will not produce an error or warn you.\n• CSS styles all need to be inlined, either directly or through the use of the `data-hse-inline=\"true\"` attribute on your `&lt;style&gt;` tags (you’ll still get a warning about style tags in the editor, however). \n• Any sort of responsive layout shifting will need to be accomplished by way of copying the generated layout classes used by the page builder, if you want consistent appearance in clients that don’t support inline style tags (see: Gmail)\n• Email modules don’t support the use of the Styles tab, so any fields which are only supported as Style Fields cannot be used.\nThere is no way to create custom layouts for the dnd builder, unfortunately."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-08-03 11:51:17",
    "text": "HubSpot I believe is working on this for their DnD editor, but in the meantime I did write up this blog post last year. It’s not fully DnD, but it gets you pretty close: <https://www.courtneyfantinato.com/custom-HubSpot-email-template/|https://www.courtneyfantinato.com/custom-HubSpot-email-template/>"
  }
]