[
  {
    "text": "Hello all!\nI’m new to HubSpot and all it offers, and discovered this slack community via suggestion, hopefully someone can help me figure out my issue. I’ve been given a design to create a landing page for the site, I used one of the landing page templates to start off and then the drag-n-drop interface in HubSpot to add content. I was able to add styles to background colors and some page elements but now I really need to access the html and css of the page I build, and I know there is design tools section in HS but I can’t seem to find how to export my created landing page to design tools to tweak html/css.\n\nAm I missing some step or functionality in order to accomplish that? Hopefully someone here can point me in the right direction.\nThanks!",
    "time_stamp": "2020-11-18 10:45:35",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-19 23:10:21"
      },
      {
        "time_stamp": "2020-11-24 12:37:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Audrey",
      "poster_handle": "audrey"
    },
    "time_stamp": "2020-11-18 13:19:05",
    "edited": {
      "time_stamp": "2020-11-18 13:19:41"
    },
    "text": "Hey everyone! Has anyone had any experience building a horizontally scrolling site in HubSpot?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-18 22:18:06"
      },
      {
        "time_stamp": "2020-11-19 10:56:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dan.wong"
    },
    "time_stamp": "2020-11-18 22:18:06",
    "text": "never tried it in HubSpot, but you can always use plugins like:\n\n<https://alvarotrigo.com/fullPage>\n\n<http://scrollmagic.io/examples/advanced/section_slides_manual.html>\n\nwhich will handle it for you. Personally I don't like it due to the fact you're limited to 100vh for all your content on 1 page so unless it's more of a show page with minimal content, it's not really suitable."
  }
]