[
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-10-01 01:06:37",
    "text": "As you can see the properties do not exist, because ticket properties differ from properties of contacts an that mean you have different endpoints. So what exactly are you trying to do?\n\nso see which properties you can assign for the different object, you should have a look in the seetings in the UI. Maybe you want to associate a ticket with a contact then you should have a look in the associations API.\n\nBut maybe first of all you should have a look how HubSpot is working and how to use it as a normal user to understand how to use the API's."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-10-01 01:16:41",
    "text": "Hey,\n\nI want to add fields like contact number, email address, name, userId in the creation api.\n\nI am not getting proper docs to view this.\n\nWould be great if you I get help with the same"
  },
  {
    "poster": {
      "poster_name": "Robert Nagy",
      "poster_handle": "robert.nagy"
    },
    "time_stamp": "2024-10-01 01:52:12",
    "text": "Feedback Submissions API:\nIs there any way to retrieve that actual wording/question of a feedback submission property which was shown to the user? If a user is not careful when setting up the survey they can end up with the internal property name and two labels (property label from the settings which will be the column name returned by the API and the question which they show to the survey participant)."
  },
  {
    "poster": {
      "poster_name": "Tarang Mehta",
      "poster_handle": "tarang"
    },
    "time_stamp": "2024-10-01 04:19:07",
    "text": "Hi All,\nHope you all doing good. I just wanted to know that using the Laravel technology can i customise in the HubSpot it self."
  },
  {
    "poster": {
      "poster_name": "Marcel van Beek",
      "poster_handle": "marcel077"
    },
    "time_stamp": "2024-10-01 06:30:31",
    "text": "Hi all,\n\nFor my HubSpot invoicing app I want to generate sales entries in an accounting tool from HubSpot invoices. So far no problem. Now I want to update the invoices statusses back to HubSpot and that seems to be not possible with the public API. The response I get from the post endpoint is: _“The scope needed for this API call isn’t available for public use. If you have questions, contact support or post in our developer forum.“._\n\nWho can I ask best to enable this API call for my app?\n\nThanks!\n\nKind regards,\nMarcel"
  },
  {
    "text": "Hi there !\nI’m looking for an API listing of all the companies to which a contact is associated, and information about the date on which the association was made for each of the companies.\nDo you have any idea which endpoint to use? Example here where I would like to have something like Association date. It is available in the UI in HubSpot, so I hope there’s a solution to have it by API.\nThanks in advance !",
    "time_stamp": "2024-10-01 10:13:36"
  },
  {
    "poster": {
      "poster_name": "Annie Short",
      "poster_handle": "annie.short"
    },
    "time_stamp": "2024-10-01 14:27:50",
    "edited": {
      "time_stamp": "2024-10-01 14:29:38"
    },
    "text": "<@UDA553DRD> Hi! Does anyone know if there was some sort of change to the deal 'amount' property? I have a subscription set up to watch for changes in the property, which sends a webhook to a scenario in our Make (formerly Integromat) account. Earlier today, that sync was absolutely flooded with triggers from apparent 'amount' updates on deals but with no actual change to the amount value. Any thoughts on why this might have occurred? I had to unsubscribe to property changes of this type in order to prevent the 429 errors that were happening in our sync."
  },
  {
    "poster": {
      "poster_name": "Matt Kim",
      "poster_handle": "makim"
    },
    "time_stamp": "2024-10-01 14:42:15",
    "text": "Hi Dennis, if you're still interested in something similar to the Engagements API where meetings would also appear in an integrated calendar, feel free to DM me, I have some more information for a private beta that we could add you to!"
  },
  {
    "text": "Hello! Does anyone know if there is a read only version of the tickets scope? e.g. crm.objects.tickets.read\nThank you :)",
    "time_stamp": "2024-10-01 17:01:48",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-02 07:35:55"
      },
      {
        "time_stamp": "2024-10-02 09:25:41"
      },
      {
        "time_stamp": "2024-10-02 14:26:19"
      },
      {
        "time_stamp": "2024-10-02 18:59:18"
      },
      {
        "time_stamp": "2024-10-04 06:42:37"
      },
      {
        "time_stamp": "2024-10-04 07:35:57"
      },
      {
        "time_stamp": "2024-11-12 19:49:35"
      },
      {
        "time_stamp": "2024-11-14 07:26:58"
      }
    ]
  }
]