[
  {
    "text": "Based on the documentation, there’s not granular scope. Just `tickets`",
    "time_stamp": "2024-10-02 07:35:55"
  },
  {
    "poster": {
      "poster_name": "Cyril KUZNETSOV",
      "poster_handle": "cyril.kuznetsov"
    },
    "time_stamp": "2024-10-02 07:58:09",
    "text": "I have exactly the same problem ! Can't import properties under \"Contact\" while importing Deals. <@U05QGQ7LUVB> do you know how to deal with it  ? =)"
  },
  {
    "text": "Hello everyone, I have a question regarding the `associationChange` payload related to changes in a company that I receive via a webhook. As you can see, I have set up the webhook to be triggered when associations within a company change. After modifying a deal (specifically, deleting its association with a company), I noticed in the console that two events are sent: one with `changeSource: 'JOB'` and another with `changeSource: 'USER'`. I would like to understand why this happens. Thanks!",
    "time_stamp": "2024-10-02 08:23:42",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-02 09:27:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Vasilis Papageorgiou",
      "poster_handle": "vasilis.papageorgiou"
    },
    "time_stamp": "2024-10-02 08:38:36",
    "edited": {
      "time_stamp": "2024-10-03 04:29:20"
    },
    "text": "Hi all\n\nWe have built a .NET C# client implementation wrapping the HubSpot API for CRM objects for our internal integration with HubSpot when it comes to using the Web API to query/update CRM.\nI now want to use NSwag to generate a proxy client for .Net to the File Manager API to access folders and files. In order to do that I need the OpenAPI specification. I cannot get this cause I do not have the correct API url for the File Manager. This has not been an issue for bespoke or build-in CRM objects like Contacts, Deals, Companies etc. Do I need to build my own client for the file API?\nAny help would be appreciated.\n\nMany thanks in advance for your time and help :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-10-02 08:51:30",
    "text": "yes. You have to use 2 different endpoints. the deal endpoint to import deals and the properties-api to create properties or the contacts-api to create contacts with defined properties."
  },
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-10-02 08:51:55",
    "text": "just check this out:\n\n<https://developers.HubSpot.com/docs/api/overview>"
  },
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-10-02 08:52:12",
    "text": "for all the things you wanna do with the HubSpot api"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-10-02 09:10:05",
    "text": "I believe you can use this: <https://legacydocs.HubSpot.com/docs/methods/email/get_events>\n\nAt least that's what I am trying to use. I am struggling to figure out how to connect an email event (or campaign) back to a deal and not just a contact/recipient. Does anyone know if that's possible?"
  },
  {
    "poster": {
      "poster_name": "Elroy",
      "poster_handle": "elroy"
    },
    "time_stamp": "2024-10-02 09:24:05",
    "text": "Hi All, Does anyone know if it is possible to deactivate a HubSpot user via the HubSpot api?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-02 09:30:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Fyfe",
      "poster_handle": "james207"
    },
    "time_stamp": "2024-10-02 09:25:41",
    "text": "Thanks Justin! Do you know who or where we can request a more granular approach for tickets?"
  },
  {
    "text": "",
    "time_stamp": "2024-10-02 09:27:53"
  },
  {
    "poster": {
      "poster_name": "Elroy",
      "poster_handle": "elroy"
    },
    "time_stamp": "2024-10-02 09:30:48",
    "text": "Found this - <https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1689092911216429>"
  },
  {
    "text": "Hi everyone,\nWe have also an issue with API intergration, specialy with Contact Data.\n\nWe can import deal like you can see at the top but when we try to integer the contact data, we have issues.\n\nCan someone help me on this issue ?",
    "time_stamp": "2024-10-02 09:36:11"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-10-02 14:26:19",
    "text": "Hey <@U05RHRA9KL6> right now the Documentation doesn’t have the ability to submit feedback. I’ve been told they are working on it.\n\nBut you can share your feedback directly with <@U03MLCLS5BN> and we can pass that information along to the right team."
  },
  {
    "poster": {
      "poster_name": "Molly Webb",
      "poster_handle": "molly695"
    },
    "time_stamp": "2024-10-02 16:30:27",
    "text": "Is there a way to delete individual Custom Event conversions? Preferably programmatically, but I'd also be fine with doing it via the UI. I had some code create a few duplicates and I really don't want to have to delete and redo the entire event."
  },
  {
    "poster": {
      "poster_name": "Molly Webb",
      "poster_handle": "molly695"
    },
    "time_stamp": "2024-10-02 16:34:28",
    "text": "Did you ever find a solution here?"
  },
  {
    "poster": {
      "poster_name": "James Fyfe",
      "poster_handle": "james207"
    },
    "time_stamp": "2024-10-02 18:59:18",
    "text": "Awesome! Glad to hear they are working on this. Thanks <@U03REFNRMB3>\n\nHey <@U03MLCLS5BN>,\n\nOne of our customers has encountered a recurring problem where their users needed to reconnect our app in HubSpot in order to continue using it. This issue requires their Operations Team to grant temporary super admin privileges in HubSpot, causing friction in their workflow and is not ideal. We believe this is because our App requires the tickets scope as mandatory, and there’s a clash with how they'd prefer to set up user permissions.\n\nUpon investigating, we identified that making the ticket scope optional would be one solution, but we can’t do that because our users rely on the Tickets CRM cards. To enable Tickets CRM Cards, the `tickets` scope must be mandatory. If there were a more specific `crm.objects.tickets.read` permission, it would allow us to avoid granting unnecessary broad permissions while maintaining access to Tickets CRM cards for our users.\n\nWe are currently building App Cards using the HubSpot UI Extensions, which might allow us to eventually bypass the need for mandatory tickets scope. However, we are unsure if moving to App Cards would remove this dependency entirely, and it would be helpful to get some context on whether this shift could provide more flexibility in managing ticket-related permissions.\n\nWe would greatly appreciate it if this feedback could be shared with the relevant team, as it would significantly improve the user experience and security management for our customers.\n\nThank you for your time and consideration. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nobuyuki Tsuchihashi",
      "poster_handle": "tsuchihashi.nobuyuki"
    },
    "time_stamp": "2024-10-02 19:08:31",
    "edited": {
      "time_stamp": "2024-10-02 19:10:15"
    },
    "text": "Hello,everyone\nI have some questions about private app.\n\nI’m using a private app (API) to pull data from HubSpot, and I’d like to achieve the following:\n• Get a list of contacts who downloaded from each 'Form' in the marketing section.\n• Get a list of contacts who clicked on each marketing 'Email.'\nI’m running the API using Ruby. Could you let me know if it’s possible to retrieve this data? If so, which specific APIs should I be using?\nAlso, could you advise which scopes need to be assigned to the private app to access this data?\n\n*Goal*\nI want to retrieve contact information for people who interacted with forms and marketing emails in HubSpot—specifically, the contacts who clicked on each email. This will help us identify effective contacts.\n\n*Approach*\n• We’re using Ruby to run the private app.\n• Ideally, we’d like to fetch related contacts in bulk, rather than one at a time.\n*Additional Info*\n• If it’s not possible to get this data via the private app, could you please share how we can retrieve contact data related to forms and emails?\nThank you for your help!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-02 19:28:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nobuyuki Tsuchihashi",
      "poster_handle": "tsuchihashi.nobuyuki"
    },
    "time_stamp": "2024-10-02 19:28:05",
    "text": "By the way, it is currently a legacy API, but it seems possible to get information about form applicants using the API below, but is it possible to do something similar with a private app?\n\n<https://legacydocs.HubSpot.com/docs/methods/forms/get-submissions-for-a-form>"
  }
]