[
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-12-10 12:26:40",
    "text": "<https://app.HubSpot.com/l/product-updates/all?query=journey%2520aut&amp;update=13962290>"
  },
  {
    "text": "Says not found :thinking:",
    "time_stamp": "2024-12-10 12:30:34"
  },
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2024-12-10 12:31:09",
    "text": "Was think maybe they build my idea haha"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-12-10 12:31:51",
    "text": "Journey Automation for Marketers\nNovember 19, 2024\nWhat is it?\nJourney automation enables you to map out, create, and optimize an end-to-end marketing experience for your customers, from new contact to lead to evangelist—all within the same view. You can specify an overall outcome of the journey, and then easily configure behavior-focused stages that aim to move contacts along it. Contacts may drop out along the way if they aren’t successful, or they may move through it faster if they engage more.\nJourney automation is in a very early private beta so we recommend testing it out with test contacts first. And while we have more features coming, we'd love to hear feedback about the new tool so far. Please share any and all feedback through the \"Share Feedback\" link on the bottom left corner of your journey in HubSpot.\nFor more information and a demo of the tool, you can watch this <https://www.loom.com/share/ff8705b63a23435c8af2b58d27a138fb?sid=b1850566-264f-4844-9251-405f0f83071b|loom>. Or, view this <https://knowledge.HubSpot.com/workflows/use-journeys|Knowledge Base article >(password: Workflows_196965).\nWhy does it matter?\nThrough omni-channel messaging, behavioral events, and robust reporting all in one place, journey automation makes it easier to send the right message to the right customer, at the right time.\n• Build an end-to-end marketing automation experience. Instead of building across a handful of workflows, you can now build out any of your marketing strategies—including lead generation, lead nurturing, or customer re-engagement campaigns—all within the same view.\n• Analyze and report on your marketing automation efforts. You can segment your customers and answer high-level questions like \"what percentage of customers are moving towards the high-intent stage and what percent seem to be going to low-intent\" to more specific questions like \"how long does it take for customers to open this email\" or \"within this stage of the journey, where are most customers dropping off\".\nHow does it work?\nTo access journey automation, go to Automation in the navigation, and click on Journeys.\nJourney Setup\n• To set up a journey, pick the segment (list) of customers you wish to create a journey for, as well as the property you will use to enroll them in different stages of the journey. For example, you could use Lead Status, your own custom property, or the Journey Stage property to create different experiences for your contacts at each stage.\n• When a contact has a certain property value, it will enroll in that stage of the journey.\n• Next, select what the successful outcome of your journey will be (e.g. Qualified).\n• Now that you know who your journey is for and what the purpose of it is, you can start building out the different stages of your journey. Each stage of the journey is essentially a workflow, aiming to help nurture and engage with your contacts to move them along the path to that successful outcome.\n• For each stage, you can determine what happens if customers are successful or unsuccessful.\n• HubSpot will automatically create different paths in the journey for you to create different experiences for re-engagement.\nCampaign Association (coming 11/25)\n• When creating the stages of your journey, you can associate them to a campaign. This makes it easier when choosing assets for the stage.\nPerformance Metrics\n• Once your journey has been turned on, you can review high-level metrics of how contacts are moving through the different stages of the journey.\n• You can see how many contacts entered and completed each stage, what percentage went down the successful path of the journey, and what percentage dropped out of the journey at each point.\n• Similar to workflows, you can also go to the details page of the journey to review additional metrics and review your action and enrollment logs.\nAutomated Customer Journey Reports (coming 11/25)\n• For each stage of your journey you can automatically generate a customer journey report. With the customer journey report, you can visualize how contacts are moving through the stage, where they drop off, along with other useful metrics like time between actions, etc.\nWho gets it?\nMarketing Enterprise"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-12-10 12:32:09",
    "text": "Marketing Enterprise only for now"
  },
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2024-12-10 12:41:25",
    "text": "wowowow so cool - this will be a game changer for companies managing large amounts of leads"
  }
]