[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2022-09-12 07:43:06",
    "text": "Is there a way to set the dark editor to default on a module for rich text?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-09-12 07:59:20"
      },
      {
        "time_stamp": "2022-09-12 08:02:05"
      },
      {
        "time_stamp": "2022-09-12 08:06:48"
      },
      {
        "time_stamp": "2022-09-12 08:12:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Logan Allen",
      "poster_handle": "lallen"
    },
    "time_stamp": "2022-09-12 07:59:20",
    "text": "Hey Scott, there is not at the moment.\n\nFollowup question — would you find it beneficial to set that in the module metadata? Meaning that module, regardless of which page it’s added to, defaults to the dark editor?\n\nOr would it be beneficial for the module to _persist_ the dark/lite editor mode which the marketer chooses while editing?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-09-12 08:02:05",
    "text": "Hi Logan, i think it would be good to still have the ability to toggle lite/dark, but also to \"lock it to dark mode\" in the metadata."
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2022-09-12 08:06:48",
    "edited": {
      "time_stamp": "2022-09-13 01:10:27"
    },
    "text": "Hey <@UN0NUBU3S> It would be great to set that in the metadata. I have a module that uses white text on a dark background, but in the page editor it looks like there is no text added to the richtext field.\n\nTo have the ability to set this on the meta.json would be brilliant then users could see that toggled straight away in the page editor. I think the marketer should still have the ability to toggle this though, as they may use the module on another page and switch out the section background and the richtext colour."
  },
  {
    "poster": {
      "poster_name": "Logan Allen",
      "poster_handle": "lallen"
    },
    "time_stamp": "2022-09-12 08:12:05",
    "text": "Thank you for sharing your opinions! I definitely hear you on this front. I will bring this feedback up with the team to see if we can figure something out."
  },
  {
    "poster": {
      "poster_name": "Adrienne Williams",
      "poster_handle": "adwilliams"
    },
    "time_stamp": "2022-09-12 11:20:29",
    "text": "Hi ! I'm creating an app that pushes modules through the Source Code API to an end users account but I'm seeing \"this module doesn't have any editable options\" ...but the module was made with both configurable content and style fields that haven't been created for the end user. Any advice on how to push the editable content and style fields into the end account would be appreciated!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-12 11:35:27"
      },
      {
        "time_stamp": "2022-09-13 08:04:40"
      },
      {
        "time_stamp": "2022-09-13 08:15:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adrienne Williams",
      "poster_handle": "adwilliams"
    },
    "time_stamp": "2022-09-12 11:35:27",
    "text": "Im assuming it is because I developed this module in the UI and not via the CLI. the UI doesnt surface the fields.JSON or mets.JSON files so its not included...\nis there any way to download all of these files from the Source Code API?"
  }
]