[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-09-26 04:30:25",
    "text": "No, what do you mean by not working? Not updating globally? Not able to edit?"
  },
  {
    "poster": {
      "poster_name": "Antoine Ravet",
      "poster_handle": "aravet"
    },
    "time_stamp": "2022-09-26 04:31:18",
    "text": "It’s now fixed"
  },
  {
    "poster": {
      "poster_name": "Antoine Ravet",
      "poster_handle": "aravet"
    },
    "time_stamp": "2022-09-26 04:31:57",
    "text": "HubSpot Developers fixed it, it was a problem when you use the following options : Group Field and first child Repeater Field"
  },
  {
    "text": "Hi! First of all I just want to say that I'm new to HubSpot CMS and maybe I've missed something, but here it goes\nI've been testing out this starter: <https://github.com/ozguruysal/HubSpot-tailwind>\n\nBut I have an issue when developing any new templates (module, page, global, etc.). Because when I create a module locally and it I want to preview it, the tailwind-css isn't included\nWhen I add the module on a page or previewing that page, the css is included as intended. Is it possible to make the tailwind-css be included in a module-preview?\nThe first image show how it looks in the module-preview and the second one is the preview of an page when using the module.\n\nI guess I somehow have to include the global CSS in each module when previewing or something to get the css to work. Because the class is there, but the css in the main.css-file isn't loaded when previewing an module/template-file\n\nAnyone have any suggestions? Developing using Tailwind is pretty much useless if this isn't possible? Since I have to create a new module for each change I want to test",
    "time_stamp": "2022-09-26 05:58:11",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-09-26 06:08:21"
      },
      {
        "time_stamp": "2022-09-26 06:08:39"
      },
      {
        "time_stamp": "2022-09-26 06:08:49"
      },
      {
        "time_stamp": "2022-09-26 08:19:47"
      },
      {
        "time_stamp": "2022-09-27 00:13:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-26 06:08:21",
    "text": "How are you testing the preview? In design manager the module preview with preview options? That preview is trash. \n\nYou can add the tailwind css as a dependency in the module and that should help it through there. That preview only loads your module. Hence it being trash as no one builds in a vacuum. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-26 06:08:39",
    "text": "Add your module to a page and do a page preview "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-26 06:08:49",
    "text": "Is my way of previewing "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-09-26 08:19:47",
    "text": "As decker said this is expected. The module previewer in DM only includes styles that are in the module or included in the module. It won’t grab stylesheets that are global and attached to a layout or template.\n\nI would drop the module in on a page to see how it works out."
  },
  {
    "poster": {
      "poster_name": "Ole-Martin Bratteberg",
      "poster_handle": "ole-martin.bratteberg"
    },
    "time_stamp": "2022-09-27 00:13:28",
    "text": "Thanks for the information!\nTested it and it works OK when doing this :slightly_smiling_face: Not as smooth as a normal local environment development flow, but it works :)"
  }
]