[
  {
    "poster": {
      "poster_name": "Cameron Claffey",
      "poster_handle": "cclaffey"
    },
    "time_stamp": "2020-12-18 09:46:05",
    "text": "Hi Michael,\n\nIt appears that you’re looking at the code for the ‘Site Search Input’ module as opposed to the ‘Site Search Results’ module, which is why you’re seeing something different.\n\nThat piece of code specifically applies for the ‘dropdown’ results that appear below the input field as a visitor types. If you want to see certain results appear in this dropdown you could clone the module and edit the string `'&amp;autocomplete=true&amp;analytics=true&amp;'` to be `'&amp;domain=<http://www.michaelsdomain.com|www.michaelsdomain.com>&amp;autocomplete=true&amp;analytics=true&amp;'`\n\nHowever, for the full results that appear on the Search Results page you would want to clone the Site Search Results module, and follow the steps outlined above (edit the ‘requestUrl’ variable on line 74 and applying the module to the template file)"
  },
  {
    "poster": {
      "poster_name": "Michael Mitchell",
      "poster_handle": "michael.mitchell"
    },
    "time_stamp": "2020-12-18 11:52:22",
    "text": "<@UGWB0PCCV> - Thanks for the quick response!  That is a great help!"
  },
  {
    "poster": {
      "poster_name": "Aaron Dadap",
      "poster_handle": "wesleyadwebster"
    },
    "time_stamp": "2020-12-18 12:39:08",
    "edited": {
      "time_stamp": "2020-12-18 12:53:28"
    },
    "text": "Hi, I have a {% choice %} set up in my HTML and the hubl works great, corresponding to the field.json as well. However, it appears the user on the dropdown will see both options. How do I make a dropdown choice unique to the options of that the user chooses?\n\nI.e - User goes in and has two choices. Choosing 1 choice will open additional option unique to that choice. The way it is set up right now both options displayed in the module UI regardless of choice.\n\nEDIT: When user selects a choice, it does switch to what is rendered. The problem is in the UI both options are displayed. It correctly renders what is selected, just the presentation step is giving both optons instead of choosing one choice to one option\n\nOption = lack of better words, richtext or design field"
  }
]