[
  {
    "poster": {
      "poster_name": "Rodrigo",
      "poster_handle": "rodrigo.castro"
    },
    "time_stamp": "2021-10-20 01:39:50",
    "text": "Hi everyone! just a QQ, Does anyone knows what’s the main difference between a developer sandbox and the currently “new” sandbox on the main site? I have already a pipeline done, but I don’t know if it’s kind of the same type of sandbox or not.\n\nThanks in advance! :)",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-20 07:03:12"
      },
      {
        "time_stamp": "2021-10-25 07:33:46"
      },
      {
        "time_stamp": "2021-10-25 07:44:46"
      },
      {
        "time_stamp": "2021-10-25 08:05:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-10-20 07:03:12",
    "text": "Sorry about the confusion with the naming.\n\nThe new sandbox functionality is basically a clone of your production HubSpot account.\n\nCMS Sandbox is a completely separate HubSpot account.\n\nThe data that _currently_ can be copied into the new sandbox\n•  account tools and features(so HubSpot products you have on your production account is the same on the sandbox)\n• Super Admins from the production account\n• Object definitions - so you can safely experiment with custom objects without affecting real data.\n• Pipelines - including pipelines for deals, tickets, custom objects, but not records currently in those pipelines.\n• Themes, templates, and modules - does not currently sync website content emails or quotes.\nMore detail on\n\n<https://www.HubSpot.com/products/sandbox>\n\n<https://knowledge.HubSpot.com/account/set-up-a-HubSpot-sandbox-account|how to set up a sandbox>"
  },
  {
    "poster": {
      "poster_name": "Erik Pendleton",
      "poster_handle": "ependleton"
    },
    "time_stamp": "2021-10-20 13:16:44",
    "text": "Hi there! I am trying to create a custom object through the API (which works fine). What I am stuck on is associating that new custom object with multiple owners (using a \"HubSpot User\"-type field). Does anyone know if that's possible?"
  }
]