[
  {
    "poster": {
      "poster_name": "Abdulrahman Hegab",
      "poster_handle": "abdulrahman.hegab"
    },
    "time_stamp": "2021-10-29 07:32:58",
    "text": "Hello everyone , I'm quite new to using HubSpot and I want to make a website page where it displays a marketplace with cards in it that gives brief info about an item however when clicked on this card it will redirect you to another page with full information and an option to try this item.\n\nthe twist is that I want the content creator to be able to add a card or remove or edit any card &amp; the page that the card redirects to.\nwhat is the best approach for doing something like that ?\nI was wondering if there's a way that the content creator can just create the page with the full details and somehow in my html file\nI can loop through all the pages created by the content creator and then display a card module with some of the info in the marketplace page.\nis this possible ? and if there exists a related doc it will be really helpful as I'm quite lost. thank you so much",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-29 09:08:44"
      },
      {
        "time_stamp": "2021-10-29 09:10:03"
      },
      {
        "time_stamp": "2021-10-29 09:31:07"
      },
      {
        "time_stamp": "2021-10-29 11:01:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2021-10-29 09:08:44",
    "text": "Sounds like you would want to use a HubDB to collect all the data, which each row can display in full page view (dynamic pages option), and the main html page can be a listing in card format of those items"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2021-10-29 09:10:03",
    "text": "There are some examples of these types of content type interactions on their code gallery: <https://designers.HubSpot.com/code-gallery/projects/hub-db>"
  },
  {
    "poster": {
      "poster_name": "Abdulrahman Hegab",
      "poster_handle": "abdulrahman.hegab"
    },
    "time_stamp": "2021-10-29 09:31:07",
    "text": "thank you very much, this is very helpful, just to make sure will each \"dynamic page\" be accessed with a unique URL and be shared without clicking on the card ? as I would want the page to be shared using url as well"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2021-10-29 11:01:44",
    "text": "yes, when you activate the “dyanmic page” option, hubdb puts in the “Page path” which essentially accepts a slug, so when you create webpage, and connect the HubDB to that page, the slug acts as a separate page but all connected to the same Hubdb, here is a reference doc to help: <https://developers.HubSpot.com/docs/cms/data/hubdb>"
  },
  {
    "poster": {
      "poster_name": "Tom Cella",
      "poster_handle": "thomas.cella"
    },
    "time_stamp": "2021-10-29 12:02:53",
    "text": "Hi Everyone - Simple question from a non-developer who now owns a HubSpot Marketplace App. How do I de-list it from the HubSpot Marketplace? I will be working with a developer to make some code changes and re-brand the app, but in the meantime I would like to de-list it. Any help would be greatly appreciated!"
  },
  {
    "poster": {
      "poster_name": "Felipe Felix",
      "poster_handle": "felipefelix"
    },
    "time_stamp": "2021-10-29 13:07:59",
    "edited": {
      "time_stamp": "2021-10-29 13:11:14"
    },
    "text": "Hello everyone!\n\nI’m trying to build an app - or anything else - to rotate HubSpot records (probably Deals) to owners of a specific team. However, my use case requires that the owner must be online at the time he is assigned to the record, as this will be used to make him responsible for taking an action in a very short SLA (around 1 hour).\n\nIf I assign an offline owner we will breach our SLA with our customers :disappointed:\n\nThe record will be rotated among a team of people, however the working hours of each employee are very different, as well as the working days. At some times we will have only one employee working while at other times we have more than 6.\n\nAnyone have *ANY* idea of how to solve this problem? With HubSpot build-in Workflow action to rotate leads I just *CAN’T* do it right now in a good way.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-29 13:08:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Felipe Felix",
      "poster_handle": "felipefelix"
    },
    "time_stamp": "2021-10-29 13:08:51",
    "text": "I searched HubSpot documentation and didn’t find anything related to get a user status (online or offline)."
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford182"
    },
    "time_stamp": "2021-10-29 13:26:40",
    "text": "Hello! Is there still no way to move a website from one portal to another? We have a couple portals that we’re merging. I know we can of course moves all the files (themes, modules, etc) but all content pages have to be rebuilt, correct?"
  }
]