[
  {
    "poster": {
      "poster_name": "Gregory Cornelius",
      "poster_handle": "gcornelius"
    },
    "time_stamp": "2019-08-29 08:26:09",
    "text": "while it doesn’t work in all cases (for example, drag-and-drop templates), i’d recommend finding ways to use a workflow where each developer uses a separate developer sandbox portals when running `hscms watch` and then to only upload changes to the PROD portal when they are ready using `hscms upload`. if you hit problems with using dev sandboxes, we’d love to know."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-08-29 08:29:50",
    "text": "We are using a \"staging\" portal to work on... we would love to have individual dev portals, but in most cases we need to have the rest of the context of the site (page content, blogs, menus, etc) instead of working in a vacuum."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-08-29 08:31:15",
    "text": "In fact, next week I'm slated to work on a script to essentially clone our production portal content to other portals... I'm really anxious about all the IDs though that seem to be different across each portal.  Has anyone done anything like this before?"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-08-29 10:26:17",
    "text": "<@U6W3H6YN8> <@U22VBL87M> Thank you for your insight! After doing some experimentation looking into this problem through the lens of the DM, local dev, ftp, and the API, it seems as though every time you create a new module it auto-generates a new \"ID\" value that I can't edit with any tool available.  Is that correct? And is that the case for everything (blogs/posts/pages/templates etc)?  I think even better than making things path-based would be to expose that ID to us and let us define it. Is that possible?"
  },
  {
    "poster": {
      "poster_name": "Gregory Cornelius",
      "poster_handle": "gcornelius"
    },
    "time_stamp": "2019-08-29 15:58:57",
    "text": "Defining the ID yourself is not really feasible, but the problems your describing are all things that we’re thinking about and working on. If you’re working with coded templates, you should never need to worry about the ID for modules."
  }
]