[
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2019-08-14 02:35:22",
    "text": "Anyone using Webpack, SCSS and Gulp with local HubSpot dev yet? We just finished a stack using these tools. We create a dist folder using gulp with all our compiled files. Only problem we have is that we can not sync from HubSpot to local, because we would have to decompile all the files. Guess that isn't really a problem because when we develop for WordPress it is also a one way sync.",
    "reply_count": 9,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-08-14 10:13:49"
      },
      {
        "time_stamp": "2019-08-14 10:53:26"
      },
      {
        "time_stamp": "2019-08-14 10:59:47"
      },
      {
        "time_stamp": "2019-08-15 02:18:57"
      },
      {
        "time_stamp": "2019-08-15 02:19:13"
      },
      {
        "time_stamp": "2019-08-21 03:57:36"
      },
      {
        "time_stamp": "2019-08-21 09:01:59"
      },
      {
        "time_stamp": "2019-08-21 09:16:57"
      },
      {
        "time_stamp": "2019-08-21 09:30:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2019-08-14 02:35:54",
    "text": "Probably the best thing about local hub development is that we can finally start using React / Preact in HubSpot."
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2019-08-14 02:37:12",
    "text": "Anyone using React / Vue in HubSpot? What are your experiences?"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2019-08-14 02:43:09",
    "text": "I guess this isn't possible yet, because there is no way to use the data from your existing portal in the Local HubSpot Server. Would really love to be able to build a project local with the Portal data before syncing with HubSpot. As most local &gt; staging &gt; production development cycles."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-08-14 10:13:49",
    "text": "That's why I opted for a PostCSS workflow instead of SCSS, I find it easier to just always work with processed CSS and build on top rather than deal with source vs prod versions. Still get all my nifty nesting and imports, but also get awesome stuff like media query packing and auto px2rem conversion."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-08-14 10:14:27",
    "text": "There's a couple of us, none with really a good repeatable workflow though I'd say. check out <#CM9UXHWKH|js-frameworks-in-HubSpot-cms>"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-08-14 10:16:18",
    "text": "I love Vue, but even when trying with local dev, I just don't see it being practical to use the CLI approach. If I use it, I use it more as a jquery replacement so I can do more object-oriented \"applets\" instead of writing a bunch of jquery on click, do this functions."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-08-14 10:53:26",
    "text": "Our team is currently using gulp in a 1-way sync process... our entire local build is housed within 1 folder in the design manager, so we can still use all our legacy templates/modules outside that folder in the traditional way and slowly transition"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-08-14 10:59:47",
    "text": "We also do not use the hs watch or sync commands, because we have 4+ people all working on the same portal and overwriting everything on the portal from someones local build every time the task is run is not ideal. So I used a series of tasks with the help of gulp-cached and gulp-directory-sync to individually upload/delete only the files that are modified in the dist folder while the task is running"
  }
]