[
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-16 13:11:13",
    "text": "Is there a way we can add \"File URL\" as a field? This way you can choose from anything inside the file manager and it will simply output the URL of that file. Saves from having to manually enter in the URL copied from the file manager. \n\nMy client, is basically building a brand repo and they want to be able to do things like offer PDF Downloads and more, I just think it'd be quicker if there was a way to do it with simply selecting a file from the file manager (aside from just images)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-02-19 12:44:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-02-16 13:20:26",
    "text": "If design manager 2 is possible for this client you can do this using a custom module instead, there are file fields now"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-16 13:25:24",
    "text": "this is work being done in HubDB an attached to the record there. I dont think using that field would be able to help on a per record basis as that would only allow adding the file to the page that is hosting the HubDB Code"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-16 14:59:36",
    "text": "Can you spit things out from a hubDB table in groups?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-16 15:07:49",
    "text": "essentially I have the HubDB table and I have a few rows where they have a primary category and a secondary category. I have them spitting out depending on the choice of a primary category from a dropdown menu and then ordered by the subcategory name. What I am trying to figure out is how to add a header to each \"sub-category group\" of items"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-02-16 15:26:22",
    "text": "I think I got it:\n```\n{% set headerVal = \"\" %}\n  {% for row in db %}\n\t\t\n\t\t {% set subHead = row[\"sub_category\"].name %}\n\n\t\t\t{% if headerVal != subHead %}\n\t\t\t\t\t{{subHead}} {% set headerVal = subHead %}\n\t\t\t{% else %}\n\t\t\t\t\t{% set headerVal = subHead %}\n\t\t\t{% endif %}\n\t\t\t\t\n  {% endfor %}\n```"
  }
]