[
  {
    "poster": {
      "poster_name": "Erik Hooijer",
      "poster_handle": "erik.hooijer"
    },
    "time_stamp": "2021-07-19 02:05:16",
    "text": "Agreed."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-07-19 02:25:46",
    "text": "Thank you for the feedback, We really miss this common function. Now the client needs to select pages in a block (and in all locations where this block is used) instead that this will be auto populated, based on where the page is created, especially for sites that use this for cases or projects etc. We tried the blog road, but there we have no way to use/create a block on a normal page where we can use blog post."
  },
  {
    "poster": {
      "poster_name": "Ophir Prusak",
      "poster_handle": "ophir"
    },
    "time_stamp": "2021-07-19 13:39:50",
    "text": "fivetran, stitch, matillion, to name a few"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-07-19 15:42:20",
    "text": "looks like you have a module \"assuage header may 2020\" that you can add it to"
  },
  {
    "text": "Hi All,\nI am quite new to HubSpot and I have got to do something that I have been told by support that it is not possible by using any declarative feature only with custom code.\n However, the documentations are bit complicated for me to understand...\n\nI am trying to use the new action in workFlows. I have custom object 'invoices' in these invoices I have a contact's email address and I basically wants to associated the contact to the invoice.\nThe way I see this happening is as follows:\n\n1- Get invoice(s) that enrolled in the workflow - the invoice has a property with an email address\n2- Get contact with 'x' email address and associate the invoice id to the associated_invoice field in the contact.\n\nI have tried doing it in so many different ways but it does not seem to be working right - I am not even sure which methods to use. I would appreciate a lot if someone could help me, please.",
    "time_stamp": "2021-07-19 17:09:26",
    "edited": {
      "time_stamp": "2021-07-19 17:18:52"
    },
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-20 06:36:33"
      },
      {
        "time_stamp": "2021-07-20 07:21:56"
      },
      {
        "time_stamp": "2021-07-20 07:23:02"
      },
      {
        "time_stamp": "2021-07-20 07:23:24"
      },
      {
        "time_stamp": "2021-07-20 20:18:42"
      },
      {
        "time_stamp": "2021-07-20 20:27:41"
      },
      {
        "time_stamp": "2021-07-20 20:28:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Pedro Henrique Ferreira Cardoso Lima",
      "poster_handle": "pedrohenriquefelima"
    },
    "time_stamp": "2021-07-19 17:19:28",
    "text": "not sure if this is the right channel, if not please. Let me know. Thanks Guys"
  }
]