[
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2021-07-14 08:59:32",
    "text": "If deals are associated you could use this:\n`{{ template_data.quote.associated_objects.deals }}`"
  },
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2021-07-14 09:01:13",
    "text": "from API you would need the list associated objects endpoint:\n<https://developers.HubSpot.com/docs/api/crm/crm-custom-objects>"
  },
  {
    "poster": {
      "poster_name": "Harish Bhutra",
      "poster_handle": "harish.bhutra"
    },
    "time_stamp": "2021-07-14 11:47:00",
    "text": "Hello Everyone,\nWe in our team have been utilizing HubSpot Test account/Portal as a place where we can test our Integrations and train users before allowing them access to the Production HubSpot instance. As the Test portal is primarily for development, we're trying to figure out if we have a way/setting so that Any emails triggered from test are forwarded to a preset list of users rather than the actual recipient, considering that some of the testing involves email with sensitive information.\nIn case there isn't any such functionality available at the moment, would love to know how/if anyone else have dealt with this use-case."
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2021-07-14 11:51:08",
    "text": "Hmm, I’m personally not sure if that’s possible, but you could probably point an email domain at Mailgun with a catch-all rule to forward the messages to your recipient list (then your test users and test contacts would just have `<mailto:user@your-special-email-domain.com|user@your-special-email-domain.com>` addresses)",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-14 11:56:03"
      },
      {
        "time_stamp": "2021-07-14 12:03:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harish Bhutra",
      "poster_handle": "harish.bhutra"
    },
    "time_stamp": "2021-07-14 11:56:03",
    "text": "Thank You for the quick response Adam.\nWell the only problem is that we don't have all our contacts belonging to a single domain and the other issue is that these contacts are being synced daily from our source systems. So your suggestion can be a great last ditch effort, but it'd be a bit more involved than what I was hoping to get."
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2021-07-14 12:03:50",
    "text": "Ahhh, gotcha, semi-live data"
  },
  {
    "poster": {
      "poster_name": "Alex Foster",
      "poster_handle": "alexfost94"
    },
    "time_stamp": "2021-07-14 15:34:37",
    "text": "Hello, I am currently having issues using NPM to install the @HubSpot/cli tool. Is there a certain channel for that or will someone be able to help me out here?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-14 15:50:02"
      },
      {
        "time_stamp": "2021-07-14 16:39:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alex Foster",
      "poster_handle": "alexfost94"
    },
    "time_stamp": "2021-07-14 15:50:02",
    "text": "So trying to follow the setting up the local setup in the dev cert for HubSpot. In the video he uses npm install @HubSpot/cli and directly after that a node_module folder appears with a packagelock.json file is created. This file will not show up after I run this command. Any thoughts?"
  },
  {
    "poster": {
      "poster_name": "Alex Foster",
      "poster_handle": "alexfost94"
    },
    "time_stamp": "2021-07-14 16:39:59",
    "text": "So after some further digging through the docs I realized that I needed to create a master folder for all of my HubSpot projects and install the HubSpot/cli there (which is odd because I was using the global command which I thought that would install globally on my :C drive?). For some reason when I use the command line in VS code it will not respect the hs commands. When I go back out and use the command prompt and use the hs command to install templates in the folder I want to create a project it works. Even when I try to use the hs upload inside VS code it will not work. I finally figured out I have to run all of my cli commands directly from my command prompt. This is not a major issue at this point, but I would definitely like to learn why the hs command will not run from the terminal within VS code."
  },
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2021-07-14 16:46:36",
    "text": "No. This is not what I’m looking for. Think about getting just the articles related to a topic cluster (not a tag)… "
  }
]