[
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-04-22 12:17:29",
    "text": "<@UBFA10FMF> looks like the public_common.js is missing again and that HubSpot has repeated its mistake from last week, taking down our website again."
  },
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-04-22 12:17:51",
    "text": "This is really disappointing."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-04-22 12:18:16",
    "text": "DM me your hubID and I'll re-enable it for you."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-04-22 12:21:37",
    "text": "This appears to only be happening in portals that are depending on `public_common.js` resources for flex sliders, etc. We're determining how to deal with these, depending on the issue, and recommending including the needed resources (flex slider js, etc)  in your files, or move towards HubSpot's built in solutions. I can re-enable this for portals and provide some recommendations in the meantime."
  },
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-04-22 12:23:06",
    "text": "<@UBFA10FMF> isn't it concerning to HubSpot that it is pushing updates breaking customer websites, and not addressing these issues with its customers? I asked last week what HubSpot is doing to ensure that these mistakes don't happen and no meaningful answer was provided. We rely on your platform to run our business, and these events impact HubSpot reliability reputation."
  },
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-04-22 12:23:13",
    "text": "Our Portal ID is 443323"
  },
  {
    "poster": {
      "poster_name": "Ivan Todorov",
      "poster_handle": "ivantodorov"
    },
    "time_stamp": "2019-04-22 12:24:06",
    "text": "We're not happy how this is being handled and the way these issues are being swept under the rug."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-04-22 12:38:57",
    "text": "Thanks for sharing the HID - I’ve gone ahead and re-enabled `public_common.js` for the account. I can understand how this is causing reliability concerns for your customers and I’d be happy to discuss the change further over DM or email, as well as make some recommendations to mitigate the impact. Moving forward, it’s best to rely on javascript files included in your design tools and your file manager. This gives you more control over your site’s functionality and reliability.\nThis work is being done as a way to increase reliability and usability of the tool by migrating to more stable scripts. I apologize for the disruption this has caused, but as this script was not intended to be built on top of for custom functionality, we will maintain the change we are making to remove the file from loading."
  },
  {
    "poster": {
      "poster_name": "Jon Bishop",
      "poster_handle": "jbishop"
    },
    "time_stamp": "2019-04-22 12:54:50",
    "text": "Thanks <@UBFA10FMF> is there a place we can find all of the scripts previously bundled in public_common.js? Would be easier than trying to dissect it ourselves."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-04-22 13:16:11",
    "text": "Definitely, let me put together some info on that- will have it within the hour"
  },
  {
    "poster": {
      "poster_name": "Jon Bishop",
      "poster_handle": "jbishop"
    },
    "time_stamp": "2019-04-22 13:24:37",
    "text": "thanks!"
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-04-22 14:25:18",
    "text": "Heya <@UE40K4VL7>, I updated this doc to outline the included files. You'll most likely just need flexslider, but feel free to let me know if those files don't resolve what you're seeing. <https://designers.HubSpot.com/docs/cos/included-cos-files>"
  }
]