[
  {
    "text": "Please add bottom padding to the settings side nav. The bottom link is always difficult to get to and web previews oftentimes cover it.",
    "time_stamp": "2022-08-10 06:47:33",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-08-10 06:53:01"
      },
      {
        "time_stamp": "2022-08-26 14:58:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-08-10 06:53:01",
    "text": "YES! getting to the settings at the bottom are always a bit of a pain, extra padding would make this much easier to access"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-08-10 10:25:07",
    "edited": {
      "time_stamp": "2022-08-10 10:39:22"
    },
    "text": "Is there a chance of us ever being able to pass in “dynamic” values to module fields? i.e. use JavaScript to query an endpoint to obtain a list of x and generate a choice filled with those values. I understand it’s possible to do this already on our own with compiling our own fields.json file, but I mean natively somehow without a compilation step. Being able to use HubL inherited with values inherited from the module.html in fields.json would also be a pretty good solution; while not “true” dynamic, we could at least pass in values from outside, although, I’m not entirely sure how that would work without causing a circular issue. And that wouldn’t really help the situation I usually want to use it for anyway, where I query an API or whatever to retrieve a list of items, and then want to generate a choice field from it. I would just prefer not to use build compilation tools with HubSpot.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-08-10 11:03:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-08-10 11:03:23",
    "edited": {
      "time_stamp": "2022-08-10 11:05:06"
    },
    "text": "I love this idea, Dustin, and I agree it would be nice to have. I'm not sure how it would be implemented though, and it would probably have to invalidate cache for any pages using modules with dynamic fields."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-08-10 12:09:23",
    "edited": {
      "time_stamp": "2022-08-10 12:09:47"
    },
    "text": "Let us add line breaks to field inline help text. I thought `\\n` worked before, but doesn’t seem to be now at least."
  },
  {
    "text": "*Multiple-Authored Posts Are A Must.* <https://community.HubSpot.com/t5/HubSpot-Ideas/Blog-Authors/idi-p/15089/page/4#comments|The community is getting louder and louder> :eyes:",
    "time_stamp": "2022-08-10 12:48:10",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-08-12 01:59:45"
      },
      {
        "time_stamp": "2022-08-17 08:34:57"
      },
      {
        "time_stamp": "2022-08-17 08:36:59"
      }
    ]
  }
]