[
  {
    "text": "I actually add some custom css to my themes to make the sproket less in the way, as it always hides the mobile navigation, or in this case it would hide the basket",
    "time_stamp": "2022-08-01 02:29:33"
  },
  {
    "poster": {
      "poster_name": "Vanessa BT",
      "poster_handle": "vanessa"
    },
    "time_stamp": "2022-08-01 07:52:57",
    "text": "Hey all. Quick question. I find a limitation for HubSpot in blogs is that you only have tags so unlike WordPress you don't have Categories and tags to work with. Having both helps you to filter down content you are looking for and give you additional options for feeding a collection of posts into a module instead of just a certain tag.\n\nDoes anyone know if or have had success with using the Campaign field as like a \"category\" that you can set up and use it to pull blog posts?",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-08-01 07:56:46"
      },
      {
        "time_stamp": "2022-08-01 10:01:58"
      },
      {
        "time_stamp": "2022-08-02 01:56:35"
      },
      {
        "time_stamp": "2022-08-03 16:19:39"
      },
      {
        "time_stamp": "2022-08-03 16:20:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-08-01 07:56:46",
    "text": "Hi  Vanessa, you could apply 2 tags to it, the second being the \"subcategory\" then filter for both tags.  I would advice against using the campaign field for that... if that is not properly documented and communicated, i am sure it could cause a lot of trouble in the future.\n\nThere is also this Blog Post:  <https://www.gonzalotorreras.com/blog/sub-categories-in-blog-posts> from <@U7ADCU3BM>"
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-08-01 10:01:58",
    "text": "Once upon a time long ago...\n\n... as T_ags_ and _Topics_ live in harmony together on an small island called _HubSpot_. But then a dark feature growth behind the horizon. It was the new set of _Hubl_ function to extend the island. And the gods of this small island decided, that there is not enough space for both. So one was choosen to rule all F_ilters_ and the other was send to the depth of the _Template_ tartarus. There it still live, lonely and quietly. We still miss you _Topic_. May you rest in peace!"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-08-01 14:44:00",
    "text": "Just like modules needed accordions/collapsable groups, the add custom object form desperately needs collapsable groups … especially once there is a tall rich text field added"
  }
]