[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-05-07 07:44:56",
    "text": "What is preventing you from using coded files?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 07:45:14",
    "text": "clients want drag n drop"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 07:45:49",
    "text": "as far as the <#CCQSQ2C6L|crankshaft>  framework the hope was to support both coded and drag n drop"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-05-07 07:48:31",
    "edited": {
      "time_stamp": "2019-05-07 07:52:02"
    },
    "text": "From a developers perspective, what would need to change RE: <https://HubSpotdev.slack.com/archives/C960Q64G4/p1556637550201200?thread_ts=1556637270.200000&amp;cid=C960Q64G4> for your clients to reasonably accept having coded files (given they could DnD on the page level), but ensuring you have ample control and the ability to create guardrails as a developer"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 07:53:26",
    "text": "idk if my feedback’s still showing in that drag n drop channel but\n\nWe need controls and access to information on the module side.\n\nSo for example inside our modules we need to have a way to see how many columns wide the module is being displayed at (otherwise we’re in a world of hurt. marketers could say make a module meant to be full width, appear at 1 column wide, then come back at us and go “it looks terrible!” then it’s our fault)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 07:56:35",
    "text": "on top of that apparently groups/nesting can happen in the  regions. This means even just having the column size may not give us enough information as in development of the modules we care how wide the module will appear, we don’t care so much about it’s nested width.\n\nSo perhaps showing the outcome width might be okay, but idk.\n\nThe other big thing is this drag n drop feature further locks us in to the bootstrap 2 grid."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-05-07 08:48:26",
    "text": ":thumbsup: thanks for the insight!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 08:54:08",
    "text": "Also to kinda further nail answer your actual question. Even with the DnD regions, not every template on a clients site will be done with one of those as we see it, just certain templates.\n\nExample - if there’s a template that has a sidebar. it may be difficult to maintain site consistency and styling of that sidebar if the sidebar is a group in the DnD region, as the marketer could drag and resize the group or accidentally delete it etc.\n\nThere are definite advantages to DnD regions but atleast at my company we feel they’re not a be-all-end-all solution. They solve certain problems really well, but can’t solve other problems as well as normal flex columns work"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-05-07 08:56:56",
    "text": ":thumbsup: makes sense. And if in coded files you could make the DnD sections in specific locations (i.e. the sidebar is fixed and normal, but the rest of that row is DnD), you would be more inclined to use them?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 08:57:15",
    "text": "oh I also forgot inside of custom modules we need to have a way to set a min and max width that the modules can be used at.\n\nexample - say I have a parallax banner. it was designed to look great at full width.\n\nIt wasn’t designed to be crushed down to 1 column wide. it would be nice if our min-width setting prevented marketers from resizing below a certain minimum column size or percentage width.\n\nMax width is less necessary but could still be useful.\n\nI would not reduce min-width to a simple “should it be full width, or variable width” because there are circumstances we can’t design for smaller than a certain size, but we can handle a range"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-07 08:59:41",
    "text": "regarding the fixed/locked column solution. I’m not sure… I’d have to see the implementation. I think it’d be too hard for you guys to make it flexible enough.\n\nexample - since it uses the bootstrap 2 grid, it’s going to make the columns stack a certain way responsively. We might want to use css to stack them a different way, and that could cause issues in the editor."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-05-07 11:54:10",
    "text": ":thumbsup:"
  }
]