[
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-05-28 06:09:52",
    "text": "Heya <@UD53A9UUR>, just hopping in here from our end. We monitor this channel consistently, and frequently open up issues based on the ideas posted. If we really like an idea, we’ll start investigating straight away. If you scroll through and look at comments, you’ll see we frequently comment and tag each other.\n\nHowever, for most ideas, *its most effective to have them in the ideas community as well*. It’s easier to get higher level buy in and visibility, but also, they won’t disappear because of the free slack constraints."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-28 06:13:39",
    "text": "Yeah, that was my understanding. Assumed the community forum was the place to be as this is more ephemeral. I. Retrospect, my original comment sounds a little nihilistic."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-28 06:13:52",
    "text": "Must have been in a dark place ;)"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-28 07:56:31",
    "text": "<@UBFA10FMF> how may upvotes does an idea need to have before HS makes a comment on it? Just asking because last year I made an idea how creation of  a data studio connector and its well over 100+ thumbs up with complete silence from HS. (yet some random post about someone wanting a unicorn that was created at the same time had about 15-20 HS people chiming in)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-28 07:58:23",
    "text": "I think it it’s subjective AJ. They look through them and if say an item has 100 votes but doesn’t seem to them like something that fits their current roadmap or would be a lot of work in somethng that could require lots of maintennance over time(integrations tend to be that way) they are likely to put it in their list of things to get to but probably not prioritize highly"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-28 08:04:28",
    "text": "also, unicorns are always prioritized.  dont think you can have a roadmap without them"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-28 08:06:12",
    "text": "totally understand that from a business perspective, but a simple line dropped saying that would suffice. The problem that is created is people see ideas where HS does in fact respond for these situations then when you have ideas that reach a certain upvote limit, it makes it feel like HS doesnt care"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-28 08:06:24",
    "text": "not saying they dont care as I know they do and I myself have submitted many ideas"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-28 08:07:06",
    "text": "but its more the perception of it"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-05-28 08:07:54",
    "text": "if that makes sense"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-28 08:10:14",
    "text": "yea, I totally get it. I suppose if they approached it like the <http://change.org|change.org> or whatever tool it was they had where if you got x signatures to your digital petition the whitehouse would put out an official response. (didn’t mean they’d do said thing but would mean they would atleast acknowledge and  publicly comment on it)"
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-05-28 08:10:54",
    "text": "<@U7SL518D6> is correct- it can vary based on the idea and our current needs. But, unless something is marked as “not currently planned”, it’s still being seen and considered.\n\nI understand what you mean- having an idea out there that’s in demand, but doesn’t have input, can make it seem like that community isn’t being used by HubSpot. At scale, we haven’t figured out how to standardize this yet (meaning, the number of upvotes at which we’ll jump in). However, we do report on the community monthly, and figuring out that sweet spot for resources and visibility is still in the works."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-28 08:12:15",
    "text": "It’s also probably hard in HS’s case because for example most of our dev needs/ideas are likely to always get outshined by Marketers ideas, just due to sheer quantity of people posting."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-05-28 08:34:51",
    "text": "and unicorns"
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-05-28 08:38:15",
    "text": "We do try to evenly weigh upvotes by user base (and we have separate teams for most things!) unless it's unicorn-oriented."
  }
]