[
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-11-13 08:15:01",
    "text": "Hey Delbert, I promised to come back to you with my findings, so here I am - it just took a lot longer than I expected!\n\nAfter a fair bit of back &amp; forth with HubSpot support, it turned out that the discrepancies I was seeing were primarily down to two things:\n\n1. The HubSpot SEO recommendations report is using performance scores for *mobile*, whereas I was looking at Lighthouse and Pagespeed scores for desktop\n2. The SEO recommendations report is using *Lighthouse v8*, whereas I'm using the current version 11 in my Chrome browser. The key factor here is that I believe Lighthouse v8 emulates a slow 3G connection, whereas v11 emulates slow 4G. So even when I compared the HS scores to Lighthouse scores for mobile, there was still a big discrepancy.\nI totally understand the logic behind using scores for mobile (mobile first!) but the fact that the SEO report is using Lighthouse v8 to generate mobile performance scores isn't mentioned anywhere in the report that I can see, or in any documentation that I found. It simply didn't occur to me, and I wouldn't be surprised if it didn't occur to others. Apparently HubSpot are planning to upgrade their tool to use Lighthouse v11, but they didn't give any timeframe for it.\n\nI've suggested that it would be helpful to clarify this in the SEO recommendations report, and in the meantime I've advised my client to disregard performance recommendations in the SEO report.\n\nHope this is useful information for you, and thanks again for your input a couple of weeks ago :grinning:"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-11-13 08:16:47",
    "text": "Oh my gosh! Thank you Sarah, all of that makes a ton of sense now!"
  },
  {
    "poster": {
      "poster_name": "Delbert",
      "poster_handle": "dhermreck"
    },
    "time_stamp": "2023-11-13 08:17:15",
    "text": "I too usually recommend not using the report as the holy grail but instead a starting point"
  },
  {
    "poster": {
      "poster_name": "Sarah",
      "poster_handle": "sarah715"
    },
    "time_stamp": "2023-11-13 08:33:22",
    "text": "yep, this is just another good reason for using multiple tools/resources to assess page performance :slightly_smiling_face:"
  }
]