[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 06:30:28",
    "text": "so guys I was thinking over the weekend on this.\n\nhere’s kind of an ultra slimmed down version of what’s currently in the doc - but would be more doable, would not require people to be sent out within a short period of time to a second conference, and would address the very important problem of providing a good experience for those who could not physically attend.\n\nWe still do presentations - but each person who is presenting pre-records their presentation in advance.\n\nPresentations get livestreamed basically like a playlist. For those at the event we’ll have a projector, for those not at the event you can watch and chat along in real time with the people who are physically there.\nThe presentations would not be done live. The projector however would be showing the exact same stream people who physically couldn’t make it are watching. Enabling people to comment on it in real time.\n\nPresenters could take that opportunity to also do Q&amp;A through slack or the stream’s chat.\n\nThe event would occur at a bar in their “party” space or if HubSpot has a space in their offices we could borrow that would also be cool.\n\nThe one part I don’t have a solution for is Emmets Bar."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 06:35:49",
    "text": "The benefits of this simplified version - no need for microphone, - may still need speakers.\n\nchairs hopefully would already exist at the venue.\n\nBoth online and in-person attendees get a similar great experience, no one is left waiting for a long time to get access to the content.\n\npresenters have already done everything so they don’t need to worry about bringing anything or bringing their A-Game.\n\nNo need hopefully - to rent tables/bars"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 06:36:37",
    "text": "only sponsorship needed would be to reserve the space at the place we go to, and the projector +screen"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 06:40:56",
    "text": "Cons would be video quality for the presentations would vary as presenters may record their presentations in their office/home. having a good microphone would be encouraged."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-06-17 12:03:05",
    "edited": {
      "time_stamp": "2019-06-17 12:04:04"
    },
    "text": "_(was out of the office last week at Partner Day EMEA, just getting caught up here now)_\n\n*First off* - WOW :exploding_head::exploding_head::exploding_head::exploding_head: SO COOL to see this much community collaboration around an event!!! :raised_hands: I'm reading all the messages and reviewing the doc today to get caught up.\n\n*Secondly* - Thank you all for investing your time and brain power to organize this. The HubSpot Dev world is going to be super excited and grateful.\n\n*Third* - We'd (HubSpot) would love to support in any way possible!! We wanted to do an official Dev Day, but needed to put all energy on some other projects (docs v2, website v2, local dev, etc) and didn't have enough time to do an event this year. You all stepped up to make something happen and we want to support it!!\n\n&gt; *Question* :point_right:  Can we organize a meeting this week to sync up on what ya'll are thinking and how HubSpot can support?",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-06-17 12:04:41"
      },
      {
        "time_stamp": "2019-06-17 12:07:07"
      },
      {
        "time_stamp": "2019-06-17 13:34:00"
      },
      {
        "time_stamp": "2019-06-17 13:34:34"
      },
      {
        "time_stamp": "2019-06-17 13:37:59"
      },
      {
        "time_stamp": "2019-06-19 16:11:58"
      },
      {
        "time_stamp": "2019-06-19 16:15:51"
      },
      {
        "time_stamp": "2019-06-20 12:12:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-06-17 12:04:41",
    "text": "I'm reading/commenting in the doc now.... but a meeting would be good to continue the conversation."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 12:07:07",
    "text": "yep a meeting is doable. I would encourage if you have the time to read through <@U25PYL3Q8>’s messages  over the weekend and  kinda the last few messages.\n\nWe’re trying to solve the issue of if someone can’t make it - we don’t want them to have a bad experience. The other thing is we want to make sure this is achievable so limiting how much $$ is necessary to get from sponsors"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-06-17 13:34:00",
    "text": "got it - Let me read through everything today and then tomorrow I'll loop around once I have context.\n\nThen we can try and find a time this week or early next week."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-06-17 13:34:34",
    "edited": {
      "time_stamp": "2019-06-17 13:34:47"
    },
    "text": "I can help push for a room to host it at -and- pitch for sponsorship $$$ from HubSpot. I'm sure we will help with as much as possible. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-17 13:37:59",
    "edited": {
      "time_stamp": "2019-06-17 13:38:39"
    },
    "text": "Sounds good, and as noted in the doc - if $ is an issue I garuntee we can round up some sponsors to offset it. Sounds like Dennis’s friend is a pro at that sort of thing. plus some of our companies may be interested in sponsoring - gets the names out there and whatnot."
  }
]