[
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "subtype": "channel_purpose",
    "purpose": "Share your ideas with the HubSpot product team!",
    "text": "set the channel description: Share your ideas with the HubSpot product team!",
    "time_stamp": "2016-08-30 11:13:11"
  },
  {
    "poster": {
      "poster_name": "eileenk",
      "poster_handle": "eileenk"
    },
    "time_stamp": "2016-08-30 11:13:19",
    "text": "Right now I have the need to transfer a blog from one HubSpot portal to a new HubSpot portal, ideally w/o exporting and reimporting in the new portal. From what I've heard this transfer functionality doesn't exist, so that's a product addition I'd like to see!"
  },
  {
    "poster": {
      "poster_name": "Colby Schneider",
      "poster_handle": "cschneider"
    },
    "time_stamp": "2016-08-30 11:15:53",
    "text": "<@U24PLTUJD> That is an idea request we see often. As of right now, the functionality does not exist. However, I know it’s something that is being experimented with right now. I wouldn’t be surprised if we saw that functionality added to portals someday in the future."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2016-08-30 11:18:21",
    "text": "I really think an XML mapper for blog imports would be great. Often we have issues with wordpress exports having some weird meta data that should be the description or the featured image"
  },
  null,
  {
    "poster": {
      "poster_name": "Colby Schneider",
      "poster_handle": "cschneider"
    },
    "time_stamp": "2016-08-30 11:24:48",
    "edited": {
      "time_stamp": "2016-08-30 11:25:18"
    },
    "text": "<@U25PYL3Q8> That is a great idea! We run into this issues with importing WordPress blogs pretty often in Migration Services. It’s a known issue and there is a push to make the WordPress importer tool even better."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2016-08-30 11:27:02",
    "text": "I'm pretty sure I email about them 3 times a week :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2016-08-30 11:27:19",
    "text": "I've created a few scripts in wordpress to do some better exports"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2016-08-30 11:27:42",
    "text": "I've actually looked to see if the importer was on github to see if I could help with it"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2016-08-30 11:28:46",
    "text": "sometimes clients have \"blogs\" setup as pages as categories and such, and it really messes with how the importer works. So it is either find and replace through files or manually mess with it <@U22PK6XSS>"
  },
  null,
  {
    "poster": {
      "poster_name": "Colby Schneider",
      "poster_handle": "cschneider"
    },
    "time_stamp": "2016-08-30 11:51:32",
    "text": "WordPress imports are definitely tough. Outside of the post title, tags, and body content, there are a lot of different ways custom elements can be added and stored."
  },
  null
]