[
  {
    "poster": {
      "poster_name": "Syeda Nabeela Fatima",
      "poster_handle": "syedanabeelafatima"
    },
    "time_stamp": "2022-11-28 02:53:01",
    "text": "If you are tying for shopity. This is very similar to a micro-influencer campaign we setup last year using dynamic discount codes that work in Shopify, which got triggered by HubSpot. Since the tools are easy to use, we completed this build in about 6 hours with two people. We've run it for a few months, and made over 1,000 variable discounts, so it's proven to be very reliable. Here's the outline of what we did.\n\nStep 1: HubSpot - Setup a workflow to initiate a new discount code\nTrigger: Can be your choice. ( We triggered based on a form fill, but you could easily use a date field )\nAction: Send Webhook. I will come back to this in a couple steps.\n\nStep 2: HubSpot - Add a discount code property to contact records\nSingle line text is the best option. This is where your birthday discount code will go. We called our property \"Influencer Registered Discount Code\".\n\nStep 3: HubSpot - Create a workflow to alert the contact of their discount\nTrigger: Manual\nAction: Send Email. Create a marketing email that will send the discount code. Use a personalization token ( Step 2 ) where you want to place the discount code.\n\nStep 4: Shopify - Get an API key from your shopify account\nYou will need to get an api key for your account, and set permissions to discounts &amp; price rules only. Here is an article on how to <https://help.shopify.com/en/api/getting-started/authentication/private-authentication#generate-credentials-from-the-shopify-admin|get credential from the shopify admin console>.\n\nStep 5: GCP - Build &amp; deploy your new discount code script\nWe use Google Cloud Functions to do this. It is a tool inside the Google Cloud Platform. Without getting too technical, you write about five steps in javascript, click run, and let marketing automation magic happen. The five steps are,\n\n1. Catch the webhook from Step 1\n2. Create a price rule code in Shopify ( this is how the discount code works )\n3. Create a dscount code in Shopify ( this is the actual code the customer gets )\n4. Update the HubSpot contact with the discount code you made ( Update the property from Step 2 )\n5. Enroll the contact in the workflow from Step 3\nHopefully this helps. If you decide to go the shopify route I can provide some example code if you need help on step 5. Good luck!"
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2022-11-28 09:52:27",
    "text": "I created a post in the ideas forum with a more detailed description on this. I would be happy if it would receive some upvotes :wink:\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Date-formatting-in-JS-callback-of-the-related-blog-posts-tag/idi-p/723719/highlight/true>"
  },
  {
    "poster": {
      "poster_name": "Catherine Spain",
      "poster_handle": "cspain"
    },
    "time_stamp": "2022-11-28 11:28:36",
    "edited": {
      "time_stamp": "2022-11-28 11:29:02"
    },
    "text": "Hello! We're a SAAS company looking to replace our current software licensing/subscription management system. Any recs on one that integrates well with HubSpot?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-28 12:32:17"
      },
      {
        "time_stamp": "2022-11-28 12:32:41"
      },
      {
        "time_stamp": "2022-11-28 12:33:26"
      },
      {
        "time_stamp": "2023-01-20 07:35:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2022-11-28 12:32:17",
    "text": "Hey Catherine! What software are you currently using?"
  },
  {
    "poster": {
      "poster_name": "Catherine Spain",
      "poster_handle": "cspain"
    },
    "time_stamp": "2022-11-28 12:32:41",
    "text": "We're using Drupal"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2022-11-28 12:33:26",
    "text": "Sorry... What I meant is what software are you currently using to manage your subscription licensing/subscriptions?"
  }
]