[
  {
    "poster": {
      "poster_name": "Fabio Marchesi",
      "poster_handle": "fabio888"
    },
    "time_stamp": "2022-07-24 10:09:33",
    "text": "Hello. I would like to add a sidebar to my theme base on default boilerplate.\nI create a global partial named sidebar.html.\nMy question is: what is the right place to include the partial sidebar.html? Do I need to add to in base.html or in every template files?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-24 11:32:54"
      },
      {
        "time_stamp": "2022-07-24 12:54:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-07-24 11:32:54",
    "edited": {
      "time_stamp": "2022-07-24 11:42:47"
    },
    "text": "<@U03PM6GFD2N> That depends on the content and use case of the sidebar.\n\n`beginners`\n*Sidebar in _base.html_ with _block_ syntax:*  \nContent can be changed from template. Available position in grid is static. Sidebar visibility is handled from CSS :empty whitespace selector (require custom flexbox layout).\n\n`advanced`\n*Sidebar as _global_partial_ or _module_ include in _base.html_ with _boolean_ wrapper:* \nContent is mostly static. Available position in grid is static. Visibility is handled from template via boolean variable. Variable declared in template are also available in base.html. Fallback in base.html is recommended. Grid columns width need additional check if sidebar is visible. (Unless you don't have a col-auto class like bootstrap)\n\n`professionals`\n*Sidebar directly in _template_:*\nContent is mostly individual. Multiple positions in grid are possible (Think about sections and each has a sticky-top element in the sidebar, that change with scroll depth). Visibility on page is handled by template element. Changes between section with and without sidebar are possible. Combination with full-width banner in content and sidebars at the same time are possible."
  },
  {
    "poster": {
      "poster_name": "Fabio Marchesi",
      "poster_handle": "fabio888"
    },
    "time_stamp": "2022-07-24 12:54:40",
    "text": "TY <@UK9BKNBD5> I will start from \"beginners\""
  }
]