[
  {
    "text": "Hi HubSpot Dev Community. I am facing problems here with emails.\n1. On \"Email\" drag-and-drop editor, as you can see (screenshot 1), all sections has the bgcolor of gray, and white for its container. But when I sent a test email on desktop browser, it doesn't follow the correct styling (screenshot 2). The lower sections, down to the footer, has now a white background instead of gray.\n2. And on mobile (screenshot 3), it doesn't also follow the correct layout. The containers must be 100% in width.\nHope you can help me out! Thanks!",
    "time_stamp": "2020-01-27 17:28:57",
    "edited": {
      "time_stamp": "2020-01-27 17:29:59"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-01-28 13:30:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alec Galvez",
      "poster_handle": "alec.galvez"
    },
    "time_stamp": "2020-01-27 17:31:32",
    "text": "Hi <@U7SL518D6>. Apologies for the late response. I have already resolved this issue. This email was built for a monthly subscription email. And it only filters the posts published for the current month. With that, my client confirmed that they only published 1 post this January."
  },
  {
    "poster": {
      "poster_name": "Alec Galvez",
      "poster_handle": "alec.galvez"
    },
    "time_stamp": "2020-01-27 17:31:53",
    "text": "Thanks for reaching out, by the way! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-01-27 17:43:55",
    "text": "Awesome, thank you for following up, glad to hear you were able to figure it out!"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2020-01-27 23:54:33",
    "text": "Hi <@UJAPS2K4N>, it's not currently possible but I'd love it to be!\n\nHopefully HubSpot are working on a way to allow layout templates and use it to extend a base template so all styles can be edited in one place."
  }
]