[
  {
    "poster": {
      "poster_name": "Bernard hanna",
      "poster_handle": "bernard.hanna"
    },
    "time_stamp": "2019-02-28 04:58:15",
    "text": "I have a number of scripts running on this custom template, how to I remove them on this template only? The default page is fine, I have uses \"Cut\" but for some reason this page built using the layout editor pulls them in from the theme when I add it to additonal header markup<http://www.moonoia.com/db-become-a-partner>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-28 06:13:29",
    "text": "That is odd. And i havent noticed that before. But most of the portals i touch are pro+"
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-02-28 06:51:18",
    "text": "Hey has anyone encountered a WP all export xml output failing to import into HubSpot? Not sure as to whether it’s a missing node or HubSpot doesn;t support the structure. (Only featured images against blogs aren’t being pulled through - there’s 450 :scream:)",
    "reply_count": 10,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-02-28 07:40:01"
      },
      {
        "time_stamp": "2019-02-28 08:42:10"
      },
      {
        "time_stamp": "2019-02-28 08:43:38"
      },
      {
        "time_stamp": "2019-02-28 09:08:45"
      },
      {
        "time_stamp": "2019-02-28 09:46:05"
      },
      {
        "time_stamp": "2019-02-28 10:06:04"
      },
      {
        "time_stamp": "2019-02-28 10:07:42"
      },
      {
        "time_stamp": "2019-03-01 02:54:57"
      },
      {
        "time_stamp": "2019-03-01 07:23:29"
      },
      {
        "time_stamp": "2019-03-03 08:55:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-02-28 07:10:43",
    "text": "Hey <@UAQHN1F2Q> and <@U7SL518D6> this is because marketing starter only can use the newer templates system which allows drag and drop at the email level rather than the “classic” templates that allow drag and drop at the template level only. At this time custom modules aren’t supported for the new dnd editor"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-02-28 07:16:10",
    "edited": {
      "time_stamp": "2019-02-28 07:16:51"
    },
    "text": "<@UFBNA9K9A> Thanks for the insight. I actually did find some info about the Marketing Hub Starter mentioning this, but it's semi-hidden within a tooltip on the *Email Marketing* feature on the pricing page: `Does not include design manager, blog/RSS emails, or multiple CAN-SPAM footers.`\n\nAlso, it's been mentioned in the drag-n-drop-email slack channel that the new drag-n-drop emails would have support sometime down the road for custom templates/styling and custom modules. Is this not the case now?\nI have found on other portals I work with that some of my custom modules are available in the drag-n-drop emails (might not work 100% due to expected styles I have in some coded templates where they're intended for use, but available all the same)"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-02-28 07:20:10",
    "text": "hey <@UAQHN1F2Q> The plan is to support custom modules in the drag-n-drop emails, but that would still be in beta.  Betas are rolled out as percentage basis so we can find bugs or fix usability issues with a smaller group before things get rolled out to a larger group hence why you would have seen this available in some portals, but not others."
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-02-28 07:21:21",
    "text": "Perfect. Thank you. Good info for my company's clients that have already started asking about the new drag-n-drop emails."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-28 07:40:01",
    "text": "did you do a full WP export or export just the specific blog. think to get featured images you have to do full"
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-02-28 08:42:10",
    "text": "Hey Jon, would you think it would be that I would need to manual remove nodes that are ‘pages’ etc then import?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-28 08:43:38",
    "text": "not honestly sure. I don’t do WP to HS migrations super often, atleast not where the client wants the old blogs to carry over.\nI think the main thing is that you need to have all the posts export AND the media library Export in the same bundle"
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-02-28 09:08:45",
    "text": "Yeah, I think it may cause imported pages etc but will test either way as it staging I can remove them if it is the case.\n\nI do have the ability to create custom XML structure but it’s also a bit of a guess at to what HubSpot expects as the WP All export simple XML fails and is dubbed as malformed ‘missing channel’ which was the wrapping node. I adjusted this from data =&gt; channel and post =&gt; item but still has errors."
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-02-28 09:08:49",
    "text": "I created a custom module using a rich text area - and for some reason at the page level, my content editors can’t use the inline editing mode - they can only use the mode of editing in the left hand modules section. Is there something that I need to enable to allow for “inline” page level edits?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-28 09:11:44",
    "text": "they should be able to click on the block, and it would pull out the edit modules pane.\n\ntrue inline editing is not currently possible with custom modules yet, it’s a feature they planned to add a long time ago and it would take advantage of the wrapper spans that are generated around the values of fields in your module that’s why it’s badd to strip those out."
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-02-28 09:12:41",
    "text": "ok - thanks <@U7SL518D6> - so not currently possible"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2019-02-28 09:12:48",
    "text": "appreciate it"
  },
  {
    "text": "Pages won't be imported by the HS blog importer - have tested this multiple times and can be a solution to the no featured images in regular post exports.\nNot sure about the error you're getting, but here's a file known to have an importer-friendly format",
    "time_stamp": "2019-02-28 09:46:05"
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-02-28 10:06:04",
    "text": "Hey James, your file works and if you import the above you’ll get the image within the content just fine but you won’t get the featured image of the blog switch enabled and subsequent featured image attached. I don;t this is supported from what I’ve read but more than happy to proven wrong at this point."
  },
  {
    "poster": {
      "poster_name": "James Cutler",
      "poster_handle": "jcutler"
    },
    "time_stamp": "2019-02-28 10:07:42",
    "text": "Can you link to an imported post and I'll take a look?\nOne thing I'll say is that the importer is pretty fickle, so I may not be able to identify the issue, but happy to take a look."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-28 10:10:00",
    "text": "New channel <#CGM4KH8KG|ecommerce-bridge> <@UFC6BLEAV> <@UCH1L597V> :slightly_smiling_face: Will start spreading the word with HubSpotters and in this community."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-28 10:10:57",
    "text": "<https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1551373847002600>"
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2019-02-28 10:11:51",
    "text": "wow! thanks luke"
  },
  {
    "poster": {
      "poster_name": "Jesus Milano",
      "poster_handle": "jesus.milano"
    },
    "time_stamp": "2019-02-28 10:27:24",
    "text": "Hello, guys, can anyone please share me the doc about: how to list the blog post in a landing(not blog), or in a outside web"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-28 10:29:22",
    "text": "Of course! - now let's work together to make that channel helpful, valuable, collaborative and fun :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nick Montagu",
      "poster_handle": "nick090"
    },
    "time_stamp": "2019-02-28 12:41:08",
    "text": "Hey all,\n\nCan someone DM me a version of an XML template for blog migration that has worked for them? We are having issues with our export format from WP and I need to complete this task before Monday.\n\nAppreciate the help!",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-02-28 13:58:23"
      },
      {
        "time_stamp": "2019-02-28 14:17:56"
      },
      {
        "time_stamp": "2019-03-01 07:10:41"
      },
      {
        "time_stamp": "2019-03-01 15:33:35"
      },
      {
        "time_stamp": "2019-03-03 08:55:52"
      },
      {
        "time_stamp": "2019-03-03 13:18:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-02-28 13:58:23",
    "text": "You can use hubl to list the articles on a landing page whithin HubSpot. outside of HubSpot you need to use a RSS feed reader."
  },
  {
    "poster": {
      "poster_name": "Nick Montagu",
      "poster_handle": "nick090"
    },
    "time_stamp": "2019-02-28 14:17:56",
    "text": "Hi Chad, sorry I might not have been clear about my intention. I want to import (migrate) a blog from Wordpress to HubSpot. The XML upload file we have isn’t being captured correctly in HubSpot and there is no field mapping during this upload. So, I wanted to see if anyone had an XML template that has worked for them in the past."
  }
]