[
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-04-16 08:58:01",
    "text": "Cross posting this announcement here as it’s in regards to this channel: <https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1618585035063500>"
  },
  {
    "poster_handle": "data-driven-content",
    "subtype": "channel_name",
    "text": "has renamed the channel from \"hubdb\" to \"data-driven-content\"",
    "time_stamp": "2021-04-16 09:47:43"
  },
  {
    "subtype": "channel_topic",
    "topic": "Let’s talk everything data-driven!",
    "text": "set the channel topic: Let’s talk everything data-driven!",
    "time_stamp": "2021-04-16 09:50:37"
  },
  {
    "subtype": "channel_purpose",
    "purpose": "As CMS Hub and websites evolve over time, content is becoming more data driven, and that data can exist and be accessed in a lot of different places including HubDB, Smart Content, HubL Functions, and CRM objects. Lets chat all things data driven.",
    "text": "set the channel description: As CMS Hub and websites evolve over time, content is becoming more data driven, and that data can exist and be accessed in a lot of different places including HubDB, Smart Content, HubL Functions, and CRM objects. Lets chat all things data driven.",
    "time_stamp": "2021-04-16 09:51:55"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-04-16 20:33:26",
    "text": "Oh I have done quite a bit of this in the past. It’s pretty common. Honestly - assuming the directory is of a reasonable size - I opt to load everything in initially with hubDB and then show/hide and manipulate the cards using vanilla js. No frameworks needed. \n\nObviously you could make Ajax calls for everything you need. But no need to make network requests if you don’t need to!"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-04-16 20:34:09",
    "text": "But if you’re dealing W a stupid large amount of data then it makes sense to Ajax it and load it as needed. "
  }
]