[
  {
    "poster": {
      "poster_name": "Anya",
      "poster_handle": "anna845"
    },
    "time_stamp": "2020-08-13 03:58:14",
    "text": "Hi guys! Could you please, advise me. We're consideriing the idea of building new project- something like Instagram but for another purposes. Users can send photos and exchange information. All are registered users with HubSpot ID. And we are looking for some solution, some CMS, which could be either added to HubSpot or integrated or whatever, that would allow us to have all the information about the posts, images, comments of this or that specific user.  So, we would be able to see when he posted, what he posted, whose post he commented and what was the comment. Something like this. Thank you.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-13 07:30:47"
      },
      {
        "time_stamp": "2020-08-13 07:30:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2020-08-13 07:27:32",
    "text": "Hey Noel, I think your thoughts are correct here. There is nothing currently in place for theme settings by domain so the alternatives I would think of are likely either two different themes (clone of the original theme) or overriding pieces of the CSS from theme one in theme two via overrides. I might recommend cross-posting in <#CSFGKSHT7|themes> to see if anyone else has come up with other ways of managing this. I'd also recommend sharing your idea suggestion (<https://community.HubSpot.com/t5/HubSpot-Ideas/CMS-Theme-settings-at-the-domain-level/idi-p/350010>) in the cross post as I think it is a great idea and would make managing multiple domains using the same theme much easier/more efficient."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-08-13 07:30:47",
    "text": "Well it sounds like CMS Hub is the right platform for you. It’s HubSpot’s own CMS that directly integrates with all of the other HubSpot products like the CRM.\n\nBecause of the need for membership accounts, and posting and displaying content, CMS Hub Enterprise  would be the ideal fit. It has memberships, and serverless functions which enable you to build truly powerful apps."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-08-13 07:30:51",
    "text": "<https://www.HubSpot.com/products/cms>"
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2020-08-13 13:38:05",
    "text": "Thanks. Still playing around with ideas to find a good solution to make it Marketer friendly. I tried creating a basic theme with just the settings and theme-override.css. and adding this css file under the page stylesheets. This works on the live page. However in the editor preview, it still shows the main theme styling. Thinking this may have something to do with the theme_path parameter added to css file url within the editor."
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2020-08-13 14:55:11",
    "text": "Are the default themes on github?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-14 07:43:20"
      }
    ]
  }
]