[
  {
    "poster": {
      "poster_name": "Felix Müller",
      "poster_handle": "fm"
    },
    "time_stamp": "2020-10-23 03:22:16",
    "text": "Hi there,\n\nI have a question regarding the Challenge and the usage of HubSpot API. On <https://developers.HubSpot.com/docs/cms/marketplace-requirements/compliance-design-code-quality|marketplace requirements> it says, that the theme may not contain \"serverless functions\". What is exactly meant by that?\nFor example: If we want to use the API (V3 / V2) for the blog page - is it conform to the requirements?\n\nCheers",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-23 03:33:38"
      },
      {
        "time_stamp": "2020-10-23 07:59:14"
      },
      {
        "time_stamp": "2020-10-23 08:04:23"
      },
      {
        "time_stamp": "2020-10-23 22:16:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Felix Müller",
      "poster_handle": "fm"
    },
    "time_stamp": "2020-10-23 03:33:38",
    "text": "Serverless functions have nothing to do with HubSpot API, right? Just want to be sure... :)"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-10-23 07:59:14",
    "text": "Hey Felix, serverless functions (as well as HubDB) are not allowed on marketplace asset submissions currently due to the fact that some users on the marketplace may not have access to this functionality.\n\nFor example, folks on CMS Hub Pro do not get serverless function so if a theme relied on them, when the user purchases it, they would effectively not be able to use the theme."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-10-23 08:04:23",
    "text": "Also, we would advise against using the HubSpot API directly inside of your templates/code as this would cause your credentials (such as API Keys) to be exposed in your code.\n\nServerless functions allow you to use HubSpot API’s as these functions are ran server side and contain ‘secrets’ (API keys and other Auth information) which provide you with a secure way to store this information and use in the functions."
  },
  {
    "poster": {
      "poster_name": "Adam Munns",
      "poster_handle": "hello509"
    },
    "time_stamp": "2020-10-23 16:41:49",
    "text": "I just discovered the “Calls to Action” module! I was wondering if there was a way to better control the design options of these buttons ?"
  },
  {
    "poster": {
      "poster_name": "Adam Munns",
      "poster_handle": "hello509"
    },
    "time_stamp": "2020-10-23 16:43:48",
    "text": "I’m working on a theme, and would rather provide a set of my own predefined CTA button styles than the ones provided. e.g. “Corduroy” is something I hope my client would not put on the site after handoff lol"
  },
  {
    "poster": {
      "poster_name": "Felix Müller",
      "poster_handle": "fm"
    },
    "time_stamp": "2020-10-23 22:16:06",
    "edited": {
      "time_stamp": "2020-10-23 22:18:31"
    },
    "text": "Thank you!"
  }
]