[
  {
    "poster": {
      "poster_name": "Oswaldo Capriles",
      "poster_handle": "oswaldo"
    },
    "time_stamp": "2020-10-20 12:08:30",
    "text": "That would be a really nice addition"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2020-10-20 12:08:55",
    "text": "I agree"
  },
  {
    "text": "Hello everyone, I am quite new to HubSpot CMS. I have started a new job where I am tasked with reorganizing and structuring their website. I’ve read through the docs regarding theme, templates, and modules. I have also connected the cms-cli. My problem is that it appears they are currently using no theme (is that possible?). What I mean by that, is that all the templates, modules, etc are simply scattered throughout the root directory, and are not contained in any theme folder. (See image). So as a test, I pushed the boiler-plate theme from my local machine. However, when I go to a page, the templates found in this boiler-plate theme are not available. Does the whole site have to adopt a theme before a template from the theme can be used?",
    "time_stamp": "2020-10-20 14:19:23",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-20 15:23:25"
      },
      {
        "time_stamp": "2020-10-20 17:47:18"
      }
    ]
  },
  {
    "text": "For example, if content editor goes to where the Design options are for the theme it gives this message.",
    "time_stamp": "2020-10-20 14:21:43"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-10-20 15:23:25",
    "text": "Hey there, it’s likely your company’s website was built before we introduced themes.\n\nYes it’s possible to have templates and modules outside of a theme, that actually used to be the only way to do it.\n\nWhen creating a page and selecting a template, there is a link that says something along the lines of “other templates” this is where templates not associated with a theme live.\n\n<https://developers.HubSpot.com/docs/cms/guides/add-theme-features-to-existing-sites|You can retroactively make templates and modules apart of a theme>, though the biggest benefit of themes comes from designing templates, modules, styles etc around being part of a theme.\n\nSo you can get some of the benefits on an older site, but the experience will be better starting from the ground up with everything built as a theme."
  },
  {
    "poster": {
      "poster_name": "Chuck Taylor",
      "poster_handle": "chuck"
    },
    "time_stamp": "2020-10-20 17:47:18",
    "text": "Thank you <@U7SL518D6>, this is exactly the information I needed. I appreciate you taking the time to reply in such detail."
  }
]