[
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2022-10-31 06:20:48",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-31 08:23:08"
      },
      {
        "time_stamp": "2022-11-01 00:10:00"
      },
      {
        "time_stamp": "2022-11-01 13:06:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Yunhui Zhou",
      "poster_handle": "zhouyunhui1994"
    },
    "time_stamp": "2022-10-31 06:41:03",
    "text": "Hello! Have you used any email validation tool which is integrated to HubSpot? We're considering to validate contacts who are hard bounced, global bounced for all the contacts in our CRM. If you happen to know any good tools, please suggest :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-10-31 08:23:08",
    "text": "Hi <@U01QA3DCD7A> while we dont mind users promoting their extensions, this message is best placed in our <#C0121KGC6RM|showcase> channel. Also, we kindly ask that if you are going to link to your extension, please link to the extension listing itself on the ecosystem and not to a direct \"install to portal\" link. This way users can view the feature set and make an informed decision. In the interim, I am going to remove the message above."
  },
  {
    "poster": {
      "poster_name": "Kavitha Sugumaran",
      "poster_handle": "kavitha"
    },
    "time_stamp": "2022-11-01 00:10:00",
    "text": "We are Marketplace app developer and need 3 Active Users count to publish our extension. So we asked by HubSpot review team to share HubSpot OAuth link to increase the Active Installs count.\n\nOur extension is yet to release, how can i share the HubSpot ecosystem link? <@U2H3TT8F2>"
  },
  {
    "poster": {
      "poster_name": "Kavitha Sugumaran",
      "poster_handle": "kavitha"
    },
    "time_stamp": "2022-11-01 00:14:06",
    "text": "Any update on this uninstall webhook notification feature?"
  },
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2022-11-01 00:20:02",
    "text": "Not that I've heard of. From what I can see they might be changing the way that apps are developed"
  }
]