[
  {
    "poster": {
      "poster_name": "Tuomas Malinen",
      "poster_handle": "tuomas.malinen"
    },
    "time_stamp": "2022-02-07 04:01:34",
    "text": "I have two tables, one for the events and one for the speakers. In the event table i have foreign ID column which is linked to the speakers name column in the speakers table. I created dynamic page for event and now i´m trying to get row from speaker table based on the selection in events table’s foreign ID column, but i don’t know how. Example if i choose speaker 1 in the events table, dynamic page shows content only from speaker 1's row from speakers table. Thanks for your help!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-02-07 04:16:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2022-02-07 04:16:48",
    "text": "Something like this should work `{% for speaker in event_row.speaker_column %} {{ speaker.whatever_property_on_speaker_table }} {% endfor %}`"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-02-07 07:07:13",
    "text": "Hey Mark, good question! We will actually soon have HubDB data in the GraphQL functionality. As Mark said, you could also use the HubDB REST API, however, the GraphQL API should will make it easier to get related table data.\n\nI actually created a sample Gatsby site with the new BETA GraphQL API if you want to check it out <https://github.com/williamspiro/gatsby-HubSpot-graphql>\n\nHowever, one thing we do not have is webhooks when content/data updates, to tell the external site to re-build, assuming there is a build phase."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-02-07 07:07:43",
    "text": "Would you be interested in hopping on a zoom and chatting more about what you want to build here and what your expectations around headless are?"
  }
]