[
  {
    "poster": {
      "poster_name": "Anthony Simonetta",
      "poster_handle": "anthony314"
    },
    "time_stamp": "2021-05-06 01:44:14",
    "text": "Hello everyone,\n\nWe're working on the creation of a custom HubSpot theme for a client.\n\nOne of the key features is a blog that has a custom blog index page and a custom blog post page.\n\nWe're wondering whether we should be implementing the blog as a set of pages that sit under the &lt;domain&gt;/blog/ URL, so that we have &lt;domain&gt;/blog/blog-post-name\n\nOr whether we should be following the create a blog feature in the HubSpot CMS, see screenshot.\n\nAnd important part of this for your consideration is that we will need to create modules on other pages of the website (like home and recipes) that reference the blog in a carousel.\n\nBoiling this down to this question:\n1. Should we be doing this through HubDB;\n2. Individual Pages (/blog/blog-item); or...\n3. Through the Blog Feature on the CMS?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-06 11:29:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jourdan Craigen",
      "poster_handle": "craigen"
    },
    "time_stamp": "2021-05-06 05:35:36",
    "text": "Hola! My name is Jourdan and I’m a frontend dev from Germany :relaxed:\nThe agency I’m working for specializes in e-commerce, especially in the e-commerce solution Shopware (web development, marketing, UX design etc.).\n\nWe are currently working on relaunching our website, because on the one hand, its design is quite outdated and on the other hand, we have been using HubSpot as a CRM for a while now. So we have decided to go the next step and use HubSpot’s CMS for our new website.\n\nI’ve already passed the written online exam for the Dev certification, but due to time deficiency (I guess we’re all familiar with this) I have yet to finish the practical task.\n\nAnyhow, I’m looking forward to being part of this community!\nHave a great day :sparkles:"
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2021-05-06 11:29:28",
    "text": "We do similar setups all the time. You should use the create a blog feature in the CMS. It has a bunch of built in functionality that is very useful like a RSS feed and subscription settings."
  },
  {
    "poster": {
      "poster_name": "Brad C.",
      "poster_handle": "bcandell"
    },
    "time_stamp": "2021-05-06 13:08:06",
    "text": "Hello everyone! My name is Brad and I am a Software Architect from Eau Claire, WI. I've had some experience with HubSpot, but this is the first time that I am entering the development ecosystem around it. I am in the process of seeing how we can improve reusability with modules, and we are about to trial the CMS and Operations products next week!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-06 14:10:37"
      },
      {
        "time_stamp": "2021-05-31 09:13:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-05-06 13:53:40",
    "text": "Yes it is. You’re looking for hubdb dynamic pages"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-05-06 13:55:59",
    "edited": {
      "time_stamp": "2021-05-06 13:56:44"
    },
    "text": "HubSpot supports memberships/registration. You’ll need a CMS Enterprise subscription. There’s some great documentation and examples here: <https://developers.HubSpot.com/docs/cms/features/memberships>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-06 14:10:37",
    "text": "A fellow Wisconsinite! Welcome to the dev slack, and excited you’re about to check out the CMS and Ops Hub. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-06 22:39:16",
    "text": "Thanks for the examples!"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-06 22:39:55",
    "text": "Thanks Kieran! I have implemented it with dynamic pages."
  }
]