[
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-10-24 11:09:34",
    "text": "Hi <@U036TUPVAV8> - thanks for sharing this idea and sorry that you had this experience!! I really like how you're thinking of helping other folks avoid similar issues in the future.\n\nI'm curious when you say you're build a solution in a sandbox, are you referring to a developer test account or potentially a free CMS sandbox? Could you please share the hubid in which you worked and encountered this issue.\n\nThis will help me see what type of account it is so that I can make sure the feedback is funneled to the right team. Thank you :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-10-24 11:23:04",
    "edited": {
      "time_stamp": "2023-10-24 11:27:46"
    },
    "text": "Hey Denise, sorry i misspoke.  To clarify, I was building out a theme in what I thought was a \"live\"/paid portal but turns out it was a trial and that trial was professional.  So i was thinking maybe a banner in the hubdb area while in a trial with something like \"Remember: Hubdb is only available for enterprise accounts\". I'm sure there are other areas where these sort of notices would be nice as well.  for reference the portal number is 41759331"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-10-24 11:25:51",
    "text": "but I guess this would also apply to sandbox development as well. Maybe if you bring in hubdb via hubl code the transpiler can pick that up and display a warning or something"
  },
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-10-24 11:26:44",
    "text": "Gotcha! That makes sense and appreciate the clarification and thought process behind the application of the use case across other account types as well. :raised_hands: thank you!"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-10-24 11:27:01",
    "text": "happy to help!"
  }
]