[
  {
    "poster": {
      "poster_name": "Aaron Marsden",
      "poster_handle": "aaron866"
    },
    "time_stamp": "2025-02-04 12:54:23",
    "text": "We have a CMS project that uses the standard CMS HubL setup. We're looking to potentially introduce React into the project to configure extra functionality and interactability on certain pages and modules.\n\nIs it possible to mix these two together (i.e. port in React to an existing CMS project that doesn't use it without a complete overhaul)? Or would it be necessary to start a new project from the ground up and port over everything from our existing project to the React setup?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-04 13:26:54"
      },
      {
        "time_stamp": "2025-02-04 13:29:49"
      },
      {
        "time_stamp": "2025-02-04 13:36:48"
      },
      {
        "time_stamp": "2025-02-04 13:37:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon Miller",
      "poster_handle": "jon894"
    },
    "time_stamp": "2025-02-04 13:26:54",
    "text": "Hello Aaron, you can definitely mix hubl and react within the same website. A follow up question though. When you say you have a \"CMS project that uses the standard CMS HubL setup\", do you mean you are using the _Project_ _system_ to build/deploy your hubl only website?"
  },
  {
    "poster": {
      "poster_name": "Aaron Marsden",
      "poster_handle": "aaron866"
    },
    "time_stamp": "2025-02-04 13:29:49",
    "text": "Sorry, I should be more specific - I don't know exactly what it's called, but our current project setup closely mirrors the <https://github.com/HubSpot/cms-theme-boilerplate|HubSpot CMS boilerplate>  - no react.\n\nWhen I was exploring the HubSpot React example, the structure of the folders and files looked quite different than the CMS boilerplate/our current project. So I was curious if it's possible to port in React to say, something like the CMS boilerplate, or if we would need to start a React project from scratch and port in our existing code"
  },
  {
    "poster": {
      "poster_name": "Jon Miller",
      "poster_handle": "jon894"
    },
    "time_stamp": "2025-02-04 13:36:48",
    "edited": {
      "time_stamp": "2025-02-05 07:35:54"
    },
    "text": "Got it. Thanks for clarifying.\n\nYou can try out react modules on your existing website would be to create a new CMS React Project (HubSpot's Project system is a build/deploy system for CRM Development and CMS Development with React)."
  },
  {
    "poster": {
      "poster_name": "Jon Miller",
      "poster_handle": "jon894"
    },
    "time_stamp": "2025-02-04 13:37:48",
    "text": "Once you deploy your new CMS React project, the modules will show up in the page editor as you would normally expect.\n\nFeel free to reach out if you have questions during the process!"
  }
]