[
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2020-06-29 02:45:50",
    "text": "<@U014629NPGC> --- at this point, not that I'm aware of. It is something I've been hoping for for a while...."
  },
  {
    "subtype": "bot_message",
    "text": "<@UDFTHC6PK> has a poll for you!",
    "username": "Polly",
    "time_stamp": "2020-06-29 07:15:00",
    "edited": {
      "time_stamp": "2020-07-02 03:48:02"
    }
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-06-29 07:49:39",
    "text": "Hey Gabriel, when you say “extend the options” can you elaborate more on this? Are you referring to something like adding new styles to that dropdown menu?"
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2020-06-29 08:03:04",
    "text": "I believe add optional class extendors on this so we can apply classes to selected text"
  },
  {
    "poster": {
      "poster_name": "Dillon Nuanes",
      "poster_handle": "dnuanes"
    },
    "time_stamp": "2020-06-29 08:05:58",
    "text": "Hoping someone can help me out with this workflow reenrollment question\n\nI've got a master workflow that enrolls contacts in many subsequent, nested workflows. Some of those nested workflows are based off of contact properties.\n\nSo when my contacts enter this master workflow, they may have a contact property that enrolls them in a nested workflow, but they may not. Over time, a contact that has completed the master workflow might acquire a contact property that would make them eligible to be enrolled in one of those nested workflows.\n\nNow, my question is how to get that contact back into the master workflow. My thought is to use the \"has never been any of\" trigger on the contact property. For example, the contact didn't have data for a diversity interest (has never been any of), but now they do, so reenroll. I *think* that's right, but there is a lack of documentation for the \"has never been any of\" trigger"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-06-29 08:31:41",
    "edited": {
      "time_stamp": "2020-06-29 08:32:44"
    },
    "text": "Hi everyone, we are switching a live Site to HubSpot and need to have downtime to be as low as possible. because we can only redirect the pages once the CName change takes effect. We also have to wait up to 48 hours for the redirects to take effect during which time all the pages that need to be redirected are showing a 404 is there a way to speed this up, prevent this from happening?",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-06-29 08:36:29"
      },
      {
        "time_stamp": "2020-06-29 08:37:28"
      },
      {
        "time_stamp": "2020-06-29 08:40:13"
      },
      {
        "time_stamp": "2020-06-29 08:40:37"
      },
      {
        "time_stamp": "2020-06-29 08:41:00"
      },
      {
        "time_stamp": "2020-06-29 08:41:31"
      },
      {
        "time_stamp": "2020-06-29 08:42:31"
      },
      {
        "time_stamp": "2020-06-29 09:13:17"
      },
      {
        "time_stamp": "2020-06-29 09:21:16"
      },
      {
        "time_stamp": "2020-06-29 09:22:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-29 08:36:29",
    "text": "This is mostl(y) out of your control if you’ve already started the move. You can speed this up usually by tweaking the domains TTL closer to the migration date (down from what can sometimes be set as 86400 seconds/a day down to 60 seconds just before.)"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-06-29 08:37:28",
    "text": "thanks Kieran!"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-29 08:40:13",
    "edited": {
      "time_stamp": "2020-06-29 08:40:36"
    },
    "text": "You’ll obviously need to wait for the current TTL time to elapse before DNS servers recognise the new TTL"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-29 08:40:37",
    "text": "If you have not started the change, adjusting your TTL to a very short period of time like advised by Kieran, then waiting until the previous period expires before issuing the CNAME change will ensure minimal down time.\n\nA reasonable amount of time after you’ve made the CNAME change make sure to update that TTL to an increased time to improve performance."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-29 08:41:00",
    "text": "Kieran beat me to it :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-06-29 08:41:31",
    "text": "thanks a lot <@UQERM7BLY> and <@U7SL518D6>!"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-29 08:42:31",
    "edited": {
      "time_stamp": "2020-06-29 08:42:38"
    },
    "text": "The only other thing - ultimately there will be company networks which ignore the TTL (and cache heavily), so just have sensible defaults for your old hosting (e.g dont worry about redirects on the old site)"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-06-29 09:13:17",
    "text": "Ok against all my assumptions and expectations i was told that  the change went through in a matter of seconds  :slightly_smiling_face:  which is a huge relief!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-29 09:21:16",
    "text": "I always encourage managing expectations for customers with a site migration. Being clear\n\n&gt; “There is a chance not everyone will see the website update right away  due to DNS caching, For the majority of users we’ve made adjustments so that they should see the new site right away.\n&gt; \n&gt; There will also likely be some redirects that we need to add because they weren’t feasible to predict in-advance. We will be monitoring the situation after launch and cleaning anything up as needed afterward.”\nThat’s purely an example."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-06-29 09:22:14",
    "text": "that is a great example, thanks for sharing :slightly_smiling_face:"
  }
]