[
  {
    "poster": {
      "poster_name": "Abs Shahid",
      "poster_handle": "abs.shahid"
    },
    "time_stamp": "2020-06-17 01:40:53",
    "text": "Thanks Jeff, I'll give that a try"
  },
  {
    "poster": {
      "poster_name": "Abs Shahid",
      "poster_handle": "abs.shahid"
    },
    "time_stamp": "2020-06-17 01:41:53",
    "text": "Is there anyway to switch the HubSpot navigation from hover over flyout to onclick flyout?"
  },
  {
    "text": "We're suddenly seeing an error message display in the page editor every time content is edited in some of our modules. We're using custom HubL macros to globally handle some functionality and HubSpot seems to think it isn't working properly and persistently shows this error now. Everything is working as intended, so can that banner please be removed since the error validation being used for it isn't accurate?",
    "time_stamp": "2020-06-17 08:18:38",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-06-17 08:27:46"
      },
      {
        "time_stamp": "2020-06-17 08:37:48"
      },
      {
        "time_stamp": "2020-06-17 08:46:41"
      },
      {
        "time_stamp": "2020-06-25 11:52:20"
      },
      {
        "time_stamp": "2020-06-25 13:09:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2020-06-17 08:27:46",
    "text": "Apologies for the problem. We have a fix in progress  that I believe should address most-to-all of these (when things seem to work fine).\n\nThe underlying issue is that we accidentally are  showing that yellow message when we encountered any errors _or warnings_ when re-rendering a module and updating the preview. But warnings should not be triggering that message, only module rendering errors should."
  },
  {
    "poster": {
      "poster_name": "Tim Ostheimer",
      "poster_handle": "tostheimer"
    },
    "time_stamp": "2020-06-17 08:37:48",
    "text": "Thanks <@UCY83QS6Q>, that would definitely be more appropriate and should prevent any issues for us. The section we're seeing this for throws a warning message since we're using a HubL filter on a variable that's passed through one of our macros which is defined globally rather than within the module's code so that would explain it. As mentioned, it works fine but the warning message always shows in the Design Manager due to the missing macro. We're okay with seeing the warning while editing the module's code but ideally not in the page editor.\n\nI'll let our team know that this is temporary. It's not stopping the pages from being edited and is simply a bit annoying and causing some confusion, so they can definitely work past it for now."
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2020-06-17 08:46:41",
    "text": ":+1:, thanks for your patience and bringing the issue up!"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-17 16:40:59",
    "edited": {
      "time_stamp": "2020-06-17 16:41:31"
    },
    "text": "hope you guys are going to set up 301’s for your new documentation links. I have dozens of internal docs that now I have links that are broken",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-06-17 16:43:07"
      },
      {
        "time_stamp": "2020-06-17 16:44:05"
      },
      {
        "time_stamp": "2020-06-17 16:44:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-17 16:43:07",
    "text": "We are actively setting 301s but if you come across any pages 404ing please do let us know. Its a very big website that had tons of redirects from very old URLs."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-17 16:44:05",
    "text": "Just left the office now, I will go through and check in the morning"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-17 16:44:18",
    "text": "Looks great though"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-17 16:45:33",
    "text": "Hey, anything happen around crm_object tags or crm_associations tags today?"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-17 16:45:58",
    "text": "Have some broken modules using these functions "
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2020-06-17 17:20:46",
    "text": "Hey, I’ve got a portal with some index.htmls in the file manager. I think linking to the folder used to serve up the index.html, but that doesn’t seem to be working anymore. Is there any way the file manager could serve up index.htmls in folders, if they exist?\n(I know this isn’t how you’re supposed to create content in HubSpot, I’m not the one who did this.)\n"
  }
]