[
  {
    "text": "Hi <@U01QVR44MEY> sorry but i understand now that we need another kind of features of Techedge Home Page. If you look the picture, we need to add another flag on the menu (chile) and if the user click on flag, the user will be redirect in a new page Techedge Page (chile). Do you know how we can do this? thanks a lot",
    "time_stamp": "2022-10-17 07:54:00"
  },
  {
    "text": "Hi we need a features of Techedge Home Page. If you look the picture, we need to add another flag on the menu (chile) and if the user click on flag, the user will be redirect in a new page Techedge Page (chile). Do you know how we can do this? thanks a lot",
    "time_stamp": "2022-10-17 07:55:36"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-10-17 08:53:04",
    "text": "Did forms update in some way recently?"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-10-17 08:53:16",
    "text": "I just noticed that a number of styles are now off/broken"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-10-17 08:54:24",
    "text": "it looks like a bunch of inline styles were added"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-10-17 08:56:00",
    "text": "thanks <@UBT0AHWLD>, I did see that but it's not related to that change. It looks like a few style updates were included probably"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-10-17 08:56:12",
    "text": "might be worth double checking your forms everybody!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-17 08:57:12",
    "text": "thanks for the heads up <@UDHT6N5SM>"
  },
  {
    "text": "According to HubSpot Website Grader tool, the webpage (which is in HubSpot CMS) has size of 1.5MB but the load time is almost 11sec, why it is not justifying the page size?\nAny idea what is affecting the load time?",
    "time_stamp": "2022-10-17 09:01:10",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-10-19 16:01:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2022-10-17 11:04:24",
    "text": "Did you ever solve this?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-10-17 16:15:58",
    "text": "So as Andreas said, it will still have .jpg in the extension but if for example you right click and save as in chrome it will actually be a webp file. If that is not the case get in touch with HubSpot support and they may be able to solve the issue.\n\nUnfortunately either lighthouse just looks at the .jpg extension, or HubSpot can’t recognise that ligghthouse supports webp so it’ll give you some warnings, though they shouldn’t be too severe to the score"
  }
]