[
  {
    "poster": {
      "poster_name": "Christopher Chiha",
      "poster_handle": "christopher051"
    },
    "time_stamp": "2022-10-13 01:31:34",
    "text": "Hello,\n\nWe have a property field that contains 2 values seperated by a comma. I would like to get the value of the property field that is before the comma only.\n\nIs there a way to achieve this?\n\nFor example:\nProperty value: Spain, Madrid\nI want to fetch \"Spain\" from the property value and put it in another property to be used in a workflow later.\n\nThanks!",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-13 07:50:26"
      },
      {
        "time_stamp": "2022-10-13 07:50:41"
      },
      {
        "time_stamp": "2022-10-16 07:40:01"
      },
      {
        "time_stamp": "2022-10-16 07:40:14"
      },
      {
        "time_stamp": "2022-10-16 07:40:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Vishal Tiwari",
      "poster_handle": "vishal.tiwari"
    },
    "time_stamp": "2022-10-13 02:07:49",
    "text": "Hello\n I want to register the user on the HubSpot landing page and then with the help of that I want to create the user in okta so the registered user can log in to HubSpot as per their assigned permission set.\nPlease guide me if you have any idea on same."
  },
  {
    "poster": {
      "poster_name": "Narasimha Murthy",
      "poster_handle": "narasimha.murthy"
    },
    "time_stamp": "2022-10-13 03:57:59",
    "text": "Hi Team,\nPlease let me know for HubSpot Form related issues which slack channel I should connect?"
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-10-13 07:41:18",
    "text": "Yea - Unfortunately this is the way this type of integration works because Zapier is looked at as the source in this instance as what is creating the lead for HubSpot. This is similar to if you have ZoomInfo importing leads into Salesforce for instance, and then have the data sync from Salesforce to HubSpot. What HubSpot sees is the integration of Salesforce creating the lead.\n\nWhat you are left with are 2 options:\n\n1. Look to the source drill-down fields to see if the data passed by the integration allows you to create custom reports based on this field, or\n2. Setup your own fields to manually populate a source in HubSpot based on data that is sent/created by the Zapier integration from Webflow and ignore the default HubSpot fields altogether."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-10-13 07:50:26",
    "text": "Do you have the format data action in workflows"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-10-13 07:50:41",
    "text": "Do you have an enterprise subscription?"
  },
  {
    "poster": {
      "poster_name": "Juliana Reyes",
      "poster_handle": "juliana693"
    },
    "time_stamp": "2022-10-13 07:56:11",
    "edited": {
      "time_stamp": "2022-10-13 07:56:34"
    },
    "text": "Data isn't passed through source drill-down either. If I were to create these properties manually I would need to also have that parsed in the initial mail parser email correct? Just like I have the utm parameters identified and parsed through the email, then Zapier, then HubSpot. The only problem with this option 2 is when I am creating reports in HubSpot and want to analyze web traffic and ad behaviour, I wouldn't be able to take advantage of any of HubSpot's default data. Do you know if I create a tracking url in HubSpot and add it to each ad it could potentially overwrite Zapier source? Or if through Zapier I create a HubSpot form submission with the dara parsed including ip address, would this identify initial tracking? <@U02J6DA8F4P>"
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-10-13 10:01:51",
    "text": "If nothing is populating in the drill-down this sounds like a shortcoming in the zapier integration.  In doing some digging, there is a native forms integration between HubSpot and Webflow.  Is there a reason you are trying to use Zapier?  Did you run into issues with the native integration? <https://university.webflow.com/lesson/HubSpot-forms-integration-wf>\n\nTo your question on option 2, you are current you would not be able to take advantages of the default data in HubSpot. If you create a tracking URL, I would fear that you would run into a disconnect between when the tracking URL is clicked, the prospect potentially has not filled out a form yet and is unknown to HubSpot and because it’s processing through an integration, you may end up with a disconnect there."
  },
  {
    "poster": {
      "poster_name": "Juliana Reyes",
      "poster_handle": "juliana693"
    },
    "time_stamp": "2022-10-13 10:08:16",
    "edited": {
      "time_stamp": "2022-10-13 10:08:28"
    },
    "text": "The reason why I'm using Zapier is because the form is embeded in Webflow, it's not a Webflow form. It's actually custom code embed. Which is why form submissions come in through email, which we then parse in mailparser and then send to Zapier to send to HubSpot. Essentially the solution would be to find a way to also send over tracking info that in HubSpot can be received as defaults and not as created properties, so reporting and Ads tab view works properly. What would you recommend? It's a little more complicated than I thought <@U02J6DA8F4P>"
  },
  {
    "poster": {
      "poster_name": "Joav Abraham-Beermann",
      "poster_handle": "developer989"
    },
    "time_stamp": "2022-10-13 15:28:44",
    "text": "Hi , has anyone had a form only load sometimes <https://www.dentec.co.nz/resources/melag-euroclav-brochure> . It appears to me that it is due to a slow json call for the form from HubSpot (where it is hosted) -creating a race condition. Has anyone had a similar problem? Thanks"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2022-10-13 15:34:19",
    "text": "Is there a way to clone a whole blog in order to use it as a “staging” blog, since there is no staging environment for blogs?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-13 15:44:56"
      },
      {
        "time_stamp": "2022-10-14 07:33:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-10-13 15:41:47",
    "text": "without the use of javascript libraries like mixitup, is it possible to filter on blog posts in the overview, without reloading the page? So lets say one post has data-filter=“tag1”, and when I select the filter in the sidebar, this will show all the post with that tag, without reloading"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-10-13 15:44:56",
    "edited": {
      "time_stamp": "2022-10-13 15:45:31"
    },
    "text": "you could try exporting it and importing back to a different blog"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "yoseph.alemu"
    },
    "time_stamp": "2022-10-13 16:36:11",
    "edited": {
      "time_stamp": "2022-10-13 16:36:35"
    },
    "text": "Hi everyone, i am working on web performance on a HubSpot website, and i noticed that normally all images are being converted in to webp format, but in this case it’s not, and lighthouse is complaining about the jpeg and png formats, any insights as to why HubSpot is not doing its job?",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-10-13 16:37:05"
      },
      {
        "time_stamp": "2022-10-13 16:38:01"
      },
      {
        "time_stamp": "2022-10-13 16:38:15"
      },
      {
        "time_stamp": "2022-10-13 16:44:12"
      },
      {
        "time_stamp": "2022-10-13 16:44:20"
      },
      {
        "time_stamp": "2022-10-13 16:44:29"
      },
      {
        "time_stamp": "2022-10-13 16:46:29"
      },
      {
        "time_stamp": "2022-10-13 16:47:42"
      },
      {
        "time_stamp": "2022-10-13 16:52:40"
      },
      {
        "time_stamp": "2022-10-17 16:15:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-13 16:37:05",
    "text": "may i ask which browser you use?"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "yoseph.alemu"
    },
    "time_stamp": "2022-10-13 16:38:01",
    "text": "it’s chrome"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "yoseph.alemu"
    },
    "time_stamp": "2022-10-13 16:38:15",
    "text": "and it’s the latest version"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-13 16:44:12",
    "text": "“An image uploaded as a .jpg, will still show as a .jpg in the URL but will be served as a WebP. This ensures links to this image will work for everyone regardless of WebP support.”"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-13 16:44:20",
    "text": "maybe this is the reason"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-13 16:44:29",
    "text": "<https://developers.HubSpot.com/docs/cms/developer-reference/cdn#image-compression-optimization-and-automatic-image-resizing>"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "yoseph.alemu"
    },
    "time_stamp": "2022-10-13 16:46:29",
    "text": "I checked the image sent to the browser and it’s still jpeg"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-10-13 16:47:42",
    "text": "yes, HubSpot is not changing the file format"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "yoseph.alemu"
    },
    "time_stamp": "2022-10-13 16:52:40",
    "text": "I’ve worked on project where all the images has been converted to webp automatically, this is a different and I don’t know what is missing"
  },
  {
    "poster": {
      "poster_name": "Ezekiel Swanson",
      "poster_handle": "swansonezekiel"
    },
    "time_stamp": "2022-10-13 17:02:45",
    "text": "Hello everyone! Is there anyone that knows of anyone that does paid HubSpot development code sessions for junior HubSpot developers?"
  }
]