[
  {
    "poster": {
      "poster_name": "Hiren Bhuva",
      "poster_handle": "hirenbhuva.official"
    },
    "time_stamp": "2022-10-14 03:16:02",
    "text": ":wave: Hi everyone! Recently we started doing integration of HubSpot with our product <https://emailanalytics.com/|EmailAnalytics>. On EmailAnalytics we provide a detailed analytics of their all inbound &amp; outbound emails. Now we want our customer to get the emails of their customer from HubSpot into our software.\n\nThe way it works currently is they create `Contact Views` in HubSpot and we want to get all contacts inside that views into our software. We are not able to find Contact View API inside our developer account.\n\nCan anyone help me finding that API from where we can get list of contacts inside any `Contact view`\n\nMuch Thanks,\nHiren\n<http://EmailAnalytics.com|EmailAnalytics.com>"
  },
  {
    "poster": {
      "poster_name": "Swapnil Harde",
      "poster_handle": "swapnil"
    },
    "time_stamp": "2022-10-14 04:46:23",
    "edited": {
      "time_stamp": "2022-10-14 04:48:15"
    },
    "text": "Hi Everyone,\n\nI'm currently working on a usecase wherein I need to insert some records in Custom Objects daily. In order to achieve this, I have created a workflow with Custom Code action added in it. I need to execute this workflow on dailty basis to delete existing records and push fresh records daily.\n\nCustom code action is responsible for following actions:\n1. Get the list of records from custom object and form a data structure to delete existing records after insertion of fresh records.\n2. Insert fresh records in Custom Object.\n3. Delete the pre-existing records using data structure created in step#1.\n\nAfter scheduling the workflow to execute daily the behavior of workflow is very diasy. I'm facing following issues:\n1. Sometimes the workflow doesn't get executed at all at the scheduled time.\n2. The code for deletion takes place fine, but during insertion it inserts the same set of data multiple times. This behavior is a bit abnormal as sometimes the insertions works correct and sometimes it inserts multiple times.\n\nNote: If I test the custom code action manually it executes as expected every single time.\n\nAny leads on resolving these issues would be very helpful.  Thank you in advance."
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2022-10-14 07:33:48",
    "text": "thank you!"
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-10-14 09:01:25",
    "text": "Unfortunately like I said before the default reporting in HubSpot assumes that the data is coming through a direct HubSpot form or integration.  If your integration is not setting the data points then HubSpot is going to default to setting the source as an integration and the only way around this is to start building out custom reporting with custom properties because you won’t be able to utilize the default setup in your instance. Some of this may be possible within the custom reports solution in HubSpot and other pieces may require data to be stored externally (ie: data warehouse).  If I were in your position, I would share with your internal team what the shortcomings are in HubSpot due to the systems you have in place that is also proving costly as you have to support MailParser and Zapier in your tech stack for an otherwise simple form post.  What I would look into is tying into the forms API of HubSpot ( <https://legacydocs.HubSpot.com/docs/methods/forms/submit_form_v3_authentication> ) into your current form submission, posting to 2 locations asynchronously, so that HubSpot receives the raw data to a HubSpot form and gives data in the default HubSpot reporting that you desire."
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2022-10-14 14:17:43",
    "text": "Are HubSpot Payment links single use ??"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2022-10-14 14:18:02",
    "text": "or can multiple customers use the same payment link??"
  }
]