[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-12 08:47:31",
    "edited": {
      "time_stamp": "2021-05-12 08:52:02"
    },
    "text": "Hey all,\n\nA quick reminder we are running a <https://cmshub.devpost.com/|HubSpot CRM + CMS website contest>.\nDidn’t hear about it? That’s okay, you have until May 20th to submit. The contest is a way for you to showcase your current or past projects and shouldn’t take you too much time.\n\nQuick summary of how it works:\n\n1. Pick a site you’ve built on HubSpot’s platform that features advanced functionality.\n    ◦ This website can exist before the contest begins, or can be created or updated during the contest.\n    ◦ The owner of the website must authorize you to feature the site in your submission.\n1. Create a ~5 minute video demonstrating all of the key features of your site.\n    ◦ Back-end / gated features must be demonstrated in the video or they will not be judged as part of the contest\n    ◦ Videos must not exceed 10 minutes in length\n1. Submit your website on <https://designers.HubSpot.com/inspire/new-entry|HubSpot's Inspire Site>, along with answers to the case study questions.\n2. Submit your official entry form on <https://cmshub.devpost.com/|this contest website> and include a link to your demo video.\n3. Get your friends to vote for your entry for a chance to win the community choice award.\n\nJudges will be assessing every submission for it’s:\n• *Use of CMS + CRM Platform Functionality* - This is the most important criteria for this contest. Our judges will be looking for powerful functionality and personalized user experiences made possible by the integration of HubSpot’s CMS and CRM platform. (think using smart content, using memberships, crm objects etc. You don’t need to be doing all of the above, more examples can be found <https://developers.HubSpot.com/blog/cms-crm-website-contest|on our guide>)\n• *Design &amp; Usability* - Judges will evaluate sites for aesthetic quality, information architecture, and general best practices.\n• *Optimization* - In this category, sites will be evaluated for accessibility, page speed, SEO, and general optimization best practices.\n• *Business Impact* - Marketing judges will evaluate case studies to understand how sites solved a compelling need or drove meaningful business results.\n• For More Information On Our Judging Criteria: View our <https://cmshub.devpost.com/developers.HubSpot.com/blog/cms-crm-website-contest|Guide to Maximizing Your Score.> Also, don’t forget to review <https://cmshub.devpost.com/rules|The Official Rules.>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-12 08:50:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-12 08:50:57",
    "text": "Interested but want some tips on how to create an effective entry?\n<https://developers.HubSpot.com/blog/cms-crm-website-contest|We’ve got you covered!>"
  },
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-05-12 10:23:54",
    "text": "<@U2H3TT8F2> <@U01J52DNGH2> We have a project where the client has not yet started their HubSpot subscription but a massive part of our plan was to use webhooks and we now have to tell them they have to pay for an additional product to get this one piece of functionality we do not need anything else from ops hub pro"
  }
]