[
  {
    "poster": {
      "poster_name": "Sean Tibor",
      "poster_handle": "sean003"
    },
    "time_stamp": "2021-05-04 06:47:23",
    "text": "Respectfully - your inside baseball explanation doesn’t explain why you would need to remove access to webhooks from Marketing Hub Enterprise in order to add it to Operations Hub Pro. It can exist in both places simultaneously. There are plenty of use cases for webhooks in Marketing Hub that do not need to touch anything else in Operations, especially in the enterprise space. Let’s be honest - clients that want webhooks are the kind that have hired developers. And if they can afford to hire developers, they can afford to buy Operations Hub. Net win for HubSpot, developers, and partners. But that’s all commercial benefit to HubSpot and the ecosystem, not necessarily to clients. This feels very much like when webhooks were moved into Marketing Hub enterprise and forced a ton of companies to purchase that just because they needed some custom workflow actions. And it’s tolerated by existing clients because they’re grandfathered in. Operations Hub has enough other desirable features like data cleaning, integrations, etc that you don’t need to remove webhooks from the other “enterprise” hubs in order to sell it. If a client is buying Enterprise-grade software in any of the hubs, webhooks should be part of that package. They shouldn’t need to buy a whole suite just because they want this one developer feature."
  },
  {
    "poster": {
      "poster_name": "Sean Tibor",
      "poster_handle": "sean003"
    },
    "time_stamp": "2021-05-04 06:51:35",
    "text": "And to be clear, I am excited that webhooks will be a part of operations hub along with the other features that will make business operations and integrations so much smoother. it will be a lot easier to convince clients to purchase a package of pro-level subscriptions than to upgrade to Enterprise for webhooks. But there are a non-trivial amount of clients in the enterprise space that have a large number of contacts and legacy systems and only need to get a foothold with one of the Hubs. we can expand their base later."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-04 14:42:40",
    "text": "This content can't be displayed.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-04 14:50:48"
      },
      {
        "time_stamp": "2021-05-05 01:12:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-04 14:50:48",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1620161306453700?thread_ts=1544482024.218200&amp;cid=C22PU4LV8>"
  }
]