[
  {
    "text": "Hello!  I am a developer currently working on some fun custom development projects for a client in HubSpot.  My client has an Enterprise account and I have some questions on some features I am trying to build out.   Has anyone here worked with custom objects and email-specific modules?\n\n*The problem I was faced with:*\nThe project is for a manufacturing company... here is how the flow was created (and why it needs changing!).\n• User fills out a form on their 'Find a Dealer' website page \n• Form submits, hits a 3rd party API routed to their SugarCRM (SSOT, holds the 'dealers' and logic to return them)\n• middleware takes the results (dealers) then takes the properties returned and applies it directly to the contacts record.\n• Due to limitation of properties on the contact record, we can only add 10 'dealers'... as they were literally just attaching tons of fields in a random Contact Group (see screenshot)\n• The client's internal system can return more than 10 results, and it does.  Since this system returns more than could be added to the contact's record, their system that does reporting shows that 20 'dealers' should have received lead notification emails, while only 10 actually did.\nI think it is obvious why this is a bad idea to most developers.  My plan is to have a custom 'object' for 'dealers' that I can then *associate* to the contact record that submitted the form.  Before I go and import their 'dealer' database into my new custom 'dealer' object, I am trying to test if this can even pull off the desired effect.\n\n\n*Here is where I landed last night before falling asleep on my Macbook:*\n• :white_check_mark:   Created a custom object for \"Dealers\".  \n• :white_check_mark:   Added test objects to my 'dealer' object, then associated it with my contact record in HubSpot.  (see screenshot 2)\n*Now what I need to happen:*\n• The contact will still hit the 3rd party API that returns 'dealer' objects from their internal CRM.  I want to use the names of each company or some other unique property returned via the API to then *search/match* those names on my custom objects, then get back the corresponding 'object ID' for each result, so that I can then associate multiple dealers to this contact's record _dynamically._   *I believe a serverless function is the best approach to achieve this... does anyone have insight to this?*\n• *More importantly,* I need to send the contact an email which will have a *repeater* of any dealer objects that were associated to the contact. \"Here is the list of dealers in your area:\" type thing.\n• Also important:  I need to then send a ''lead notification email' to the email addresses located in the *dealer* objects that were associated to the contact... saying \"hey, here is a lead you just received!\"\nSorry for the long intro... but if anyone has insight on how to achieve this... I would be SO grateful.  I think I am close, but the documentation around custom objects is still pretty new",
    "time_stamp": "2020-12-02 14:15:33"
  }
]