[
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-09-28 09:11:30",
    "text": "Hey <@U02E6LPLW72>, I need to look into this one some more. The workflow ID included in the request is the same one that is in the URL of the app when you’re looking at a workflow. Unfortunately our existing workflows API uses different IDs for contact workflows. I’m not sure what the best course of action is here.\n\nWould you mind explaining a bit what you’re using the workflows API for? Wondering if there’s an alternative solution here"
  },
  {
    "text": "Hi <@U0157R7AQ84>, I made a workflow extension that send me a post request with some information including the workflow id (you can see a part of this body), but when I want to get information about this workflow with the endpoint : /automation/v3/workflows/:workflowId, using the workflow id returned, I have a 404, this workflow doesn't not exist.\nSo I made a request to get all my workflow (in order to check IDs) at this endpoint :  /automation/v3/workflows, and I found that the id returned by my workflow extension is not the workflow id but the flowId in the migrationStatus object.\nDo you understand? I don't know if I'm making myself clear",
    "time_stamp": "2021-09-28 09:21:08"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-09-28 09:24:28",
    "text": "Yes, perfectly clear, thank you :+1: Out of curiosity, what information are you looking for from the `/automation/v3/workflows/:workflowId` endpoint?\n\nThe only workaround that I can think of for right now is to loop through the workflows in `/automation/v3/workflows` and match using the `flowId`, instead of looking up the workflow directly."
  },
  {
    "poster": {
      "poster_name": "Ophelie",
      "poster_handle": "ophelie"
    },
    "time_stamp": "2021-09-28 09:37:02",
    "text": "I just want to get the name of the workflow. I tought of this solution but I think it's a bit heavy if I have a lot of workflow."
  },
  {
    "poster": {
      "poster_name": "Ophelie",
      "poster_handle": "ophelie"
    },
    "time_stamp": "2021-09-28 09:40:47",
    "text": "It's okay, I'll do without. I thought I was wrong somewhere. Thank you for your answer <@U0157R7AQ84> :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-09-28 09:56:44",
    "text": "No problem! Sorry about the confusion here. We do eventually plan on updating our workflows API, which will solve this ID problem, but no estimate yet for when that will be ready :slightly_smiling_face:"
  }
]