[
  {
    "poster": {
      "poster_name": "Chris Knowles",
      "poster_handle": "chris.knowles"
    },
    "time_stamp": "2021-10-05 06:08:34",
    "text": "<@UETV43QNL> you could approach it the other way round, in the Design Manager right click on the offending templates and select 'Show dependents' to see a list of pages still using it, if it's none, you're good!"
  },
  {
    "text": "",
    "time_stamp": "2021-10-05 06:08:48"
  },
  {
    "poster": {
      "poster_name": "Chris Knowles",
      "poster_handle": "chris.knowles"
    },
    "time_stamp": "2021-10-05 06:09:11",
    "text": "Depends how many templates we're talking about :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Nicole Pereira",
      "poster_handle": "nicole249"
    },
    "time_stamp": "2021-10-05 06:14:39",
    "text": "Lots and lots of templates. We have many clients that have us spin up a theme version of their old templated site. Short of spreadsheeting it all and tracking, there is not administrative way to see this info easily.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-05 06:17:40"
      }
    ]
  },
  {
    "text": "i think it would be cool to make this a column option of the pages view:",
    "time_stamp": "2021-10-05 06:17:40"
  },
  {
    "poster": {
      "poster_name": "Chris Knowles",
      "poster_handle": "chris.knowles"
    },
    "time_stamp": "2021-10-05 06:33:41",
    "text": "If it's part of a full site redesign we would use the Content Staging queue to check which pages we've switched over"
  },
  {
    "text": "Hi HubSpot Team! Is there a way to update the blog listing template when its template is deleted? In the screenshot below, there is no action button that lets me update the template. When I click on 'Edit' it prompts me to update the template because the current one doesn't exist but clicking on it takes me to the landing page template chooser instead of blog listing.",
    "time_stamp": "2021-10-05 12:56:02",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-05 12:59:02"
      },
      {
        "time_stamp": "2021-10-05 13:05:53"
      },
      {
        "time_stamp": "2022-01-24 08:49:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Neil Yonzon",
      "poster_handle": "neil.yonzon"
    },
    "time_stamp": "2021-10-05 12:59:02",
    "text": "Actually, looks like there isn't a way for me to update the blog listing template at all even if the template wasn't deleted. It works for my first blog but all additional blogs created after that won't let me update the template."
  },
  {
    "poster": {
      "poster_name": "Neil Yonzon",
      "poster_handle": "neil.yonzon"
    },
    "time_stamp": "2021-10-05 13:05:53",
    "text": "Ok looks like a found a solution. I restored the deleted template and went inside the template settings and updated it there although it would be great to be able to update it from the settings page similar to the blog post.\n\nI think the landing page template chooser instead of the blog listing template is still an issue though."
  }
]