[
  {
    "poster": {
      "poster_name": "Jatin",
      "poster_handle": "jatin811"
    },
    "time_stamp": "2024-07-31 01:46:30",
    "text": "<https://api.hubapi.com/crm/v3/objects/contacts?after=552>\ni have used this api for fetch all users.\nbut i need a data which join after 25 july how do filter it on query param or api",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-31 05:43:46"
      },
      {
        "time_stamp": "2024-07-31 05:43:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dayo Fordah",
      "poster_handle": "dayo.fordah"
    },
    "time_stamp": "2024-07-31 02:59:31",
    "edited": {
      "time_stamp": "2024-07-31 05:57:53"
    },
    "text": "Hi team - hope everyone is well.\nI'm having difficulty getting my CMS data to breakdown daily.\n\nFor example, after trying this: <https://api.hubapi.com/analytics/v2/reports/pages/total?start=20240101&end=20241231>\n\nI'm provided with the data found in this <https://docs.google.com/spreadsheets/d/1LzazxZz8wi2U5BabegOjEI6Jq9oMh-08WS_mcki4x4c/edit?gid=0#gid=0|spreadsheet>\n\nI then used this for the daily breakdown: <https://api.hubapi.com/analytics/v2/reports/pages/summarize/daily?start=20240101&end=20241231>\n\nBut this fails to provide me with the <https://docs.google.com/spreadsheets/d/1JEtCW4HJATcD6D22Cdvvg3tcyPZYEVa0THzHsHC04H4/edit?gid=0#gid=0|data I need>.\n\nAny assistance would be appreciated - thanks!",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 05:43:22"
      },
      {
        "time_stamp": "2024-07-31 06:00:24"
      },
      {
        "time_stamp": "2024-07-31 06:36:51"
      },
      {
        "time_stamp": "2024-07-31 06:59:48"
      },
      {
        "time_stamp": "2024-07-31 07:01:19"
      },
      {
        "time_stamp": "2024-07-31 07:01:21"
      },
      {
        "time_stamp": "2024-07-31 07:01:24"
      },
      {
        "time_stamp": "2024-07-31 07:01:36"
      },
      {
        "time_stamp": "2024-07-31 07:17:03"
      },
      {
        "time_stamp": "2024-07-31 07:26:53"
      },
      {
        "time_stamp": "2024-07-31 07:44:43"
      },
      {
        "time_stamp": "2024-07-31 07:45:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Paola Mereu",
      "poster_handle": "paola.mereu"
    },
    "time_stamp": "2024-07-31 03:15:02",
    "text": "thanks, <@U03REFNRMB3>. I checked it, but it is not a good solution for our platform.\nI have to show the HubSpot form (HubL) in our platform (incompatible with HubL).\n\nWe aim for the users to create their page/mail template using our platform, include a HubSpot form on this template, and then export the entire final template (including the form) to HubSpot. This flow is not supported with this API. Do you have other suggestions?\nI do not know if my need it is clear."
  },
  {
    "poster": {
      "poster_name": "Paola Mereu",
      "poster_handle": "paola.mereu"
    },
    "time_stamp": "2024-07-31 03:18:14",
    "text": "Hello Team,\nTopic: *HubSpot merge tag import*\nHubSpot is integrated with our platform (content creator)\n\nWe are working to enforce the current integration.\nCurrent pain points: The merge tags and special links must be imported manually from HubSpot to our platform instead of automatically receiving them by the connector HubSpot.\nWe checked if importing autmatically the merge tag from HubSpot is possible, and it does not seem feasible.\n\nAny suggestion would be appreciated\nThanks!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 05:42:05"
      },
      {
        "time_stamp": "2024-07-31 06:12:12"
      },
      {
        "time_stamp": "2024-07-31 06:42:46"
      },
      {
        "time_stamp": "2024-08-02 02:41:17"
      }
    ]
  },
  {
    "text": "The first thing to do is check to see if there is already an existing integration that meets your needs before you try creating your own.  I was able to find one in the app marketplace you can check out.",
    "time_stamp": "2024-07-31 05:34:11"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:42:05",
    "text": "The descirption of your issue doesn’t dig into any actual details on how we could help you. you mention merge tags, which might be personalization tokens. And you mention connector — content creator as a platform. Is that the name of the brand / product?\n\nYour topic in here is basically like walking into an automotive repair shop and asking a question that makes us think you might be talking about a bicycle, a solar powered airplane, or maybe a car. And you’ve explained that you might not be able to put your suitcase in it.\n\nThis happens a lot here, so I want to make sure that you maybe break down your problem into one item you can specifically outline the problem for and describe what is expected and what you need help with"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:43:22",
    "text": "You need to request access to these google sheets. Might want to make this viewable by public without needing to request\n\nThat being said — you mention “data I need” If that is listed in the document, then that makes sense, if not I’d ask you to outline the data you need"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:43:46",
    "text": "you would want to use the search api and query contacts based upon that property"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:43:56",
    "text": "<https://developers.HubSpot.com/docs/api/crm/search>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:45:38",
    "text": "Additional emails are just emails added to the email field.\n\ntypically they are\n\n<mailto:email1@domain.com|email1@domain.com>;<mailto:email2@domain.com|email2@domain.com>\n\nSeparated by a semicolon\n\nYou might be able to do a contact api call, get the email, reorder the email so that <mailto:email2@domain.com|email2@domain.com>;<mailto:email1@domain.com|email1@domain.com> is your new email property, and update the contact based upon the ID"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 05:48:00",
    "text": "not having a more robust form api really kills me.\n\nThe only way I’ve gotten aroudn this when I needed to do this is by creating a field on all forms called submitted at. I use javascript to put the date into the hidden field, then I use the search api to look it up.\n\nThis can have false positives for multiple submissions during a time period. I started to go down with the “properties with history” and going through that and then decided to just gather this information on a cron job and saving the data daily\n\neventually the need for this died and the project ended. I never got much further than that"
  },
  {
    "poster": {
      "poster_name": "Dayo Fordah",
      "poster_handle": "dayo.fordah"
    },
    "time_stamp": "2024-07-31 06:00:24",
    "text": "thank for the heads-up <@U25PYL3Q8> I've made the links shareable to the public.\n\nThe data i need is located in the first spreadsheet but it isn't broken down by day. The second link where I attempt to \"summarize daily\" gives me even less data"
  },
  {
    "poster": {
      "poster_name": "Paola Mereu",
      "poster_handle": "paola.mereu"
    },
    "time_stamp": "2024-07-31 06:12:12",
    "text": "The flow I want to address is this one:\n• on our content creator platform, the user can create an email template.\n• This platform is integrated with HubSpot -&gt; which means that the email template created can be exported to the HubSpot platform\n• During the template creation phase, users must add some merge tags.\n• *Request:* At the moment, the merge tag can be added only manually. It seems that it is not possible to import the merge tag in bulk from HubSpot to our platform.\n\n <@U25PYL3Q8> Below I added more details regarding *merge tags - special links.* I do not know if these are enough for you to better understand my goal.\n\nIn HubSpot, merge tags are placeholders that allow you to dynamically insert personalized information into your emails, landing pages, and other marketing content. To locate and set up merge tags in HubSpot, you will typically find them in the editing interface of the specific tool you are working with. Here's how you can find and set up merge tags in the following sections:\n\n1. *Emails*:\n    ◦ When creating or editing an email in HubSpot, you can insert merge tags by clicking on the \"Personalization\" dropdown menu in the email editor toolbar.\n    ◦ Select the type of contact property you want to use as a merge tag, such as first name, last name, email address, custom properties, etc.\n    ◦ Place the merge tag where you want the personalized information to appear in the email body.\n2. *Landing Pages*:\n    ◦ In the landing page editor in HubSpot, you can add merge tags by clicking on the \"Insert\" dropdown menu in the editing toolbar.\n    ◦ Select the type of merge tag you want to insert, such as contact properties, form submission data, or custom properties.\n    ◦ Insert the merge tag in the desired section of your landing page content.\n3. *Forms*:\n    ◦ Merge tags can also be used in form fields to automatically populate information based on the contact's details.\n    ◦ While creating or editing a form in HubSpot, you can click on a form field and select the \"Merge tag\" option to insert personalized data fields.\n\n\nIn the *free version* of HubSpot, you can create reusable content snippets that include merge tags and then insert these *snippets* into your emails, landing pages, and other marketing assets. Merging tags directly into HubSpot modules, however, is a feature available in *higher-tier plans*.\n\nHere's how you can create a reusable content snippet with merge tags:\n1. *Create a Custom Module*:\n    ◦ In your HubSpot account, go to your Settings and navigate to Marketing &gt; Files and Templates &gt; Design Tools.\n    ◦ Create a new custom module that will contain your content snippet with merge tags.\n2. *Add Merge Tags*:\n    ◦ Edit the custom module and insert merge tags wherever you want dynamic personalized information to appear.\n3. *Save as Snippet*:\n    ◦ Once you've added your merge tags to the custom module, you can save this module as a snippet.\n    ◦ Click on the \"Save\" or \"Save as Snippet\" option in the editing interface, and give your snippet a descriptive name.\n4. *Insert Snippet*:\n    ◦ When creating new content like emails or landing pages, you can now insert this saved snippet containing merge tags into your content.\n    ◦ Look for the \"Insert snippet\" option in the content editor and select your previously saved snippet to include the merge tags.\n*Merge tags and special links* serve different purposes in email marketing and personalization efforts. Here are the key differences between the two:\n1. *Merge Tags*:\n    ◦ *Purpose*: Merge tags are placeholders that allow you to dynamically insert personalized information from your contact database into your marketing content. These can include details like a contact's first name, last name, company name, or any other custom properties you have associated with contacts.\n    ◦ *Usage*: Merge tags are typically used to personalize emails, landing pages, forms, and other marketing assets by automatically populating contact-specific information. They help in creating more targeted and relevant content for your audience.\n    ◦ *Example*: Hi [First Name], thanks for visiting our website! Would you like to learn more about [Product of Interest]?\n2. *Special Links*:\n    ◦ *Purpose*: Special links, also known as tracked links or smart links, are unique URLs generated by marketing platforms to track and monitor user engagement and behavior. These links can provide additional data insights such as click tracking, conversion tracking, and lead attribution.\n    ◦ *Usage*: Special links are used in email campaigns, social media posts, and other digital marketing channels to track clicks, measure campaign performance, and analyze user interactions. They help understand how users engage with your content and optimize your marketing strategies.\n    ◦ *Example*: Click here to download your exclusive offer: [Special Link]\n"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-07-31 06:29:06",
    "text": "Hey all, when making a delete request for a custom object I am getting this error. `{\"status\":\"error\",\"message\":\"Cannot modify HubSpot defined object type\",\"correlationId\":\"b1d14f7e-1892-4b7f-b91f-f157be95185a\",\"category\":\"VALIDATION_ERROR\",\"subCategory\":\"ObjectSchemaError.CANNOT_MODIFY_HubSpot_DEFINED_OBJECT_TYPE\"}`  Anyway to hard delete an old custom object made with API? I did try deleting it in the portal.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 06:45:06"
      },
      {
        "time_stamp": "2024-07-31 06:46:06"
      },
      {
        "time_stamp": "2024-07-31 06:48:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:36:51",
    "text": "Yeah — so analytics api is less than stellar.\n\nBest you are going to do without pulling your hair out is to do average over time periods, making the individual calls and storing the data and querying on that"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:42:46",
    "text": "AMAZING STUFF HERE\n\nmerge tags are really just object properties. If I needed to get this set up, I would create a default mapping.\nForm submission data, contact properties and custom properties are all going to be properties that are on teh contact record — they are accessible via the api through various api calls. I’ll do a simple, go thorught he motion explanation on how to preview how the emails work and what you COULD do if you wanted to, then a brief outline on how to do this via the api.\n\nCreate a HubSpot contact\nEdit the contact with all the properties you want to map out in your system\nAdd all those properties to an email using the editor\nView the HTML of the email — this will show you how to structure the personalization tags.\n\nTake that information and integrate it into your platform.\n\nYou could set this up in a different way.\nYou could use the contact schema api to bring in all properties.\nYou could use something like `{{ contact.email }}` in your mapping and set up all the items in schema\nI’d look at having some sort of “fallback property to send” if the property is empty.\n\nThat being said, you might not want to bring in all those properties"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-31 06:43:58",
    "text": "yeah, I’m thinking of processing the full feed, then storing the newest submittedAt and then checking for new submissions after that timestamp then repeating and updating that submittedAt timestamp."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:45:06",
    "text": "I’ve deleted through the UI and gotten errors.\nI had to remove all references to the objects in all of the lists workflows, etc.\n\nI then redid the delete, one of them deleted after a few days, the other one I reached out to support via email and they fixed me up"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:45:42",
    "text": "kind of janky"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:45:46",
    "text": "but likely the best way"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-07-31 06:46:06",
    "text": "Yea I have a ticket in, it seems objects made the old way impact it. They do a soft delete from the UI and you cant restore to do a hard delete with api."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 06:48:37",
    "text": "I’m guessing that is what happened with one of my vs the other"
  },
  {
    "poster": {
      "poster_name": "Anand Kumar",
      "poster_handle": "anand"
    },
    "time_stamp": "2024-07-31 06:57:41",
    "edited": {
      "time_stamp": "2024-07-31 07:02:24"
    },
    "text": "Hello  team\nI am try to import csv  though api  but i am facing issue ,   I am using this code\n``` document.getElementById('importButton').addEventListener('click', () => {\n      const csvFileInput = document.getElementById('csvFileInput');\n      const file = csvFileInput.files[0];\n\n      if (!file) {\n        alert('Please select a CSV file first.');\n        return;\n      }\n\n      const reader = new FileReader();\n      reader.onload = function(event) {\n        const csvContent = event.target.result;\n        console.log(\"CSV content read successfully:\", csvContent);\n        importDataToHubDB(csvContent);\n      };\n      reader.readAsText(file);\n    });\n\n    async function importDataToHubDB(csvContent) {\n      const HUBDB_TABLE_ID = 'HUBDB_TABLE_ID';\n      const HubSpot_BEARER_TOKEN = 'HubSpot_BEARER_TOKEN';\n\n      const config = {\n        skipRows: 1,\n        separator: ',',\n        idSourceColumn: 1,\n        resetTable: false,\n        columnMappings: [\n          {\n            target: 1,\n            source: 'name'\n          },\n          {\n            target: 2,\n            source: 'address'\n          }\n        ],\n        primaryKeyColumn: 'name',\n        encoding: 'utf-8',\n        format: 'csv'\n      };\n\n      const form = new FormData();\n      form.append('config', JSON.stringify(config)); \n      form.append('file', new Blob([csvContent], { type: 'text/csv' }), 'data.csv');\n      console.log(form)\n      try {\n        const response = await fetch(`<https://api.hubapi.com/cms/v3/hubdb/tables/${HUBDB_TABLE_ID}/draft/import>`, {\n          method: 'POST',\n          headers: {\n            'Content-Type': 'multipart/form-data',\n            'Authorization': `Bearer ${HubSpot_BEARER_TOKEN}`\n          },\n          body: form\n        });\n\n        if (!response.ok) {\n          throw new Error(`Error: ${response.statusText}`);\n        }\n\n        const data = await response.json();\n        console.log('Data imported successfully:', data);\n      } catch (error) {\n        console.error('Error importing data:', error);\n      }\n   }\n\nIn  Do we need to use form data and combine config and csv file  or  will need to send sepratly in 3 parammeter , headers , config , file please help   ```",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-31 08:33:41"
      },
      {
        "time_stamp": "2024-07-31 11:53:52"
      },
      {
        "time_stamp": "2024-07-31 21:37:01"
      },
      {
        "time_stamp": "2024-08-01 08:08:07"
      },
      {
        "time_stamp": "2024-08-01 08:10:30"
      },
      {
        "time_stamp": "2024-08-01 08:16:07"
      },
      {
        "time_stamp": "2024-08-01 08:21:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dayo Fordah",
      "poster_handle": "dayo.fordah"
    },
    "time_stamp": "2024-07-31 06:59:48",
    "text": "\"*analytics api is less than stellar*\" yep :laughing:\n\nRight - how do I make \"average over time\" calls?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:01:19",
    "text": "take that first call you do, and run that every day"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:01:21",
    "text": "store that in a database"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:01:24",
    "text": "and query on that"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:01:36",
    "text": "that is really teh only way you are going to be able to have some sort of effetive way of doing that"
  },
  {
    "poster": {
      "poster_name": "Dayo Fordah",
      "poster_handle": "dayo.fordah"
    },
    "time_stamp": "2024-07-31 07:17:03",
    "text": "Ah ok that makes sense. I'm assuming if I wanted a date assigned to each day I would need to add this in myself through other means i.e. data transformation? I can't see a date field in the HubSpot documentation"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:26:53",
    "text": "yeah you would basically build that into your database / storage stuff"
  },
  {
    "poster": {
      "poster_name": "Dayo Fordah",
      "poster_handle": "dayo.fordah"
    },
    "time_stamp": "2024-07-31 07:44:43",
    "text": "Ok - thanks for your assistance Nick. Definitely saved me the headache of having to figure it out myself"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 07:45:52",
    "text": "good luck"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-31 08:33:41",
    "text": "What error are you getting when you try to submit?"
  },
  {
    "poster": {
      "poster_name": "Jennie Huettel",
      "poster_handle": "jhuettel"
    },
    "time_stamp": "2024-07-31 08:45:38",
    "text": "Thanks <@U25PYL3Q8>!"
  },
  {
    "poster": {
      "poster_name": "Harpreet Bhatia",
      "poster_handle": "posttoharpreet"
    },
    "time_stamp": "2024-07-31 08:50:32",
    "text": "Hello everyone,\nI have been facing error with private app i create for consuming APIs to create leads at HubSpot.\na detailed description of the problem is here:\n<https://github.com/HubSpot/HubSpot-api-php/issues/371>\nI need help or suggestions.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 18:49:43"
      },
      {
        "time_stamp": "2024-08-01 09:00:09"
      },
      {
        "time_stamp": "2024-08-01 09:07:28"
      },
      {
        "time_stamp": "2024-08-06 07:15:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Patricio Cardó",
      "poster_handle": "patricio471"
    },
    "time_stamp": "2024-07-31 08:54:23",
    "text": "Hello Team!\nI'm facing an issue trying to send and Email using HubSpot through nodeJs.\nNo matter if I use the SDK with `this.hClient.marketing.transactional.singleSendApi.sendEmail(payload);`\nOr API call with https.request like <https://developers.HubSpot.com/beta-docs/reference/api/marketing/emails/transactional-emails|the example in the documentation>\nOr API using axios with\n```      const response = await <http://axios.post|axios.post>(this.baseUrl, payload, {\n        headers: {\n          'Content-Type': 'application/json',\n          'Authorization': `Bearer ${this.accessToken}`,\n        },\n      });```\nI get the following error\n```non-http:dev: Body: {\"status\":\"error\",\"message\":\"This app hasn't been granted all required scopes to make this call. Read more about required scopes here: <https://developers.HubSpot.com/scopes>.\",\"correlationId\":\"169bb3ba-612d-449d-9a6c-a91b6a87a263\",\"errors\":[{\"message\":\"All of the following scopes are required.\",\"context\":{\"requiredScopes\":[\"transactional-email\"]}}],\"links\":{\"scopes\":\"<https://developers.HubSpot.com/scopes>\"},\"category\":\"MISSING_SCOPES\"}```\nThe scope is already assigned in the app I'm using, and I have an Enterprise account.\nWhat else do I have to configure?\n\nthe `prosal` variable is as follows:\n```      const payload = {\n        emailId: this.templateId,\n        message: {\n          to: <http://email.to|email.to>,\n          from: email.from,\n        },\n        customProperties: [\n          {\n            name: 'subject',\n            value: email.subject,\n          },\n          {\n            name: 'body',\n            value: email.body,\n          },\n        ],\n      };```",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-31 12:00:34"
      },
      {
        "time_stamp": "2024-07-31 18:50:16"
      },
      {
        "time_stamp": "2024-08-02 14:02:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-31 10:56:54",
    "text": "Is this a demo/test portal or a production portal?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 11:53:52",
    "text": "I hope this is back end code — has the api key here. Guessing that might be an issue?\n\nCORS isn’t available on POST requests, only GET requests, where you don’t need the api key"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-31 12:00:34",
    "text": "Does the HubSpot account have the transactional email addon purchased?"
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2024-07-31 14:52:20",
    "text": "Hello!\n\nAny ideas on how it would be possible to identify if an 'email' was sent through a sequence or manually by a user?\n\nIdeal scenario:  there would be two properties in the email record:\n• sequence_sent: boolean\n• sequence_name: string (could be the id)\nRight now, I don't think this is possible and it's hard to track what emails the user sent and what emails were sequences blasting.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 16:04:04"
      },
      {
        "time_stamp": "2024-08-01 06:15:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Vogele",
      "poster_handle": "nathan148"
    },
    "time_stamp": "2024-07-31 16:04:04",
    "edited": {
      "time_stamp": "2024-07-31 16:05:04"
    },
    "text": "Sequences should be an API Endpoint. Absolutely agree.\n\nYou could search for emails that contain a specific set of unique content that would be unique to a particular sequence. Or that are from a specific user.\n\nFrom there you could make a property with a bool on it, and add something like \"latest sequence\" to the contact and update it whenever you log a new sequence. But it's going to be a relatively intense process.\n\n<https://developers.HubSpot.com/beta-docs/reference/api/crm/engagements/email#post-%2Fcrm%2Fv3%2Fobjects%2Femails%2Fsearch>\n\nYou can pull some native reporting with HubSpot for it, but right now I believe if you want to hook onto it programmatically you have to use the email search.\n\n<https://knowledge.HubSpot.com/sequences/analyze-sequence-enrollment-and-performance-data>"
  },
  {
    "poster": {
      "poster_name": "Chris Strom",
      "poster_handle": "cstrom"
    },
    "time_stamp": "2024-07-31 16:20:51",
    "text": "Anyone have experience using <http://tray.io|tray.io> and/or connecting HubSpot to Bullhorn and interested in collaborating? We have a prospect who is struggling with their HubSpot-Tray-Bullhorn integration and looking for help. ",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-31 17:45:01"
      },
      {
        "time_stamp": "2024-07-31 20:09:54"
      },
      {
        "time_stamp": "2024-08-01 01:36:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-07-31 17:45:01",
    "text": "Hey Chris,\n\nNo experience with these two systems but eager and willing to collaborate and provide support.\n\nUnderstanding the use case, data flow, objects involved, current setup and details on what you mean by \"struggling\" would be helpful context for me.\n\nHoping it might be a fit!\n\nRyan\nUnified Support Solutions"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 18:49:43",
    "text": "Try attempting a lead without an association.\nJust do an email address. See what happens, then test through it"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-31 18:50:16",
    "text": "yeah, that is a paid add on!"
  },
  {
    "poster": {
      "poster_name": "Chris Strom",
      "poster_handle": "cstrom"
    },
    "time_stamp": "2024-07-31 20:09:54",
    "text": "Pleased to meet you, Ryan! Could you DM me to tell me more about your experience and capabilities in HubSpot API development and systems integration?"
  },
  {
    "text": "hi <@U03REFNRMB3> and <@U25PYL3Q8>\nWhen using this code using  HubSpot private App  through this error ,\nI am using this from front end",
    "time_stamp": "2024-07-31 21:37:01"
  }
]