[
  {
    "poster": {
      "poster_name": "Gavin Bailey",
      "poster_handle": "gavin.bailey"
    },
    "time_stamp": "2024-07-01 02:59:44",
    "text": "we are doing standard integration with Salesforce connector but also a workaround as no one can tell us if the standard Bulk API is working the same as others. Normally we would send example 10000 records for update and if 1 failed then we would receive an error as to what the failure was. However, with HubSpot, it seems that if I send 10000 records and 1 fails, then the whole batch fails instead of just that one. Therefore the question is more so does HubSpot support this type of integration via Bulk API so far we haven't been able to tell."
  },
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-07-01 03:27:46",
    "text": "Hello <@U25PYL3Q8>,\n\nWe hope this message finds you well. We wanted to follow up on our previous message. We have yet to receive a response from your end, and we are keen to hear your feedback or any suggestions you might have.\n\nYour input is valuable to us, and we would greatly appreciate your timely advice on how to proceed. Please let us know your thoughts at your earliest convenience.\n\nThank you for your attention to this matter. Looking forward to your reply."
  },
  {
    "poster": {
      "poster_name": "Basit Manzoor",
      "poster_handle": "basit.manzoor"
    },
    "time_stamp": "2024-07-01 04:15:07",
    "text": "Does using serverless function require a separate subscription plan?"
  },
  {
    "text": "I see a serious problem this morning.  Looks like it started over the weekend.  The Read method for Line Items is acting strange.  My calls to it (which have been running in webhooks successfully for months)  are suddenly getting 404 errors.  If I test on the docs page and enter the required lineItemId parameter I indeed get back a 404.  But if I don't enter the required parameter I get page a page of 10 results as if I called the List method.  Can anyone else verify this or can someone loop in a HubSpot person to let them know about this issue.  I realize most everyone is out this week, right?  <@U01QVR44MEY> <@U25PYL3Q8>",
    "time_stamp": "2024-07-01 05:21:08",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-01 05:59:01"
      },
      {
        "time_stamp": "2024-07-02 09:25:33"
      },
      {
        "time_stamp": "2024-07-03 04:40:49"
      },
      {
        "time_stamp": "2024-07-03 05:57:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-07-01 05:59:01",
    "text": "Examining this issue further it looks like I am only getting these 404 errors on a few line items - my process keeps trying to run them because they are not marked as completed in my database.  Still the strange behavior of the docs page is ... well, strange."
  },
  {
    "poster": {
      "poster_name": "Manuel Velarde",
      "poster_handle": "manuel.velarde"
    },
    "time_stamp": "2024-07-01 07:54:21",
    "text": "Hello, I am using a private application to manage webhooks, but some of them are being sent instantly and others have delay, I would like to know how long is the average of those delays to have a better management in my integration. Thank you so much",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-02 09:35:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-07-01 08:31:14",
    "text": "Hello!\n\nI am about to create contacts in HubSpot through the API and I want to associate these contacts with already existing companies. This is working just fine if the contact and its associated company has the same domain name for email and website(?). But when the contact has another email-domain than the company then the HubSpot Automation for creating companies gets triggered which creates a new company and sets this newly created company as the primary association, the new company is also based on the email-domain of the contact.\n\n Is there a way to circumvent this automated creation of the company if the contact is created from for instance my private app as the source? Are there any other ways to circumvent the HubSpot Automation to get triggered?\n\nHappy for any help!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-01 08:56:44"
      },
      {
        "time_stamp": "2024-07-01 08:59:13"
      },
      {
        "time_stamp": "2024-07-01 15:50:02"
      }
    ]
  },
  {
    "text": "Hi <@U064T7QT5C0>, is it possible that your issue is in the HubSpot portal settings? It is under Companies &gt; Settings",
    "time_stamp": "2024-07-01 08:56:44"
  },
  {
    "poster": {
      "poster_name": "Jonatan Ryd",
      "poster_handle": "jonatan.ryd"
    },
    "time_stamp": "2024-07-01 08:59:13",
    "text": "Hey <@U04CC57CMBP>, thanks for the reply. So the problem is that we actually want that feature turned on for a lot of other sources, just not the private app source that I am using to create the contacts, for instance web leads etc.\n\nI understood it as that feature can only exclude contacts based on company domain which is not scalable for us"
  },
  {
    "poster": {
      "poster_name": "Etai Barash",
      "poster_handle": "etai"
    },
    "time_stamp": "2024-07-01 09:15:52",
    "text": "Hello everyone! I am attempting to create a HubSpot API integration with a BaaS platform called <https://docs.squid.cloud/docs/integrations/api/httpapi/|Squid>. To do so, I need the HubSpot OpenAPI specification file URL (which usually ends in `.json` or `.yaml` ). Does anyone know where I can find this? Thank you for your help!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-01 12:48:54"
      },
      {
        "time_stamp": "2024-10-03 03:04:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Basit Manzoor",
      "poster_handle": "basit.manzoor"
    },
    "time_stamp": "2024-07-01 11:27:53",
    "text": "Thank you <@UJJ239SC9> No Auth required for Post data solves my problem"
  },
  {
    "poster": {
      "poster_name": "Etai Barash",
      "poster_handle": "etai"
    },
    "time_stamp": "2024-07-01 12:48:54",
    "text": "Updating to say I found this useful article on OpenAPI specs: <https://developers.HubSpot.com/changelog/get-all-publicly-available-open-api-specifications>"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-07-01 15:50:02",
    "text": "Got it. Yeah very tricky situation and I doubt they have a way of skipping the automation."
  }
]