[
  {
    "poster": {
      "poster_name": "Arun Kumar",
      "poster_handle": "arun"
    },
    "time_stamp": "2024-07-15 01:20:14",
    "edited": {
      "time_stamp": "2024-07-15 01:20:33"
    },
    "text": "Hi Team,\n\nI am using custom code and the HubSpot API to associate meetings with tickets. However, I'm facing some issues:\n\n1. When I book a meeting, it displays an itemId of 199 and a label of \"null\".\n2. I'm having trouble associating specific meetings with tickets—currently, all meetings are being associated with the ticket.\n3. Meetings are being shown based on their ID in ascending order, rather than by time.\nIs there a way to add labels to meetings to help identify specific ones?\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Raman Bazhanau",
      "poster_handle": "r.bazhanau"
    },
    "time_stamp": "2024-07-15 02:43:52",
    "text": "Hi everyone,\n\nI need some help integrating HubSpot with our IoT platform. We want to track various user activities such as logins, device additions, and other interactions. Additionally, when users sign up, we want to add them as customers (contact?) in HubSpot.\n\nOur goal is to provide our marketing team with detailed activity data so they can analyze user behavior within HubSpot.\nDoes anyone have experience with this type of integration or any suggestions on how to get started? Any guidance or resources would be greatly appreciated!\n\nBy the way, we are using Python. Sorry, if this question is too much basic :sweat_smile:\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Fran Quero",
      "poster_handle": "fran.quero"
    },
    "time_stamp": "2024-07-15 07:29:36",
    "text": "Hi team! We are building a HubSpot CRM integration and one of the use cases is data syncing AKA data exporting. So to use the export API, we know we need the \"crm.export\" scope\n\nWe have seen that only Super Admins can grant this scope. We tried with other kinds of users, even enabling the CRM Export permissions for them and we were unable to authorize our app. Is this scope only available for Super Admins or is there any other way to grant it? Thank you so much in advance"
  },
  {
    "poster": {
      "poster_name": "Robert Nagy",
      "poster_handle": "robert.nagy"
    },
    "time_stamp": "2024-07-15 08:01:51",
    "edited": {
      "time_stamp": "2024-07-15 08:02:01"
    },
    "text": "Hi, what are the required scopes for `GET <https://api.hubapi.com/marketing/v3/emails/>` ? I granted `marketing-email`  and `transactional-email`  under “Standard” but get 403 still.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-15 08:30:07"
      },
      {
        "time_stamp": "2024-07-15 11:07:44"
      },
      {
        "time_stamp": "2024-07-16 03:38:19"
      },
      {
        "time_stamp": "2024-07-16 09:23:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Nagy",
      "poster_handle": "robert.nagy"
    },
    "time_stamp": "2024-07-15 08:30:07",
    "edited": {
      "time_stamp": "2024-07-15 08:30:16"
    },
    "text": "Answer: it’s `content`"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-07-15 10:40:51",
    "text": "I believe this is a bug. It seems when you get a (non-archived) page, it defaults the archivedAt field to the beginning of unix epoch time, which breaks when you try to create that page somewhere else. I \"fixed\" this by setting the field value to null, which according to the docs is an invalid value, which say it's a date not a nullable date."
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-15 11:07:44",
    "text": "<@U07CUL3HLL9> did the response of 403 not provide the scope needed?"
  },
  {
    "poster": {
      "poster_name": "Moe Musa",
      "poster_handle": "mmusa"
    },
    "time_stamp": "2024-07-15 11:30:57",
    "text": "Created lead on HubSpot, and this is what I receive in webhook log:\n\n{\n  \"eventId\": 1460737831,\n  \"subscriptionId\": 2703127,\n  \"portalId\": 46747303,\n  \"appId\": 3566735,\n  \"occurredAt\": 1721064474781,\n  \"subscriptionType\": \"company.propertyChange\",\n  \"attemptNumber\": 0,\n  \"objectId\": 21910285662,\n  \"propertyName\": \"lifecyclestage\",\n  \"propertyValue\": \"salesqualifiedlead\",\n  \"changeSource\": \"PIPELINE_SETTINGS\",\n  \"sourceId\": \"LCS-set-on-Lead-association\"\n}"
  },
  {
    "text": "",
    "time_stamp": "2024-07-15 11:31:22"
  },
  {
    "poster": {
      "poster_name": "Moe Musa",
      "poster_handle": "mmusa"
    },
    "time_stamp": "2024-07-15 11:32:45",
    "text": "I don't see lead info or at least lead ID.\n\nOther issue, when I change lead status/ or even create new lead for same contact, it does not trigger webhook&gt;\n\nI need assistance please"
  },
  {
    "text": "hello i can't see my HubSpot API key on the dashborbard, someone nkow hot it work ?",
    "time_stamp": "2024-07-15 11:46:47",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-16 06:06:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Willy Hernandez",
      "poster_handle": "willy"
    },
    "time_stamp": "2024-07-15 12:05:55",
    "text": "Hi everyone! Does anyone know how our company can formally sign up as an ISV Technology partner with HubSpot? We essentially want to procure a Developer Sandbox to test against custom objects/fields/lists APIs with a HubSpot connector that we are building Thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Louran Costa",
      "poster_handle": "louran.costa"
    },
    "time_stamp": "2024-07-15 17:01:44",
    "edited": {
      "time_stamp": "2024-07-15 17:02:50"
    },
    "text": "Hi guys!\n\nIs there a way to get (via API or not) the scheduling meeting page link of the deal owner?\n\nI have a partner portal, where they can register new deals and each register I send for a different owner.\n\nIn the partner portal, I have a deal details page, where the partner can do a lot things like schedule a meeting to the deal, so the owner will be different and  I need show the correct schedule page (embeded)."
  }
]