[
  {
    "poster": {
      "poster_name": "Robert Nagy",
      "poster_handle": "robert.nagy"
    },
    "time_stamp": "2024-07-16 03:38:19",
    "text": "It did but I was too stupid to read the error properly."
  },
  {
    "poster": {
      "poster_name": "Robert Nagy",
      "poster_handle": "robert.nagy"
    },
    "time_stamp": "2024-07-16 03:40:24",
    "text": "Is there an API endpoint to fetch click events for Marketing Emails, i.e. essentially the data which is accessible from `V2_LIVE.EVENTS_CLICKED_LINK_IN_EMAIL_V2`  in the Snowflake dump?"
  },
  {
    "poster": {
      "poster_name": "Leonardo Gonzalez",
      "poster_handle": "leonardo572"
    },
    "time_stamp": "2024-07-16 06:06:47",
    "text": "hi moustapha, to do that you should in that same location of the print in left menu you go in the \"Applications privées\" to enter the private apps section, inside that section go to authorization, and you'll find your API key :)"
  },
  {
    "poster": {
      "poster_name": "David Sereboff",
      "poster_handle": "david200"
    },
    "time_stamp": "2024-07-16 07:41:51",
    "text": "Hello all, new to HubSpot Slack. I'm running into an issue when testing a webhook from within the HubSpot console. I provisioned my API to 'seemingly' meet the requirements regarding payload, etc., but receive nothing but a 400 response and null error message from HubSpot. The subscription trigger is an object created event.\n\nI'm also unsure if this is the proper place to ask this question, so any assist on both fronts is appreciated! (edited)"
  },
  {
    "poster": {
      "poster_name": "Pragna Brahmbhatt",
      "poster_handle": "pragna"
    },
    "time_stamp": "2024-07-16 08:29:19",
    "text": "Hello everyone,\nUsing <https://api.hubapi.com/marketing/v4/email/single-send|this> API I am getting sent status but it is not actually delivering the email to the email address.\nCan anyone please provide solution to my query because as per my knowledge it should be delivered to the inbox of the email address.\nAny help would be really appreciated. Thank you in advance!\nCreated issue in php-github package as well. (Ref: <https://github.com/HubSpot/HubSpot-api-php/issues/368> )"
  },
  {
    "poster": {
      "poster_name": "Pragna Brahmbhatt",
      "poster_handle": "pragna"
    },
    "time_stamp": "2024-07-16 08:44:49",
    "text": "Also another question is, I did not get any reference of how to manage Templates using php-package for same. Cerated issue related to same in <https://github.com/HubSpot/HubSpot-api-php/issues/367|github>. Question is below.\n\nI got reference of api to manage the contacts but did not get any reference of how I can manage templates using this package. Can anyone help or guide me for the same?\nI have knowledge of how I can achieve using core php or curl but using this package I did not get any reference.\n\nIf anyone have any knowledge in same then kindly guide. Rightnow using curl I have implemented same but I want to achieve it using the package. Any help would be appreciated. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-16 09:23:53",
    "text": "lol!"
  },
  {
    "poster": {
      "poster_name": "Ankit Singh",
      "poster_handle": "ankit479"
    },
    "time_stamp": "2024-07-16 14:14:01",
    "edited": {
      "time_stamp": "2024-07-16 14:14:33"
    },
    "text": "Hello everyone,\nIs there a way I can fetch reporting data through API under module Reporting & Data > Dashboard for a specific report"
  },
  {
    "poster": {
      "poster_name": "Chris Buckingham",
      "poster_handle": "cbuckingham"
    },
    "time_stamp": "2024-07-16 14:18:51",
    "text": "Hi,\ntrying to figure out how to pull phone information from contact with api. Im assuming <https://api.HubSpot.com/crm/v3/objects/contacts> can do it but I cant seem to find how specifically? (or if thats not a thing possibly pulling that data from a list?)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-16 14:38:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-07-16 14:38:56",
    "text": "<https://youtu.be/_o9UmYRq-WE?si=QvkEIcymTAcwvTQ8|https://youtu.be/_o9UmYRq-WE?si=QvkEIcymTAcwvTQ8>"
  }
]