[
  {
    "poster": {
      "poster_name": "Tadeja Čander",
      "poster_handle": "tadeja.cander"
    },
    "time_stamp": "2024-03-26 01:54:31",
    "text": "Hi all! I'm trying to implement the HS website grader on our site and it all works well except, the SEO tool keeps telling us that the logo used for branding in the web grader form has no alt text, which it does. Has anyone else here dealt with a simmilar issue? Not having the logo for the form works but my boss wants to keep the logo :sweat_smile: and keeping the logo apparently raises a SEO issue :confused:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-26 08:27:27"
      },
      {
        "time_stamp": "2024-03-26 08:38:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Satyam Chaudhary",
      "poster_handle": "satyamc.wot2022"
    },
    "time_stamp": "2024-03-26 07:56:02",
    "text": "Can you share any page links that we can look into?"
  },
  {
    "poster": {
      "poster_name": "Edmond Deema",
      "poster_handle": "edmond"
    },
    "time_stamp": "2024-03-26 08:17:15",
    "text": "Have you checked the page speed loading time from page insight? It has happened to me that these recommendations are not 100% accurate, but can you attach a page we can take a look at?"
  },
  {
    "poster": {
      "poster_name": "Edmond Deema",
      "poster_handle": "edmond"
    },
    "time_stamp": "2024-03-26 08:27:27",
    "text": "Hi, which SEO tool do you use! I would recommend trying SemRush it's more accurate, it is a tricky situation I haven't come across a similar issue but I would suggest trying a different SEO tool to see if the same issue arises!"
  },
  {
    "poster": {
      "poster_name": "James H",
      "poster_handle": "jim834"
    },
    "time_stamp": "2024-03-26 08:38:39",
    "text": "I don’t find the grader super reliable on everything but there should be an option to ignore/ mark as fixed? Alternatively I am sure your code is fine but if you want to paste the markup surrounding and including your logo maybe it’s missing something and a fresh pair of eyes will see it "
  },
  {
    "text": "Hi <@U06G4DKLZJP>\nHere’s the page link - <https://www.activesgcircle.gov.sg/facilities/swimming-pools>",
    "time_stamp": "2024-03-26 22:47:41"
  }
]