[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-08-13 02:49:50",
    "text": "and also, the CMS  that adapts the best to an ever changing environment quickly is really valueable for all parties involved"
  },
  {
    "poster": {
      "poster_name": "Victoria Gumaer",
      "poster_handle": "vgumaer"
    },
    "time_stamp": "2020-08-13 05:16:37",
    "text": "<@UBT0AHWLD> would it be fair then, in your opinion, to say that a developer's value moment would be achieved the first time their marketer publishes a piece of content with an asset they've created?  And, on the opposite side, a marketer realizes the value of a developer's work when it takes them less time overall to publish a page?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-08-13 05:22:01",
    "text": "i think the marketer  realizes the value if they can create a system of modules, settings and templates that fit their workflow and how they work best.....though they won´t admit that publicly :wink:... in terms of the developers value moment..hm at least it would be a necessary milestone that is achieved though it depends on who you ask..the dev and UX team would argue that they put a ton into it before that happenend which yielded that result in the first place... the marketer might counter that with something like...\"yeah, but if we don´t actually use it for the world to see...its useless\""
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-08-13 05:26:48",
    "text": "So there is this myth that agencies steal each other clients if they know of them. Has this actually happen to  some of you? I have never witnessed this before. Sure clients switch to other agencies or developers tell the client that they aren´t a good fit anymore, that i have witnessed.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-08-13 08:12:06"
      },
      {
        "time_stamp": "2020-08-17 18:00:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2020-08-13 08:12:06",
    "text": "not that i know of"
  },
  {
    "poster": {
      "poster_name": "Victoria Gumaer",
      "poster_handle": "vgumaer"
    },
    "time_stamp": "2020-08-13 08:34:56",
    "text": "It is a hard question :joy:"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-08-13 10:02:27",
    "text": "The perfect CMS: a clean UI for editors, intuitive yet visually pleasing analytics for decision makers, and a robust API w/ documentation for developers."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-08-13 10:06:35",
    "edited": {
      "time_stamp": "2020-08-13 10:06:42"
    },
    "text": "I actually think in a lot of ways, the Forms tool in HS is the gold standard. Manage the form as a form, not a portion of a page. View analytics for the form as it's own object or \"content type,\" and all actions related to the form are available via API. Developers have the option to use the built-in markup via embedding, or can also submit to the form using AJAX and handle user flow that way. Either way, the content editors managing the form and the stakeholders looking at the analytics have the tools they need in the UI they want."
  }
]