[
  {
    "poster": {
      "poster_name": "Jeff Stafford",
      "poster_handle": "jeff544"
    },
    "time_stamp": "2023-12-19 09:46:28",
    "text": "Your \"watch\" should be running in the background, pushing changes immediately. It's not really much different than seeing your changes locally, from what I've experienced."
  },
  {
    "poster": {
      "poster_name": "Jeff Stafford",
      "poster_handle": "jeff544"
    },
    "time_stamp": "2023-12-19 09:50:47",
    "text": "I'm not sure this is the right channel, but I'm developing a custom theme using the cms-boilerplate. I created a menu in \"Navigation menus\" under settings and then created a new \"Website page\" using my template. All good so far. Then I realized I need to adjust my main navigation so I went back to Settings &gt; Navigation menus and made the update. However, the web page is still showing the old version. I unpublished and published the page, cleared browser cache...still I'm seeing the old nav. Any thoughts? What am I missing?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-12-19 10:47:08"
      },
      {
        "time_stamp": "2023-12-19 13:12:34"
      },
      {
        "time_stamp": "2023-12-21 07:47:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2023-12-19 10:47:08",
    "text": "Hey Jeff — this might be better suited for the <#C22PU4LV8|general> Channel. This is very unlikely related to the boilerplate. Sounds like it’s a cloudflare caching issue. Does the nav change if you open it up in an incog widnow?"
  },
  {
    "poster": {
      "poster_name": "Jeff Stafford",
      "poster_handle": "jeff544"
    },
    "time_stamp": "2023-12-19 13:12:34",
    "text": "Ok thanks for the advice. I'm pretty sure its a caching issue, just couldn't figure out exactly \"where\" it was being cached. I just opened it again and its loading as expected now."
  }
]