[
  {
    "poster": {
      "poster_name": "David Abreu",
      "poster_handle": "biorazor.a"
    },
    "time_stamp": "2020-05-16 13:15:52",
    "text": "Hi everyone, I'm new to hubSpot, I wanted to ask you:\n\nWhat's the best way for you, via the API, to create or obtain a contact, and generate a meeting with a seller in zoom, indicating which products you are interested in? Then give the meeting information to the customer",
    "reply_count": 10,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-16 13:17:13"
      },
      {
        "time_stamp": "2020-05-16 13:34:02"
      },
      {
        "time_stamp": "2020-05-16 13:34:06"
      },
      {
        "time_stamp": "2020-05-16 13:44:05"
      },
      {
        "time_stamp": "2020-05-16 13:48:34"
      },
      {
        "time_stamp": "2020-05-16 13:49:18"
      },
      {
        "time_stamp": "2020-05-16 13:49:55"
      },
      {
        "time_stamp": "2020-05-16 13:56:06"
      },
      {
        "time_stamp": "2020-05-16 14:40:43"
      },
      {
        "time_stamp": "2020-05-16 15:19:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "David Abreu",
      "poster_handle": "biorazor.a"
    },
    "time_stamp": "2020-05-16 13:17:13",
    "text": "I've been reviewing the API documentation and can't find the Endpoint to create and get meetings"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 13:34:02",
    "text": "<@UFL9XN2DQ> this is actually something that doesn't exist - creating a \"meeting\". You can via the API however create an engagement which will be in the diary of the \"sales agent\" and you can setup HubSpot workflows to listen to this engagement event and send it to the customer. I'm a bit rusty as I integrate this generally with HubSpot workflows with no code, but an engagement may email the customer the information.\n\nYou could create  a special Zoom link(??????????????????) in a HubSpot field on a contact and use that as a field to send in a transactional mailer?"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 13:34:06",
    "text": "Let me know how this goes!"
  },
  {
    "poster": {
      "poster_name": "David Abreu",
      "poster_handle": "biorazor.a"
    },
    "time_stamp": "2020-05-16 13:44:05",
    "edited": {
      "time_stamp": "2020-05-16 13:44:24"
    },
    "text": "Hi <@U011H02FR3Q>! Thank you!\n\nOk, I'll try with engagements, I had in mind also the workflows, but in my trial account I don't have access to them for free, I'm waiting for the company to give me access to the account. Now my question would be, can a workflow generate, assign and schedule the meeting with a vendor? or with certain vendors?\n\nI also know that zoom is integrated into the workflows, according to the presentation of the app, I think that by generating the meeting through the workflow I could send the info to the user by mail. What do you think about it'"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 13:48:34",
    "text": "as a developer-turned-devops, I'm always pushing no code approaches wherever possible, as the more custom code you have, the more code you have to maintain - think npm modules getting security vulnerabilities etc."
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 13:49:18",
    "text": "You *should* be able to do this entire thing with workflows, my customers generally have the Marketing/Sales package... let me have a look at the API"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 13:49:55",
    "text": "See if there is anything you can at least prototype with a \"trial account\". When you say trial, do you mean of a real CRM or a developer trial/CRM <@UFL9XN2DQ>?"
  },
  {
    "poster": {
      "poster_name": "David Abreu",
      "poster_handle": "biorazor.a"
    },
    "time_stamp": "2020-05-16 13:56:06",
    "text": "a real CRM, I'll check from the developer account"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-16 14:40:43",
    "text": "you use third party integrations from Zapier for this using your account (if limited with HubSpot workflows)"
  },
  {
    "poster": {
      "poster_name": "David Abreu",
      "poster_handle": "biorazor.a"
    },
    "time_stamp": "2020-05-16 15:19:39",
    "text": "Well, from the HubSpot workflow I can only include the contact to a zoom webinar, not create and assign it to a meeting as such. So that would rule out work flow.\n\nI have to find another way.\n\nWith Zapier I can do something similar, but the date and time assignment of the meeting is not dynamic, nor can I define who I assign it to, because it is created with only 1 account."
  }
]