[
  {
    "poster": {
      "poster_name": "Rutger Smit",
      "poster_handle": "rutger"
    },
    "time_stamp": "2020-05-28 04:51:33",
    "text": "Hi all, I'm building an app which only uses webhooks. The idea is to get updates on changes on Deal entities. What's not clear to me is wether I should do all the OAuth stuff or not. Can enyone elighten me? Cheers!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-28 05:34:17"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-05-28 05:34:17",
    "text": "Hi Rutger :wink: yes, you must do the OAuth-dance to install the app."
  },
  {
    "poster": {
      "poster_name": "Kyle Halkerston",
      "poster_handle": "kyle.halkerston"
    },
    "time_stamp": "2020-05-28 13:51:34",
    "text": "Hi everyone! I am currently working on a rebranding of our website and we just moved over to HubSpot. We are a transportation &amp; logistics company so on our current site we have a track a shipment field where the customer can enter their 8 digit bill number then the information for their shipment is populated into a nice organized table on a different page on our site. We have the API to gather the shipment information, however, we are stuck on how to implement in our new HubSpot realm. Does anyone have any suggestions on how to get this up and running?? Thank you in advance!",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-29 09:25:17"
      },
      {
        "time_stamp": "2020-05-29 09:25:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "RJ Hallin",
      "poster_handle": "rjhallin"
    },
    "time_stamp": "2020-05-28 14:04:28",
    "text": "Hi all, I'm trying to figure out a way to import attachments/files to the HubSpot CRM in bulk. Has anyone ever attempted something like this before? Any help would be greatly appreciated. Thanks in advance!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-28 16:46:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Kofman",
      "poster_handle": "mark027"
    },
    "time_stamp": "2020-05-28 16:46:23",
    "text": "Your your best starting point is this API method - <https://developers.HubSpot.com/docs/methods/files/post_files>"
  }
]