[
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-05-08 06:22:00",
    "text": "<@U012LKRF0RJ> to just clarify - you want to merge companies? With the API as you have seen that's not possible. <@UCE3D677X>’s suggestion of a custom field would work if.\n\nTwo solutions:\n• Not so hacky: If this is *used by a custom integration* could you use *that* app to search for companies by some sort of unique identifier for that \"actual company\" e.g. `<mailto:xxx@acme.com|xxx@acme.com>` and `<mailto:yyy@acme.com|yyy@acme.com>` are a certain client... is the acceptance criteria really that is it in HubSpot?\n• Hacky: Could you write some code that would create a new account with two JSON objects glue together, make it a new company and then update all HubSpot records to that new amalgamated company?\n• *Actually maybe promising but not 100%:* CRM Associations API has parent/child child/parent relationships with companies. Would this not suit you?"
  },
  {
    "poster": {
      "poster_name": "mmcdaris",
      "poster_handle": "morgan"
    },
    "time_stamp": "2020-05-08 11:27:38",
    "edited": {
      "time_stamp": "2020-05-08 11:29:10"
    },
    "text": "Thanks guys! I appreciate the feedback here, I've made progress by:\n• turning off the auto create companies setting: it causes us much more trouble than it's worth.\n• deleting all of the companies\n• multi file import of companies and contacts including our association id"
  },
  {
    "poster": {
      "poster_name": "mmcdaris",
      "poster_handle": "morgan"
    },
    "time_stamp": "2020-05-08 11:33:12",
    "edited": {
      "time_stamp": "2020-05-08 11:34:19"
    },
    "text": "The problem is Emails and Email Domains are not unique identifers. Slack is a good example. 1 email, multiple slack workspaces.\n\nFor the auto create and associate company to work correctly, it needs an option to choose your own association id to trigger the creation or association. That things would get us closer to trustable data.\n\n&gt;  is the acceptance criteria really that is it in HubSpot?\nYep! This is just to get up and running. We are just getting our data in a good state before we start using all the fun tools."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-05-08 13:28:23",
    "text": "I'm working on trying to get a 3rd party form submissions to post to the forms API using GTM.\n\nIs this the way to extract the user's hutk with something like the code below?"
  },
  {
    "poster": {
      "poster_name": "Geoffrey Campbell",
      "poster_handle": "gcampbell"
    },
    "time_stamp": "2020-05-08 13:34:04",
    "edited": {
      "time_stamp": "2020-05-08 13:34:54"
    },
    "text": "Hi <@UDDJG2VFG> - how would you extract the hutk from a user who submits a 3rd party form in order to post that to the forms API? Something like this?\n\nvar hutk = document.cookie.replace(/(?:(?:^|.*;\\s*)HubSpotutk\\s*\\=\\s*([^;]*).*$)|^.*$/, \"$1\")"
  },
  {
    "poster": {
      "poster_name": "mmcdaris",
      "poster_handle": "morgan"
    },
    "time_stamp": "2020-05-08 19:53:55",
    "text": "There is a beta that can be joined to <https://community.HubSpot.com/t5/HubSpot-Ideas/Associate-one-contact-to-multiple-companies/idi-p/19236|associate a contact to multiple companies>, is there a way to do this with the API?"
  }
]