[
  {
    "text": "it worked briefly and now is no longer working. im  wanting to change the page header and H1 based on the Dynamic page it is currently on.",
    "time_stamp": "2020-05-18 13:12:58"
  },
  {
    "poster": {
      "poster_name": "Derek Shelby Jones",
      "poster_handle": "whatadayderek"
    },
    "time_stamp": "2020-05-18 13:31:16",
    "text": "ive also noticed that if you make one change from the front end drag and drop edit panel you lose functionality on back end with code. atleast for me that is, i.e. H1 tage and Cover photo"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-05-18 13:37:09",
    "text": "ahhh I see what you’re doing.\n\nyeah I’m not sure I’d use drag and drop that way with dynamic pages. You would just be setting the default content, and I’m not 100% confident how that end result would actually come out.\n\nNormally with dynamic pages people want to preserve the ability to edit the content through HubDB. So you wouldn’t use a dnd area, you would either write the HTML how you want it to display or use module tags with the override parameter set to false."
  },
  {
    "poster": {
      "poster_name": "Derek Shelby Jones",
      "poster_handle": "whatadayderek"
    },
    "time_stamp": "2020-05-18 13:44:11",
    "text": "So my next quest is, and im not really using it for dnd functionality, it was a blank template, can i remove the dnd tags and preserve the format of the template?"
  },
  {
    "poster": {
      "poster_name": "Derek Shelby Jones",
      "poster_handle": "whatadayderek"
    },
    "time_stamp": "2020-05-18 13:45:24",
    "text": "or just remove dnd for the section header in this instance so i can continue to drag and drop modules in lower sections?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-05-18 13:49:32",
    "text": "So depends on your goals. If you were using it purely for structural reasons. then an alternative is you could just use `div`s with the grid classes.\n\n<https://github.com/HubSpot/cms-theme-boilerplate/blob/master/src/css/objects/_layout.css>\n\nIt follows the bootstrap 2 class names.\n\nregarding having lower sections use dnd, If you don’t need the content of those dnd areas to be specific to the hubdb row, then yes. It would be the same for all of those pages, unless you use HubL to hide/show it  for specific pages"
  }
]