[
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-04-24 03:33:40",
    "text": "Hi everyone,\n\nI hope this message finds you well. We are seeking assistance with an issue that has arisen following our transition from using Hapikey (v2 version) to a Private App (v3 version) for our API calls. Since making this change, we have encountered a problem with tracking Google and Facebook leads in our HubSpot contacts list.\n\nPreviously, when we used a [specific code], tracking for contacts originating from Google functioned correctly for v2 version. However, after switching to v3 version, the tracking no longer seems to differentiate properly between Google and Facebook leads. Instead, [specific code] appears to aggregate contacts from both sources under a single filter in the HubSpot contacts list, particularly under the \"Original source drill-down 2\" filter option.\n\nCould you please help us resolve this issue so that we can correctly track and differentiate leads coming from Google and Facebook separately as we did before?\n\nThank you in advance for your help and support.",
    "reply_count": 10,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-24 05:38:47"
      },
      {
        "time_stamp": "2024-04-25 09:12:52"
      },
      {
        "time_stamp": "2024-05-09 02:48:17"
      },
      {
        "time_stamp": "2024-05-09 02:59:26"
      },
      {
        "time_stamp": "2024-05-09 03:16:37"
      },
      {
        "time_stamp": "2024-05-09 03:23:30"
      },
      {
        "time_stamp": "2024-05-09 03:25:27"
      },
      {
        "time_stamp": "2024-05-09 11:03:48"
      },
      {
        "time_stamp": "2024-05-15 02:46:57"
      },
      {
        "time_stamp": "2024-05-20 04:37:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Edmond Deema",
      "poster_handle": "edmond"
    },
    "time_stamp": "2024-04-24 05:38:47",
    "text": "Hi, we need a bit more information about how you're tracking these leads. Specifically, I'm interested in understanding how you're setting the source_drill2 property for each lead. This property is what determines the \"Original source drill-down 2\" filter option in the HubSpot contacts list.:slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Simon Gugala",
      "poster_handle": "simon722"
    },
    "time_stamp": "2024-04-24 09:18:34",
    "text": "Hello.  I am trying to place a form on a HubSpot page that connects to a service called Campaign Nucleus.  They have a 'form receiver link' that connects data from your HubSpot form to the CRM in Campaign Nucleus.  Does anyone have experience and know-how about how to implement this?  Thanks!"
  }
]