[
  {
    "poster": {
      "poster_name": "Gagandeep Singh",
      "poster_handle": "gagan317"
    },
    "time_stamp": "2024-05-20 03:59:25",
    "text": "Hi all, I am trying to create an integration between HubSpot, stripe, and our backend via which we send a quote to our customer from HubSpot and there are a few objects created on the Stripe side once payment is made - subscription, invoice, payment. And at our backend side based on created subscriptions, we assign different services to the customer. For this we are trying to use our own custom quote template and override the functionality of default payment button give by HubSpot. Instead, we are adding our own custom pay button. I am still facing issues while updating the payment status of the quote when payment is made via our custom pay button. Is there any way we can update the payment status of the quote via API or anything? I am open to suggestions and would like to know the possibilities of what can be done to achieve the same solution. The main goal is to handle subscription entries on *Stripe* or on *Stripe &amp; HubSpot both*, whichever is possible Thanks in advance:slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-05-20 04:37:33",
    "text": "Hello <@U06G4DKLZJP>,\n\nWe hope this message finds you well. We wanted to follow up on our previous message. We have yet to receive a response from your end, and we are keen to hear your feedback or any suggestions you might have.\n\nYour input is very important to us, and we would greatly appreciate your timely advice on how to proceed. Please let us know your thoughts at your earliest convenience.\n\nThank you for your attention to this matter. Looking forward to your reply."
  },
  {
    "poster": {
      "poster_name": "Rosie Gyselynck",
      "poster_handle": "rosie"
    },
    "time_stamp": "2024-05-20 06:18:40",
    "text": "Indeed, I guess so!\n\nSo the App developer account actually needs to have an entreprise license then? (Makes sense)"
  },
  {
    "poster": {
      "poster_name": "Mike Eastwood",
      "poster_handle": "mike330"
    },
    "time_stamp": "2024-05-20 15:56:53",
    "text": "Hey HubSpotters, how to I add Template Listing superpowers to my developer portal? I have a Custom Module that I want people to be able to install BUT my Developer Account (45964164) can only add App Listings *not* Theme (or Custom Module) Listings.",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-21 03:43:55"
      },
      {
        "time_stamp": "2024-05-21 03:48:39"
      },
      {
        "time_stamp": "2024-05-21 04:04:34"
      },
      {
        "time_stamp": "2024-05-21 18:09:31"
      },
      {
        "time_stamp": "2024-05-22 01:14:16"
      },
      {
        "time_stamp": "2024-05-22 01:16:30"
      },
      {
        "time_stamp": "2024-05-22 01:16:54"
      },
      {
        "time_stamp": "2024-05-22 01:53:58"
      }
    ]
  }
]