[
  {
    "poster": {
      "poster_name": "juliench",
      "poster_handle": "julien.chiappinelli"
    },
    "time_stamp": "2021-01-21 03:48:39",
    "text": "Hi, I am trying to create a logged call from engagement API.\nIt works fine but I can't set the call type. I have custom call types and I found the property is `hs_activity_type` but I still can't modify it because I can find the corresponding id or tag linked to my custom type.\nHere is the metadata for 'CALL':\n```metadata: {\n        toNumber: 00022211133,\n        status: 'COMPLETED',\n        durationMilliseconds: 60000,\n        body: 'description',\n        hs_activity_type: 'Sales',\n      },```\nHow can I set \"call type\" in a logged call from engagement API ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-01-26 05:56:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mauro Casula",
      "poster_handle": "m.casula"
    },
    "time_stamp": "2021-01-21 10:37:05",
    "text": "Thanks very much Neal and Lance for your responses! I'll do some test! Thanks again!"
  },
  {
    "poster": {
      "poster_name": "Joshua Schrom",
      "poster_handle": "jschrom"
    },
    "time_stamp": "2021-01-21 12:43:06",
    "edited": {
      "time_stamp": "2021-01-21 12:48:58"
    },
    "text": "Hello, I'm attempting to use the \"Search the CRM\" api to find contacts by a few parameters (name, phone, email). I'm able to successfully locate contacts, however I'm only able to search a limited amount (about 9 at a time) depending on whether I use filters or query. Query seems limited to a single string, while filter allows up to 9 depending on what you're providing. The problem in my specific situation is that I'm searching for specific contacts which makes the AND operator between filters within a filterGroup less useful.  Does anyone know a better way to search the crm for an array of email/phone/name without having to make multiple requests? I'm dealing with a list of ~25 contacts."
  },
  {
    "poster": {
      "poster_name": "Quentin Lamamy",
      "poster_handle": "quentin.lamamy"
    },
    "time_stamp": "2021-01-21 18:03:56",
    "text": "Hi <@U01CMKVMJEM> you can use mutltiple filter on a single search with no limitation of result\nPlease post on the community board a new issue and ping me on it. I will see with you how to achieve your search <https://community.HubSpot.com/t5/APIs-Integrations/bd-p/integrations>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-01-22 15:13:03"
      }
    ]
  }
]