[
  {
    "text": "Hello, I am trying to upload a file from client-side via HS Serverless to Custom object. In the <https://developers.HubSpot.com/docs/api/crm/crm-custom-objects|documentation> of Custom Objects I see there is a `fieldType file` option. But later I do not see how the file can be uploaded there via API.\n\nWhat should be ok for my case is that on client-side the file will be encoded to <https://community.HubSpot.com/t5/APIs-Integrations/Sending-files-to-serverless-function-with-html-forms/td-p/375907|Base64> in order to be able to send it to Serverless endpoint (as the <https://developers.HubSpot.com/docs/cms/features/serverless-functions/reference|Content-Type> is only allowed to be json). Then I need to know how to prepare the file in order to create a custom object and add this file in there.\n\nIs there somewhere a documentation on this? Should it be like for <https://developers.HubSpot.com/docs/api/cms/files|files> endpoint? Thank you in advance :thumbsup:\n\nOr, alternatively, is there an option to populate this “Attachments” part that I see on this instance of a custom object?",
    "time_stamp": "2021-01-22 01:44:02"
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2021-01-22 11:49:37",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-22 12:37:20"
      },
      {
        "time_stamp": "2021-01-24 23:19:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-01-22 12:37:20",
    "text": "can you share the url or the code ?"
  },
  {
    "poster": {
      "poster_name": "Joshua Schrom",
      "poster_handle": "jschrom"
    },
    "time_stamp": "2021-01-22 15:13:03",
    "text": "I'm pretty sure I understand what you're saying, but it will not work. I am receiving data from an external source and want to match data points (email, name, phone number) to HubSpot contacts in order to update specific properties on found contacts. The data is not always matching (sometimes perhaps only the name will match). It's okay if it doesn't match, but I believe that negates the ability to use the search api based on the following restrictions:\nWhen multiple `filters` are provided within a `filterGroup`, they will be combined using a logical `AND` operator. When multiple `filterGroup`s are provided, they will be combined using a logical `OR` operator. The system supports a maximum of three `filterGroups` with up to three `filters` each.\nFound: <https://developers.HubSpot.com/docs/api/crm/search>\nThis indicates to me (and through my attempts) that if I have external data consisting of 10 contact's name, email and phone number, I will only be able to do something as such:\n`filterGroups: [ { filters: [1 filter per contact due to AND between filters} ]`\nIn the case that the identifying name/email/phone does not return the HubSpot contact id, I will have to decide between using the next filtergroup to search for the same contact or the next in the list. Of course I would look for the next. The maximum number of contacts I could return would be 3 (1 per filter group). I could use more generic filters to silo the contacts and then search within the returned list, however that seems like a strange path to receive the contact ID when I know the following:\n[name = x, OR phone = 1, OR email =@gmail] for the entire list"
  },
  {
    "poster": {
      "poster_name": "Brent Worley",
      "poster_handle": "bworley"
    },
    "time_stamp": "2021-01-22 16:04:26",
    "text": "I'm attempting to embed the timeline via IFrame into another application.  However, I keep getting this error:\n`{\"status\":\"error\",\"message\":\"Unable to parse value for query parameter: vid\",\"correlationId\":\"7d9ddd08-0b0b-4c21-8460-0ff56541eb64\"}`"
  }
]