[
  {
    "poster": {
      "poster_name": "Harshvardhan Sharma",
      "poster_handle": "harshvardhan.s"
    },
    "time_stamp": "2022-07-22 03:26:02",
    "text": "Hi everyone,  Hope everyone is doing great here!!\nWe are planning to push a theme/no of pages that we have build in-house, willing to list down in HubSpot Marketplace, before moving to marketplace I have few query, it will be really helpful you can help us.\n1. Do we have any other guide lines/ that HubSpot team have updated recently for marketplace. I found a link to it ( <https://developers.HubSpot.com/docs/cms/marketplace-guidelines/compliance-design-code-quality> )\n2. How many modules we can list down in marketplace? If we have variation of module does it will be counted as single or depending upon the variations. \n3. HubSpot has updated a Version based approach where you can update the version of the theme, so we can only update/modify modules or we can add few number of modules. \nThankyou in advance, appreciate your guidance. :innocent:",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-22 05:17:40"
      },
      {
        "time_stamp": "2022-07-22 05:20:51"
      },
      {
        "time_stamp": "2022-07-22 09:49:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sakshi Bansal",
      "poster_handle": "sakshib103"
    },
    "time_stamp": "2022-07-22 05:17:40",
    "text": "Hi <@U0256SM9890> check this link - <https://developers.HubSpot.com/docs/cms/marketplace-guidelines/theme-requirements#:~:text=Themes%20cannot%20contain%20more%20than,50%20modules>\n\nNot sure if this will help you much but this link contains every singe detail for Marketplace theme. Also, there are 2 main points which HubSpot always comes back with while checking the themes -\n1. There should be no warning in any template/module/css/js files of theme before you upload it in marketplace \n2. and every blog module containing featured image should have the backup image in it. "
  },
  {
    "poster": {
      "poster_name": "Sakshi Bansal",
      "poster_handle": "sakshib103"
    },
    "time_stamp": "2022-07-22 05:20:51",
    "text": "And for the variations of modules, it depends on what variations have you created. If they are different modules with different design and fields then they will be counted as different modules"
  },
  {
    "poster": {
      "poster_name": "Harshvardhan Sharma",
      "poster_handle": "harshvardhan.s"
    },
    "time_stamp": "2022-07-22 09:49:17",
    "text": "<@U03QEU2MF5G> Thanks for the quick response."
  }
]