[
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2022-02-04 07:04:02",
    "text": "You got it! Thanks for the feedback--it's very appreciated!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-02-04 09:28:57",
    "text": "If you’ve built with serverless functions in the CMS you’re ready to build custom coded workflow automations. Jack Coldrick shows how to do data enrichment in workflows with custom coded workflow actions.\n<https://www.youtube.com/watch?v=gnDaA1JVaOc>"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2022-02-04 14:04:22",
    "text": "Super excited about this challenge!\nProbably, it’s one of the rare occasions when I managed to meet the contest deadline and submitted earlier despite the prolonged covid in Jan.\n\n<@U2H3TT8F2> <@U7SL518D6> I’m curious about the marketplace review queue and the theme challenge. Looking forward to someone to clarify how it’s gonna work.\n\nI’ve noticed that the queue is moving a bit slow. I submitted my theme on Jan 24. Today, there are still 29 items before mine. It doesn’t seem to be reviewed by Feb 14.\nIf my theme won’t be reviewed by Feb 14, will my challenge submission be valid?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-02-04 14:09:41",
    "text": "Hey Olia! Yep your submission is in there :slightly_smiling_face:."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-02-04 14:09:44",
    "text": "Marketplace reviews are being handled separately from the judging, Judges do not have access to the Marketplace review information. So all feedback you receive from the marketplace team is purely ensure your theme is ready to publish on the marketplace. They will not be giving any feedback from Judges."
  }
]