[
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-06-26 05:25:24",
    "text": "is there a recommended source to buy custom fonts that allow TTF downloads? I just realized Adobe Fonts or MyFonts do not support this. Any recommendations?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-06-26 11:58:40",
    "text": "I used TTF in that example, but I generally wouldn’t recommend serving TTF except as a last-ditch compatibility measure. Browsers near-universally support WOFF2 nowadays, which is much lighter-weight and better suited for web viewing.\n\nAs far as resources to get webfont files to serve, you have a few options:\n• Free font resources like <https://www.fontshare.com/|Fontshare>, <https://www.collletttivo.it|Collletttivo>, or <https://fonts.google.com/|Google Fonts> will usually let you download a package with desktop _and_ web versions of a font\n• Premium marketplaces like <https://www.myfonts.com/|MyFonts> or <https://www.fontspring.com/|FontSpring> will let you select whether you’re licensing for desktop use, web use, or app use when adding a set of fonts to your cart. If you’re not able to download the webfonts from MyFonts, that might indicate that you haven’t purchased the correct license\n• Font subscription services like Adobe Fonts will basically never let you download font files directly, since that would easily allow you to bypass their subscription model\n• When purchasing directly from a foundry like <https://pangrampangram.com|PangramPangram> or <https://www.atipofoundry.com/|atipo>, you’ll usually see the same desktop/web license split that’s found in font marketplaces\n• Some individual creators will offer a combination desktop/web license, but that’s going to be highly case-by-case\nAs far as serving typefaces from Adobe Fonts vs. including them as a custom font in your HubSpot theme: where feasible, I currently recommend sticking with serving via Adobe Fonts and setting fonts via CSS instead of the rich text or theme settings interface. There are a number of user experience (and accessibility) kinks when using custom fonts that aren’t worth the tradeoff, in my mind. For example — the bold and italic buttons in the rich text editor get disabled, requiring font weight to be set from the font select dropdown; this also replaces the relevant semantic elements (`&lt;em&gt;`, `&lt;strong&gt;`) with `&lt;spans&gt;` and `style` attributes."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-06-26 12:06:55",
    "text": "<@U04AQA0QM8E> thank you so much for taking the time to break all of this down. Especially this part \"I currently recommend sticking with serving via Adobe Fonts and setting fonts via CSS instead of the rich text or theme settings interface.\" This is what I was thinking because in my research with Adobe Fonts and MyFonts they don't let you download. So having the font in the font selection dropdown is a nice feature but not workable if the client wants to use Adobe Fonts. Appreciate your help."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-06-26 12:11:26",
    "text": "But one issue with this approach is the CTA popups which you can't fully control the fonts from a theme."
  }
]