[
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-12-09 12:22:49",
    "text": "<@U26BLKGE4> Wow, this is dead simple, but I’ve never thought of doing this — time to go add a “Visibility” style tab to all of the modules I maintain. :sweat_smile: Thanks for the tip!"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-12-09 12:55:36",
    "text": "Could you give a sample of the output you expect, and the output you’re getting? Perhaps screenshots of each?\n\nI’m looking at the code for the default Social Sharing module, and I’m not seeing any logic that handles passing the page title, or setting the default post contents. It seems as if that’s that’s being handled by the platforms themselves, likely based on the relevant page’s meta/OpenGraph information.\n\nAre you testing the default and customized implementations on the exact same page? If you’re using the live previewer or an unpublished page to test the customized implementation, there may not be sufficient metadata for the platform’s post preview."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-12-09 13:25:57",
    "text": "Hello! I’m still having the same issue. The properties started showing, but then they stopped showing again.\nI’m using crm_associations() function and I’m only getting the ID and one property, and my custom object has more than 5 custom properties."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-12-09 13:29:03",
    "edited": {
      "time_stamp": "2022-12-09 13:29:05"
    },
    "text": "Interesting, what does you're call look like?"
  },
  {
    "poster": {
      "poster_name": "Ian Grayson",
      "poster_handle": "ian311"
    },
    "time_stamp": "2022-12-09 16:59:11",
    "text": "Is it possible to construct a URL to a an <http://app.HubSpot.com|app.HubSpot.com> list page (i.e. list of tickets) with prefilled filter value, or ideally a HubL query?",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-12-09 21:11:59"
      },
      {
        "time_stamp": "2022-12-09 23:31:06"
      },
      {
        "time_stamp": "2022-12-10 07:22:05"
      },
      {
        "time_stamp": "2022-12-10 08:24:59"
      },
      {
        "time_stamp": "2022-12-10 11:54:37"
      },
      {
        "time_stamp": "2022-12-10 11:58:44"
      },
      {
        "time_stamp": "2023-01-12 09:56:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-12-09 21:11:59",
    "text": "To my limited knowledge no this currently isn't possible HubSpot list pages don't operate using query parameters just js variables for refetching the data. I could definitely be wrong about this and would like to be corrected <@U7SL518D6> might have a nifty idea"
  },
  {
    "poster": {
      "poster_name": "Ian Grayson",
      "poster_handle": "ian311"
    },
    "time_stamp": "2022-12-09 23:31:06",
    "text": "my goal is to, using an integration, create a note with a link that lists all tickets with \"field = foo\""
  }
]