[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-11 05:29:38",
    "text": "I gave a talk at inbound developer day on how my company does module styling on HubSpot i think it will come in handy for you\n<https://designers.HubSpot.com/blog/developer-day-2018-videos>\n\nRegarding multiple stylesheets it's completely fine we do it all the time. HubSpot combines and minifies them."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-11 16:49:43",
    "text": "Taking notes - We have this top of mind and are thinking through various options. It sounds like an easy fix, however, with a few hundred of people on the product team - we have to make some internal process, culture, infrastructure changes to make this happen. We're exploring potential solutions for 2019."
  },
  null,
  {
    "poster": {
      "poster_name": "Kevin Thurmam",
      "poster_handle": "kthurman"
    },
    "time_stamp": "2018-11-11 17:01:53",
    "text": "I wish I could find a developer to hire in the San Francisco Bay Area. I'm already overwhelmed and just need a website for my business. I want to work with someone local that I can meet with locally. Anyone here?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-11-11 17:47:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-11 17:47:31",
    "text": "Hi <@UE0C97LPK>, I am not from the bay area, so I don’t fit your preference for a local developer. I just wanted to let you know to check back Monday. The slack dies down quite a bit on weekends but is very active during the week.\n\nIf you later decide to expand your search for a developer, my team and I are in Milwaukee WI, and about 60-70% of our clients we’ve never met in person, but have great relationships with because we video chat, call, and communicate well online with them."
  }
]