[
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-09-02 23:54:18",
    "edited": {
      "time_stamp": "2024-09-03 00:05:52"
    },
    "text": "I’m encountering an issue with a blocking action in a workflow. The action sends selected properties to a Lambda function, which then triggers a worker code that updates certain contact fields.\nThe workflow should remain blocked until it receives a response from the worker code, confirming that the contact fields have been updated. However, the action is marked as \"succeeded\" immediately after the Lambda function sends a response, which isn't the intended behavior.\nIs there a way to make the workflow wait for the worker code's response before it ends, rather than succeeding right after the Lambda function sends a response?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-03 00:50:57"
      },
      {
        "time_stamp": "2024-09-03 00:56:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2024-09-03 00:50:57",
    "text": "Is the \"block\" action execution response missing a <https://developers.HubSpot.com/docs/api/automation/custom-workflow-actions#:~:text=you%20can%20specify%20a%20value%20for%20the%20hs_default_expiration%20field|hs_default_expiration> specification?\n&gt; When blocking, you can specify a value for the `hs_default_expiration` field, after which your custom action will be considered expired. The execution of the workflow will then resume and the action following your custom action will be executed, _*even if the action is not completed.*_\n"
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-09-03 00:56:09",
    "text": "I have specified the expiration duration time..but since i get the response from lambda function the action is completed..but i need the action to wait for the response from the worker code after processing"
  }
]