[
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 08:20:17",
    "text": "What is the best approach in making the global header and footer interchangeable parts? I recently had someone purchase a theme for the page layout body content but want to use their corporate header and footer from another theme? Due to style conflicts, I assume I would have to say that it requires custom code to reproduce the header and footer used in another theme. Anyone else run into this?",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-24 12:21:37"
      },
      {
        "time_stamp": "2022-03-24 12:21:55"
      },
      {
        "time_stamp": "2022-03-24 12:25:15"
      },
      {
        "time_stamp": "2022-03-24 12:25:57"
      },
      {
        "time_stamp": "2022-03-24 12:26:26"
      },
      {
        "time_stamp": "2022-03-24 12:27:10"
      },
      {
        "time_stamp": "2022-03-24 12:30:48"
      },
      {
        "time_stamp": "2022-03-24 12:33:00"
      },
      {
        "time_stamp": "2022-03-24 12:33:12"
      },
      {
        "time_stamp": "2022-03-24 12:38:50"
      },
      {
        "time_stamp": "2022-03-24 12:41:47"
      },
      {
        "time_stamp": "2022-03-24 12:51:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-03-24 12:21:37",
    "text": "Hey Jacob, I hope all is well.\n\nI’m not sure if there are any new tricks that I’m unaware of, but I think the best approach is to follow the boilerplate and use `blocks`  in a base template that can be interchanged.\nThis approach may still require additional tweaks based on any js/css that may be required, but if those components are isolated to their own files the could be included in a `block` in the `head` (you could get fancy with conditionals there if you wanted to take it that far).\n\nHere’s the boilerplate example I’m referring to - <https://github.com/HubSpot/cms-theme-boilerplate/blob/main/src/templates/layouts/base.html#L22-L24>\n\nSorry if this is already what you’re doing and I’m wasting your time."
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-03-24 12:21:55",
    "text": "Also, this is assuming that the customer is using a child theme."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:25:15",
    "text": "You will never waste my time. Just curious to see others have face this. My customer is using a theme from another provider"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:25:57",
    "text": "So it's a Frankenstein mashup. I like the guts of yours but want to use it in my main site with header and footer."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:26:26",
    "text": "The other theme didn't use blocks and so there are style code conflicts"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:27:10",
    "text": "So i just need to explain you can't copy and paste between themes without some refactoring"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-03-24 12:30:48",
    "text": "Ah shoot, that def. makes things a bit difficult. I’ve def. seen folks run into this issue before, and the best result was to:\n• Isolate all of the html/css/js from their existing header/footer and try to separate it out into their own files\n• Add those files to the theme that you created\n• Remove any conflicting code from your theme (header/nav behavior and style, footer oddness, any potential smooth scrolling or other js conflicts\nDepending on how much of a mess their existing theme is, the alternative is to tweak the theme that you created to match the style and behavior of their existing header/footer. Although this is a pain, it can sometimes be easier since you’re playing with code that you wrote vs. code that could be an absolute nightmare…"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:33:00",
    "text": "Yeah great point"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:33:12",
    "text": "Blessing and curse of themes I guess"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-03-24 12:38:50",
    "text": "Yeah, it certainly isn’t an easy problem to solve for developers or from a platform perspective.\nSections have a lot of potential to swap out full blocks of content. Depending on the complexity of a page, it could be simple to generate a number of sections that customers could pull into their existing theme. However, they’d probably be tied to their existing style (which may be best?)"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-24 12:41:47",
    "text": "I wonder if it makes sense for header and footer to be a site setting that is global for the domain. You can then override on the page level if you want. Like you can with global logo. Hmm"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "yolo"
    },
    "time_stamp": "2022-03-24 12:51:39",
    "text": "That’s a cool idea. It would force developers to code a specific way, and would probably be a long road to adoption for existing customers… But hey, I’ve seen crazier things happen."
  }
]