[
  {
    "poster": {
      "poster_name": "Dawid Kokoszka",
      "poster_handle": "dawid.kokoszka"
    },
    "time_stamp": "2023-03-29 03:42:40",
    "text": "You are right, I'm able to clone the existing modules but I want to create a new one. When I'm trying to do this the new module doesn't display in the section with theme modules.\n\nmy goal is to create a new module not overwrite the existing one"
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-03-29 06:28:04",
    "text": "Hello everyone,\nare there any updates about the customization of the Knowledge Base? Not only as far as custom html/css are concerned, but also for JavaScript. Like, I wish I could interact with the KB through a custom script to collect the query entered by the user and its results in order to send an event to Google Analytics. Currently it seems it's still not viable, isn't it?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-03-29 13:22:18",
    "text": "Hey Dawid, can you share more about the module you created that isn't showing in the child theme?"
  },
  {
    "poster": {
      "poster_name": "Sergio S. Reyes",
      "poster_handle": "sergio.reyes"
    },
    "time_stamp": "2023-03-29 13:32:39",
    "text": "I've been spending all day updating field mappings in a HubSpot production sandbox connected to a Salesforce sandbox. I would love 1 of 2 things, either would make life so much easier:\n\n1. HubSpot production sandbox ability to sync native Salesforce integration settings (preferred)\n2. Public Salesforce Connector API. Same logic as leveraging the public properties API to bulk GET/POST properties from a production account to a dev test portal that isn't a proper sandbox for testing.\n    a. Bonus here would be surfacing some of the tools that internal HubSpotters use for troubleshooting, such as sync history (updated properties/previous value, trigger)\nPlease/thank you!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-03-29 13:43:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sergio S. Reyes",
      "poster_handle": "sergio.reyes"
    },
    "time_stamp": "2023-03-29 13:43:21",
    "text": "To add some context to my pain:\n\nThe integration when first connected pulls over all fields visible to the integration user and creates custom properties in HubSpot to match. This is great when you basically want to map everything, but when you have A TON of unwanted properties, this makes for a lot of clean-up, re-mapping of properties that already had a custom property pulled over from the sandbox object schema sync (non \"__c\" variants that were created in production at some point in time to match a new SFDC field).\n\nAdditionally, once I finish getting everything to be a 1:1 match by updating, deleting mappings (and bonus unwanted properties), I feel pretty stuck with this sandbox. For assets that can't be re-synced (e.g., one-time 5000 record sync), it's not an option for me to rebuild the sandbox given the hours of work that I'm sinking (no pun intended) into this. I also have to hope that no other super admin nukes this thing :grimacing:"
  }
]