[
  {
    "poster": {
      "poster_name": "David Essery",
      "poster_handle": "david297"
    },
    "time_stamp": "2020-03-27 06:49:24",
    "text": "Hi All. I have am looking at creating a custom integration between another platform and HubSpot for the first time. I am just trying to get my head round the correct methodology for it. Am I right in thinking that what I need to do is essentially build my integration as a middleman that sits between both platforms so that when a webhook on my other platform fires, it sends the data to my application, which picks it up, processes the data and puts it in the right format to then send to HubSpot via the API. Is that correct? Many thanks!",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-03-27 08:36:45"
      },
      {
        "time_stamp": "2020-03-27 08:41:09"
      },
      {
        "time_stamp": "2020-03-27 08:43:59"
      },
      {
        "time_stamp": "2020-03-27 08:45:18"
      },
      {
        "time_stamp": "2020-04-27 15:16:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2020-03-27 08:36:45",
    "text": "Hey <@UGKAX5HQC> without knowing the end use case that sounds about right from a high level. Most integrations act as a middleware when you squint enough at it.  The devil is in the details. If you have any specific questions on which APIs to use, let me know."
  },
  {
    "poster": {
      "poster_name": "David Essery",
      "poster_handle": "david297"
    },
    "time_stamp": "2020-03-27 08:41:09",
    "text": "Hey <@UFBNA9K9A>, thank you very much for coming back to me! It seemed like the most logical way of doing it. Basically I am just trying to send data from another platform into HubSpot. I can configure a webhook from the other end but obviously I can’t connect that straight into the HubSpot API so a middleman makes sense. I have used the HubSpot API a lot so it sounds like it should be pretty straightforward but it is usually when someone does something like submits a form or something, not using webhooks. Many thanks!!"
  },
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-03-27 08:43:59",
    "text": "<@UGKAX5HQC> Hi, just saw your post, if you're looking for a 'middleman' type integration that passes information back and forth from HubSpot to another platform it might be worth looking into Zapier as you might find an integration already exists and could save some time building something from scratch. <https://zapier.com/apps/HubSpot/integrations>"
  },
  {
    "poster": {
      "poster_name": "David Essery",
      "poster_handle": "david297"
    },
    "time_stamp": "2020-03-27 08:45:18",
    "text": "Hi <@UKU1Z4X63> Thanks for this, I have looked at some of the out of the box integrations for the other platform on Zapier but the options are very limited. But I guess I can just use the webhooks to do whatever I want. I will look into it further. Many thanks!"
  },
  {
    "poster": {
      "poster_name": "Louis Chaussé",
      "poster_handle": "louis.chausse"
    },
    "time_stamp": "2020-03-27 13:14:03",
    "text": "Hi! Do you know of a SMS integration that supports one-to-one MMS sharing and also create a new HubSpot contact for unknown numbers inbound messages. I tested Sakari and Salesmsg (They both support MMS, but don't create new contacts for unknown numbers). I also tested SMSZap, it does create a contact for unknown numbers, but does not support MMS... I'm a bit tired of creating free trial accounts for every SMS integration in the app marketplace so if you know one integration that will fulfill my need that would be awesome."
  }
]