[
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-07-23 07:23:10",
    "text": "Hi, we would love to have this feature as well. Any future plans to include the abality to pre-populate the message or the subject line?"
  },
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-07-23 07:31:57",
    "text": "Hi <@U05ENUJF7B5>, the use case we have for the same feature is on the help desk. The service agent needs to pass some questions to external people (the storage company) to answer to a customer ticket. We do that by creating a child ticket and then want to send a one to one email in the context of the child ticket. It would be very nice if we could add automatically some text/template that we generate from the context of the ticket. Something like “Hi {{contact.name}}, our customer is waiting for the delivery of the order {{ticket.order_id}}. Could you please send us the tracking link for the delivery… In short: we want to open a new conversation with as little effort as possible."
  },
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-07-23 07:36:16",
    "text": "We would prefer GQL since we have often nested associations until we get the data we need. Things like all line items of the associated deal to a ticket."
  },
  {
    "poster": {
      "poster_name": "Renee Mazza",
      "poster_handle": "rm9705"
    },
    "time_stamp": "2024-07-23 12:12:06",
    "text": "We have been able to run an API call to push Qliksense data to HubSpot, however the 2FA has posed an issue as we are getting the notification with each push. Can anyone provide a quick fix for this? I am sure it is simple for those involved in development."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-07-23 17:10:09",
    "text": "Makes sense, <@U011PG2JL2H>. Curious to know your answers to the rest of the questions in the post."
  },
  {
    "poster": {
      "poster_name": "Michal Wezykowski",
      "poster_handle": "michal.wezykowski"
    },
    "time_stamp": "2024-07-23 18:21:12",
    "text": "Always happy to help, and looking forward to new possibilities! \n\n1. GQL and bulk updates are by far the most popular apis. \n2. We have complex relationships that need to be propagated from master object to all childrens and on children updates propagate through the master object to the rest of the children associated. \n3. Inability to run serverless functions triggered outside workflows, UI, or CMS. I'd love to see serverless functions as a more advanced custom code on workflows that is not constrained to execution on a specific object but rather whole account. Triggering a workflow from serverless function and, GitHub integration for custom code workflows would be golden.\n4. GQL, always! There is no option to filter on record associations on REST, especially in a single GET request. "
  }
]