[
  {
    "poster": {
      "poster_name": "Priyanka Salodia",
      "poster_handle": "minipikupie"
    },
    "time_stamp": "2024-07-24 04:17:19",
    "text": "Can anyone help me creating High Probability report - Basically m interested in report of 2 keywords , i want to know the no. of users came after searching that 2 keywords\n\nneed that report from HubSpot"
  },
  {
    "poster": {
      "poster_name": "Chris Simoni",
      "poster_handle": "chris.s9606"
    },
    "time_stamp": "2024-07-24 07:49:02",
    "text": "1. Batch and GraphQL\n3. Our association names seem to have shifted around when we made our dev sandbox so all our GraphQL queries need tweaked between dev and prod.\n\n4. GraphQL is nice. It would be better if we could use where clauses and other operations, unless we can already."
  },
  {
    "poster": {
      "poster_name": "Ashutosh Singh",
      "poster_handle": "ashutosh.singh"
    },
    "time_stamp": "2024-07-24 10:08:24",
    "edited": {
      "time_stamp": "2024-07-24 10:17:45"
    },
    "text": "So, do we need CRM dev tool access in order to develop an app locally? <@U06832ZTGKC>"
  },
  {
    "poster": {
      "poster_name": "Robyn Naragon (HubSpot PM)",
      "poster_handle": "rnaragon"
    },
    "time_stamp": "2024-07-24 10:23:52",
    "edited": {
      "time_stamp": "2024-07-24 10:33:58"
    },
    "text": "Super admins and partner admins can develop apps locally, and if your portal is enrolled in the private beta for the new developer permission set, users with the 'Developer tools access' permission enabled can also develop an app locally, as this permission grants users access to CRM Dev tools.\n\nThe beta can be requested in-app under your avatar in the top right > Product Updates > search for 'New Developer Permission Set'. The new permission toggle will in appear permission settings under Account > Settings access permissions.\n\nLet me know if you request the beta, and I can go ahead and approve it!"
  },
  {
    "poster": {
      "poster_name": "Ashutosh Singh",
      "poster_handle": "ashutosh.singh"
    },
    "time_stamp": "2024-07-24 12:51:55",
    "text": "Thanks for getting back to me, I have requested the beta now."
  },
  {
    "text": "I've just approved the request :+1: You might need to log out and then back into your account to see the changes take place.\n\nIn additional to the '*Developer tools access*' permission toggle, you will also have access to the developer permission template. The template includes all of the permissions that a developer should need to do their work, including the new developer permission. That way, admins don't have to individually enable each permission toggle to a user, as the template will auto-enable this pre-determined set of permissions.\n\nAdmins can still fine-tune the permissions assigned to the user, or add the new developer tools permission to an existing custom permission set. Let me know if you have any feedback regarding the new  permission and/or developer permission template :slightly_smiling_face:",
    "time_stamp": "2024-07-24 13:00:53"
  }
]