[
  {
    "poster": {
      "poster_name": "Ian Hayes",
      "poster_handle": "ian802"
    },
    "time_stamp": "2021-11-02 07:57:42",
    "text": "Hey all, has anyone added / pulled a description from a tag in the tag template? I can see theres a description in the API docs but not in the CMS"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-11-02 11:41:25",
    "text": "<@UBT0AHWLD>"
  },
  {
    "poster": {
      "poster_name": "Ian Hoyte",
      "poster_handle": "ian135"
    },
    "time_stamp": "2021-11-02 15:14:38",
    "edited": {
      "time_stamp": "2021-11-02 16:00:21"
    },
    "text": "Hey guys, maybe a bug in the new Beta Blog Listing editing capabilites section?  Here is what I experienced:\n\nI ran into an issue with the new Beta Blog Listing template when trying to change the template from one that was deleted to a new template.  The reason I found this was that I accidently uploaded my custom theme with the wrong Folder name, so had deleted it, and uploaded the theme with the proper name.\n\nThe Blog Listing template correctly showed an error that the template didn't exist, but I wasn't able to switch it from the old template to the new one.  The template picker didn't display the blog index template at all, so I wasn't able to select it.\n\nI resolved it by reuploading a blog listing template with the same path as the old one, then I could change it to the new theme.\n\nHere are some steps to receate it.\n\n1. Enter into the beta to enable the new Blog Listing Page editing capabalities;\n2. Assign a Blog Listing template from a custom theme to the Blog Listing Page;\n3. Delete the theme that contains the Blog Listing Page template;\n4. Upload a new theme*;\n5. Attempt to change the Blog Listing Page to the Blog Listing Template found in the new theme;\n\n*Note that I only had 1 theme uploaded at any one time.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-10 06:02:48"
      },
      {
        "time_stamp": "2021-11-10 06:15:42"
      }
    ]
  }
]