[
  {
    "poster": {
      "poster_name": "Andrea Simoncini",
      "poster_handle": "andrea.simoncini"
    },
    "time_stamp": "2021-02-15 03:55:41",
    "text": "Hi! New here! what is the difference between Themes and Templates? I mean the item I want to buy in the Marketplace is available both as a theme than as a template pack, and don’t know if they are the same or different.\nCan you please help me?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-02-15 04:04:47"
      },
      {
        "time_stamp": "2021-02-15 04:17:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-02-15 04:04:47",
    "edited": {
      "time_stamp": "2021-02-15 04:08:17"
    },
    "text": "I would go for the theme - this is the standard now. Template packs are legacy and are likely to be a bit more fiddly to customise. Whereas the new theme standard tends to be easier to configure."
  },
  {
    "poster": {
      "poster_name": "Andrea Simoncini",
      "poster_handle": "andrea.simoncini"
    },
    "time_stamp": "2021-02-15 04:17:33",
    "text": "thank you!"
  },
  {
    "poster": {
      "poster_name": "Håvard Bartnes",
      "poster_handle": "bartnes"
    },
    "time_stamp": "2021-02-15 09:24:05",
    "text": "Hi all! I am diving into the HubSpot CMS as a part of my onboarding process at my new workplace. After examining some templates and various sites using HubSpot CMS I was a bit frightened, as most of them didn't render valid markup. But after reading a bit of documentation it seems like this could all be avoided creating good templates from scratch. Coming from Craft CMS, HubSpot CMS looks like a nice tool to dig into.",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-02-15 09:40:24"
      },
      {
        "time_stamp": "2021-02-15 09:47:02"
      },
      {
        "time_stamp": "2021-02-15 09:48:10"
      },
      {
        "time_stamp": "2021-02-15 09:53:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-02-15 09:40:24",
    "edited": {
      "time_stamp": "2021-02-15 09:47:56"
    },
    "text": "Hey - so it’s pretty familiar to CraftCMS, but naturally you have less control. You’re going have a better developer experience if you develop themes module first and in isolation - but i’d say that’s a pretty standard approach nowadays with things like BEM and React.\n\nUltimately you’re going to have no issues with HUBL - it’s just an extended version of Jinja2 (very similar to Twig) so ultimately front-end wise it’s good.\n\nIf you need more custom data/objects you can use crm_objects (though quote new) and custom objects, or HubDB. These can both be queried via the CMS.\n\nYou’ll want to be building stuff out in themes - which will allow you to provide global settings for the site (usually for design and layout, things like font colours.\n\nFor content/module specific layout/styles you will use fields.json which each module will have."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-15 09:47:02",
    "text": "Hey there Havard!\n\nHighly recommend our quick-start guide, which gets you from nothing to having a website in a sandbox account in just a few minutes.\n\n<https://developers.HubSpot.com/docs/cms/guides/getting-started>\n\nYou as the developer control the markup. The only significant area you don’t control markup for is just the drag and drop areas.  You as the developer create the modules that content creators can use inside the drag and drop areas, you control the markup for the modules themselves.\n\nAs Kieran said, modules are a pretty powerful tool in HubSpot and are a great way for you to control markup as well as allow content creators to change settings/styles."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-15 09:48:10",
    "text": "If you’d like to see basically what a bare-bones HubSpot theme looks like check out <https://developers.HubSpot.com/docs/cms/building-blocks/themes/HubSpot-cms-boilerplate|the boilerplate>"
  },
  {
    "poster": {
      "poster_name": "Håvard Bartnes",
      "poster_handle": "bartnes"
    },
    "time_stamp": "2021-02-15 09:53:28",
    "text": "Thanks a lot for the feedback. I'll spend a few days digging further into HS CMS with your comments in mind :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Daniel Gurtner",
      "poster_handle": "dgurtner"
    },
    "time_stamp": "2021-02-15 13:29:01",
    "text": "Good Day to you all! Interestingly, HubSpot is not new to me - It's this new and waaay better version of HubSpot that is new for me :wink: Having said that, I was hired by a skincare company to build a Shopify store and in the meantime I'm spending more time working on our HubSpot setup than Shopify :zany_face: Great, now I'm learning a new CMS!"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-02-15 14:49:27",
    "text": "Hubl and Liquid are super similar!"
  },
  {
    "poster": {
      "poster_name": "Daniel Gurtner",
      "poster_handle": "dgurtner"
    },
    "time_stamp": "2021-02-15 23:14:18",
    "text": "Yeah, browsing through that fields.json I found something eerily familiar :astonished:"
  }
]