[
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-01-25 07:59:40",
    "text": "Hi <@U06AR8NSUBX>, can you tell me what you meant by 'passing the session to the app' - which app did you refer to in that context?"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-01-25 08:00:22",
    "text": "&gt; Because the NextJS app is public, and if I use the private app api key, any action there can be done by anyone, technically (my only security is through people not knowing the URL).\nBy public, did you mean that it's unauthenticated?"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-01-25 08:01:09",
    "edited": {
      "time_stamp": "2024-01-25 08:01:17"
    },
    "text": "Also, unrelated to solving this problem, I'm curious to know why you decided to stand up a nextjs app instead of building in inside the extension, thinking of what capability did you miss as a developer."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-01-25 08:01:55",
    "text": "Can you give me an example?"
  },
  {
    "poster": {
      "poster_name": "Jeff Stafford",
      "poster_handle": "jeff544"
    },
    "time_stamp": "2024-01-25 10:58:55",
    "text": "Fairly new to the HubSpot Slack channel and never completely sure where to post, but maybe someone here can help with this issue. I've created a custom theme using CMS Boilerplate and one of my pages includes javascript that needs to fetch a JSON file that contains some data that I need to parse. If I put the JSON directly into a variable everything is working fine, but when I try to fetch a file thats hosted on my HubSpot CDN I'm getting, \"failed to load resource connection refused\". Thought it might be a CORS issue but everything is on HubSpot so that doesn't seem right. The site isn't live yet, just using the temp dev url. Any ideas?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-25 11:08:40"
      },
      {
        "time_stamp": "2024-01-25 11:11:23"
      },
      {
        "time_stamp": "2024-01-25 16:53:02"
      },
      {
        "time_stamp": "2024-01-26 16:05:56"
      },
      {
        "time_stamp": "2024-02-07 12:48:24"
      },
      {
        "time_stamp": "2024-02-07 13:17:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2024-01-25 11:08:40",
    "text": "How are you retrieving this data?\n\nHosted on your HubSpot CDN - meaning, the content is hosted in your portal? Is it in the file manager?"
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2024-01-25 11:11:23",
    "text": "If it’s an authenticated request - regardless of whether or not it’s content connected to your portal, HubSpot will block the request.\n\nFrom the docs:\n\n_*Do the HubSpot APIs support CORS / AJAX requests?*_\n\n_For the most part, the HubSpot APIs do not support cross-origin (CORS) AJAX requests. Making the request client-side using JavaScript would expose any authentication you’re using for the request. In order to use JavaScript/AJAX, you would need to make the request (excluding any authentication) to an external server that could then add the needed authentication and make requests to HubSpot’s APIs server-side._\n_The exceptions to this rule are:_\n• _The <https://legacydocs.HubSpot.com/docs/methods/forms/submit_form|Submit form data (AJAX)> endpoint, which accepts CORS AJAX form submissions._\n• _Most `GET` requests for published HubDB tables. See the <https://developers.HubSpot.com/docs/methods/hubdb/hubdb_overview|HubDB API Overview> for more details._\n"
  },
  {
    "poster": {
      "poster_name": "Jeff Stafford",
      "poster_handle": "jeff544"
    },
    "time_stamp": "2024-01-25 16:53:02",
    "text": "The file is in the file manager (Marketing &gt; Files &amp; Templates &gt; Files). I also tried putting it in a folder within my theme."
  }
]