[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 06:32:14",
    "text": "I disliked twillio, however I didn’t’ do much with sms from there. That is more about their other apis and their documentation,. From sales to sales support and tech support I found it difficult to work with them\n\nVonage has super simple apis for text/voice. I think I set up an email watcher to call and text me when a certain email came in in a day without touching vonage or google mail apis before. Vonage was the easier part of that"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 06:40:11",
    "edited": {
      "time_stamp": "2024-01-18 06:41:57"
    },
    "text": "HubSpot forms from 2 portals, site on wordpress. crm2 is receiving more data than they should\n\nI believe what is happening here is you have crm2 collecting non HubSpot forms. It reads a different HubSpot portal form as a non HubSpot form. This is why the data is flowing in there. You could turn that off and that should solve this problem. If you still need that to happen, here are a few options\n\n• if you display form from crm 2, you would want to use the HubSpot tracking code from crm2, not crm1. That might help out with this. set that up in your google tag manager\n• Use a custom form and route this to the forms api, sending the data to the proper crm, similar to your zapier item\nNow, those options there — I have to ask WHY are you doing this. Why are there two CRMs, why is any of this happening, this is the problem — you are going to continue to develop crazy work arounds because of this. This seems like a bad path to go down and to let people make business decisions around this.\n\nTwo CRMs for one website.. but only on one page and one form…."
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:06:21",
    "edited": {
      "time_stamp": "2024-01-18 07:07:16"
    },
    "text": "Hi,\nI'm doing this multi CRM system into one website, because we need depending to user choice ( select box ), to send leads into differents platforms. Thats separate ones.\nThen with GravityForm plugin, wordpress communicate and is connected with HubSpot CRM1 by default.\n\nMy system let people choosing the form then simply send a request.\nEven without my double contact form system, we had same problem with wordpress contact sending into only CRM 1.\n\nTomorrow we'll test to disable the option into setting \"enable data from non-HubSpot forms\". Maybe that will solve our problem from that double form system"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:08:16",
    "text": "Finally thats two CRMs for one website, with 2 forms selection."
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:09:04",
    "text": "Thats a click2 call system in the end"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 07:26:33",
    "text": "You don’t have to dig into the details, but I’m trying to understand why one website is sending data into two different crms. I’m not understanding the business use case.\n\nThis is an example of why someone would do this\nManufacturing website. Manufacturing company has a retail and a wholesale division. They have each of their databases separated out and into different CRMs. So one form goes to retail, one goes to wholesale.\n\nThat is what I’m trying to understand — I’m trying to wrap my head around why one website feeds two separate crms"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:30:09",
    "text": "thats simply one website with two differents topics included. Each topics have a proper CRM with behind a call center"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 07:36:56",
    "text": "Are you using both tracking codes on the website or just one of the crms?"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:38:12",
    "text": "just one"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:38:26",
    "text": "crm1 by default loaded by gravity form plugin"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 07:46:59",
    "text": "I’d remove that from happening in gravity forms and set it in google tag manager. Then when you change between form 1 and form 2, you can change the embed code as well. This will prevent the issue of the data going to the other crm, it won’t even see the page when the other tracking code is loaded"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 07:59:46",
    "text": "i did already. i can't disable gravity form connection. That will blocked my others forms"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 08:06:00",
    "text": "If you have the tracking code on your website pages and a form completion is done, HubSpot picks that up in the crm"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 08:08:34",
    "text": "in reality what you should be doing is having two website that have two separate tracking codes. You could also have two seperate landing pages, one for each crm, and instead of putting the form on the page, you put them on seperate landing pages. You create a cta that sends them to the proper landing page, or you just redirect them to the proper page. Each of those landing pages are associated to the correct crm.\n\nThat would prevent all the issues you are having"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 08:12:25",
    "text": "yes of course but i can't recreate a second website with more that 400 articles, juste to prevent an HubSpot error.. I have to keep that unique website. Then, i'll check wordpress gravity form plugin to see if i can change something"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 08:12:31",
    "text": "thanks for your assist"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 08:19:54",
    "text": "What subscriptions on HubSpot do the CRMs have?"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 08:25:01",
    "text": "the entreprise one"
  },
  {
    "poster": {
      "poster_name": "Fabien Flerchinger",
      "poster_handle": "flerchinger.contact"
    },
    "time_stamp": "2024-01-18 08:25:03",
    "text": "last one"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-18 08:51:56",
    "text": "if you have marketing pro on either of them, you can create landing pages and put them on a subdomain for each site"
  },
  {
    "poster": {
      "poster_name": "Chad Sollis",
      "poster_handle": "chad182"
    },
    "time_stamp": "2024-01-18 09:28:18",
    "text": "Good morning.  Is there a way with `ui-extensions` , specifically `openIframeModal` to pass the `oauth` token to the opening iframe to continue the session and leverage in API calls in the frame window?\n\nI'm currently using a limited scope `private app token` -- which works, but still feels insecure for the operations we are running in the iframe.\n\nBehind the scenes, we pass a deal id in the iframe url, look up the deal, present a quoting experience, then write to a custom object the results of the experience.\n\nTheoretically, anyone who knew the URL could cycle through deal IDs and see *some* deal information.  Also, they could create quotes, which isn't the end of the world.\n\nBut I'd love to lock down with Oauth, without prompting them again for credentials.\n\nAm I missing something?  IS my only option to run an OAuth experience upon iframe open?",
    "reply_count": 11,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-01-18 15:55:54"
      },
      {
        "time_stamp": "2024-01-19 05:44:16"
      },
      {
        "time_stamp": "2024-01-19 07:40:32"
      },
      {
        "time_stamp": "2024-01-21 09:37:25"
      },
      {
        "time_stamp": "2024-01-21 11:00:41"
      },
      {
        "time_stamp": "2024-01-21 11:00:49"
      },
      {
        "time_stamp": "2024-01-22 13:43:57"
      },
      {
        "time_stamp": "2024-01-25 07:59:40"
      },
      {
        "time_stamp": "2024-01-25 08:00:22"
      },
      {
        "time_stamp": "2024-01-25 08:01:09"
      },
      {
        "time_stamp": "2024-01-26 11:23:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marwin Ramos",
      "poster_handle": "marwin"
    },
    "time_stamp": "2024-01-18 10:31:09",
    "text": "hello, is there a way for us to create our own validations on a specific field in HS Forms?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-19 05:45:25"
      },
      {
        "time_stamp": "2024-01-25 08:01:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-01-18 14:53:28",
    "edited": {
      "time_stamp": "2024-01-18 14:56:40"
    },
    "text": "I am still looking into this as an fyi, <@UDLS0CYPP>"
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2024-01-18 14:53:50",
    "text": "I have a working solution to start/stop presently."
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2024-01-18 14:55:51",
    "text": "It will require all videos that need message-based playback to be set to `autoplay` , and for a mutation observer to check for state change from `ready` to `playing`. Once it starts to play, you can pause or play the video via the method above (`postMessageToPlayer` )."
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2024-01-18 14:56:46",
    "text": "The key is the `autoplay` - until the video is instantiated, either through autoplay functionality or a click, you cannot post messages to the video. After the video starts, you can control remotely."
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2024-01-18 14:58:43",
    "text": "The preferred solution is to give users of the API the ability to post messages that are all accepted after a certain status, I would presume `loaded` is most appropriate. That way, I can play without having to observe changes to the player, and setup the video to not autoplay."
  },
  {
    "poster": {
      "poster_name": "Chad Sollis",
      "poster_handle": "chad182"
    },
    "time_stamp": "2024-01-18 15:55:54",
    "text": "<@U05KNCMAE7N> able to provide perspective?"
  }
]