[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 05:37:58",
    "text": "are you asking about the old dnd templates? or the new dnd areas?\ndnd templates I would say they are deprecated, (if not, they should):\n\n• You have limited control of the HTML output.\n• it injects old css for bootstrap framework.\n• It requires some \"hackish\" ways to  localize the template.\n• The marketer relays on the built-in templates or he needs to dig in to the DM.\n"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-04-19 05:41:45",
    "edited": {
      "time_stamp": "2021-04-19 05:42:19"
    },
    "text": "If you didn't checked yet the local tool <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli|HS CLI> I would highly recomend to check it and play with it.\nIt will basically allows you to work with your own tools and setup.\nIt will basically allows you to build your templates freely (with or without drag n drop areas, if you don't want to allow that much flexibility for marketers) but with the freedom that doesn't gives you the old DM dnd templates."
  },
  {
    "text": "Hello All - I’ve got a specific use case that I’m in need of developer insight on! I myself am not a developer, but ’ll do my best to summarize below:\n\n• We are building a secondary navigation bar underneath the hero <http://6846802.hs-sites.com/-temporary-slug-b2616943-bf95-41db-bda0-d324ddbd7814?hs_preview=uGFNJQbQ-45384431948#|on this page>. When a user selects an option (logo for home page and “about” are the only two options working), the content changes. \n• The last three navigation options are not functioning as intended - it seems we’ve reached a limit for the number of modules or content for these pages? Is there a way to workaround this?\n• I’ve attached the template code below for insight on how we’ve configured this. We want to continue to add content by navigation option and wonder if it’s down to how we’ve configured the code. \nAny insight is helpful! Feel free to DM me directly as well.",
    "time_stamp": "2021-04-19 17:40:08",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-20 07:42:54"
      },
      {
        "time_stamp": "2021-04-20 09:25:04"
      }
    ]
  }
]