[
  {
    "poster": {
      "poster_name": "Lisa Sundberg",
      "poster_handle": "ls"
    },
    "time_stamp": "2021-04-14 03:26:05",
    "edited": {
      "time_stamp": "2021-04-14 03:27:45"
    },
    "text": "Hi guys, I’m quite new to HubSpot and I’m about to create a landing page dnd template, but I have a problem setting the width and offset of columns and modules. All the modules turn out 12 columns, even though I set the width and offset to something else. I don’t think it’s a CSS issue because the modules don’t even get the correct CSS class. Even if I set `width=7`, the CSS class I see when I inspect is `span12`. Offset is ignored completely. I have the feeling I’ve missed something really simple, but I can’t figure out what. Any tips much welcome :slightly_smiling_face:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-04-14 03:46:39"
      }
    ]
  },
  {
    "text": "Hello guys, I am very new in HubSpot and need help\nI need to add editable (not rich text) tag into my template inside dnd_module tag . Is it possible? Unfortunatly i can`t see any updates even with simple div tag. Template stay the same(",
    "time_stamp": "2021-04-14 03:29:44",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-14 03:41:16"
      },
      {
        "time_stamp": "2021-04-15 00:58:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-04-14 03:41:16",
    "text": "everything you add on this position is part of the RichText Field. If you want to add something else the module ( for example a text or image) , you would need to add it outside of the  rich Text field"
  },
  {
    "poster": {
      "poster_name": "Lisa Sundberg",
      "poster_handle": "ls"
    },
    "time_stamp": "2021-04-14 03:46:39",
    "text": "Found the reason – I had been updating the content in the content editor, so my code changes didn’t reflect on the page since content changes override the template"
  },
  {
    "poster": {
      "poster_name": "Max Haponenko",
      "poster_handle": "maksym"
    },
    "time_stamp": "2021-04-15 00:58:40",
    "text": "Thanks!"
  }
]