[
  {
    "text": "Hi <@U25PYL3Q8>\n\nThank you so much for assisting!!:pray: Bear with me in the update below; as I said, I have no knowledge of coding.\n\nHere are the updates - I am not sure it is running right - <https://www.loom.com/share/63651d9f2bfd4c86adba41891d23666f?sid=a81afa19-454c-44a1-a25a-14362ddf87f2>\n\nI realized I referred to the create date section. I just mean that, as per my original screenshot, HubSpot made it hs_createdate by default. Is it fine to change it to createdate?\n\nWe want to report only on calls made on weekdays. Moreover, if we report on the average number of calls made a day, will eliminating weekdays not skew that average if fewer calls are made on weekends?\n\nAlso, find screenshots below.\n\nNot sure how to check if it is working if I cannot see what call is being run through and to what value the property is being set.",
    "time_stamp": "2025-01-22 08:26:48"
  },
  {
    "poster": {
      "poster_name": "Etlané van Jaarsveldt",
      "poster_handle": "etlanevanjaarsveldt"
    },
    "time_stamp": "2025-01-22 08:35:50",
    "text": "<@U25PYL3Q8> Also, if I can get this right here, we do not need a dataset for this (it was much easier to achieve there, of course), and then we can have call reports with *dynamic* date range *dashboard* quick filters. Furthermore, this enables us to filter out calls based on the day of the week as a whole and compare by days of the week, etc."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-22 08:47:03",
    "text": "I am in meetings for quite a bit of today, but I will get back to you on this"
  },
  {
    "poster": {
      "poster_name": "Etlané van Jaarsveldt",
      "poster_handle": "etlanevanjaarsveldt"
    },
    "time_stamp": "2025-01-22 08:59:51",
    "edited": {
      "time_stamp": "2025-01-22 09:14:20"
    },
    "text": "No worries - I will check back regularly until around 2pm PST, but no rush at all - any help is much appreciated.\n\nAlso note that I manually enrolled 5 calls and it did not work. As I was not sure how to check, I chose 5 calls, filtered for them from CRM > Calls, and checked if the day of the week was updated. Unfortunately it did not, although it said success."
  },
  {
    "text": "",
    "time_stamp": "2025-01-22 09:14:45"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-01-22 10:50:18",
    "text": "Basically if you copy everything I did, renaming the hs_whatever to just how I have it in my screenshots, making sure input and output match, it should work, but maybe not after reading in more detail\n\nso your goal is to have any calls that happened on monday to have a monday property output? does this information need to live on other properties?"
  },
  {
    "poster": {
      "poster_name": "Etlané van Jaarsveldt",
      "poster_handle": "etlanevanjaarsveldt"
    },
    "time_stamp": "2025-01-22 10:53:34",
    "edited": {
      "time_stamp": "2025-01-22 10:53:48"
    },
    "text": "It can be Monday or 1, and Sunday or 7 (etc.). It is based on the create date - if the call was made (created) on a Monday, then it must say 1 or Monday. <@U25PYL3Q8>"
  },
  {
    "text": "I have a HubSpot form I want when user submits this HubSpot form I want to get data using webhock. Using n8n webhock node I have also created a new app in HubSpot for HubSpot form and I have also added form scope and now I want to add webhock url with objects and events but I am not able to understand how to set these fields",
    "time_stamp": "2025-01-23 00:20:52"
  }
]