[
  {
    "text": "Hey guys :slightly_smiling_face:\nI'm trying to create a field that will count the number of values that were chosen in other field (in the same object = contact).\nThe field is a multiple choice type, and the new field will count the number of values were chosen in the multiple choice type field.\nI created a private app and now need 2 things:\n1- let me know that i created it correctly\n2- how should i proceed with the code in the workflow?",
    "time_stamp": "2025-01-02 04:12:10",
    "reply_count": 9,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2025-01-02 04:46:00"
      },
      {
        "time_stamp": "2025-01-02 05:06:45"
      },
      {
        "time_stamp": "2025-01-03 02:52:46"
      },
      {
        "time_stamp": "2025-01-03 02:55:05"
      },
      {
        "time_stamp": "2025-01-03 02:56:18"
      },
      {
        "time_stamp": "2025-01-03 03:05:54"
      },
      {
        "time_stamp": "2025-01-03 03:42:38"
      },
      {
        "time_stamp": "2025-01-03 03:45:40"
      },
      {
        "time_stamp": "2025-01-03 03:51:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-01-02 04:46:00",
    "text": "Hi!\nSomeone else may have a different (and better) idea, but I would probably approach this by making a call to get the values from the multiple choice field, and then using .length on the response to return the number of items in the array.\nYou can then use that value to update the property you want on the object! :)"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-01-02 04:49:58",
    "text": "How many requests are you making at the same time to hit the rate limit? A simple thing to try would be to branch with a delay before the custom coded step, if that helps. You can branch on a certain number of % of enrolled objects. This might still reach the rate limit though if you are enrolling absolutely tonnes of objects at the same time.\n\nYou could also split the custom coded action into 2 steps if it's taking too long?"
  },
  {
    "poster": {
      "poster_name": "Tal Rei",
      "poster_handle": "tal.r"
    },
    "time_stamp": "2025-01-02 05:06:45",
    "edited": {
      "time_stamp": "2025-01-02 05:06:55"
    },
    "text": "hey Stacey, thanks for your effort! Do you know the coding for this?"
  }
]