[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-05-18 09:02:14",
    "text": "Hi <@U06U1BWP1FB> the font-size should be applied to the a-element, not the \"p\"-element"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-05-18 09:24:27",
    "text": "Furthermore it has nothing to do with HubSpot but instead how a browser works.\n*CSS/HTML works from \"top-to-bottom\".* \nThis means that what comes last will overwrite previous things.\nExample: if you have an a-element in line 2 with \"color:red\" and the same a-element with \"color:blue\" in line 3, the a-element will be blue.\n\n*Classes overwrite no class styling*\nYou can have an a-element with \"color:red\" in line 2 and an a.blue-font element in line 3 - the text will be blue\n\n*Loaded files will overwrite existing styling*\nIf you have a - color:red in the main.css file and a - color:blue in a different css file - the file that's gonna get loaded last will overrule.\nExample: You have color:red in the main.css and color:blue in the theme.css; the theme.css is getting loaded after the main.css file - the color will be blue\n\n*Inline styling will almost ever overrule*\nIf you have a - color:red in your CSS file but you're opening up a rich-text, highlight a text and change the color, font-size... it will almost always overrule CSS files since \"it's closer to the element\".\n\n*The sledgehammer*\nThe nightmare of a developer/branding expert/designer/marketer - Since this will overrule everything and send you down the rabbit hole please do not use it! This is just for knowledge:\n\"!important\" - this will tell the browser that this statement is important and therefore it will override almost everything. The only way how this can be overwritten is another \"!important\". So don't start with \"!important\""
  },
  {
    "text": "What the heck?! :facepalm:\n\nQuick tipp (if you didn't knew it already):\nIf you're building/modifying a theme you can host it in your theme-folder",
    "time_stamp": "2024-05-18 09:29:29"
  }
]