[
  {
    "poster": {
      "poster_name": "Jason Frade",
      "poster_handle": "jfrade"
    },
    "time_stamp": "2022-07-11 08:05:38",
    "edited": {
      "time_stamp": "2022-07-11 08:06:08"
    },
    "text": "Hey <@U03NNR15ACB>, I work on the HubSpot team that owns the webhook action, I hope you don’t mind me following up on this.\n\nSo as I understand it you’re trying to send data from HubSpot to Amplemarket via a webhook. HubSpot doesn’t allow you to customize the request body so it sends all the data about the enrolled object.\n\nAmplemarket is erroring because it’s expecting an email and it’s not parsing that from the request?\n\nCarter mentioned that Amplemarket is not set up to parse the body of the request and recommended using Zapier instead.\n\nHow would Zapier help here? Where in the request would you be putting that data so that Amplemarket can parse it? I’m assuming you wouldn’t send it in the body since it sounds like it would result in the same issue?\n\ncc <@U022ANB8ZC4>"
  },
  {
    "text": "Hi Jason, correct, email is not being parsed so it spits back an error.\n\nHere's what I've built in zapier, but was hoping to not have to pay extra for zapier if HubSpot could.",
    "time_stamp": "2022-07-11 08:25:04"
  },
  {
    "text": "Oh that’s interesting.\n\nRunning a small test on my end it seems like the problem is the way the data is structured when it’s being sent from HS. For example, instead of first name just being a single key value pair HS has a more complicated structure that Amplemarket has no idea how to parse. Sound about right to you?\n\nThe good thing is that we are going to be releasing a new update to the webhook action very soon that will allow you to customize your request the same way you can do in Zapier. We’re hoping to begin releasing in the next couple weeks if all goes well :crossed_fingers:",
    "time_stamp": "2022-07-11 08:44:05"
  },
  {
    "poster": {
      "poster_name": "Leif Catania",
      "poster_handle": "leif831"
    },
    "time_stamp": "2022-07-11 10:26:46",
    "text": "<@U02EFVAAGCR> That is amazing news! I will build this out in zapier for now just to solve it today, but would love so so much more to be able to do this with HubSpot as I need 3-4 webhooks sent per worflow depending on different paths, and zapier is just straight line. Can't wait for this!"
  },
  {
    "poster": {
      "poster_name": "Jason Frade",
      "poster_handle": "jfrade"
    },
    "time_stamp": "2022-07-11 10:28:35",
    "text": "Awesome! Could you DM me your portal ID so I can get you on the initial role out?"
  },
  {
    "poster": {
      "poster_name": "Leif Catania",
      "poster_handle": "leif831"
    },
    "time_stamp": "2022-07-11 10:29:37",
    "text": "you bet - I actually work at Amplemarket but this is for one of my customers who use Operations Enterprise so I will get their ID rather than ours that we use for testing haha"
  },
  {
    "poster": {
      "poster_name": "Jason Frade",
      "poster_handle": "jfrade"
    },
    "time_stamp": "2022-07-11 12:33:51",
    "text": "Yea that’s fine, which ever portal you think is going to get the most use."
  },
  {
    "poster": {
      "poster_name": "Leif Catania",
      "poster_handle": "leif831"
    },
    "time_stamp": "2022-07-11 14:59:57",
    "text": "Portal id is 19492330"
  }
]