[
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-20 09:51:25",
    "text": "Hello Folks!"
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-20 09:51:55",
    "text": "Is there a way to migrate the HubSpot workflows from  Sandbox to production?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-21 10:33:48"
      },
      {
        "time_stamp": "2022-07-21 10:39:40"
      },
      {
        "time_stamp": "2022-07-21 10:39:56"
      },
      {
        "time_stamp": "2022-07-21 10:42:00"
      },
      {
        "time_stamp": "2022-07-21 10:46:33"
      },
      {
        "time_stamp": "2022-07-21 10:47:42"
      },
      {
        "time_stamp": "2022-07-21 10:48:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2022-07-20 13:59:10",
    "text": "For anybody else here wondering... You're not crazy, workflows have become unreliable and barely functional.\n\nWe have one workflow (a fairly large one) that has been working continuously for a year with no issues, but about a month ago it suddenly began taking an hour or more to complete *OR* the workflow would just sit on step 1 and we'd eventually have to manually unenroll it.\n\nAfter a lot of back and forth with the HubSpot engineering team, we have been told the following (verbatim with the exception of the parentheses sections)\n\n1. Eliminate if/then branch actions *entirely*, this will lead to a more timely performance (translated - HubSpot is in over their head. They wrote a workflow tool with if/then capabilities, but if you are dumb enough to expect them to work, you should not expect them to work well).\n2. This is currently working as designed and we do not have the ability to put in place a fix to improve this outcome (Thanks for the money, now GFY)\n3. The evaluation that Automation performs is sent over a network request to the Lists API service. And so because the action is requires an external service through the API - it’s time- and resource-bounded by that API service. (We architected this product poorly, and it is now your problem)\n4. We thoroughly understand that it’s inconvenient and we apologize for it (but again GFY and see item #2 - We won't be fixing our broken workflow tools)\nMind you, these workflows that have begun stalling out and failing have been working for a year or more with no issues... and yet somehow this is OUR fault as the customer for expecting it to just continue working.\n\nIf you've spent any meaningful time with HubSpot support, you know that this is their canned answer. Everything is always the customer's fault, they can do no wrong, they don't make mistakes, they won't fix what they break in production, and ultimately they don't care that much about whether they wreck your business or not.\n\nWe are now in the process of evaulating other platforms. As much of a panacea as it sounds like to have a single platform for CMS/CRM/Service/Operations/Billing - When that provider refuses to offer SLAs (look at your contract... you don't have any) that should be a HUGE red flag. As the decision maker who chose HubSpot, ultimately this is my fault and there is a good reason why nobody gets fired for choosing Salesforce.",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-07-20 14:17:56"
      },
      {
        "time_stamp": "2022-07-20 14:19:09"
      },
      {
        "time_stamp": "2022-07-20 15:11:10"
      },
      {
        "time_stamp": "2022-07-20 15:26:32"
      },
      {
        "time_stamp": "2022-07-20 15:33:47"
      },
      {
        "time_stamp": "2022-07-20 16:01:19"
      },
      {
        "time_stamp": "2022-07-21 10:38:11"
      },
      {
        "time_stamp": "2022-07-21 13:11:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-07-20 14:17:56",
    "text": "Hey Arlo, are you a pro or enterprise user? If so I think you could build if/then branches by combining custom code actions and Value equals branches."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-07-20 14:19:09",
    "text": "By doing this all the execution is kept inside the workflow"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2022-07-20 15:11:10",
    "text": "We are Enterprise and yes, custom code is an option. It defeats the purpose of having a workflow tool if the answer to poor architecture choices is always \"go write it yourself\" but more than anything, it means marketing &amp; operations can't edit business logic, which is the main selling point of workflows."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-07-20 15:26:32",
    "text": "Yeah, totally agree with you, just trying to help think of workarounds for you guys. Another one would be create a custom workflow action, which takes the place of the custom code action and it would have a nice interface to it."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2022-07-20 15:33:47",
    "text": "Thanks Carter."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-07-20 16:01:19",
    "text": "NP"
  }
]