[
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-07-21 10:33:48",
    "text": "Was just told by our partner manager yesterday that workflows are now able to sync with sandboxes! they were not before.\n\n<https://knowledge.HubSpot.com/account/sync-automated-emails-forms-lists-and-workflows-to-a-sandbox-account>"
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-21 10:38:11",
    "text": "This is interesting. I have just begun working on few automation using workflows."
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-21 10:39:40",
    "text": "Thank you <@U03MJJ5Q4AG>. We are working with one of the big tech and we are planning to see if we can do in sandbox and move to prod. Not the other way around."
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-21 10:39:56",
    "text": "We wanted to use Sandbox as a Dev/QA and move to prod"
  },
  {
    "text": "Shoot, I thought it was on - I think this is coming very soon. I’m also working on some sandbox workflows to move to prod",
    "time_stamp": "2022-07-21 10:42:00"
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-21 10:46:33",
    "text": "Yep. Ideally you should have workflow. Unfortunately HubSpot misses it. Here is what we have done. We imported workflows from API and exported them to Production using create workflow APIs to automate the whole process. But the API end points offers only the contact driven workflow not all."
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-07-21 10:47:42",
    "text": "I’m asking my partner rep if he has an ETA on this - will let you know if I hear back!"
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-07-21 10:48:38",
    "text": "Absolutely. Thanks much for taking your time to respond here. I will also update you if I have come across any best approach."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2022-07-21 13:11:28",
    "edited": {
      "time_stamp": "2022-07-21 13:12:28"
    },
    "text": "One of the undocumented parts of workflows is that \"Value Equal\" branches don't seem to use the same kinds of resources that If/Then branches do. We did exactly what Carter was suggesting and it took the workflow from 1 hour+ and a 50% success rate down to about 60 seconds.\n\nWhile it is great, there are some major limitations to `value branch` type of branches in that you can't evaluate associated objects, you can't do numeric comparisons (e.g. greater than or less than), and you can't test whether a value exists, so although they seem faster, the end result is that if you want reliable and high performance workflows, you will need engineering talent to help you which usually means spending money or resources that should be busy doing something else.\n\nBecause of these limitations, 100+ of our several hundred workflows can't be converted to value branches so we just have to live with slowness or choose a different solution (Zapier for example)\n\nWith custom code you lose the references to properties, meaning that I can't click on a property in an object and see \"oh look, this property is used in this workflow\" which makes them prone to breaking when one admin may delete what looks like an unused property because they had no way of knowing it was used in custom code  workflows."
  }
]