[
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2021-11-04 04:11:15",
    "text": "<@U7SL518D6> do you have any insight about this that you are able to tell us?"
  },
  {
    "time_stamp": "2021-11-04 08:00:38",
    "edited": {
      "time_stamp": "2021-11-04 08:00:40"
    },
    "text": "Reminder: *Want to learn the latest tips and tricks for building on HubSpot?*  Check out our <https://developers.HubSpot.com/blog|Developer blog> for the latest."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-11-04 10:58:51",
    "text": "I’ve currently modified the {{ }} part of the video includes and run it thorugh a macro to grab the thumbnail and use that as a lazy loaded image., creating a click or autoplay event on that based upon lazy load or click, using vidyards newest script to load the video. It has saved me massive amounts of time on page loading. This client is using HubSpot video which uses the normal vidyard script to load. I’m definatly interested in these changes and am hoping I can get access to this to test things out first. Any details would be great!!!!!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-04 11:15:36",
    "edited": {
      "time_stamp": "2021-11-04 11:18:56"
    },
    "text": "Hey all, appreciate you sharing these concerns. The team is aiming for feature parity with the vidyard implementation. Feature parity does not mean the generated script code is the exact same - so I will ask internally about this and let you know what I find out."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-11-04 11:16:43",
    "text": "Also, would you consider asking for a time line / possibility of a beta on this so that things can be tested out before release/launch <@U7SL518D6> ?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-04 11:50:29",
    "text": "&gt; For customers who have a paid Vidyard subscripion, they will be able to continue using Vidyard to host their videos. Also any copy-pasted Vidyard embed codes are unaffected.\n<@UATE4ATHP> yes existing video will still work, but no it will not be hosted on Vidyard (for portals which are only using builtin HS Video)."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-04 11:57:10",
    "text": "<@U25PYL3Q8> regarding your HubL modification there, might have to see an example of it to understand implementation wise if it could be affected.\n\nRegarding ability to opt-in to the feature early/test. I’ve asked the team if it makes sense for us to roll out to CMS sandbox accounts first. That way you could test there without affecting your production account"
  }
]