[
  {
    "poster": {
      "poster_name": "Rens Bekkers",
      "poster_handle": "rens927"
    },
    "time_stamp": "2024-03-21 01:41:47",
    "text": "HI Amalia, Thank you for thinking along. Very much appreciated.\n\nThe current problem I have is that I do not have a way (other than doing a GET request every second/minute/hour on the task status) is that the workflows do not support a way to retrigger completed tasks.\n\nPerhaps I do not understand your suggestion correctly. Do I understand it correctly that your method will work IF we know that there is a task completed?"
  },
  {
    "poster": {
      "poster_name": "Sebastian von Appen",
      "poster_handle": "sebastian.vonappen"
    },
    "time_stamp": "2024-03-21 07:06:13",
    "text": "Hello everyone, are there any experts here regarding importing data or creating notes?\n\nI originally wanted to create notes via Hightouch, but have not found a way to do this. That would be the ideal case.\n\nWorkaround could be: To fill a text field \"pre-note\" when importing via Hightouch. A workflow could then be set up based on this (trigger: \"pre-note\" filled), which writes a note to the contact. Does anyone have experience with whether notes can be created via workflow (we have Ops Hub Pro) and what formatting options are possible?\n\nThanks in advance.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-27 13:35:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Caroline Santos",
      "poster_handle": "caroline.santos"
    },
    "time_stamp": "2024-03-21 09:31:49",
    "text": "Hi team! :nerd_face::wave:\n\nI need to create a property that returns the client's Life time, the time between the creation date and today's date. The best way to do this would be through custom code with import datetime, or by setting today's date in a property with the operations workflow programming?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-21 09:38:58"
      },
      {
        "time_stamp": "2024-03-21 11:38:49"
      },
      {
        "time_stamp": "2024-03-22 07:53:40"
      },
      {
        "time_stamp": "2024-03-22 07:54:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jacob Davis",
      "poster_handle": "jdavis"
    },
    "time_stamp": "2024-03-21 09:38:58",
    "text": "I'd do it with a calculated field. It should be pretty straightforward. You can either do it through your suggested \"today\" field. Or... I _*think*_ there is a function for \"today\" in the advanced formula area for creating a calculated property."
  },
  {
    "poster": {
      "poster_name": "Jacob Davis",
      "poster_handle": "jdavis"
    },
    "time_stamp": "2024-03-21 11:38:49",
    "text": "Ah, <@U06PRAR6DGA> - it doesn't look like there is a \"today\" feature I might be misremembering <https://knowledge.HubSpot.com/properties/create-calculation-properties#functions>"
  },
  {
    "text": "Right, I did misread. Here is a hacky way of getting it to retrigger based on Number of Sales Activities, though it will always go through if there’s at least one task already completed, so you’ll need to add validation that the completed timestamp is for a new task that wasn’t previously triggered, So after you get the query, check the timestamp that it was completed within the last 1-5 mins?",
    "time_stamp": "2024-03-21 18:04:58"
  }
]