[
  {
    "poster": {
      "poster_name": "Lukas Knobling",
      "poster_handle": "lukas.knobling"
    },
    "time_stamp": "2024-03-22 01:17:33",
    "text": "<@UDHT6N5SM> the serverless function has to be in the same file and you cannot break up.\n<https://HubSpotdev.slack.com/archives/C011F74BKQW/p1710429545065059>"
  },
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2024-03-22 05:39:25",
    "text": "Just chiming in here, since I spent half the day trying to get this to work, being completely confused by the docs and it ultimately not working.\nMoved to a normal serverless function, works.\n\nAlso confused by the serverless.json syntax being updated but only for functions in projects, not normal functions."
  },
  {
    "poster": {
      "poster_name": "Lloyd Wilson",
      "poster_handle": "lloyd.wilson"
    },
    "time_stamp": "2024-03-22 07:11:59",
    "text": "It works but it’s not working very well.  In fact, you cannot use these serverless functions in any HubSpot workflow.  Also, there’s a really nasty bug that that causes a lot of issues when you have more than one serverless function in your code base where it doesn’t push your changes correctly and causes all kinds of errors.  The fix was to update every function and push them all at once, even if there was no code changes.  Additionally, it only works with GET and POST HTTP methods.  I had to move to Cloudflare (using functions inside a super simple Pages app) to avoid all the issues.  The developer and platform experience has been horrible.  I’d build and use Cloudflare directly as just use a simple worker/pages function to do what you need given all the challenges and issues we experienced.  I hope HubSpot fixes these issues as this is a major issue. "
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-03-22 07:18:16",
    "text": "Thank you"
  },
  {
    "poster": {
      "poster_name": "George Grigorita",
      "poster_handle": "george.grigorita"
    },
    "time_stamp": "2024-03-22 10:57:08",
    "text": "At least, there should be a clear note or mention in the documentation that the serverless functions in projects docs apply (mostly or only) to the CRM UI Extensions and not to CMS React projects."
  },
  {
    "poster": {
      "poster_name": "Lloyd Wilson",
      "poster_handle": "lloyd.wilson"
    },
    "time_stamp": "2024-03-22 11:05:00",
    "text": "Yep, I agree :point_up: would have saved a lot of time. "
  }
]