[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-29 04:55:28",
    "edited": {
      "time_stamp": "2024-04-29 04:55:48"
    },
    "text": "I appear to be stuck in a loop...\nI have created a button in UI Extensions that enrols a contact into a workflow, takes the userid of the person logged in, and updates a hidden HubSpot owner property based on that (for auditing).\nHowever, I cannot use the userid to update this property as the internal references are different. I cannot access the owners endpoint with the userid as it expects the ownerid in the URL.\nSo how do I get the ownerid for a user in order to set that property?\nAm i missing something vital? I have searched online for this but cant find anything specific to this 'order'. :disappointed:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-29 05:10:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-04-29 05:10:38",
    "text": "Incase anyone else misses this in the endpoint documentation like i have done... I just added query parameter to it and it worked!\n?idProperty=userId"
  },
  {
    "text": "Hi guys!\n\nI have a problem getting a list of templates through <http://hubapi.com|hubapi.com>.\n\nI have 3 templates. I can see them in the UI.\n\nWhen I hit the endpoint I am getting a 200 ok response but is an empty response.\n{\"limit\":100,\"objects\":[],\"offset\":0,\"total\":0}\nWhat I am doing wrong?\n\nI am hitting the endpoint with a GET method.\n\n```<https://api.hubapi.com/content/api/v2/templates>```\nI checked the community forum. I saw posts with the same problem, but the posts are still unresolved\n\nI will appreciated any help.\nThanks guys",
    "time_stamp": "2024-04-29 11:13:24"
  },
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2024-04-29 11:18:00",
    "text": "Hey hubdev folks, I'm trying workout the lists api with creating a list, the filters schema and branches are bit strange as pointed out in the husbpot documentation. Anyone created lists using the api and can walk me through the filters?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-29 12:36:39",
    "text": "I have been actively building an app I that would like to (eventually) release on the marketplace.  But right now I am building and testing (and continually learning) how to do this.  So, for sake of simplicity, say my current state is you go on my app website and create a login (step 1).  Then after logging into the app it asks you to install the app in your portal (step 2).  After this the app wants you to set a schedule for when the app will run its sync operations (step 3).  So you set it to, say, run every 6 hours or whatever.  Now the app is functional and starts running every 6 hours automatically and doing it's thing.   Now, let's say sometime down the road you decide to uninstall the app.  So you go into your portal, find the app in integrations and delete it.  Well and good.  Well at least you think so.  The app on the other hand already has an access token and a refresh token stored from the install procedure and simply carries on as if nothing happened.  It doesn't know you have deleted the integration and it doesn't really care.  What am I missing?  This should not be able to happen I wouldn't think.  Should the uninstall action in the portal call out to the app and let it know about that action?  How do you experts handle this?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-29 15:27:14"
      },
      {
        "time_stamp": "2024-04-30 06:11:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Leonardo dos Santos Canario",
      "poster_handle": "leonardo.canario"
    },
    "time_stamp": "2024-04-29 12:46:47",
    "text": "What's up community, someone can help me?\nI'm searching for a endpoint to get values from a report  in HubSpot?\nIt's possible to get this information?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-29 19:16:29"
      },
      {
        "time_stamp": "2024-04-30 06:04:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2024-04-29 15:27:14",
    "text": "Hey this is a difficult one. I do this in a few ways, a) i tie a subscription to the installation using stateToken in the install link, and they usually want to cancel their subscription. I have filters to work only for active subscriptions (that's for backend work that's not portal specific)\nb) the moment they have uninstalled the app, their token is usually expired and you won't be able to refresh, so look for expiry errors on the access and refresh and if it doesn't work, then cancel the work on their account and mark it as uninstalled"
  },
  {
    "poster": {
      "poster_name": "Cristóbal Parraguez",
      "poster_handle": "cparraguez"
    },
    "time_stamp": "2024-04-29 19:16:29",
    "text": "This is the closest one I know about <https://developers.HubSpot.com/docs/api/crm/exports>"
  },
  {
    "poster": {
      "poster_name": "Cristóbal Parraguez",
      "poster_handle": "cparraguez"
    },
    "time_stamp": "2024-04-29 19:17:39",
    "edited": {
      "time_stamp": "2024-04-29 19:18:55"
    },
    "text": "Does anyone know if anyone gets notified if the daily API limit for private apps is hit? image on thread for reference",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-29 19:19:00"
      },
      {
        "time_stamp": "2024-04-30 07:35:33"
      },
      {
        "time_stamp": "2024-04-30 07:38:10"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-04-29 19:19:00"
  }
]