[
  {
    "poster": {
      "poster_name": "Alexandros Avlastimidis",
      "poster_handle": "alex233"
    },
    "time_stamp": "2024-04-01 01:40:59",
    "text": "Before i get the properties that i want I want to get them all. What i mean for example as u see on the screenshot above there is a section on the left side and under the About this Deal there are some information (properties) i know the standard ones but some users can have more properties. I want to get them all iterate upon them and then make suggestions. To do that I need them all because i dont know in advance which properties user want to update."
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-01 01:52:32",
    "text": "In the Custom Objects doc, there is an \"Object schema\" tab: <https://developers.HubSpot.com/docs/api/crm/crm-custom-objects>\n\n*This is NOT limited to Custom Object, it can be used in the default objects and engagements like notes, emails, etc...*"
  },
  {
    "poster": {
      "poster_name": "Alex Av",
      "poster_handle": "iamavalex"
    },
    "time_stamp": "2024-04-01 01:55:32",
    "text": "Thank you Christensen. Is there any way to get the properties if I dont know them in advance?"
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-01 01:59:21",
    "text": "Yes. You call the schema for the object by referencing the code in the documentation that I just sent now."
  },
  {
    "poster": {
      "poster_name": "Alex Av",
      "poster_handle": "iamavalex"
    },
    "time_stamp": "2024-04-01 01:59:54",
    "text": "But this is for the objects right not for the properties of this object. I want to get the Deals and all the inputs tat the Deals object has in the UI."
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2024-04-01 02:01:03",
    "text": "If you want to get the properties of the deals including the custom properties then you need to call the schema endpoint for the deals."
  },
  {
    "poster": {
      "poster_name": "Artem Dikmarov",
      "poster_handle": "dikmarov"
    },
    "time_stamp": "2024-04-01 10:12:50",
    "text": "We just had a fiasco: we have updated the SSO certificates in Google Account (the old expired ones), and we cannot log in to HubSpot (even administrators), since the login is only by SSO for updating certificates\n\nHas anyone encountered this? How can the problem be solved? (maybe it is possible through the endpoint of the connected application)"
  }
]