[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-04-18 01:21:11",
    "text": "Any ideas from anyone else? :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Sean Bell",
      "poster_handle": "sean.bell"
    },
    "time_stamp": "2024-04-18 01:56:04",
    "text": "Hi All\n\nWhen I create a contact via API - I want to be able to see the historic web visit history associated with them.\n\nI want to link these contacts to their previous web visit history using the GUID generated by the website tracking code and stored in the HubSpotutk cookie.\n\nWhere is the appropriate documentation that explains how to do this?"
  },
  {
    "poster": {
      "poster_name": "Abhinav Kesharpu",
      "poster_handle": "abhinav.k"
    },
    "time_stamp": "2024-04-18 03:17:53",
    "text": "Hi Team, Wanted some opinions on Clearbit integration .\nWe recently did buy clearbit subscription through HubSpot as we expected an almost realtime enrichment, but during dev and integration, we are getting a latency of around 40s-50s, to enrich data sent to HubSpot. Is there a way to make it faster?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-18 11:34:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "usman raza",
      "poster_handle": "usmanrazajutt786"
    },
    "time_stamp": "2024-04-18 04:35:10",
    "text": "Hi All,\nI'm new to HubSpot, Just found its documentation a bit complex, Could you please guide me, in implementing association batch read API, to find out the contact ids associated to deals? and please share If anybody has some API implemented boilerplate code of serverless function.\nThanks",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-18 11:35:39"
      },
      {
        "time_stamp": "2024-04-18 13:02:33"
      },
      {
        "time_stamp": "2024-04-18 13:03:21"
      },
      {
        "time_stamp": "2024-04-18 13:04:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-18 06:26:05",
    "text": "yes 10K hard limit - you would have to filter data to get less than that and run several different filtered operations to get everything.  I don't know why that limit is there."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-18 06:27:09",
    "text": "I can't say if I have tried filtering on the create at, updated at, etc."
  },
  {
    "poster": {
      "poster_name": "Casper Kraken (HubDo)",
      "poster_handle": "casper928"
    },
    "time_stamp": "2024-04-18 06:42:37",
    "text": "Hi <@U05EC3L7UF8> you could just query the companies endpoint directly to get that filter function:\n/crm/v3/objects/companies?archived=false\n\nThis will achieve the same thing"
  },
  {
    "poster": {
      "poster_name": "Aruljothi Kuppusamy",
      "poster_handle": "aj974"
    },
    "time_stamp": "2024-04-18 08:46:05",
    "text": "Hi All,\nIn HubSpot i integrated 2 way sync with google calendar. The default app. When i schedule any event in google calendar doesn't reflect in HubSpot calendar. Thanks"
  },
  {
    "poster": {
      "poster_name": "Aaron Gutierrez",
      "poster_handle": "aaron.gutierrez"
    },
    "time_stamp": "2024-04-18 09:36:01",
    "text": "hi <@U04JUUACH6E>, for my project, I only need to pull records (both archived TRUE and FALSE records) that have changed since the last ELT job. I don't think that end point allows me to specify to only pull data updated after X."
  },
  {
    "poster": {
      "poster_name": "Justin Cortez",
      "poster_handle": "jcortez"
    },
    "time_stamp": "2024-04-18 11:05:53",
    "text": "Hey Everyone,\nI've developed an app that creates Deals in our HubSpot account. I'd love to have a \"Log In With HubSpot\" button so I can restrict access to our HubSpot users and set the Deal Owner to the user. Is there any way to implement this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-19 04:55:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Elijah Gastin",
      "poster_handle": "elijah.gastin"
    },
    "time_stamp": "2024-04-18 11:34:03",
    "text": "From my understanding not really the only thing that comes to mind is enriching less data but I doubt that's an option, but this might be a better question for clearbit assuming you are using the integration they created if you are using another integration then I would ask whoever the provider is."
  },
  {
    "poster": {
      "poster_name": "Elijah Gastin",
      "poster_handle": "elijah.gastin"
    },
    "time_stamp": "2024-04-18 11:35:39",
    "text": "While the api can do this I would recommend doing a little reading on GraphQL it might be a bit easier to implement for your use case"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 12:19:34",
    "text": "thank you for that, the while loop worked, however, only about 300+ contacts where sent to our board in <http://monday.com|monday.com>, dont know why. I though it was something to do with the board itself, like the total limit of items where set to 350, but no. So I have no idea why we are only getting half of our total contact list."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-18 12:21:55",
    "text": "are you logging errors?"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 12:22:28",
    "text": "yeah, no errors show at all"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-18 12:24:51",
    "text": "can you remove the monday aspect of the process and see if it proceeds?"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 12:25:22",
    "text": "oh nice idea, ill give it a try"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-18 12:26:01",
    "text": "check for any rate limits that you may be hitting as well.  that should throw an error, but just in case"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:02:33",
    "text": "I'd reccomend using the search api,<https://developers.HubSpot.com/docs/api/crm/search>"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:03:21",
    "text": "you would do a deal search with propertyName : associations.contact"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:04:33",
    "text": "and add more filters based on how specific or general you want to be"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:08:03",
    "text": "you are adding paging to it?"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:08:24",
    "text": "the max limit is 500 perp page so you have to adda  condition that if theres a pagination token to keep reading"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 13:09:49",
    "text": "yeah im paging it, however if I increase the limit above 100 my code doesnt work"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2024-04-18 13:10:47",
    "text": "ok so try this, based on your rate limits you have x calls per 10 seconds, so add a loop that if you have less than x calls and retry again, i tried that the other day with python and worked like a charm"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 13:11:47",
    "text": "cool! Ill see what I can do"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-18 13:12:23",
    "text": "somewhat related <https://github.com/HubSpotdev/crm-object-sync|this repo> just went public :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Alejandro Stafuza",
      "poster_handle": "alejandrostafuza"
    },
    "time_stamp": "2024-04-18 14:18:38",
    "text": "So, I tried making the call alone, without any monday stuff, and I get the total contacts returned. So that is working properly. Must be something in between thats causing this weird glitch."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-18 14:46:27",
    "text": "at least you are getting somewhere :grin:"
  },
  {
    "text": "Hey All From Canada :flag-ca: :wave:\n\nI’m having an issue I am wondering if anyone else here has ran into and been able to solve it. Essentially, when I create an Invoice in the UI and associate a product, I’m expecting that an instance of that product is created as a line item and associated with the invoice. This all seems to work fine. But my issue is that the instance of this line item does not have a custom property `NetSuite Internal Id` I created for the product filled out.\n\nIn the 1st screenshot below, you can see the product table showing this product has the property set to a value of 3383 but in the 2nd screenshot (response from my GET /crm/v3/objects/line_items/&lt;line_item_id&gt; API call) you can see the line item has no value for this property.\n\nAny help would be greatly appreciated! :slightly_smiling_face:",
    "time_stamp": "2024-04-18 14:48:14"
  },
  {
    "poster": {
      "poster_name": "Matija Kordic",
      "poster_handle": "matija912"
    },
    "time_stamp": "2024-04-18 14:58:27",
    "edited": {
      "time_stamp": "2024-04-19 02:27:55"
    },
    "text": "Hey everyone,\n\nBeen working on a series of automation recently. Now, I am new to HubSpot. So, we have a HubSpot Form that gets some information from clients and updates our Company Properties with it. I can fetch all of the properties via a workflow trigger and send that to Google Cloud for other purposes. The one thing I am not succeeding and quite important too, is transferring the file that is uploaded via HubSpot Form as a company property. This is a boundary file that serves as an entry point into different analyses. I have done some reading, and a lot of discussions say that all files uploaded to company properties are hidden and cannot be accessed via an API. However, these discussions are quite old so I have been wondering if this has changed?\n\nThe final question:\nCan I download a file that is in Company Properties (uploaded there via HubSpot Form) using the HubSpot API.\n\nI have tried the following:\n• Using the URL of the file (that if I click on it in HubSpot downloads it), I have called the API get_by_id function and I get a response 200 but the contents are HTML so I think I am getting a redirect. \nThanks and hope everyone is having a great day"
  },
  {
    "poster": {
      "poster_name": "Makoy Cameña",
      "poster_handle": "marcneilc"
    },
    "time_stamp": "2024-04-18 15:09:00",
    "text": "Is it possible to sort a /batch/read?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-19 05:02:08"
      },
      {
        "time_stamp": "2024-05-10 00:58:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-04-18 16:12:25",
    "text": "We have a framework agreement custom object where Deals are associated to the framework agreement.\n\nWe have multiple child companies competing for the same Deal. We use Deal Split to manage the revenue share. We also use Deal Split API to calculate the share based on different variables. With this we're able to properly forecast the amount.\n\nExample: FA-Deal is created with 1M$ and shared between Comp 1, 2 and 3 evenly.\nWe forecast that each user from respective company have 333k $ in their pipeline\n\nNow, there is a selection process conducted by the FA-customer, and the outcome could be that Comp 1 and 2 has won the Deal. And by using Deal Split API we \"refresh\" the split.\nThe problem is that I'm not able to see the amount that Comp 3 has lost.\n\n*Any input on this? How can I mange the revenue Comp 3 has lost?*\n\n*Possible solutions*\nBased on some logic somewhere, create a Deal that is automatically put to closed lost using WF. Not sure how this could be triggered.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-19 00:23:10"
      },
      {
        "time_stamp": "2024-04-19 00:45:16"
      },
      {
        "time_stamp": "2024-04-19 00:47:13"
      },
      {
        "time_stamp": "2024-04-19 07:22:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Phillip Allen",
      "poster_handle": "phillip.allen"
    },
    "time_stamp": "2024-04-18 22:41:51",
    "text": "Hi,\n\nHas anyone used Amazon AppsFlow to extract data from HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-04-19 00:23:10",
    "edited": {
      "time_stamp": "2024-04-19 00:23:28"
    },
    "text": "Just a thought...\n\nYou need a preliminary step (UI Extension) which allows for a user to select who the companies are that won, what their new deal split %, and to make things easier, which company lost.\n\nAfter saving, the extension function will be able to perform the updates on the current deal including modify the deal splits, removing of associations, and create the new deal with the closed-lost amount. There are probably a handful of fields/data you want to carry over to the closed-lost deal for reporting.\n\nI also do not know if you can receive events when deal-splits take place.  You really only want to know when they get \"updated\" and when the deal is marked as \"closed-won\" or enters a specific deal stage.  The whole event trigger approach I don't think will work."
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-04-19 00:45:16",
    "text": "Could be worth mentioning that the FA-deal is pulling data from external Framework agreement software."
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-04-19 00:47:13",
    "text": "But I'll look into UI Extensions"
  }
]