[
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-05-03 02:00:20",
    "text": "Hi, we are experimenting with the new capability to add the react components to the preview pages. It works as expected!\nBut we hoped that the ticket preview could be used for the help desk as well. But it seems that there is currently no way to include that component in the help-desk preview. Does anybody know if there is a non documented option for the location property like “crm.helpdesk” or if it is planned to extend the location to the helpdesk preview?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-03 10:40:34"
      },
      {
        "time_stamp": "2024-05-03 13:58:44"
      },
      {
        "time_stamp": "2024-05-03 13:58:46"
      },
      {
        "time_stamp": "2024-05-03 13:59:37"
      },
      {
        "time_stamp": "2024-05-03 14:00:57"
      },
      {
        "time_stamp": "2024-05-03 15:10:09"
      },
      {
        "time_stamp": "2024-05-04 00:09:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas689"
    },
    "time_stamp": "2024-05-03 06:15:17",
    "text": "is there a way to translate a multi checkbox property into the toggleGroup without looping through and hacking the checked values that way?",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-05-07 09:03:13"
      },
      {
        "time_stamp": "2024-05-07 10:20:48"
      },
      {
        "time_stamp": "2024-05-07 11:36:58"
      },
      {
        "time_stamp": "2024-05-07 11:37:06"
      },
      {
        "time_stamp": "2024-05-07 11:37:17"
      },
      {
        "time_stamp": "2024-05-07 11:47:11"
      },
      {
        "time_stamp": "2024-05-07 13:31:17"
      },
      {
        "time_stamp": "2024-05-07 13:31:33"
      },
      {
        "time_stamp": "2024-05-07 13:31:48"
      },
      {
        "time_stamp": "2024-05-07 13:31:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-05-03 10:40:34",
    "text": "Hello Thorsten, we are working on the helpdesk one. Can I know your use case?"
  },
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-05-03 13:58:44",
    "text": "Hi, I am a partner and this is for a prospect where we are currently in a paid PoC. (PortalId for the PoC 144397110). We have made some shortcuts on a custom Tab (Buttons that directly create a child tickets with some dependencies). They want to have the option to create the child ticket directly from help-desk (without clicking on the ticket). Her ist the link to the ticket view:"
  },
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-05-03 13:58:46",
    "text": "<https://app-eu1.HubSpot.com/contacts/144397110/record/0-5/2959388608>"
  },
  {
    "text": "This is the ticket view",
    "time_stamp": "2024-05-03 13:59:37"
  },
  {
    "text": "And this would be the ideal view / sidebar for the helpdesk:",
    "time_stamp": "2024-05-03 14:00:57"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-05-03 15:10:09",
    "text": "Thanks. What happens when you click these buttons? Do you trigger server less functions? Can you also tell me more about what goes on into creating child tickets?"
  },
  {
    "poster": {
      "poster_name": "Thorsten Heissel",
      "poster_handle": "thorsten.heissel"
    },
    "time_stamp": "2024-05-04 00:09:28",
    "text": "Hi <@U03FJQPSC0Y> yes, a serverless function is triggered, This functions creates a new ticket which is associated with the original ticket. It copies an associated object from the original ticket to the new ticket and adds the contact from this associated ticket to the original ticket.\n\nThe use case is a company selling tyres at scale (30 Support agents). Many of their support ticket are like “when will be tyres arrive”. They know from their ERP system where they ordered the tyres (many different distributors across Europe). The child ticket is then an inquiry at the distributor what happened with the tyres. This inquiry is done automatically with a transactional email at the child ticket level. Once they answer (or new information about the tyre delivery appears in their ERP - integrated with HubSpot) The original ticket from the help desk is re-activated and they answer to the original customer with information such as “will take some time because .. ” Or delivery was started at, her is you tracking link …” and so on.\n\nOverall they are looking for their service agents want to become as efficiently as possible hence every additional click should be avoided as well as too many different views (ticket detail / help desk) since many agents are not that expirienced."
  }
]