[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-09-10 10:35:13",
    "text": "it would be cool if the content editor could get a visual clue if something is not according to certain accessibility standards…larger websites try to adhere to the standards",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-10 11:35:33"
      },
      {
        "time_stamp": "2020-09-10 11:41:38"
      },
      {
        "time_stamp": "2020-09-10 11:42:03"
      },
      {
        "time_stamp": "2020-09-10 11:51:31"
      },
      {
        "time_stamp": "2020-09-10 11:53:14"
      },
      {
        "time_stamp": "2020-09-10 11:54:46"
      },
      {
        "time_stamp": "2020-09-10 11:57:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-10 11:35:33",
    "text": "We do provide a few hints in the optimize tab when editing a page. Specifically for headings and images.\n\nDo you have any specific examples of things that would be handy for us to surface to content creators?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-09-10 11:41:38",
    "edited": {
      "time_stamp": "2020-09-10 11:44:21"
    },
    "text": "the most important thing for me would be font-size and contrast and proximity between elements. For accessible color i just saw this video which was really interesting: <https://www.youtube.com/watch?v=sEDnmNtEaqQ&amp;ab>"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-09-10 11:42:03",
    "text": "font-size specifically on mobile devices"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-10 11:51:31",
    "text": "This is good feedback and worth exploring.\n\nThere is a potential problem though:\nSay as a developer.  You build a theme for a specific company, a designer already designed it, and you styled everything to match their mockups/work.\n\nAs a result you likely didn’t provide controls for some of the brand styling.\n\nSay we display a warning stating there are color contrast issues in the optimize tab. The content creator has no control to fix the issue themselves."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-09-10 11:53:14",
    "text": "Ideally I would think most accessibility issues should be tested for and addressed during design and development.\n\nThere are some use-cases where the developer can’t set up guard rails, those would be cases that make a lot of sense to surface in the editor"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-09-10 11:54:46",
    "text": "i agree, the reason i have written this is that it would give the editor instant feedback on this, not only once a quarter when the IT has time to run a A11y audit or in some similar situation."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-09-10 11:57:00",
    "text": "yes, for example font size in the RichText Editors. If a editor choses a font size of 10px for &lt;p&gt; i think it would be a good idea to let him know that he probably should go back to change it. similar to the expierience of the notification in the Landing Page Settings that the chosen image has probably not the correct aspect ratio for Social networks."
  }
]