[
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-04-20 05:55:57",
    "text": "Hi Dev Team, any plans to breath new life into the local HubSpot server? As we are building up the dev team around our website we find this lack of a localhost server to be a huge bottleneck."
  },
  {
    "poster": {
      "poster_name": "Andre Desbiens",
      "poster_handle": "adesbiens"
    },
    "time_stamp": "2021-04-20 08:53:50",
    "text": "I have set myself up for local-dev, when I deploy to the DEV account (or portal) everything works well, when I point to production I get a scope error. It seems to be only with my account, we have tested with my colleague account and on his side everything works... Anyone has an idea what it could be, how I fix this and how we can avoid that from happening in the future? TY"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-20 12:16:40",
    "text": "<https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1618935910074600>"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-04-20 15:45:47",
    "edited": {
      "time_stamp": "2021-04-20 16:15:18"
    },
    "text": "Does `Clone Theme` in Design Manager work differently behind the scenes than `Clone Module`? Our process to duplicate prod pages to a staging portal is broken now using a theme.\n\n*Background:* To replicate our prod portal content on staging portals, in the past we have been able to use Design Manager to clone modules from prod to a staging portal, then run a node script that uses the API to iterate over all the pages on prod, update the template ID to match the template on the destination portal, and upload to dest portal. And all of the module references would get “magically” updated so everything worked on the destination portal. I’m guessing behind the scenes the Design Manager Clone Module creates a map of module ID’s from source to destination, so if a page’s data references a module ID from the old portal, it can look up what the new ID should be and successfully find the module. However, we just did a site redesign within a theme. We were able to successfully copy the theme to a staging portal through Design Manager, however all the modules connections in the pages are broken."
  }
]