[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-04-02 02:49:34",
    "text": "*Caching in Local Development*\nIs there anyone currently developing a theme within local development and has issues with caching?\n\nMaybe someone knows how to prevent caching for local development?\n\nFor example, the width for the dnd column is not applied to be seen in the preview. However, code is passed to HubSpot server — no errors in the terminal, and it’s displayed in Design Manager, but for Content Editor it’s not the case.\nHTML/Hubl is mostly affected by this aggressive caching. On the other hand, CSS changes are applied seamlessly.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-02 04:26:52"
      },
      {
        "time_stamp": "2021-04-02 05:06:13"
      },
      {
        "time_stamp": "2021-04-02 05:57:48"
      },
      {
        "time_stamp": "2021-04-02 05:58:04"
      },
      {
        "time_stamp": "2021-04-02 07:20:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-04-02 04:26:52",
    "text": "I may be completely wrong here - but I have a feeling this is down to priority of variables/settings.\n\nAnything in the theme files/dnd settings are classified as defaults can be overwritten in the editor and if this has happened I believe this takes priority"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-04-02 05:06:13",
    "text": "Thanks <@UQERM7BLY> You might be right about priority. I was hoping for some trick to prevent that. It’s rather inconvenient to develop a dnd theme that way though. I can’t see the impact my code is making on the visuals and content editing experience"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-04-02 05:57:48",
    "edited": {
      "time_stamp": "2021-04-02 05:57:56"
    },
    "text": "Yeah, i just create new pages and end up with 10s"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-04-02 05:58:04",
    "text": "but i guess it’s a good way to ensure your defaults are on point"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2021-04-02 07:20:10",
    "text": "Thanks for trying out.\n10s is pretty fast. The last couples of days it took up to several hours. It was a nightmare at some point. Checking your code for errors for zillions times doesn’t help because it’s cache"
  }
]