[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-17 12:59:17",
    "text": "Promised I’d share my Outlook email story in a roundtable today. For those who’re interested I’ll post it in this thread.",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-17 13:10:01"
      },
      {
        "time_stamp": "2021-11-17 13:12:58"
      },
      {
        "time_stamp": "2021-11-17 13:15:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-17 13:10:01",
    "text": "I used to build a ton of marketing emails prior to working at HubSpot.\n\nOften a designer would mock up what the email was intended to look like ahead of it going out.\n\nThis time the designer had given me an email where the top 75% of the email was basically just a graphic of the product being marketed. There was 1 short line of text, but it was a situation where it was fine to just provide that text as alt text.\n\n\nThe remaining part of the email was just a little blurb about the product, and a link, then all the CAN-SPAM stuff.\n\nAnyhow I’m in a rush. I have a deadline of only 4 hours to build this fresh new design out. (this is before cool tools like MJML and foundation for emails).\n\nI build out this table layout, have a big image up top probably around 1200px tall. Like I said it was big.\n\nStyle up all the text etc. things are going fine. Then I start testing. Gmail - perfect, Mac mail - perfect, android email - perfect, then I get to outlook…\n\nThat giant image for some reason had a giant gap of space in it, about 300px tall. As if I had split the image in two and just put white space. Horrified, I start googling around trying to figure out what in the world could cause such a thing."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-17 13:12:58",
    "text": "I spent about 2.5 of my 4 hours just sweating trying to figure out how to fix this weird issue.\n\nI come across 1 lone thread on the internet, about how somoene tried sending an image attachment through outlook and the same thing happened. That dreaded moment everyone has - no solution discovered.\n\nThen I remember, that version of outlook is using Microsoft Word as it’s rendering engine. My brain starts ticking - what applies to Microsoft Word, but doesn’t make sense to an email?\n\n\n\n\nThink about what happens if you add an image to a page in Microsoft Word that is too large for the page…"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-11-17 13:15:02",
    "edited": {
      "time_stamp": "2021-11-17 13:54:52"
    },
    "text": "…\n\n\n\n\n\nIt splits the image onto a separate page.\n\n_My EMAIL was being split across “pages”, because it was too tall to fit on an 8.5 by 11in sheet of paper._\n\nThe solution - doing the very thing Microsoft was doing, split the image into two separate images, place them ontop of eachother. This stopped the goofy gap.\n\nSo that’s my goofy Outlook story."
  },
  {
    "text": "Hello everyone,\n\nI was looking for an answer and also any alternate way to achieve this.\nI want to create a property in company where I want to add items multiple time. For example \"Top 5 Fav Website\"\n\ncan we do it in a single property? just like multiple domain option already available in HubSpot.",
    "time_stamp": "2021-11-18 00:38:36",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-18 12:11:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Manoj Rajput",
      "poster_handle": "manojr"
    },
    "time_stamp": "2021-11-18 00:38:44",
    "text": "Thanks for any help."
  },
  {
    "poster": {
      "poster_name": "Manoj Rajput",
      "poster_handle": "manojr"
    },
    "time_stamp": "2021-11-18 00:38:47",
    "text": ":slightly_smiling_face:"
  }
]