[
  {
    "poster": {
      "poster_name": "John Duggan",
      "poster_handle": "john.duggan"
    },
    "time_stamp": "2021-09-20 02:56:08",
    "edited": {
      "time_stamp": "2021-09-20 02:58:46"
    },
    "text": "Thanks, that is very interesting information with some interesting thoughts about the versioning.\n\nI'll be interested in how others manage their versioning of pages, components or themes and whether they do it manually.\n\nI'm still exploring the different approaches myself. I'll share the information if I come up with something that I think could be useful for others."
  },
  {
    "poster": {
      "poster_name": "Parth Chaudhary",
      "poster_handle": "parth.1996.ce"
    },
    "time_stamp": "2021-09-20 06:54:38",
    "text": "Hi Everyone,\n\nI have 4+ year of experience in HTML, CSS and JavaScript.\n\nI am new to HubSpot CMS and I am trying to learn though the Courses on HubSpot.\n\nCan anyone help me with which courses should I go through one by one From Basic to Advance.\n\nThanks"
  },
  {
    "poster": {
      "poster_name": "Julie Guo",
      "poster_handle": "julie-externe"
    },
    "time_stamp": "2021-09-20 07:41:26",
    "text": "hello <@U010ZU6TRD0>, it’s me again. Thank you for the advice. I wonder wether you have an idea how long it take for a change in setting-&gt; template to be reflected on the website ? :bow: My observation is it’s not immediate :thinking_face:"
  },
  {
    "time_stamp": "2021-09-20 12:00:20",
    "edited": {
      "time_stamp": "2021-09-20 12:00:31"
    },
    "text": "Reminder: Are you a developer new to HubSpot, looking to get started building on CMS Hub? Check out our <https://developers.HubSpot.com/docs/cms/guides/getting-started|quick start guide> to get a quick taste. When you’re ready to learn more head on over to our <https://developers.HubSpot.com/docs/cms/guides|tutorials and guides> to learn by doing. When you’ve got a chance, we recommend looping back and reading the <https://developers.HubSpot.com/docs/cms/key-concepts|Key Concepts> of the CMS. It explains how all of the pieces of the CMS fit together. Welcome to HubSpot development, there’s never been a better time to be HubSpot developer!"
  },
  {
    "poster": {
      "poster_name": "Tomas Sandven",
      "poster_handle": "tomas960"
    },
    "time_stamp": "2021-09-20 13:12:09",
    "text": "I have a customer that wants me to integrate a HubSpot form on their website. I read some documentation and instructed my customer to enable \"Set as raw HTML form\" so I can style the form with CSS, as explained here: <https://developers.HubSpot.com/docs/cms/building-blocks/forms>. The customer replied that they are unable to check that option, saying that they would need the \"Marketing Hub Professional\" license in order to do so.\n\nSince both me and the customer are very new to HubSpot, I was hoping somebody here could confirm whether this license is indeed required in order to add raw HTML forms to websites.\n\nIf yes, is it an option to use the API to push form submissions from a custom form, or would that also require an additional license?"
  },
  {
    "poster": {
      "poster_name": "Evan Grim",
      "poster_handle": "whiteship1120"
    },
    "time_stamp": "2021-09-20 14:33:18",
    "edited": {
      "time_stamp": "2021-09-20 14:33:32"
    },
    "text": "<@U02F6NJE2U9> The forms API can do this. I'm a little confused about the subscription tier required. If you click the Marketing Hub tab here, this seems to say that Forms API is available at the \"Marketing Hub Free\" tier  <https://developers.HubSpot.com/apisbytier> (HubSpot pricing confuses me though so YMMV)"
  },
  {
    "poster": {
      "poster_name": "Evan Grim",
      "poster_handle": "whiteship1120"
    },
    "time_stamp": "2021-09-20 14:34:11",
    "text": "I imagine you've found this page, but here are the form API docs <https://developers.HubSpot.com/docs/api/marketing/forms>"
  },
  {
    "poster": {
      "poster_name": "Tomas Sandven",
      "poster_handle": "tomas960"
    },
    "time_stamp": "2021-09-20 14:39:29",
    "text": "<@U010ZU6TRD0> Thanks, seems you're probably right about API.\n\nCan you confirm that the \"Set as raw HTML form\" option requires the user to have \"Marketing Hub Professional\" license? Unfortunately I don't have access to the user's account so I can't confirm it myself."
  },
  {
    "poster": {
      "poster_name": "Evan Grim",
      "poster_handle": "whiteship1120"
    },
    "time_stamp": "2021-09-20 14:42:22",
    "text": "I can't confirm that, don't know for sure.  I think I know someone you can ask though--I'll DM you."
  }
]