[
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2023-11-14 07:04:58",
    "text": "Hi! Let me find this answer for you"
  },
  {
    "time_stamp": "2023-11-14 08:00:27",
    "text": "Reminder: You can find our developer content on HubSpot academy by going to <https://academy.HubSpot.com/results?q=developer&amp;library=true>  Additionally we have a YouTube Channel with a developer podcast and some great developer content <https://www.youtube.com/c/HubSpotDevelopers/playlists>"
  },
  {
    "poster": {
      "poster_name": "Nicole Casares",
      "poster_handle": "ncasares"
    },
    "time_stamp": "2023-11-14 11:20:49",
    "text": "CMS Data-Driven Content Course has Launched :tada: CMS Data-Driven Content Course has Launched :tada: As a developer, you’re responsible for creating websites that offer seamless digital experiences for users. Websites need to be more than just visually appealing- they should be data-driven and scalable, allowing your website to grow along with your business.  In this course, you’ll learn about the following: how and when to use smart CRM objects and HubDB, fetching data in templates and modules, and generating dynamic pages. By integrating smart CRM data sources with HubSpot CMS, you can enrich your CMS content with dynamic data and connect your site more deeply to the full Customer Platform ecosystem. Upon course completion, you'll have gained strategies for creating sophisticated interactive digital experiences that are driven by data. Want to learn more? Let's go! View Course button",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-14 11:32:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2023-11-14 11:32:41",
    "text": "This is awesome, so excited to take this course :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2023-11-14 12:44:27",
    "text": "Hi <@U02DYFPJH4J>, we unfortunately don't have the ability to do this at this time. I know this makes your 'In Progress' section a bit cluttered, but thank you for this valuable feedback!"
  }
]