[
  {
    "poster": {
      "poster_name": "Milan Dodiya",
      "poster_handle": "dev.milandodiya"
    },
    "time_stamp": "2022-04-05 02:23:57",
    "edited": {
      "time_stamp": "2022-04-05 02:24:02"
    },
    "text": "Hey folks,\nCan anyone help me out for accessing module editability which is used on blog listing page?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-05 03:15:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2022-04-05 03:15:01",
    "text": "Since the blog listing doesn’t have its own “content page” and you can edit only the template, I would consider adding all blog listing settings to the theme settings via theme’s `field.json`. Would that be a solution to give more flexibility to content editors?"
  },
  {
    "poster": {
      "poster_name": "Pranjal Tiwari",
      "poster_handle": "pranjal"
    },
    "time_stamp": "2022-04-05 06:34:32",
    "edited": {
      "time_stamp": "2022-04-06 23:24:10"
    },
    "text": "Hello Everyone, I want to create my own templates. Please guide me on how to create templates.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-05 12:22:10"
      },
      {
        "time_stamp": "2022-04-05 22:29:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Simon Tuck",
      "poster_handle": "simon.tuck"
    },
    "time_stamp": "2022-04-05 11:51:30",
    "text": "Hey all, quick question re. global content. I have created a child of my current theme to modify for a redesign of our page. If I edit the global content on a page in this new theme, am I editing it for just the pages using the current theme or the parent theme as well? I ask because if I edit the global content header it says I am editing 88 of 96 assets. even though I only have one page using this new theme at the moment. I guess I could just make a small change and see what happens, but maybe someone has run into this before: When I edit a global content header does it apply just to the current theme, the current theme and domain, or to all domains using the current theme and its parent?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-04-05 13:52:41"
      },
      {
        "time_stamp": "2022-04-05 13:56:22"
      },
      {
        "time_stamp": "2022-04-05 14:07:09"
      },
      {
        "time_stamp": "2022-05-04 12:56:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-04-05 12:22:10",
    "text": "Hi Pranjal, at this time, Themes are only available to be uploaded and sold. If you are looking to for a getting started on how to build themes, please refer to the following docs:\n• <https://developers.HubSpot.com/docs/cms/building-blocks/themes> which will give you an overview of Themes on HubSpot\n• <https://developers.HubSpot.com/docs/cms/guides/getting-started-with-themes> is our getting started guide that you can follow along with "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-04-05 13:52:41",
    "text": "Your child theme is still going to pull modules from the parent theme unless a module or template or resource exists in the child them with the same name at the same location. In short I believe if you clone the global header module and sit it inside of the child theme at the same path as the OG module then your child theme should pull that instead."
  },
  {
    "poster": {
      "poster_name": "Simon Tuck",
      "poster_handle": "simon.tuck"
    },
    "time_stamp": "2022-04-05 13:56:22",
    "text": "Hey <@UQWGKUEN7> thanks for the help. Do you know if this applies to the theme settings as well? Based on your answer I assume so."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-04-05 14:07:09",
    "text": "No theme settings should be distinct for the child — The child theme I believe needs it’s own fields.json file in order to be built"
  },
  {
    "poster": {
      "poster_name": "Pranjal Tiwari",
      "poster_handle": "pranjal"
    },
    "time_stamp": "2022-04-05 22:29:22",
    "text": "Thanks"
  }
]