[
  {
    "poster": {
      "poster_name": "Samantha Canon",
      "poster_handle": "sam326"
    },
    "time_stamp": "2022-11-14 09:17:06",
    "text": "Hey everyone Im looking for guidance, We developed an e-commerce site on WordPress, and the informational pages are hosted in HubSpot. When we use the search bar on the E-ccomerce side, only the product pages show up, and when we use the search bar on the HubSpot pages, only those show up. Is there a way for the e-commerce and the informational pages to show regardless of where you are on the site?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-14 09:17:58"
      },
      {
        "time_stamp": "2022-11-14 09:19:15"
      },
      {
        "time_stamp": "2022-11-14 09:20:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-11-14 09:17:58",
    "text": "maybe <http://www.sitesearch360.com|www.sitesearch360.com> can help with this"
  },
  {
    "poster": {
      "poster_name": "Samantha Canon",
      "poster_handle": "sam326"
    },
    "time_stamp": "2022-11-14 09:19:15",
    "text": "we looked into it, but its out of the client budget do you know of an alternative plug in?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-11-14 09:20:51",
    "text": "no"
  },
  {
    "poster": {
      "poster_name": "Victoria Gumaer",
      "poster_handle": "vgumaer"
    },
    "time_stamp": "2022-11-14 12:18:05",
    "text": "Hey HubSpot community.  It has. been. a. while.  I've moved off from the CMS and over to Commerce Group with a focus on Products, Line Items, and discounts.  My PD and I are starting to dig in on some problems there faced by the community AND we would love to hear from you.  So, if you've used Quotes, Line Items, or any other totals services and ever thought to yourself \"my brain might explode\", we'd love to chat about how we can a.) make that not happen - :brain: exploding is bad and b.) what are you and all of your clients doing with totals calculations when quoting work and delivering to customers.  Feel like a chat?  Hit Alvin up here: <https://community.HubSpot.com/t5/HubSpot-Ideas/Participate-in-a-paid-HubSpot-research-study/idi-p/718322>"
  }
]