[
  {
    "poster": {
      "poster_name": "Prashant Abhishek",
      "poster_handle": "prashant.abhishek7g"
    },
    "time_stamp": "2024-08-07 01:32:19",
    "edited": {
      "time_stamp": "2024-08-07 01:33:05"
    },
    "text": "Hi folks, I am trying to build a connector app between an e-commerce platform and HubSpot. To get the app approved from the e-commerce platform's end I need a Data acknowledgment form signed from HubSpot's end basically to ensure that HubSpot will not use the merchant data to solicit merchants to leave the e-commerce platform.\n\nI would like to talk to the concerned person in HubSpot regarding this. Any idea who might be the relevant person to talk to?\n\nI intend to publish this app publicly on HubSpot's app marketplace."
  },
  {
    "poster": {
      "poster_name": "Atteeq",
      "poster_handle": "a.rehman"
    },
    "time_stamp": "2024-08-07 02:49:15",
    "text": "Hello Team;\nI'm working on to build an App for HubSpot market place. This app will be used to sync users(on register) from my platform to HubSpot as contact and vice versa. My tech stack is laravel.\n\n*Our Scenario*\nMy platform is for event management, in which each event will have unique access key with a dedicated subdomain and registration form for users which are always custom except three fields i.e Fname,Lname and Email. Rest there can be 50 custom fields on the form depending on user requirement.\n\nWe want when user registers on an event he can be synced into HubSpot as contact and vice versa and we are making a global solution so any agency that is using HubSpot can use this by installing our app from the HubSpot market place. At the moment we are using Zapier and some other tools to achieve this where user uses his dedicated API key and accesses fields from his unique custom form.\n\nQ.1\n We want to authenticate our event on HubSpot as each event will have a unique API key, first user should be able to map his event(access his event).\n\nQ.2\nHow would the contact that is created on HubSpot will be received by us i.e using what webhook or polling.\n\nQ.3\nField mapping does that will be provided by HubSpot or do we need to mange that in our app for all fields including custom.\n\nQ.4\nhow would we send data, is there a webhook endpoint where we would push data or we need to create a polling API like we did for Zapier."
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2024-08-07 04:05:03",
    "text": "Hey All,\n\n\tWe need a few tester for our Easyesign app which sign documents without leaving HubSpot with Pandadoc, Dropbox, and DocuSign (supported custom objects and custom properties which are not there in exitsing HubSpot marketplace apps).\n<https://easyesign.oappsit.com/>\nIf you have any questions/issues please message me or mail me at <mailto:shakil@oappsinfotech.com|shakil@oappsinfotech.com>"
  }
]