[
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-08-12 09:02:01",
    "text": "Hey <@U07FVDVFWN6> - Nick is correct, soliciting services does go outside our code of conduct, which would normally yield a warning - but directly soliciting our members to partake in known scams is unfortunately grounds for an immediate ban."
  },
  {
    "poster": {
      "poster_name": "Yohanny Lugo",
      "poster_handle": "fullstack3"
    },
    "time_stamp": "2024-08-12 11:33:52",
    "text": "Hello HubSpot team,\n\nI hope this message finds you well. We are interested in developing an app that syncs contacts between our own database and HubSpot, with the possibility of listing it on the HubSpot Marketplace. However, we noticed from your <https://developers.HubSpot.com/docs/api/app-marketplace-listing-requirements|App Marketplace Listing Requirements> that apps listed on the marketplace should primarily operate within the HubSpot environment.\n\nCould you please confirm if it is possible to create a public app that syncs data between an external database and HubSpot? If such functionality is not supported directly through the marketplace, would it require collaboration with HubSpot’s engineering team, similar to integration apps like <https://app.HubSpot.com/ecosystem/47006645/marketplace/apps/marketing/marketing-automation/keap-data-sync|Keap Data Sync>? Your guidance on this would be greatly appreciated to ensure we align with HubSpot’s policies and capabilities.\n\nThank you for your assistance.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-12 13:01:24"
      },
      {
        "time_stamp": "2024-08-12 13:07:57"
      },
      {
        "time_stamp": "2024-08-12 13:08:50"
      }
    ]
  },
  {
    "text": "Hey <@U07GAB27FAP>, Every app that uses \"Data Sync\" is actually created directly by HubSpot (you can see this in the provider for each of the Data Sync apps). This is because HubSpot has built a special engine for creating these data sync apps and, unfortunately, they haven't provided an option for other developers to access it yet. This also applies to the frontend components of Data Sync apps (the mapping process and settings).",
    "time_stamp": "2024-08-12 13:01:24"
  },
  {
    "poster": {
      "poster_name": "Yohanny Lugo",
      "poster_handle": "fullstack3"
    },
    "time_stamp": "2024-08-12 13:07:57",
    "text": "Ok <@U01QVR44MEY> thank you very much for your help"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-08-12 13:08:50",
    "text": "of course man, let me know if you run into any issues. Happy to help!"
  }
]