[
  {
    "poster": {
      "poster_name": "ANMOL MATHUR",
      "poster_handle": "mathur.anmol"
    },
    "time_stamp": "2024-07-11 09:11:13",
    "text": "Hello All,\n\nI am using the HubL variable `{% request.geoip_country %}`, and it was returning the correct output until a few days ago. Recently, it has been consistently returning 'us' regardless of the VPN region I am connected to. Is there any issue on HubSpot's side?\n\nCan anybody help ?"
  },
  {
    "text": "I’m trying to build a module for an email, but the if/else isn’t working for me. Anyone able to help?\n\n```{% if module.category==\"python\" %}\n  <h3 style=\"margin-bottom: 5px;\">\n    Python: {{ contact.data_science_quiz_python_score }} / 4\n  </h3>\n  {% if contact.data_science_quiz_python_score <= 1 %}\n  You have a basic understanding of Python. Enhancing your knowledge in core programming concepts will significantly improve your data science skills.\n  {% elif contact.data_science_quiz_python_score == 2 %}\n  Your grasp of Python is solid. Continuing to build on this foundation will help you develop more advanced programming abilities.\n  {% elif contact.data_science_quiz_python_score == 3 %}\n  In the Python section, you showcased your grasp of this versatile programming language. Your results reflect your proficiency in Python essentials.\n  {% elif contact.data_science_quiz_python_score == 4 %}\n  Excellent work! Your Python skills are top-notch, demonstrating a deep understanding of programming concepts and techniques. You're already excelling, but there's no limit to how far you can go.\n  {% else %}\n  Invalid python score.\n    {% endif %}```\n\nthat’s the code I have for my module. The `contact.data_science_quiz_python_score`  is a Contact property stored as a single line text field.\n\nI’ve tested it for a specific contact, with a score of 3. The module is picking up the score, but not matching the if/else . I’ve also tried with a comparison of `contact.data_science_quiz_python_score == \"3\"`  because I thought maybe it was a string vs integer issue, but that didn’t work either.",
    "time_stamp": "2024-07-11 10:47:27",
    "edited": {
      "time_stamp": "2024-07-11 10:47:56"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-15 09:28:26"
      }
    ]
  }
]