[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-07-29 05:38:34",
    "text": "<@U25PYL3Q8> <@U03AKL6Q1B2> This was the most enjoyable thread I have read in a while - kudos!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-29 06:16:37",
    "text": "<@U07DXTA87L6> :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jeff Bell - Level 4",
      "poster_handle": "jeffrey.bell"
    },
    "time_stamp": "2024-07-29 08:57:30",
    "text": "Hey all. I think I'm missing something fairly elementary and am hoping to get some help. I'm pretty new to CMS development but have been doing quite a bit of CCAs and such. Anyway, I'm trying to customize a quote template. I've cloned the them and am working on a new template. I have added a new property to my Products called \"contract type\" (internal value is just 'type'). The end goal is to have two different line item tables - one the filters on line items where type=price_and_qty and another where type=price.\n\nEverything has been working \"logically\" until I go to actually use the quote template for a real quote. I've updated the mock_data file to include my \"type\" property and I can filter while previewing. But when I got to actually use the quote template, I get nothing. Is there some file or definition somewhere that tells HubSpot what properties of the objects to pull in? What am I missing here?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-29 10:11:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jeff Bell - Level 4",
      "poster_handle": "jeffrey.bell"
    },
    "time_stamp": "2024-07-29 10:11:19",
    "text": "Answering my own questions here in case anyone else runs into this. I was filtering with LINE_ITEMS|selectatt(\"type\",\"equalto\",\"price\") but the value was actually found within the custom_properties. The filter that ended up working was:\n\n```|selectattr(\"custom_properties.type.internal\", \"equalto\", \"price\")```"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-07-29 11:01:01",
    "text": "who would like to help iron out a feature for CMS modules???\n*looking for both developers and marketers to play around with this.*\n\nWe're seeking participants to test a new feature called Default Module Versioning - Default Module Upgrade UI. This new UI allows marketers to easily opt into new versions of default modules as they become available and perform module upgrades or rollbacks without delving into the technical details. It also offers internal developers the flexibility to iterate and build custom modules.\n\nIf you're interested in trying out the versioning upgrade UI, let us know, and we'll enroll you in  our empathy session planned for Aug 7th 2024. During this session, we'll collect feedback and answer any questions about the new functionality.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-29 12:24:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2024-07-29 12:07:51",
    "text": "I do this for modules I create, but what about when you are building a theme and  are using the built in HubSpot Image Slider Gallery?   We set the width and height but it is not rendered in the code when the user adds their own images. This should really be built into HubSpot to always have a width and height defined:\n\nE.g.\n\n{% dnd_module\n        path=\"@HubSpot/image_slider_gallery\",\n        offset=0,\n        width=12,\n        slides=[ {\n          \"caption\" : \"Enter any descriptive text for this image that you would like visitors to be able to read.\",\n          \"img\" : {\n            \"alt\" : \"Add detailed image description\",\n            \"height\" : 1200,\n            \"src\" : \"<https://www.domain.com/hubfs/my-image.webp>\",\n            \"width\" : 1200\n          }\n        } ],\n        slideshow_settings={\n          \"movement\" : {\n            \"loop_slides\" : true\n          },\n          \"navigation\" : {\n            \"show_dots\" : true\n          },\n          \"slides\" : {\n            \"aspect_ratio\" : \"1:1\",\n            \"show_captions\" : false,\n            \"sizing\" : \"natural\"\n          } ...\n        }\n      %}\n      {% end_dnd_module %}"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-07-29 12:24:47",
    "text": "feel free to shoot me a dm if interested :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "AdrianF",
      "poster_handle": "adrian823"
    },
    "time_stamp": "2024-07-29 15:12:48",
    "text": "<@U25PYL3Q8> Thanks again for the video. I didn't realize it was that easy. But I was curious about a couple things before I right click and delete the theme from the sandbox.\n\nWhen I first created the sandbox (built/imported by HubSpot) there was no theme selected so I had to select the theme in the settings. The first problem I encountered was that HubSpot couldn't see the theme. I noticed that the theme didn't have a theme.json so I created a very basic one and uploaded it. After that HubSpot could see and select the theme. This is straying from the point a little, but I just wanted to mention that. It makes me assume that HubSpot can't use a theme unless it has a theme.json which makes we wonder how the theme was selected in the first place in production.\n\nSo back to the point and my questions. I'm not sure what deleting the theme is going to do to the sandbox if the selected theme is suddenly gone. It's kind of integrated into a lot of stuff already. That large red popup warning is also making me a little hesitant to right click and delete it. The warning is listing a pretty large number of \"live assets\" which feels a little confusing, but I'm probably just not aware of what or where those assets are yet. I'm still discovering how the site was originally set up (by someone else a long time ago).\n\nHere's that warning:\n\"Be careful, by deleting \"Theme\" you're about to delete a total of 91 files, 34 of which are being used by live assets.\"\n\nObviously it's just a sandbox, so I could break every file and it wouldn't matter but this makes we wonder if it might be easier to delete the sandbox I've been working on, create a new one and start over. Then I could delete and copy the theme from production before selecting it as the theme in the settings... or maybe the same situation would come up even then?\n\nYou've probably seen some of this behavior before so I thought you might know what would happen in either case. Any suggestions?\n\nI'm mainly trying to avoid any extra frustration and work, if possible."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-29 15:15:03",
    "text": "I kind of agree with the idea of creating a new sandbox and leaving this one be. Make a fresh start for you to take over without worrying about legacy issues"
  },
  {
    "poster": {
      "poster_name": "AdrianF",
      "poster_handle": "adrian823"
    },
    "time_stamp": "2024-07-29 17:07:39",
    "text": "I'm starting to lean that way too. Maybe something  got messed up during build of the current one. Too bad only one sandbox at a time. Would be nice if I could have more than one at a time, or at least two. I'm curious if there is also a way to use the cli to copy production over to the dev, the other type of sandbox. I haven't seen a way to do that in HubSpot. Eventually I'm thinking it would be better to use the cli for everything but I've only used it for uploading and downloading files so far, so I'll need to get up to speed with that first."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-29 17:09:45",
    "text": "Are you talking about the Enterprise sandbox that connects directly to prod? \n\nYou could get a free CMS sandbox for developers"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-29 18:24:17",
    "text": "<@U07DXTA87L6>\nDid you verify if the theme.json was in the production account?\n\nRename the theme folder before coping the new one over so it doesn’t get overwritten\n• To add to this, I would test into a dev account if possible, just so you know what you are doing!\nNow, I’ve had mixed results and cannot remember the outcome when copying over from one portal to another and updating a theme in that regards. There are module IDs that might be linked (if you are pulling in modules that way in the theme. The proper way would be to use relative urls like `../layouts/base.html` vs using a module ID. These are typically in saved sections or “template” files that are bringing those in. If you are using relative stuff, IT should be okay.\n\nYou can also use the CLI to do this.\nYou auth in, grab all the files, then `hs auth` to the new portal, then push files….. if you push them to the proper folders you should be good.\n\nAgain — this might be better done in a dev account as a trial run."
  },
  {
    "poster": {
      "poster_name": "AJ Johnson",
      "poster_handle": "aj.johnson"
    },
    "time_stamp": "2024-07-29 20:26:31",
    "text": "thank you, <@U03MU3H35R6> &amp; <@U03AKL6Q1B2>! :raised_hands::skin-tone-2:"
  },
  {
    "poster": {
      "poster_name": "AdrianF",
      "poster_handle": "adrian823"
    },
    "time_stamp": "2024-07-29 20:33:23",
    "text": "<@U03AKL6Q1B2> <@U25PYL3Q8> Actually, I'm trying to remember how I created the other sandbox... I created the standard sandbox from the production account, but before I did that I created a sandbox from within my user account. Ah, this must be the CMS sandbox for developers. I was just using it to mess around and test random stuff. I did use the cli to put the production theme there too.\n\nI never found a theme.json in the theme from within the production account so I guess it never had one. I thought that was odd. OK, maybe I'll test the things you're suggesting here in the developer account asap.\nThanks guys!"
  }
]