[
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2024-07-30 12:53:46",
    "edited": {
      "time_stamp": "2024-07-30 12:56:09"
    },
    "text": "I have uploaded css and js files to the Design Manager as I build out a theme. These files are assigned to modules created in Design Manager. I thought HubSpot minifies these, but am I wrong? When I view pages in content staging the files are not minified.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-31 17:00:46"
      },
      {
        "time_stamp": "2024-08-08 09:55:25"
      },
      {
        "time_stamp": "2024-08-08 09:57:10"
      },
      {
        "time_stamp": "2024-08-10 07:20:43"
      },
      {
        "time_stamp": "2024-09-25 07:30:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AdrianF",
      "poster_handle": "adrian823"
    },
    "time_stamp": "2024-07-30 16:05:41",
    "text": "<@U03AKL6Q1B2> <@U25PYL3Q8>\nI'm seeing some different behavior in the accounts. In the Standard Sandbox when I create a new webpage and I'm taken to the page where I have to select a theme, I can't see the theme, but there's a \"Skip to templates\" button where I can jump ahead to the templates. At that point I can view and select the templates from the correct theme (which is how I did it before in that account). In the devs CMS when I create a webpage and I'm taken to where I have to select a theme, I also can't see the theme, but there's no \"Skip to templates\" or anything so I can't create a page. I'm not sure why it would be different between those accounts.\n\nIn both accounts when I go to Settings -&gt; Tools -&gt; Themes and then click on the theme it tells me that the theme has no templates. It does have a lot of templates though. I'm wondering if this has anything to do with the problem with the modules.\n\nOne thing I noticed about the template files when I look at them locally. All the files in the templates directory are json files. In other themes I've used the files are all html. I think I've always created templates as HTML files. I'm wondering how these templates were created. Wasn't there a way to create a template in HubSpot so that it's non editable? I'm remembering there was \"drag and drop\" type or something, but I don't see it now. Was it removed?\n\nBefore moving forward I guess I should just keep messing around with these two accounts to see what I can find out or get to work."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-07-30 17:49:33",
    "text": "<@U07DXTA87L6> this sounds like a super mess.\n\nIs the theme in your original portal a child theme of a parent theme? That might be what is going on here?\n\nIf that isn’t the issue, I’m not sure what the actual issue is here! I might be able to look at it early next week if you want a second eye on it."
  },
  {
    "poster": {
      "poster_name": "AdrianF",
      "poster_handle": "adrian823"
    },
    "time_stamp": "2024-07-30 19:52:45",
    "text": "<@U25PYL3Q8> Yea, and it looks like a mess too. There are so many files everywhere and I'm not sure what they're for. It looks like there are a lot of old files that are not being used. There are also more than 50 GB of files in the Library-&gt;files, most of them high resolution images. Well... one step at a time. The first thing I'm supposed to do is get some kind of dev environment set up so I can test minor tweaks with out cluttering up the main account.\n\nI think the theme is a custom theme with no parent. I've never used a child theme before in HubSpot so I'm not sure yet how they are identified, but I'll see if I can find out what it is. I'll update you here if I find out anything else and maybe we can try looking at it next week.\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Brandon Nkabinde",
      "poster_handle": "brandon693"
    },
    "time_stamp": "2024-07-30 23:51:50",
    "text": "Goodday Developer group! I need some help! I am looking to display deal data to my user on a landing page which makes up a customer portal. Adding personalization tokens is very limited as they do not pull the right data if any at all. I need to pull deal data and display. I have tried creating a module yet it continuously says deal data cannot be displayed. Any one who could perhaps guide me here?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-28 10:54:08"
      }
    ]
  }
]