[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-07-23 01:19:10",
    "text": "It might happen due to the changes made to the module in the update. For example, the new version has changed some of the paths, like this:\nold: `module.title`\nnew: `module.text_elements.title`\nOn the page, old module instances will try to find module.title, but its value is already stored in module.text_elements.title\n\nSuch a change might impact existing instances of the module, but it won't affect adding new instances on the page\n\nThis is one of the hypothethical reasons for the page's missing elements. However, to find the real reason, one needs to check the code inside your HubSpot portal"
  },
  {
    "poster": {
      "poster_name": "Shani Hussain",
      "poster_handle": "zibrar00"
    },
    "time_stamp": "2024-07-23 04:51:44",
    "text": "Hi Guys,\n\nIs anyone able to help here, please?\n\nI am trying to fetch contact associated company records in the email module using the crm_associations function, it works fine if I use a static ID for a contact, but if I use 'contact.hs_object_id' to fetch values dynamically then it stops working."
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-23 08:30:51",
    "text": "Got a fun conditional question!\n\nIn my custom module I have two fields:\n• name: contact — is a “crmobject” contact. (properties_to_fetch include phone).\n• name: phone — text field.\nWhen you select the object in the module, I only want to display the phone field (second field) if the contact.phone is empty.\n\nIn all my testing.. the phone `visibility` settings never work. I’ve tried the following\n```  \"visibility\" : {\n    \"controlling_field\" : \"contact\",\n    \"controlling_field_path\" : null,\n    \"controlling_value_regex\" : \"true\",\n    \"property\" : \"phone\",\n    \"operator\" : \"EMPTY\",\n  }```\nI’ve tried the following.\n1. I’ve tried `controlling_field` and `controlling_field_path`\n2. tried in the property field `contact.phone` and `property.phone`\n3. tried operator IS_EMPTY/NOT_EMPTY \n4. I’ve tried adding a default value to the contact field that include phone\n5. Also tried a regex test of `\"controlling_value_regex\" : \"^$\",`  \nBased off the docs, it would work with specific field types, like image, but can’t get it to work with crmobject field type.\n\nHas anyone ever been able to solve this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-23 08:33:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-23 08:33:51",
    "text": "I know I can control this in the module.html but I want a better user experience."
  },
  {
    "poster": {
      "poster_name": "Tyler Samani-Sprunk",
      "poster_handle": "tyler594"
    },
    "time_stamp": "2024-07-23 15:48:21",
    "text": "We resolved this issue. It was a mess that caused it but in case anyone else encounters it, ours was caused by the following:\n• We had two clones of a theme and we had pages using modules from what I'll call version A\n• We created a child theme of version B and moved all the pages using templates from Version A to the same templates from the new child theme. Everything looked good but we didn't realize that the pages were still referencing modules from Version A instead of the same modules in Version B. This was only true for modules that had been added, any module that was in the actual page template updated to point to the module the template referenced in Version B\n• We deleted Version A, which meant that all those modules from Version A disappeared from the pages"
  }
]