[
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-04-08 05:36:12",
    "text": "<@U22PJPGK0> Thanks very much for reaching out, there's a lot of scripts that aren't easy to understand their purpose, like 'head-raven.js' and scripts to do with messages / message handling. Is there anyway to see exactly what HubSpot is including on your site or anyway to tell HubSpot to combine and minify them?"
  },
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-04-08 05:37:35",
    "text": "<@UVCQGSL2C> Hi Quinn, thanks very much for your help, I do use custom modules quite a lot in HubSpot CMS. I'm interested in what you mean by the 'new CMS' approach. I've been using CMS for a while now and am now sure of a new way to include JS or CSS?"
  },
  {
    "poster": {
      "poster_name": "Quinn Chaffee",
      "poster_handle": "quinn884"
    },
    "time_stamp": "2020-04-08 06:56:37",
    "text": "so first step is to see the \"new\" approach, which seems to be to version control everything: <https://github.com/HubSpot/cms-theme-boilerplate>"
  },
  {
    "poster": {
      "poster_name": "Quinn Chaffee",
      "poster_handle": "quinn884"
    },
    "time_stamp": "2020-04-08 06:56:59",
    "text": "I'd recommend checking that out and creating your own iteration"
  },
  {
    "poster": {
      "poster_name": "Quinn Chaffee",
      "poster_handle": "quinn884"
    },
    "time_stamp": "2020-04-08 06:57:26",
    "text": "from there you will start to get a feel for where things are going, and how to create global vs modular items"
  },
  {
    "poster": {
      "poster_name": "Quinn Chaffee",
      "poster_handle": "quinn884"
    },
    "time_stamp": "2020-04-08 06:57:55",
    "text": "ps: im guessing the HS team is working on bundling all assets in the future regardless of module vs global, but dont know for sure"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2020-04-08 08:29:34",
    "text": "ah, `head-raven.js` is loaded by the chat widget. If you remove the chat widget does that make most of them go away? Note that it is loaded async, so it won’t affect the initial page load. I will follow up with that team and see if they can combine them though."
  },
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-04-08 09:32:32",
    "text": "<@U22PJPGK0> It was the chat, I disabled it and it removed 6 scripts, 5 images and a couple of stylesheets. The scripts where quite heavy too, it would be great if there was a way to combine them. Thanks for looking into this!"
  },
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-04-08 09:32:59",
    "text": "<@UVCQGSL2C> Hi Quinn, thanks for the link, I'll look into that, looks interesting! Thanks for your help!"
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2020-04-08 09:36:19",
    "text": "Cool. Most of those scripts are supposed to load on demand rather than on page load. The team is looking at why that’s not working."
  },
  {
    "poster": {
      "poster_name": "David",
      "poster_handle": "david419"
    },
    "time_stamp": "2020-04-08 10:00:18",
    "text": "Thanks Jeff, that's great!"
  }
]