[
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-06-17 05:00:10",
    "text": "Hi everyone,\n\nI hope this message finds you well. We are seeking assistance with an issue that has arisen following our transition from using Hapikey (v2 version) to a Private App (v3 version) for our API calls. Since making this change, we have encountered a problem with tracking Google and Facebook leads in our HubSpot contacts list.\n\nPreviously, when we used a [specific code], tracking for contacts originating from Google functioned correctly for v2 version. However, after switching to v3 version, the tracking no longer seems to differentiate properly between Google and Facebook leads. Instead, [specific code] appears to aggregate contacts from both sources under a single filter in the HubSpot contacts list, particularly under the \"Original source drill-down 2\" filter option.\n\nCould you please help us resolve this issue so that we can correctly track and differentiate leads coming from Google and Facebook separately as we did before?\n\nYour prompt attention to this matter would be greatly appreciated.\n\nThank you in advance for your help and support."
  },
  {
    "poster": {
      "poster_name": "Mylène Bergeron",
      "poster_handle": "mylene.bergeron"
    },
    "time_stamp": "2024-06-17 10:00:12",
    "text": "Hi, I don't know where to go in your slack channels to get help, but I was redirected here from your HubSpot support chat.\nThe HubSpot Plugin for WordPress got an update recently, and our team went forward with the update but is now having issues seeing our website chat consistently. When I go into the plugin settings in WordPress, I see that it mentions that the latest version of HubSpot was not tested with the latest version of WordPress. Does someone know when it'll be tested so I can know when to expect to see the chat consistently?"
  },
  {
    "poster": {
      "poster_name": "Anwin Anto",
      "poster_handle": "anwina"
    },
    "time_stamp": "2024-06-17 22:48:18",
    "edited": {
      "time_stamp": "2024-06-17 22:48:46"
    },
    "text": "Hi team,\nI am new here!\nI recently came across a CMS React boilerplate designed for creating modules using React. I am seeking assistance with the following:\n1. *Webpack Configuration for Code Splitting*: Could anyone provide guidance or examples on how to configure Webpack for code splitting in this context?\n2. *Bundle Size Limit for Production*: Additionally, I would like to understand the rationale behind the imposed bundle size limit for production deployments.\nAny insights or resources you could share would be greatly appreciated.\nThanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Karandeep Singh",
      "poster_handle": "ext.karandeep.k365"
    },
    "time_stamp": "2024-06-18 00:32:35",
    "text": "I am trying to get authorization code with full call back url and with localhost. But its not working",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-18 15:43:37"
      }
    ]
  }
]