[
  {
    "poster": {
      "poster_name": "Jaivardhan Dalal",
      "poster_handle": "jai.palmspire"
    },
    "time_stamp": "2023-06-20 10:08:45",
    "text": "Hi, I'm Jai from Palmspire, offering exceptional services to agencies and brands. Whether you want to boost your own online presence or that of your clients, Palmspire has got you covered. Visit <https://www.palmspire.com|palmspire.com> for more details or you can reach out to us anytime at <mailto:hello@palmspire.com|hello@palmspire.com>. I'd also like to share some of our recent projects. Take a look at our work: <https://www.palmspire.com/our-work/|Recent work>."
  },
  {
    "poster": {
      "poster_name": "Zev",
      "poster_handle": "zevibackup"
    },
    "time_stamp": "2023-06-20 20:44:44",
    "text": "Hiya! Zev here - really stoked to share that there’s a shiny new tool called SmartSide out in beta, and I’d really love your feedback!\n\n:question: *What is it?* SmartSide allows you to action and manage your HubSpot CRM from within Slack. No more tab switching.\n:eyes: *How so?* Users/managers can build custom and personalized workflows to notify them of what’s most important to them! They can use actions (yep, you guessed it, also totally customized) to easily update the CRM right from the message! Best part? It’s to your DMs so there’s no unnecessary channel spamming, unless the manager sets it up.\n:thinking_face: *What else?* Once a user receives an alert they can do all sorts of cool stuff: create notes or meetings, update records, and more!\n:toolbox: *What tools or resources do I need?* None! You build your workflows in Slack start to finish.\n:exploding_head: *OK, I’ll try it:* Woohoo! Please feel free to install and get going, but shoot me a DM to help walk you through the fun!\n\nUltimately, tab switching is tough, and SmartSide aims to solve it in the best way possible. I’d really love your thoughts and feedback so give me a holler at anytime!\n\n:link: <https://smartside.app>\n:bird: <https://twitter.com/smartsideapp>"
  }
]