[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-07-27 04:24:45",
    "edited": {
      "time_stamp": "2022-07-27 04:25:07"
    },
    "text": "Why doesn’t HubSpot load the HubSpot sprocket menu toolbar and page editor tinymce rich text area toolbar in iframes? Kind of annoying that theme CSS affect them.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-07-27 07:35:22"
      },
      {
        "time_stamp": "2022-07-27 07:37:14"
      },
      {
        "time_stamp": "2022-07-27 08:05:33"
      },
      {
        "time_stamp": "2022-07-27 08:10:35"
      },
      {
        "time_stamp": "2022-08-01 02:29:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2022-07-27 07:35:22",
    "text": "That's a great question. It's really an architectural decision that we took several years ago which has worked really well. I don't know the full story, but having the toolbar be loaded into our apps allows us to use that as a universal hub for special API calls that all our applications need. If that were an iframe, those call responses would not propagate into the apps themselves. Things like the Help widget information and access rights tend to be loaded in that component"
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2022-07-27 07:37:14",
    "text": "However, it would be cool if you opened a feature request to fix theme CSS affecting the toolbars. Maybe we can create a way to encapsulate the components themselves into a shadow dom. I'll chat with the menu bar team to see if they've heard this concern before."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-07-27 08:05:33",
    "edited": {
      "time_stamp": "2022-07-27 08:07:53"
    },
    "text": "&gt; However, it would be cool if you opened a feature request to fix theme CSS affecting the toolbars.\nSure. By open a feature request, you mean post as an idea through the community forums, right? And yeah, I run into this issue on pretty much every theme/website I create, I’m a little surprised I haven’t seen others complaining about it. Probably because you can arguably just tweak your selectors around the issues to get rid of them."
  },
  {
    "poster": {
      "poster_name": "Zeke Schmois",
      "poster_handle": "zschmois"
    },
    "time_stamp": "2022-07-27 08:10:35",
    "text": "Yeah the ideas forum would be great"
  }
]