[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-07-13 06:27:44",
    "text": "Good idea, this is something we plan to support!\n\nOut of curiosity, is your expectation that the sort only happens in the table editing UI, and does not impact the display order on your website (if code does not otherwise sort it)? Or do you except the sort to impact the display order of data on your website?\n\nIf just the table UI, do you expect the table sort to persist? For you? For all users in your account?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-13 09:38:55",
    "text": "It would be dope if there were a way to toggle on a baked in ordering option that would impact display. Would be easiest if it were a drag and drop kind of a tool where you could just grab rows and place them in the correct order"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-07-13 09:48:08",
    "text": "&gt; if it were a drag and drop kind of a tool where you could just grab rows and place them in the correct order\nthis is hopefully in BETA in the next couple weeks, however, would work independently and mutually exclusively of some sort of table sort feature (i.e. alphabetically sorting a column).One if a programmatic sort, and one is an arbitrary sort. Does that make sense?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-13 09:50:35",
    "text": "Haha im not following 100% but cool that some native sorting is coming"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-13 09:51:01",
    "text": "What do you mean that it’s mutually exclusive of some table sort?"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-07-13 09:54:40",
    "text": "So the default \"order\" of the data is currently by when the row was created (as they are displayed in the table editor). This impacts the editor and order on a website (if the data is not otherwise sorted in code).\n\nSoon, we will allow you to re-order those rows manually, to change the \"order\" of the data in the editor and on websites (if the data is not otherwise sorted in code).\n\nWe are additionally considering letting users \"sort\" the table based on columns, like you can do in excel/other spreadsheet style tools, where the order of editor changes, to follow some rule. i.e. X column asc/desc. We are currently thinking this would not impact website display order, and it would just be an editor feature to more easily sort through your data and find stuff. The manual display order you create will be the order as it displays on a website, unless otherwise sorted in code).\n\nDoes that make sense?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-07-13 09:55:22",
    "edited": {
      "time_stamp": "2022-07-13 09:55:52"
    },
    "text": "&gt; Out of curiosity, is your expectation that the sort only happens in the table editing UI, and does not impact the display order on your website (if code does not otherwise sort it)? Or do you except the sort to impact the display order of data on your website?\n&gt; If just the table UI, do you expect the table sort to persist? For you? For all users in your account?\nYeah, only happening in the table editing UI is fine for my use-cases. We can already use HubL (or JS) to filter and sort the results how we want programmatically, if I understand you correctly.\nI would expect the table sort to not persist, personally; generally these kind of sort/filter things are temporary, but either would be fine. And I would expect just for me, but again either would be fine really."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-07-13 09:55:56",
    "text": "Thanks!"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-13 09:56:11",
    "text": "Yes this makes sense and im all about what youre throwing down!"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-07-13 09:57:10",
    "text": "Yeah, that sounds like what I would expect, sounds good."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-07-13 09:57:57",
    "text": "Thank you both for the perspective!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-07-13 13:19:13",
    "text": "I know I'm a little late to the convo, but one feature that would also be nice is the ability to freeze the header row so that when you're scrolling to update data in the table you can still see the header."
  },
  {
    "poster": {
      "poster_name": "Brandon Tuttle",
      "poster_handle": "brandon139"
    },
    "time_stamp": "2022-07-13 15:15:33",
    "edited": {
      "time_stamp": "2022-07-20 09:11:02"
    },
    "text": "Here is an app in the marketplace that gives you the ability to sort by column\n\nHubDB HQ for HubSpot Integration Overview\n<https://ecosystem.HubSpot.com><https://ecosystem.HubSpot.com/marketplace/apps/marketing/cms/integrate-hubdb-201495| › integrate-hubdb-201495>"
  }
]