[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-07-21 04:55:11",
    "text": "Allow loops in `dnd_area`. We should be able to loop through an array of strings to generate custom modules/sections, and or be able to do\n```  {% for num in range(1, 8) %}\n    {% include_dnd_partial path='../sections/some-section.html' %}\n    {% include_dnd_partial path='../sections/divider.html' %}\n  {% endfor %}```",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-07-21 11:18:41"
      },
      {
        "time_stamp": "2022-07-21 14:07:07"
      },
      {
        "time_stamp": "2022-08-24 20:27:21"
      },
      {
        "time_stamp": "2022-08-24 20:28:16"
      },
      {
        "time_stamp": "2022-08-25 07:18:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-07-21 11:18:41",
    "edited": {
      "time_stamp": "2022-07-21 11:21:23"
    },
    "text": "*How often do you think you’d use this if it existed?*\n\n*Do you have any use cases that would be enabled by having this?*\n\n*How would you expect us to handle situations where the number of loops is dependent on either a variable in the page or another variable accessible in the CMS?*\n\nlike for example you could theoretically get the `length` of blog posts returned by `blog_recent_posts()` and use that as the number.\n\nIf looping based on quantity of posts like this: every new page you created with that template would loop the number of times for blogs at the time of page creation. So the first page might have 1 loop, the 2nd page 10, depending on timing with blog posts.\n\nDevelopers do some pretty creative things. If we were to support looping like this, we’d need to be careful, as tons of possibilities open up that could create weird experiences."
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2022-07-21 14:07:07",
    "text": "&gt; *How would you expect us to handle situations where the number of loops is dependent on either a variable in the page or another variable accessible in the CMS?*\nI think is the main one. Right now after you create a page that contains a D&amp;D area that instance of the D&amp;D area is essentially disconnected from the template (because reconciling template updates with changes made on the page level in the editor would be really hard / impossible to guess right). This loop functionality essentially becomes a “run once at page creation time” utility. We’ve talked about this a little bit internally in regards to potentially adding fields to sections, but run into a similar problem (you essentially fill out fields for the section once at insert time and then never again), so the idea never gained too much traction."
  }
]