[
  {
    "poster": {
      "poster_name": "Ollie Bradley",
      "poster_handle": "ollie.bradley"
    },
    "time_stamp": "2024-06-26 03:41:25",
    "text": "Hi James. I have used this integration for a few projects (albeit using dedicated make expert partners). What errors are you getting?"
  },
  {
    "poster": {
      "poster_name": "Paul",
      "poster_handle": "paul.buskovskij"
    },
    "time_stamp": "2024-06-26 03:59:49",
    "text": "Hello everyone,\n\ncan HubSpot please help me directly, I had a property in a custom object, now I would like to create a new property with the same internal name, unfortunately I get the following error message:\n\n“The following property cannot be created with hasUniqueValue=true because a non-unique property with the same name previously existed in this portal: portalId=XXX, objectTypeId=YYY, propertyName=ZZZ”\n\nI can’t find the property via the api or the portal.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-26 09:09:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Omri Cheikha",
      "poster_handle": "omri"
    },
    "time_stamp": "2024-06-26 05:46:47",
    "text": "Hey <@U0741NL2WMA>, thanks for your reply :slightly_smiling_face:\nWere using WP as CMS and the HubSpot meeting module is embedded on a dedicated page under the same domain.."
  },
  {
    "text": "I get like this for example. Even though I checked all of the possible scopes, I still can't make the error disappear.",
    "time_stamp": "2024-06-26 07:00:30"
  },
  {
    "poster": {
      "poster_name": "Trish Erickson",
      "poster_handle": "trish.erickson"
    },
    "time_stamp": "2024-06-26 09:09:18",
    "text": "I might try exporting all of your properties from the CRM, it will have all of the internal names and you should be able to CTRL-F to find the Property with the same internal name. You can't change internal names so you will have to delete the property that has it. Hit me up if you need further assistance"
  },
  {
    "text": "Hello, I am trying to figure out if I can  have a separate search results page for a specific blog - we have 2 HubSpot blogs. I noticed you can change the blog system pages search result page but that will effect all blogs. Our situation is we have a blog where we post blog like articles and we have another blog that we call our Application database where users can search our research articles. I currently have a separate search input module that only searches for blog posts under our application database blog. *I am unsure if we can have a seprate search results page for this application database blog or not*.  I would imagine to have a separate search result page i would need to go to settings-&gt;Content-&gt;Pages and then select the system pages and make sure that our blog was selected. the only issue is that this is settings for all blog pages.",
    "time_stamp": "2024-06-26 09:23:01"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-26 09:59:06",
    "text": "All of the sites that have the tracking code added need to be listed on the Advanced Tracking tab.\n\nAny domain hosted outside of HubSpot can't be connected in HS on the Domains &amp; URLs settings or it would take down your existing live site and 404 error. Only domains for content hosted in HS should be connected to HS."
  },
  {
    "poster": {
      "poster_name": "Demi Regan",
      "poster_handle": "demi"
    },
    "time_stamp": "2024-06-26 10:43:02",
    "text": "Hey y'all!\nTrying to a find a way to auto-log Single Send API email replies on the deal record.\nI know we can use the HubSpot BCC email, but it doesn't work for our use case.\n\nWe have a real estate company, and an Agent can be on multiple deals, and we don't want the email reply logging to ALL deals this Agent is associated with.\n\nRight now we send the email to the Buyer &amp; CC the Agent. We'd want to log the Buyer's reply to ONLY their deal &amp; contact record, and skip logging it to the Agent's record.\n\nWe have the Gmail plug in with auto-logging &amp; tracking on, but from what I've gathered, a reply/thread ID will only log to the deal record once WE reply to the Buyer's initial reply. Which seems weird.\n\nHas anyone solved this problem in the past?"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-06-26 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Carolina Mardones",
      "poster_handle": "cmardones"
    },
    "time_stamp": "2024-06-26 16:13:27",
    "text": "Hello, I am a beginner. I having some issues trying to insert the code for the favicon in a personalized landing  (the blog) page of my site. Can you help me? On which channel I have to go. thanks!!!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-27 01:31:19"
      },
      {
        "time_stamp": "2024-06-27 02:28:29"
      },
      {
        "time_stamp": "2024-06-27 02:29:35"
      }
    ]
  }
]