[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 06:51:49",
    "text": "only on the advanced tracking settings, not connected to Domains &amp; URLs (it can only be connected to one CMS and would break your current website if you change the DNS)"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 06:55:17",
    "text": "The steps for going live depend on whether it's a new website or one that you're migrating to HubSpot from another CMS (already live somewhere else).\n\nUpdating the DNS records will make any published pages for your domain live based on the settings you have under Domains &amp; URLs."
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-06-19 07:16:42",
    "text": ":100: what <@U03AKL6Q1B2> said\n\nsmall addition:\nIf you have build (and published) your pages on a default HubSpot Domain for testing/building purposes you'll need to edit this on every page ( drafts too). Furthermore it's recommended to delete the redirects once the domain is connected and the pages have the right domain. It's optional but will keep your redirect list clean and might improve tech. SEO (you might run into potential redirect loops at a later point)"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 07:28:19",
    "text": "<@UJAPS2K4N> if they set their domain as the primary for websites, and they published with the staging (hs-sites) domain, it now auto-updates. I can't remember when this changed, but it's been the case for the last few website launches I've had."
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-06-19 07:29:04",
    "text": "Ohh wow - didn't know that! That's amazing!\n\nThanks for the info <@U03AKL6Q1B2>!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 07:29:19",
    "text": "yes, it was a HUGE improvement!"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-06-19 07:30:33",
    "text": "saves A LOT of headaches :smile:\n\nHad to edit 100+ pages once and learned from this... no fun"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 07:37:06",
    "text": "yes, same, and it's still the case if they connected a subdomain and then change it to the root domain and both remain connected, even if the primary for websites changes."
  },
  {
    "text": "I am curious if we have flexibility to add custom button in this activity buttons list which do custom action we set may be using HubSpot UI extention?",
    "time_stamp": "2024-06-19 09:32:15",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-21 10:43:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gaurav Singla",
      "poster_handle": "gaurav.s"
    },
    "time_stamp": "2024-06-19 09:52:37",
    "edited": {
      "time_stamp": "2024-06-19 09:53:08"
    },
    "text": "Thank you for your assistance. We are launching a new website with entirely fresh content, not migrating any material from other sources, and we are using a new domain. What will be the process for going live?\n\nThanks in advance"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-06-19 10:49:42",
    "text": "1 - update your language settings, make sure prefix in slug is only selected if you plan to use that as your home page (instead of root domain)\n2 - you can pre-provision your SSL ahead of time (this would've saved time at launch if done a few days ago)\n3 - connect your DNS\n4 - verify all of your pages are live (24-48 hours)"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-06-19 10:55:02"
  }
]