[
  {
    "poster": {
      "poster_name": "Shweta S",
      "poster_handle": "support676"
    },
    "time_stamp": "2024-06-12 06:04:18",
    "text": "Hi team, \n\nI've created a private API app for calling and shared the key with the developers. However, they are encountering issues while trying to push the recordings from their system to HubSpot due to some permission restrictions. Can you please advise on what permissions I need to grant in order to enable the call recordings to be transferred into HubSpot? "
  },
  {
    "poster": {
      "poster_name": "Federico Ruffa",
      "poster_handle": "federico248"
    },
    "time_stamp": "2024-06-12 06:08:09",
    "text": "Hi there <@U3T21PDBK>! A question on this, is there a way to link a hubdb table for authors with blog posts? I am trying to see if we can have multiple authors on a blog post, seems the only way would be with HubDB but how would one link an author to a blog post there"
  },
  {
    "text": "To clarify your module is not pulling in the correct number of posts per page based on what you have set under settings &gt; content &gt; blog &gt; templates tab. Is that correct? And this is for a custom module on a blog listing page?",
    "time_stamp": "2024-06-12 07:01:02"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2024-06-12 07:03:14",
    "text": "No, i have tried to use the standard pagination in combination with \"blog_recent_posts\" which  does not seem to be possible."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2024-06-12 07:03:53",
    "edited": {
      "time_stamp": "2024-06-12 07:04:11"
    },
    "text": "However, i do have found a workaround to my problem :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2024-06-12 07:10:31",
    "text": "Perfect! Happy to hear you found a workaround. Yeah if you're using the blog_recent_posts function I think the solution would have to be a bit different. There should be <https://developers.HubSpot.com/docs/cms/hubl/functions#blog-recent-posts|a limit option> on that function if you were just trying to have it show a certain number of posts but if you were trying to get that hooked up to a pagination I think you'd need to do something a bit different but sounds like you have a working solution now!"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2024-06-12 08:47:33",
    "text": "So you have to get hacky with it… but it can be done in a couple of ways…\n1. Use special tags and display them like authors\n    a. Use the prefix method like so: `multiauthor_John Doe` …  \n    b. hide all tags starting with `multiauthor` \n    c. create a special display rule for any tag starting with `mutliauthor`. (Split tags by the `_` and show the last: `'multiauthor_John Doe'|split('_')|last`)\n2. Use HubDB \n    a. put a custom module on the blog post page displaying multiple authors\n    b. if you want filtering by author then it gets more complicated: \n        i. maybe have an “author table” and `foreign_id` it with a “blog posts” table \n        ii. assign multiple authors to each row\n        iii. You’ll need some sort of workflow to maybe update the hubdb table with new blog posts? Or manually input blog posts if posting infrequently"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2024-06-12 08:48:00",
    "text": "The tag prefix hack has native blog “Filtering” via the tag system"
  },
  {
    "poster": {
      "poster_name": "Federico Ruffa",
      "poster_handle": "federico248"
    },
    "time_stamp": "2024-06-12 09:10:42",
    "text": "Thanks a lot <@U3T21PDBK>! we had thought something in that direction, we'll check both approaches to see what fits best in this case."
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-06-12 10:55:02"
  },
  {
    "poster": {
      "poster_name": "Inaiat Moraes",
      "poster_handle": "inaiat.moraes"
    },
    "time_stamp": "2024-06-12 11:39:34",
    "text": "Hello, we use HubSpot crm with twilio flex. HubSpot embedded inside of twilio flex, one month ago we started with a layout issue, basically, the css variable --global-nav-dir is 0 inside of iframe e the same var has 41px outside of iframe. I apreciate any help. Thanks in advanced.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-12 11:41:52"
      },
      {
        "time_stamp": "2024-06-12 11:43:19"
      }
    ]
  },
  {
    "text": "inside of iframe",
    "time_stamp": "2024-06-12 11:41:52"
  },
  {
    "text": "withtout iframe",
    "time_stamp": "2024-06-12 11:43:19"
  }
]