[
  {
    "poster": {
      "poster_name": "SyNeSTeR BLacK",
      "poster_handle": "synester.black"
    },
    "time_stamp": "2024-06-13 04:17:26",
    "edited": {
      "time_stamp": "2024-06-13 04:18:46"
    },
    "text": "hi I am having a sales hub pro subscription and trying to do this. We have a meeting scheduler meeting created and embedded on to our company website. So when clicked the link it will redirect to HubSpot meeting scheduler link and once the meeting is submitted will show the thanking message. Instead of this we wanted it redirected to our own website with the thank you landing page. So we inserted the link to the redirected to external url on the advanced settings of the form. But we want the redirection link to pass in the event confirmation info as well so we can display that display on our landing page for the client. So we tried creating a sample link with query selector <https://samplewebsite.com/thankyou-HubSpot/?event_type_name=EVENT_NAME&invitee_first[…]t_start_time=EVENT_START_TIME&event_end_time=EVENT_END_TIME|https://weareteamrocket.com/thankyou-HubSpot/?event_type_name=EVENT_NAME&invitee_first[…]t_start_time=EVENT_START_TIME&event_end_time=EVENT_END_TIME> but the query fields are not working how can I find the correct fields and get this sorted. And whether this is possible with the current subscription and all that."
  },
  {
    "poster": {
      "poster_name": "Tony Koehn",
      "poster_handle": "tony641"
    },
    "time_stamp": "2024-06-13 06:38:12",
    "text": "When working tickets in HubSpot and choosing to send an email out. HubSpot is asking me to connect to my inbox. I don't want my emails in HubSpot. I want to be able to send an email on a ticket and then when the end user (staff) responds I want it tied to the ticket as well as I get notified that the ticket was updated with an email. Is this possible?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-13 11:05:45"
      },
      {
        "time_stamp": "2024-06-13 11:37:52"
      },
      {
        "time_stamp": "2024-06-13 16:39:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Angelo Públio",
      "poster_handle": "angelo"
    },
    "time_stamp": "2024-06-13 08:21:23",
    "text": "Hi, HubSpot Dev Team! Can “*Embed content*” be utilized in platforms like *Magento*, in addition to HubSpot and WordPress? Any thoughts on this? <https://knowledge.HubSpot.com/website-pages/embed-content-in-HubSpot-and-wordpress>",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-13 08:53:45"
      },
      {
        "time_stamp": "2024-06-13 10:07:39"
      },
      {
        "time_stamp": "2024-06-13 10:51:50"
      },
      {
        "time_stamp": "2024-06-13 10:54:41"
      },
      {
        "time_stamp": "2024-06-13 11:21:15"
      },
      {
        "time_stamp": "2024-06-13 11:26:28"
      },
      {
        "time_stamp": "2024-06-13 12:14:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SyNeSTeR BLacK",
      "poster_handle": "synester.black"
    },
    "time_stamp": "2024-06-13 08:53:45",
    "text": "Yes the script could be used with any page "
  },
  {
    "poster": {
      "poster_name": "Joe Dee",
      "poster_handle": "jody2be"
    },
    "time_stamp": "2024-06-13 09:19:22",
    "edited": {
      "time_stamp": "2024-06-13 09:24:08"
    },
    "text": "hmm... is there a way to auto populate a CTA HubSpot form with data based on the dynamic page the user is on when they fill out the form?\nTried doing something like this:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-14 05:08:35"
      },
      {
        "time_stamp": "2024-06-20 07:59:00"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-06-13 09:24:12"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-06-13 10:07:39",
    "text": "Hi <@U077V6SDLLD>! In the embedded content tool, I couldn’t find a way to generate JS that I can include in specific areas of the Magento frontend to coordinate with HubSpot. How do you suggest using it in Magento or any other custom website platform?"
  },
  {
    "poster": {
      "poster_name": "SyNeSTeR BLacK",
      "poster_handle": "synester.black"
    },
    "time_stamp": "2024-06-13 10:51:50",
    "text": "because i embedded on my site coded the front end with next JS and it worked. Even the chatbot was working. I will look up on Magento how to do it."
  },
  {
    "poster": {
      "poster_name": "Angelo Públio",
      "poster_handle": "angelo"
    },
    "time_stamp": "2024-06-13 10:54:41",
    "text": "How did you set up NextJS to retrieve content from HubSpot using the “embed content tool”?"
  },
  {
    "poster": {
      "poster_name": "Jon Martin",
      "poster_handle": "jon175"
    },
    "time_stamp": "2024-06-13 11:05:45",
    "text": "Are you using personal email or the inbox/helpdesk functionality?"
  },
  {
    "poster": {
      "poster_name": "SyNeSTeR BLacK",
      "poster_handle": "synester.black"
    },
    "time_stamp": "2024-06-13 11:21:15",
    "text": "ohh i just copied the code &lt;script&gt; code and pasted on the app.js file"
  },
  {
    "poster": {
      "poster_name": "Angelo Públio",
      "poster_handle": "angelo"
    },
    "time_stamp": "2024-06-13 11:26:28",
    "text": "I can’t find where the JavaScript is generated for each content in the Embed Content tool. Could you please provide a screenshot or the steps for locating it? Thank you very much!"
  },
  {
    "poster": {
      "poster_name": "Tony Koehn",
      "poster_handle": "tony641"
    },
    "time_stamp": "2024-06-13 11:37:52",
    "edited": {
      "time_stamp": "2024-06-13 11:40:58"
    },
    "text": "Jon,\n\nCan you explain this to me.  I am going to a CRM/Tickets, Select a ticket and then on the center tab under Activities I select the Emails tab and then click on Create Email.  I am not doing anything under CRM/Inbox.\n\nIs this wrong?\n\nAt the end of the day what I need to do in some cases is send a message to the staff user that created a ticket and ask a question."
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2024-06-13 12:00:21",
    "text": "<@UDA3F01U4> <@U8249TTCK> Any luck on this? I see this being a huge issue. I’m seeing the same issue (CTA buttons not showing up in default install of Firefox)."
  },
  {
    "poster": {
      "poster_name": "SyNeSTeR BLacK",
      "poster_handle": "synester.black"
    },
    "time_stamp": "2024-06-13 12:14:44",
    "text": "can you show me what you trying to get the embedded content for"
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2024-06-13 12:16:42",
    "text": "Hi. PSA/request for more info.\n\nWe’re beta testing our new website and found that CTAs and at least one module simply aren’t showing up in Firefox by default. If we add the site to a tracking exception list, in Firefox settings, they show up fine which seem to imply it is a privacy issue? Seems like a huge deal. Anyone have any suggestions or solutions? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Tony Koehn",
      "poster_handle": "tony641"
    },
    "time_stamp": "2024-06-13 12:35:04",
    "text": "If this is the wrong place to post this please correct me.\n\nI have a custom object that I need to change the Default's View order of the properties being shown.  However it seems every time I make a change it's not working.\nIs it possible to change the Default View Property Order?\nI need some help understanding what I am doing wrong and how I can fix this.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-13 14:27:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Jordan",
      "poster_handle": "nathan786"
    },
    "time_stamp": "2024-06-13 14:23:06",
    "text": "Hey all, has anyone had any luck getting conversion rates using formula function fields in reports? The formulas I've built so far haven't yielded anything except 0%. The report displays the assigned user and the count of custom objects (sales, appointments) where they are assigned. The idea would be to see the conversion rate of # of appointments to sales for each assigned user."
  },
  {
    "poster": {
      "poster_name": "Nathan Jordan",
      "poster_handle": "nathan786"
    },
    "time_stamp": "2024-06-13 14:27:30",
    "edited": {
      "time_stamp": "2024-06-13 14:28:02"
    },
    "text": "Hey Tony, did you ever customize your personal view for the custom object before changing the default view? It's \"Customize Properties\" under the actions menu in the record view. I think if you change the default view for a record but already have a customized property view, it won't change it so you can keep your personalized sidebar."
  },
  {
    "poster": {
      "poster_name": "Jon Martin",
      "poster_handle": "jon175"
    },
    "time_stamp": "2024-06-13 16:39:38",
    "text": "Is your email connected under your HubSpot user profile? or connected under the inbox?"
  },
  {
    "poster": {
      "poster_name": "Martin C",
      "poster_handle": "seniordev1220"
    },
    "time_stamp": "2024-06-14 00:58:26",
    "text": "Hello, everyone, My name is Martin and I am a full-stack developer with rich experience of HubSpot."
  }
]