[
  {
    "poster": {
      "poster_name": "asher Lin",
      "poster_handle": "asher"
    },
    "time_stamp": "2024-06-10 03:21:52",
    "text": "Can I check with you what we are trying to do on HubSpot before I proceed further. We are trying to use HubSpot APIs to programmatically fill up data from our database to the editable areas in the email template for eg. Sales figures. I have already created a HTML template based on the guide I found but there is nothing written about having custom editable tags where we can update the content (numbers) into the HTML template."
  },
  {
    "poster": {
      "poster_name": "Yashica Nagrani",
      "poster_handle": "yashica"
    },
    "time_stamp": "2024-06-10 07:26:33",
    "text": "Hi! I am trying to add a Google Ads conversion tracking code to a Form CTA within my Landing Page in HubSpot. Any idea how to do this?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-10 11:20:28"
      },
      {
        "time_stamp": "2024-06-17 03:22:30"
      },
      {
        "time_stamp": "2024-06-17 12:27:05"
      },
      {
        "time_stamp": "2024-06-17 12:27:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2024-06-10 07:33:04",
    "text": "Does anyone know of an Okendo reviews integration with HubSpot?"
  },
  {
    "poster": {
      "poster_name": "4D Digital Media",
      "poster_handle": "4ddigitalmedia"
    },
    "time_stamp": "2024-06-10 07:52:17",
    "text": "Hi everyone. New here. Working on a project for a client and a little new to webdev to be honest so bear with me. I am trying to get my search features on the website to pull results only from one of my blogs at a time. So if the user is signed in and searching from the signed in page, I want them to only pull information from the members only blog. If they have not signed up, then only pull info from the non members blog located on the outside of the membership sign in wall. \n\nI have tried custom modules and custom search results pages to no avail. Any ideas would be great!  \n\nAlso I’m not sure if this is the right place for this question. I also placed it in modules. Sorry if this is the wrong place!"
  },
  {
    "poster": {
      "poster_name": "Jamie Royce",
      "poster_handle": "jamie377"
    },
    "time_stamp": "2024-06-10 09:14:07",
    "text": "We are having many issues in the last few weeks using the E-Signature feature on Quotes. Specifically when we have a Quote that also has a Payment Link. The initial email is sent fine, but when the customer clicks to verify his email address the email confirmation never shows up. They have checked spam, junk, waiting 10 minutes, etc. I've found this works sometimes and not works other times. My Sales team doesn't want to use HubSpot for E-Signatures due to this.\n\nHas anyone found a similar issue, or know of a fix?"
  },
  {
    "poster": {
      "poster_name": "David Anderson",
      "poster_handle": "davida"
    },
    "time_stamp": "2024-06-10 11:20:28",
    "text": "If I'm understanding your question correctly, I think if your Google Ad url had a querystring, that could populate a hidden field on your form."
  },
  {
    "poster": {
      "poster_name": "David Anderson",
      "poster_handle": "davida"
    },
    "time_stamp": "2024-06-10 11:28:35",
    "text": "Can you help me find the right data structure to store Generosity Events?  For a given Contact, we might do a personalized event (take them to coffee, give them a book we think they'd like, etc) and/or a campaign event (ie, every new customer gets the same thank-you gift after their first order, key accounts might get the same special gift at new years, etc)\n\nThe ideal version would allow us to capture multiple events for one contact (some events would be allowed only once, some multiple times), with this data captured for each:\ndate\nevent category\nevent quick desc\nNotes\nDeal ID that was created as a response to that event\n\nWe've considered using Line Items, because we could have multiple (open-ended) items, with pre-configured column options for them (date, etc).\n\nBUT, this is an obvious mis-use of the Line Items tool AND those are not directly hooked onto Contacts, but Deals.\n\nAny ideas for how to create a Contact data structure that's richer than just a few properties?"
  },
  {
    "poster": {
      "poster_name": "Lucy Seed",
      "poster_handle": "lseed"
    },
    "time_stamp": "2024-06-10 22:01:31",
    "text": "Hey guys! Does anyone have experience with NICE CXOne and connectivity to HubSpot?"
  },
  {
    "poster": {
      "poster_name": "pavithra kannan",
      "poster_handle": "pavithrakannan1498"
    },
    "time_stamp": "2024-06-10 23:27:43",
    "text": "Hi guys i.have a doubt on quote template line item I need to show my item name and custom created description down to the item name how to do that"
  }
]