[
  {
    "poster": {
      "poster_name": "Md Endan Mollick",
      "poster_handle": "endanm"
    },
    "time_stamp": "2024-06-24 03:19:47",
    "text": "Hi everyone, I need help with integrating HubSpot to any web interface. I want my Contact activities to be able to view using embedded view. I am working on MS 365 so need some solution on this. How can I show my contacts activities ?"
  },
  {
    "poster": {
      "poster_name": "Rida Hamadani",
      "poster_handle": "mridahamadani"
    },
    "time_stamp": "2024-06-24 06:13:27",
    "edited": {
      "time_stamp": "2024-06-24 06:15:11"
    },
    "text": "This is a beginner question, please let me know if there is a better suited channel as I'm new to slack.\nMy background is Salesforce development, where when we develop an app and then users download it, it gets hosted on their org.\nWhere does a HubSpot app get hosted? Is it similar to Salesforce where it gets hosted in the HubSpot account, or should we host it externally?"
  },
  {
    "poster": {
      "poster_name": "test email",
      "poster_handle": "emailfortesting698"
    },
    "time_stamp": "2024-06-24 07:08:59",
    "text": "How to integrate Personal Facebook Messenger Chatbox in HubSpot ?"
  },
  {
    "poster": {
      "poster_name": "Raghav Aggarwal",
      "poster_handle": "raghav.aggarwal"
    },
    "time_stamp": "2024-06-24 07:11:56",
    "text": "Hi All,\nCan anyone suggest me where can I find meetings in HubSpot? I created one via api but unable to locate it in the web application.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-24 08:23:17"
      },
      {
        "time_stamp": "2024-06-25 04:44:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Omri Cheikha",
      "poster_handle": "omri"
    },
    "time_stamp": "2024-06-24 08:23:17",
    "edited": {
      "time_stamp": "2024-06-24 08:23:40"
    },
    "text": "If I got you right- search the email you used to submit the form, it should appear as an activity on the contact page"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-06-24 10:24:04",
    "text": "Anyone on HubSpot doing SMS marketing? If so, are you using a HubSpot tool to do that? Or do you pay for a separate service outside of HubSpot?"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-06-24 14:09:30",
    "text": "Hello HubSpot dev community! While this isn’t a support space, we do know some channels, including especially beta channels, do provide HubSpotter feedback and support. So, we wanted to give you all a heads up:\n\n:developers-developers-developers: *This week, HubSpot’s entire Product and Engineering team is gathering in person in Boston for a week of alignment.* We’ll still be online, but we’ll be slow to respond. And as usual, outside of beta or otherwise noted channels, this is a space for peer to peer developer support and idea sharing from the community. :developers-developers-developers:\n\n:HubSpot: :palm_tree: The week after, *from Monday July 1st through Friday July 5th inclusively, all of HubSpot will be closed for our annual restorative week of rest.* There will be core support working the frontlines, but not much more from us that week. We hope you get a chance to relax and restore yourselves this summer! \n\nWe’ll be back and raring to go on July 8th :) :palm_tree: :sprocket-dance:\n\n\n"
  },
  {
    "poster": {
      "poster_name": "Michael Thebeau",
      "poster_handle": "michael399"
    },
    "time_stamp": "2024-06-24 14:21:44",
    "text": "Hi All, Sorry for the lengthy question - appreciate any support in advance.\n\nI have a client who is looking to set up some custom meeting links. The link would have 1 static person (project manager), and then would have a round robin to various project assistants. For example a project manager may have 3 assistants supporting them so the meeting link would always have that PM and then a 33% round robin rotation to the other 3 people. The client has Sales, service, marketing enterprise, and ops Pro. Anyone know how we could set this up? Here's some additional questions we've got out to HubSpot as we try to play with some ideas\n\n1. How can I find the Rotation ID for my weighted rotation setup?\n2. Is there any API documentation available for fetching weighted rotation details?\n3. Are there any limits on how many API calls I can make to get rotation details?\n4. Can the weighted rotation API be used for both lead assignments and meetings?\n5. What's the best way to get the current lead counts for each team member?\n6. Could you share examples of how to fetch lead counts and use them in a custom code action in HubSpot workflows?+\n"
  }
]