[
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2019-06-03 13:18:12",
    "text": "It would be beyond marvelous to be able to have an option native to the HubDB setup that separated between `draft/staged/published` modes. This is a major source of worry for my clients. They want to be able to preview a dynamically generated post and listings page without having to fully publish.\n\nCurrently there are workarounds that kind of function (have a live/not live boolean to filter out items from a listing/ use the `/draft` mode from the API to show items that are being drafted, but not published) but this leaves open avenues for confusion by content managers in how navigate those spaces (i.e. accidentally publishing a page that they wanted to just see staged will then push all things live).\n\nI tried to find an open topic on this in /communities, but didn't seem to be there",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-06-03 13:38:23"
      },
      {
        "time_stamp": "2019-06-03 14:11:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-06-03 13:34:55",
    "text": "make it so!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-03 13:38:23",
    "edited": {
      "time_stamp": "2019-06-03 13:39:24"
    },
    "text": "Completely agree with this.\nmaybe a side feature - on dynamic pages allow use of a query parameter which allows you to view the current page using  said draft/staged/published version of the DB (would only show draft or staged if current user is logged in) - would be happy to add a quick access button to the query params in dev extension."
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2019-06-03 14:11:59",
    "text": "that could be interesting"
  }
]