[
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-11 14:38:35",
    "text": "Hi everyone,\nI'm using this API: <https://api.hubapi.com/crm/v3/objects/contacts/batch/update> to set the value of a custom property for a contact. Afterward, an email will be sent using a workflow. However, I would like to know if there's any possibility to send customized data using this API, as I intend to use it in the email that will be sent from the workflow"
  },
  {
    "text": "Why is this happening?\n\nWhen creating an email with a custom template, this module with a repeating Text field is injecting visible code. It goes away when view in my mailbox once I send a test. But I don’t understand why it’s showing up in the HubSpot visual editor _at all_.\n\nIf I remove `{{ contact.firstname }}`, it stops doing it. But any reference to a contact variable and it comes back.",
    "time_stamp": "2023-09-11 14:51:16",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-11 15:11:13"
      },
      {
        "time_stamp": "2023-09-11 15:12:17"
      },
      {
        "time_stamp": "2023-09-11 15:21:10"
      },
      {
        "time_stamp": "2023-09-12 02:48:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2023-09-11 15:11:13",
    "text": "I set up this HTML+HubL email template and module identically in a second, separate, and unrelated instance of HubSpot and I am not seeing this issue come up at all.\n\nSo now I believe there might be some setting turned off or on in my main instance that I’m not aware of?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2023-09-11 15:12:17",
    "text": "Both emails in both instances have the Programmable email beta turned on."
  },
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-11 15:15:43",
    "text": "Hi everyone,\nI'm using this API: <https://api.hubapi.com/crm/v3/objects/contacts/batch/update>\n to set the value of a custom property for a contact. Afterward, an\nemail will be sent using a workflow. However, I would like to know if\nthere's any possibility to send customized data using this API, as I\nintend to use it in the email that will be sent from the workflow"
  },
  {
    "text": "",
    "time_stamp": "2023-09-11 15:21:10"
  }
]