[
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-08-28 08:21:59",
    "edited": {
      "time_stamp": "2023-08-28 08:22:46"
    },
    "text": "Cat's out of the bag - we're hosting a developer meetup at INBOUND next week. On Sept 7 from 6-10 PM, a hop skip and a jump from the convention center, we'll have all the beer/seltzer/mocktails you care to drink, delicious food for all dietary needs - and most importantly, your fellow devs building on HubSpot and HubSpotters that care about seeing you succeed! No longer strictly limiting this to folks deep in the code everyday - if you are a dev or love devs, join us! Get your tickets here. <https://events.HubSpot.com/events/details/HubSpot-HubSpot-global-presents-developers-inbound-meetup/?code=devslackog>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-28 14:11:08",
    "text": "I'm looking to schedule a post-INBOUND HUG event for the <https://events.HubSpot.com/seo-performance-cms/|SEO + Performance + CMS HUG> and while there isn't a lot of web dev on the agenda, there are a lot of really cool sessions and experts who'll be attending both INBOUND and the Developer session that I'd love to meet.\n\nI'm thinking Tuesday September 12 at 11 EST and will get it scheduled as soon as Bevy stops acting up...\n\nIf anyone is interested in connecting while at INBOUND and would like to do a panel discussion for the HUG (and are available on this date/time), I'd love to connect - it can be anything SEO, CMS, Core vitals - what you expect to see over the next year, recent algorithm changes, etc.\n\nDM me so we can meet up at INBOUND",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-08-28 16:03:30"
      },
      {
        "time_stamp": "2023-08-31 11:04:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2023-08-28 16:03:30",
    "text": "<@U2H3TT8F2>, <@U02094DEMTK>"
  }
]