[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-22 07:51:41",
    "edited": {
      "time_stamp": "2018-03-22 07:52:19"
    },
    "text": "started teaching myself vue.js in my off hours. Just curious are any of you using vue on your HubSpot projects? have you run into any issues trying to use vue on HubSpot?\n\nI realize one con is that using vue on HS is basically piling on libraries since JQuery added automatically, so you’ve got two big libraries that can conflict..",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-03-22 07:56:51"
      },
      {
        "time_stamp": "2018-03-22 08:04:08"
      },
      {
        "time_stamp": "2018-03-22 08:15:26"
      },
      {
        "time_stamp": "2018-03-22 09:38:35"
      },
      {
        "time_stamp": "2018-03-22 09:39:03"
      },
      {
        "time_stamp": "2018-03-22 09:39:11"
      },
      {
        "time_stamp": "2018-03-22 09:40:26"
      },
      {
        "time_stamp": "2018-03-22 09:40:40"
      },
      {
        "time_stamp": "2018-03-22 09:40:56"
      },
      {
        "time_stamp": "2018-03-22 09:43:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-03-22 07:56:51",
    "text": "I'm still meaning to write that blog post lol. I use it, but what I do in the beta design manager is include the full version as a dependency when I'm building in the DM IDE so I can still access Vue Devtools, then when the module is ready for production I switch the file to the minified version and don't run into much issue. As long as I have the files hosted in the design manager, I don't get too much of a performance knock.\n\nNow that's just for adding in modules, if I was to build a site to use Vue from the start, I would probably spend more time changing my build tool process to compile and minify my scripts with more of a performance mindset."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-22 08:04:08",
    "text": "When you are building a module using vue and it’s ready for production do you upload a copy of the minified vue js and add it to the module as a linked js file, or do you use a CDN or?\n\nI just wonder in-case you have multiple modules that use vue, on a page.\n\nand thanks for responding on it. I’m still very new to vue, but I’m finding it friendlier to learn than react."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-03-22 08:15:26",
    "text": "No problem, It's my understanding that if I include the minified version as a linked JS file, it will only be included once per pageload even if multiple modules use it as a dependency as well, but I haven't tested to see if that's actually the case. Unfortunately most of our client's aren't clamoring for these types of functions, so I only get to experiment when I have time lol.\n\nVue is awesome, but so is React, just very different use cases. If I'm building a single-page, side-project, or just fairly simple site from scratch, I'm doing it in React / Gatsby now, it's just too easy and I can host it anywhere for super cheap (GH Pages, Netlify, Surge CDN, etc...). If I'm just adding interactivity in one or two places on a site, Vue makes way more sense, and definitely plays the nicest with hosting environments like HubSpot. Plus the transitions functionality in Vue is freaking awesome."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-03-22 09:38:35",
    "text": "Doesn’t HubSpot load react into every page view anyways? Or is that only with forms?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-22 09:39:03",
    "text": "only forms as far as I’ve seen."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-03-22 09:39:11",
    "text": "hmm. ok."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-22 09:40:26",
    "text": "and I could be wrong but I think that with their forms, if embedded through the js script they’re combining react or a stripped down version of react into their script not loading it separately, so relying on it could be dangerous"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-03-22 09:40:40",
    "text": "yeah."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-03-22 09:40:56",
    "text": "Just a brain synapse I had"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-03-22 09:43:13",
    "text": "My devtools say it's a older version as well, would take some experimenting to see if it's usable."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-22 10:03:39",
    "text": "Does anyone know if you can get an rss feed of an authors posts by a certain topic? I know you can get an authors normal rss by going to /author/author-name/rss.xml but wasnt sure on getting it for only a certain topic"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-03-22 11:12:39",
    "text": "tried url queries?"
  },
  null
]