[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-02-11 05:48:45",
    "text": "Can you provide a link to your webpage this appears on?"
  },
  {
    "poster": {
      "poster_name": "Bianca",
      "poster_handle": "bianca"
    },
    "time_stamp": "2025-02-11 07:24:15",
    "text": "Hi! Sorry for the late answer. Here's the page it appears\n<https://www.frydenbo-bil.no/kampanje/nybil/polestar/4>\nFirst section  under hero"
  },
  {
    "text": "So, looking at the underlying code in the code inspector, I see the italic from the rich text control just sets the html to a &lt;em&gt; tag which renders it a italic.  It is not setting a font size at all so the font-size is rendering what is set in your template.main.min.css in the body stylings (see screen 1 below).  I can manually set this to font-size: 8pt; to get what you really want (see screen 2 below).\n\nUsually rich text area controls give you an &lt;html&gt; link in the top controls where you could modify the underlying html that is generated.  If you could, then you could add a class name to the &lt;em&gt; tag and then add styling for that class in your template.main.css file.  But you could also add a style just targeting the &lt;em&gt; element inside the main div container: &lt;div class=\"campaign-cards ....  like so:   .campaign-cards em { font-size: 8pt; }  Please note that doing it this way would make ANY &lt;em&gt; tag that is inside the &lt;div class=\"campaign-cards element to be that font size - so be careful to only add the italic where you want it.  It would be much better if you could add a class name to the &lt;em&gt; tag in the underlying html of the rich text control if you can find out how to get it to show you an &lt;html&gt; edit button.",
    "time_stamp": "2025-02-11 08:18:54"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2025-02-11 09:00:13",
    "edited": {
      "time_stamp": "2025-02-11 09:00:27"
    }
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2025-02-11 09:04:52",
    "text": "I would hope so. For now you have to edit fields.json in code editor and upload via CLI."
  },
  {
    "poster": {
      "poster_name": "Rolando Carias",
      "poster_handle": "rolando"
    },
    "time_stamp": "2025-02-11 12:40:49",
    "text": "Any help is appreciated"
  },
  {
    "poster": {
      "poster_name": "Susanne Heyer",
      "poster_handle": "sheyer"
    },
    "time_stamp": "2025-02-11 15:08:22",
    "edited": {
      "time_stamp": "2025-02-11 15:10:11"
    },
    "text": "hi all, my name is Susanne and am an admin to HubSpot and new/learning to be a developer... I am a bit stuck on a project and am hoping you can help me or guide me with a project... we are currently working on setting up templates for quotes in HubSpot, however, we would like to customize the quote based on the client and what product they are buying.  I know that there are the \"Comments to Buyer\" and \"Purchase Terms\" that will allow you to edit, however, these fields we cannot add images.  Is there a way we can create a module to be editable when creating the quote to be editable or make either the \"Comments to Buyer\" or \"Purchase Terms\" able to add images?"
  },
  {
    "text": "This is the section I am referring to",
    "time_stamp": "2025-02-11 15:10:23"
  }
]