[
  {
    "poster": {
      "poster_name": "Bianca",
      "poster_handle": "bianca"
    },
    "time_stamp": "2025-02-07 04:05:03",
    "text": "I have two instances of the same theme (one for live, one for staging) and when swapping theme from staging to live on a page, any modules created while staging theme will remain connected to the staging theme despite having an identical module in the live theme. Is there any way in a dnd area to \"insist\" it looks for the twin module in the current theme, either via APIs or javascript or similarly? We tried accessing <https://api.hubapi.com/cms/v3/pages/site-pages> and it did return the module id for us. Ideally I could post to this again and say \"replace all modules label \"Hero\" to id \"xyz\"\" etc for all modules. Possible or no? Any other methods to transfer a page from one theme to another without having to recreate it?"
  },
  {
    "poster": {
      "poster_name": "Enoid",
      "poster_handle": "bonolo.kamolane"
    },
    "time_stamp": "2025-02-07 04:36:49",
    "text": "I'm working with a HubSpot form where users select a \"Language From\" and \"Language To\" using `&lt;Select&gt;` components. However, when submitting the form, these fields are not updating correctly in the state.\n*Issue:*\n• The `deadline` field updates fine.\n• But `languageFrom` and `languageTo` remain empty (`\"\"`).\n• Console logs show that `onValueChange` for the select fields is not updating the state.\n*Code snippet:*\n```jsx```\n```&lt;Select\n  label=\"Language From\"\n  name={`languageFrom-${row.id}`}\n  options={[\n    { label: \"English\", value: \"english\" },\n    { label: \"French\", value: \"french\" },\n  ]}\n  value={row.languageFrom || \"\"}\n  onValueChange={(newValue) =&gt; {\n    console.log(`Language From updated for row ${row.id}:`, newValue);\n    handleInputChange(row.id, \"languageFrom\", newValue);\n  }}\n/&gt;\n\nconst handleInputChange = (id, field, value) =&gt; {\n  setRows((prevRows) =&gt;\n    prevRows.map((row) =&gt;\n      row.id === id ? { ...row, [field]: value } : row\n    )\n  );\n};```\nW*hat I've tried:*\n\n• Ensured the `&lt;Select&gt;` component is controlled by using `value` and `onValueChange`.\n• Logged `newValue` inside `onValueChange`, but it's not updating state.\n• Tried different approaches such as using `event.target.value`.\n*Question:*\nHow can I correctly capture and update `Select` field values in HubSpot forms?"
  },
  {
    "poster": {
      "poster_name": "Elena Hearty",
      "poster_handle": "elena.hearty"
    },
    "time_stamp": "2025-02-07 08:20:21",
    "edited": {
      "time_stamp": "2025-02-07 08:21:33"
    },
    "text": "<@U02EH80E74Z> you aren’t the only one. It’s happening to us too this morning. I opened a ticket for support to investigate, but hopped on Slack to post to this channel for visibility and you beat me to the punch."
  },
  {
    "poster": {
      "poster_name": "Elena Hearty",
      "poster_handle": "elena.hearty"
    },
    "time_stamp": "2025-02-07 08:22:51",
    "text": "<@U7SL518D6> please see <@U02EH80E74Z>’s message. My team alerted me to the same issue this morning and we need a fix ASAP.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-07 12:26:42"
      },
      {
        "time_stamp": "2025-02-13 11:53:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Josh Abrams",
      "poster_handle": "jabrams"
    },
    "time_stamp": "2025-02-07 08:58:55",
    "text": "Is it possible, to anyone's knowledge, to export (via UI or API) the audit log for an individual field?\n\nSpecifically, we have several thousand companies that we cleared the company owner. We want to return the value to what it was before clearing.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-07 12:25:52"
      },
      {
        "time_stamp": "2025-02-10 04:50:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2025-02-07 09:15:23",
    "text": "Yeah, i'm just discovering this. was working on a custom module to use with the multi-step feature and forms created with the new editor do not show up in the list with the form module field. This has got to be an oversight?"
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2025-02-07 09:40:33",
    "text": "the default form module allowed selection of new editor forms. looking at the field.json. the field definition had an additional parameter...\n```   \"embed_versions\": [\n    \"v2\",\n    \"v4\"\n   ],```\nafter adding this to my form field in fields.json, my custom module now allows selection of new editor forms."
  },
  {
    "text": "*Adding a Surcharge to Line Items (Similar to the Discount Column) in HubSpot Quotes:*\n\nHello everyone, I have a requirement related to line items. When I create a quote and add the respective items, there is a column for applying a discount (%) to a line item. I need to implement a similar logic, but instead of a discount, it should be an additional charge on the line item. However, this feature doesn’t exist natively, and there is no property that can fulfill this need.\n\nI'm aware of the taxes we can apply to the entire quote, but they are applied to all line items, which is not what I need.\n\nDoes anyone know a workaround or a way to achieve this in HubSpot?",
    "time_stamp": "2025-02-07 11:12:12",
    "edited": {
      "time_stamp": "2025-02-07 11:14:56"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-02-07 12:23:32"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2025-02-07 12:05:01",
    "edited": {
      "time_stamp": "2025-02-07 12:05:03"
    }
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-07 12:23:32",
    "text": "HubSpot allows for custom properties at the *product* level, but not directly on line items in quotes. However, you can:\n\n1. *Create a custom property* at the *product level* (e.g., \"Additional Charge %\").\n2. When adding a line item, input the extra charge into this field.\n3. Use a *workflow* to calculate the additional charge and add it to the total.\n*Keep in mind that* since it's at the product level, this charge will apply to all instances of that product, not just in one quote."
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-07 12:25:52",
    "text": "Were the company owner re-assigned or not yet?\n\nTry to contact HS support first but alternatively what we did before at that instance is to restore that user's email then login to the account and re-assign it with the proper rights. Assuming you have super admin rights."
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-02-07 12:26:42",
    "text": "Please update when possible :pray:"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2025-02-07 12:42:07",
    "edited": {
      "time_stamp": "2025-02-07 12:42:21"
    },
    "text": "oh cool thanks for sharing, i'm assuming they'll add it as a native option from the UI soon"
  },
  {
    "poster": {
      "poster_name": "Santiago Moran",
      "poster_handle": "santiago434"
    },
    "time_stamp": "2025-02-07 15:11:44",
    "text": "hi everybody! Nice to meet you!!!\nWe are trying to use some Contact properties to filter a Hubdb table but we are not being successful in that business.\nIf I filter the table hardcoding the filter values with the exact values in the contact property, it works perfectly, but for some reason it doesn't with the contact properties.\nIf somebody had the same issue or have an idea of how to make it work I'll be very grateful to listening to it!\nThank you very much and have a nice weekend!"
  }
]