[
  {
    "poster": {
      "poster_name": "Jan Ekholm",
      "poster_handle": "jan.ekholm"
    },
    "time_stamp": "2025-02-03 01:20:30",
    "text": "So with an error like:\n```HTTP response body: {\"status\":\"error\",\"message\":\"Cannot set PropertyValueCoordinates{portalId=144691183, objectTypeId=ObjectTypeId{legacyObjectType=PRODUCT}, propertyName=hs_sku, value=20000020} on 78226872556. 36943177921 already has that value.\",\"correlationId\":\"a02a2474-16b3-4021-9666-e669e26f5d7e\",\"category\":\"VALIDATION_ERROR\"}```\nhow can I find the product (in this case) with the id `36943177921`? I can’t seem to find any way on the website to find by `HubSpot_id`, only the higher level data. In this case it seems the product `78226872556` is getting the same SKU as that other product, and that’s not allowed."
  },
  {
    "poster": {
      "poster_name": "Jan Ekholm",
      "poster_handle": "jan.ekholm"
    },
    "time_stamp": "2025-02-03 01:22:11",
    "text": "However, I don’t think this place actually is useful in any way. I see so many questions here and no HubSpot engineers seem to be here helping out paying customers. The only way to get real support is the support emails and that process is sloooow. I’m not impressed with this side of HubSpot at all, even if it technically works ok."
  },
  {
    "text": "the duplicate check only blocks company creation if that first option is selected. select \"do no matching\" would probably work better?",
    "time_stamp": "2025-02-03 06:18:21"
  },
  {
    "poster": {
      "poster_name": "Frans Leys",
      "poster_handle": "fleys"
    },
    "time_stamp": "2025-02-03 06:18:34",
    "text": "or sync the connectwise ID's over to HubSpot in some custom property, and then match on those"
  },
  {
    "poster": {
      "poster_name": "Viviana Cardenas",
      "poster_handle": "vcardenas"
    },
    "time_stamp": "2025-02-03 06:43:00",
    "text": "Thank you, <@U01JT537HG9>, that’s really helpful! :slightly_smiling_face: I’ll give that a try.\nI also wanted to ask if you know whether it’s possible to sync the \"opt-out\" field from ConnectWise to HubSpot. From the mapping, it seems like syncing is only possible from HubSpot to ConnectWise. Do you know if there’s a way to sync it the other way around?"
  },
  {
    "poster": {
      "poster_name": "Divya Bhavi",
      "poster_handle": "dbhavi"
    },
    "time_stamp": "2025-02-03 15:31:11",
    "text": "Hi Everyone!\nIt's my first time working with HubSpot embedded form. I would appreciate any guidance.\nWe are planning to use the HubSpot embedded form into our React website. We are already creating the contact in HubSpot as soon as user registers in our website so HubSpot will have all user preferences\nstored as soon as they register.\nNow , when a user login to our website , we are planning to use the embedded form to show the preferences which user already selected during registration and also allow them to update this form.\nMy questions are :\n1. When a user login and click on preferences, if we pass only login in query string , will all other preferences will be loaded for that user (Which is saved in contact object)?\n2. Should we send each filed in the form as query string to show in the form ?\n3. The only way we are able to think is , Get the user’s contact record from HubSpot by calling the HubSpot API, prepopulate the data in the form.\n4. Any other way where We can load this embedded form with the user already selected values and allow them to update.\n\nCan someone please point me in the right direction.\nThanks in advance."
  }
]