[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown523"
    },
    "time_stamp": "2025-02-20 03:02:17",
    "text": "This may have been mentioned before but with Chrome disabling the developer extension, whats everybody using now? Are people switching to an alternative chrome based browser?"
  },
  {
    "poster": {
      "poster_name": "Brian O'Condún",
      "poster_handle": "brian.ocondun"
    },
    "time_stamp": "2025-02-20 05:24:42",
    "text": "Hi all,\n\nPerhaps not the right channel but feel free to direct me elsewhere. I’m trying to resolve an issue with our “Partner” Object in the HubSpot CRM. It was custom built, and it appears to be lacking in some functionality such as the ability to add notes, make calls, and send emails, functionality which we see on standard objects such as Contacts or Companies.\n\nHaving shared a HAR file with the HubSpot Support team. They responded with:\n\n“We found the error in the HAR file:\n_Invalid input JSON on line 1, column 1141: Cannot build AssociationSpec, some of required attributes are not set [associationCategory, associationTypeId]_\nThis error is indicating that there are no associations defined between your custom object and other CRM objects, such as engagements (notes, calls, emails, etc.).\n\nWould you ask a developer to fix this? This is the document you can share with them: <https://developers.HubSpot.com/docs/api/crm/crm-custom-objects#update-existing-custom-objects>”\n\nThe Custom Object wasn’t built by me, and we seemed to have used a third party integration called <https://app.HubSpot.com/ecosystem/596253/marketplace/apps/easy-custom-objects|Easy Custom Objects> so unsure if this complicates matters.\n\nWould anyone be willing to explain how to go about fixing it?"
  },
  {
    "poster": {
      "poster_name": "Matt Reims",
      "poster_handle": "matt963"
    },
    "time_stamp": "2025-02-20 10:56:39",
    "text": "Hi all, new to the group and fairly new to CMS but have been struggling trying to add custom images into a quote based on custom properties. Has anyone done this?"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2025-02-20 12:15:00",
    "edited": {
      "time_stamp": "2025-02-20 12:15:50"
    },
    "text": "Hello Developer Slack Community!\n\nI'm so excited to share that the new and improved program _formerly known as the HubSpot Developer Mentorship Program_ has rebranded, expanded and relaunched as the :sparkles: *<https://developers.HubSpot.com/ecosystem-mentorship-program|HubSpot Ecosystem Mentorship Program>*:sparkles:  *is live - and applications are now open (through March 5th)!* \n\n*Why Developers Should Apply*\n\n• *Level Up Faster* – Get hands-on mentorship in *CRM customization, app building, AI, and CMS development* to accelerate your HubSpot skills.\n• *Learn or Lead* – Mentees gain insights from seasoned developers, while mentors grow their *thought leadership and coaching skills*.\n• *Expand Your Network* – Connect with *developers, experts, and partners* to unlock new opportunities and stay ahead in the HubSpot ecosystem.\n:date: *Apply by March 5th!* → <https://developers.HubSpot.com/ecosystem-mentorship-program> :rocket:\n\nHave any questions? We're hosting an informational session about how the program and the application process works with time for Q&A on <https://HubSpot.zoom.us/webinar/register/WN_txEXe9TsQA-Sb4D4Hs4WgQ#/registration|Feb 26th at 11 AM EST> (registration required) and will share the recording on the landing page afterwards, but a ton of questions are addressed in the FAQ."
  },
  {
    "poster": {
      "poster_name": "Matthew James",
      "poster_handle": "matthew929"
    },
    "time_stamp": "2025-02-20 14:18:55",
    "edited": {
      "time_stamp": "2025-02-20 14:20:04"
    },
    "text": "We are running into a bug with new HubSpot Accounts that are created. When we create a new HubSpot Account for our clients and create a new page for them the HubSpot preview link for the pages is not working on any new accounts. This is causing a lot time to be added when developing pages and pushing up changes as we cant see them in the preview window where changes are seen instantly instead of having to wait for the published page to update."
  },
  {
    "poster": {
      "poster_name": "Dylan Hamlett",
      "poster_handle": "dylan.hamlett"
    },
    "time_stamp": "2025-02-20 15:21:48",
    "text": "Hello All! I am trying to send data with a workflow to salesforce using\nAPI - basic Auth. I have hit a road block and have been told to go\ndifferent routes. I started to build out the webhook within workflow but\n that did not work as planned.\n\nIs this the best way to go about this? Where should this be taking place. Also have access to developer for help if needed"
  },
  {
    "poster": {
      "poster_name": "Dylan Hamlett",
      "poster_handle": "dylan.hamlett"
    },
    "time_stamp": "2025-02-20 15:29:28",
    "text": "I am also trying to configure a process to this and have come to a halt. But I believe the required scopes are just fields that need to be recorded. Check the properties that are being utilized."
  }
]