[
  {
    "poster": {
      "poster_name": "James Morris",
      "poster_handle": "j.morris"
    },
    "time_stamp": "2022-03-01 10:45:19",
    "text": "Hi <@U02G7H60YCS> happy to chat and see how can help"
  },
  {
    "poster": {
      "poster_name": "Lauren Kennedy",
      "poster_handle": "lauren852"
    },
    "time_stamp": "2022-03-01 11:59:55",
    "text": "Hi! We’re hiring a Sr HubSpot Operations Specialist. <https://coastalconsulting.topgradingonline.com/job_openings/sr-HubSpot-operations-specialist?utm_campaign=direct_links&amp;utm_medium=job-boards&amp;utm_source=hsdevs|Job Details &amp; Application here> if you or someone you know is interested! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Dawn Wright",
      "poster_handle": "dawn766"
    },
    "time_stamp": "2022-03-01 18:26:50",
    "text": "I’ve got a wonderful opportunity for a <https://textio.com/careers/job/?id=4994356003|Senior HubSpot engineer> on my team. This is a full-time role with growth opportunity. You’ll lead the redefinition of Textio’s marketing experience for our ambitious growth goals, and be responsible for Textio’s Marketing-side tech stack.\n\nFortune 500 companies use Textio to interrupt bias and communicate inclusively, and the more leads we convert, the more positive impact we’ll have. Textio is on Fast Company’s list of the <https://textio.com/blog/textio-named-most-innovative-company-by-fast-company/13035166527|Most Innovative Companies>. We’re a creative team that cares a lot about our engineering culture, which emphasizes growth, leadership, and collaboration.\n\nWe’re a fully distributed team. This role requires you to live anywhere in California, Colorado, Hawaii, Illinois, Massachusetts, New York, Oregon, Texas, or Washington.\n\nWe offer generous medical benefits, a 401k, paid time to volunteer at nonprofits you care about, stipends for wellness, personal workspace, and continuous learning, plus on-demand personal coaching and a healthy balance of time off.\n\nTextio welcomes and celebrates individuals of all backgrounds, orientations, and identities.\n\nIf this sounds interesting, I’d love to talk with you! Please apply here: <https://textio.com/careers/job/?id=4994356003>\n\nLet me know if you have any questions!"
  }
]