[
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2022-03-24 09:27:44",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-25 01:52:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Amanda Althaus",
      "poster_handle": "aalthaus"
    },
    "time_stamp": "2022-03-24 11:04:13",
    "text": "Hi all! We're looking for a Senior Full Stack Developer to join our web development team. We're a hybrid agency based in Denver, CO, but have many remote team members across North America and Latin America. If you're interested and think you may be a good fit, let's talk! You can check out the job post <https://revenueriver.applytojob.com/apply/wfB9KDJv9t/Senior-Full-Stack-Developer?referrer=20220324152957KBKKQULRVPN4OPJY|here>.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-29 03:30:34"
      },
      {
        "time_stamp": "2022-03-30 11:26:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-03-24 14:07:31",
    "text": "Looking to hire a website project manager in the next 30 days — Remote, HubSpot/WordPress/api integration and web app projects are our main focus. Mostly responsible for moving projects through, communicating with clients and dev team, QA experience is a huge plus. Contract position with full time employment towards the end of the year as we get that figured out.\n\nWe’re a new HubSpot partner (december). I’ve been doing word of mouth work for about 3 years. Our website is a wip, we are having that designed and the content done in the background — so site is kind of a mess.\n\nWe are working on a real job description and responsibilities. If you are interested in this opportunity and want to hear more about this when we have the details in place, fill out the form on this page, will begin hiring April 1: <https://deckerdevs.com/careers>"
  }
]