[
  {
    "text": "hi, i am wondering if there is anyone here that might understand why/how a mobile email preview would look ok in HubSpot’s mobile device previewer and in the iOS gmail client, but not in the iOS mail client? it almost seems like the iOS mail client still tries to display the email in a desktop resolution. It looks like the HubSpot mobile device preview and the gmail client will increase the font size of text in a mobile resolution, but i can’t figure out why this does not happen in the iOS mail client…it almost seems like it tries to display the desktop resolution\n\n the first screenshot is HubSpot’s mobile device preview. the second screenshot is HubSpot’s iOS gmail app client. the third screenshot is HubSpot’s iOS 15.0 iphone 13 client preview. the screenshots are consistent with what is displayed in the actual mail client apps on a physical iphone",
    "time_stamp": "2023-04-27 07:54:57",
    "edited": {
      "time_stamp": "2023-04-27 07:57:29"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-04-27 18:07:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "sasha g",
      "poster_handle": "gensa9"
    },
    "time_stamp": "2023-04-27 08:14:57",
    "text": "hi guys I have set a window pop up of email capture on my shopify account using hub spot."
  },
  {
    "poster": {
      "poster_name": "sasha g",
      "poster_handle": "gensa9"
    },
    "time_stamp": "2023-04-27 08:15:26",
    "text": "can you please help me to make the wind appear any time  a visitor refreshes a store?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-03 14:33:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Leonardo dos Santos Canario",
      "poster_handle": "leonardo.canario"
    },
    "time_stamp": "2023-04-27 13:04:53",
    "text": "Hi guys, someone can help me to answer a question about emails in HubSpot?\n\nIf one contact have additionals emails and i send a action to send email, this email who i will send will sent to all emails from this contact?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-27 14:32:48"
      },
      {
        "time_stamp": "2023-05-02 08:33:20"
      },
      {
        "time_stamp": "2023-05-08 13:52:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alex Carpenter",
      "poster_handle": "alcarpenter"
    },
    "time_stamp": "2023-04-27 14:30:17",
    "text": "Hey all, has anyone managed to get google annotations working?\n<https://developers.google.com/gmail/promotab>\nI've been beating my head against the wall without any luck",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-27 14:34:47"
      },
      {
        "time_stamp": "2023-04-27 18:06:32"
      },
      {
        "time_stamp": "2023-04-27 20:11:49"
      },
      {
        "time_stamp": "2023-04-28 08:46:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alex Carpenter",
      "poster_handle": "alcarpenter"
    },
    "time_stamp": "2023-04-27 14:32:48",
    "text": "No, by design only the primary email address will receive the email.\nIf you want each address to receive the email you need to keep them as separate contacts without merging"
  },
  {
    "poster": {
      "poster_name": "Alex Carpenter",
      "poster_handle": "alcarpenter"
    },
    "time_stamp": "2023-04-27 14:34:47",
    "text": "<@U03TPM5CHSS>"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-04-27 18:06:32",
    "text": "Nope, it’s pretty much impossible right now to implement and test. These are updates from Google in early March:\n\n• Right now Annotations are available only to an \"allow list\".\n• They've also mentioned it's impossible to test annotations on a one-off basis. They have an internal system that detects if the email is a mass email and thus results in the Annotations being displayed. Test sends to one recipient will not work (ie. sending tests from your ESP). They are working to release a reliable test tool in the next few weeks (as of April 27 this is still not available).\n• The Annotations released in their update mid-feb are considered in beta and are being tested with a group of well known brands\n• If brands want to be considered for the allow list, they can reach out to <mailto:p-gmail-outreach@google.com|<mailto:p-gmail-outreach@google.com>> and Google will review the content and standards of the brand to ensure it doesn't have any risk of abuse \n• Even if you get approved for the allow list, it doesn’t mean that annotations will automatically display every time. Google is very much controlling if/when it’s displayed."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-04-27 18:07:55",
    "text": "How is the email built? Coded? Drag and drop?"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-04-27 18:10:02",
    "text": "It’s unclear to me, is the issue on the receiving end or when trying to send?"
  },
  {
    "poster": {
      "poster_name": "Alex Carpenter",
      "poster_handle": "alcarpenter"
    },
    "time_stamp": "2023-04-27 20:11:49",
    "text": "Thank you for this detailed write up! It definitely explains why I was getting nowhere with testing.\nWhere are you keeping up to date on the progress?"
  }
]