[
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2020-08-25 05:49:35",
    "text": "we have the CTA selection in the modules, then use we get the actual cta with `cta(module.cta)` and use the split filter couple of times to extract the URL from the CTA. This way the content producers don't need to remember to use the unstyled CTA when creating new ones, all will look alike still."
  },
  {
    "poster": {
      "poster_name": "John Sardañas",
      "poster_handle": "jssardanas"
    },
    "time_stamp": "2020-08-25 06:57:34",
    "text": "Is there any way to pull the number of views per post? I tried to do it using hubl {{ content.views }} as per Developer Info but it's not returning anything.\n\nI'm trying to create a custom filtering on blog listing and I was able to do it alphabetically &amp; published date, it would be nice if I can do also a filter for popularity. Thanks."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2020-08-25 10:13:25",
    "text": "<@U0149PQC0HK> oooo tricky. me likey."
  },
  {
    "time_stamp": "2020-08-25 10:13:32",
    "text": "sneaky"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-08-25 10:32:38",
    "text": "I tried that but get an error. I have a field group in a module. Let's call this Group. This group is repeatable and by default it starts with 2 items .  When I set count = module.Group.length I get the error  Cannot resolve property 'length'. I'm pretty sure I am just forgetting something simple here."
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-08-25 10:39:33",
    "text": "I think I might be able to get what I need using   {{loop.length}} inside the loop for this one, but in general it would be nice to be able to grab the length from outside of the loop."
  },
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2020-08-25 11:27:18",
    "edited": {
      "time_stamp": "2020-08-25 11:28:02"
    },
    "text": "apprently the cta image needs to be in the document too for cta analytics, we just render the whole original cta inside a `&lt;template&gt;` so it's there but won't show up"
  }
]