[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2025-01-24 01:46:13",
    "text": "Hey everyone.\nJust noticed that while you can add Icons to groups now\n```{\n        \"name\": \"colors\",\n        \"label\": \"Colors\",\n        \"required\": false,\n        \"locked\": false,\n        \"children\": [\n              some color fields\n              ...\n           ],\n        \"type\": \"group\",\n        \"inline_help_text\": \"\",\n        \"help_text\": \"\",\n        \"default\": {},\n        \"icon\": {\n            \"name\": \"palette\",\n            \"set\": \"fontawesome-6.4.2\",\n            \"type\": \"REGULAR\"\n        }\n    }```\nonly the \"SOLID\" type will display the icon.\n\"REGULAR\" and \"LIGHT\" don't work.\nRegardless of \"set\" or if it's a module fields.json or a theme fields.json :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2025-01-24 09:31:00",
    "edited": {
      "time_stamp": "2025-01-24 09:31:32"
    },
    "text": "Hey <@UQWGKUEN7> just saw this thread regarding the Elevate theme - I used it for a internal project recently and it appears to be broken at the moment. Seems to have happened out of the blue - but it's throwing a bunch of inline comments saying there is an issue rendering the modules."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2025-01-24 17:58:11",
    "edited": {
      "time_stamp": "2025-01-24 17:59:02"
    },
    "text": "Don't want to be a grumpy old guy... But let's say a small business owner uses this theme or another react based theme and want to customize it. Wouldn't that require hiring a more advanced and likely more expensive react developer vs html css js dev? I get performance, but doesn't this make things way more complicated for small to medium sized sites?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2025-01-24 21:43:31",
    "edited": {
      "time_stamp": "2025-01-24 21:44:10"
    },
    "text": "<@UG7S8J18D> only kind of. The market has shifted a lot. The rise of free online training boot camps etc. Newer devs are learning React before mattering html and CSS. Additionally the rise of LLMs has made react much more accessible since React is one of the things it's best at.\n\nReact based themes are primarily replacing HubL not html CSS and JS. Having strong HTML and CSS skills can actually make you a better React developer because then you're not as likely to reinvent the things the web platform already gives you. The React skills also transfer not just to work in basically every other platform, but also to HubSpot UI extension development.\n\nThe trade off that companies may want to weigh though: Projects require developing locally. There is no in-app editing for projects currently planned. This doesnt mean you need to do it all locally on your computer, for example i use gitpod for my personal site so i can make edits on any machine without needing to download or auth anything"
  }
]