[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-21 08:43:17",
    "text": "Hey hey — so It seems that I was partially wrong and going off of old information. After some playing today and digging into some convos — the child theme functionality works as expected. Ie you can from DM, even, click file &gt; New theme &gt; (manually add `\"extends\": \"@HubSpot/elevate\"`) to the theme.json file and it will create a new child theme based off of elevate. You can even create hubl modules that will override the react modules, just note that in Elevate the modules live at `./components/modules/module_name` so the structure in your child theme would need to be the same.\n\nYou can also create a child theme project and override react modules with …react modules. Just add the extends line to your theme.json file as mentioned above and create the new module at the same path and build away. If you really wanted you could create a child theme project of a standard hubl-based theme. However, you likely, in that case, won’t be able to replace modules as the modules in a project need to live in a `/components` dir, and I imagine it’s unlikely that the parent theme has modules inside of a `components` dir.  cc. <@U04J72L6M8D>"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-21 08:43:55",
    "text": "Also CC <@U03AKL6Q1B2> &amp; <@U01QVR44MEY>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2025-01-21 08:45:42",
    "text": "<@U7SL518D6> I think we were talking the other week about not being able to do the child themes, but this looks like it could be the solve, thanks <@UQWGKUEN7>!"
  },
  {
    "text": "Also worth noting that in elevate the “module name” is not the directory name of the module. But is stored in the module index file under the `defaultModuleConfig` var.",
    "time_stamp": "2025-01-21 08:55:31"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-21 08:57:01",
    "text": "So a new module in the child theme named `rich_text` will correctly override the existing module if it is at the path `components/modules/rich_text` . Don’t name the module `RichText` or you will be frustrated."
  },
  {
    "poster": {
      "poster_name": "Huda",
      "poster_handle": "huda.ishekhani"
    },
    "time_stamp": "2025-01-21 12:26:43",
    "text": "the documentation gives a good run-through on how to get the elevate theme through CLI but for some reason, I'm unable to get the whole folder. The components folder is missing when I open it in my local environment. is it not supposed to bring in the modules at all?"
  }
]