[
  {
    "poster": {
      "poster_name": "Adam Berggren",
      "poster_handle": "adam.berggren"
    },
    "time_stamp": "2022-09-06 01:30:00",
    "edited": {
      "time_stamp": "2022-09-06 01:31:17"
    },
    "text": "Hey guys! Anyone who knows a good training course/module for associates to  gain knowledge around HubSpot Development? As for my opinion HubSpot Academy could be a bit too basic/high level. All thoughts and tips are very welcome! :smile:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-06 07:27:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "jatin sharma",
      "poster_handle": "sharmajatin1204"
    },
    "time_stamp": "2022-09-06 06:25:07",
    "text": ":wave: Hi everyone!"
  },
  {
    "poster": {
      "poster_name": "Connor Slivensky",
      "poster_handle": "connor295"
    },
    "time_stamp": "2022-09-06 07:27:45",
    "text": "I think it's going to be a bit of learn as you go. That being said I think the big recourses to be aware of are\n\n• <https://knowledge.HubSpot.com/crm|The Knowledge Base>\n• <https://developers.HubSpot.com/docs/api/overview|API Documentation> (Or dev documentation in general)\n• <https://community.HubSpot.com/|The HubSpot Community>\n    ◦ You can post specific questions to talk through your specific problem and it's very active with super users. "
  },
  {
    "poster": {
      "poster_name": "Linda Lee",
      "poster_handle": "hsiang"
    },
    "time_stamp": "2022-09-06 07:47:27",
    "edited": {
      "time_stamp": "2022-09-06 07:49:00"
    },
    "text": "Hi everyone, does anyone have experience implementing HubSpot cookies with Cookie Pro?  The website is hosted with HubSpot CMS, but we're using Cookie Pro to manage the consent and banners. Pretty new to this, any advise on how to do manage cookie if the client reject the consent?\n\nOr atleast not to trigger HubSpot's tracking code before the receiving consent from the user.\n\nI've tried `_hsp.push(['revokeCookieConsent']);` and seems like the `HubSpothutk` cookie still exists every time I reload the page. Should I be using `_hsq.push(['doNotTrack']);` instead?"
  },
  {
    "poster": {
      "poster_name": "Lorena M",
      "poster_handle": "lmartinez384"
    },
    "time_stamp": "2022-09-06 08:04:06",
    "text": "Hi Everyone! I dont know if there is a better chat to ask this but I would need your help. Question: Concerning knowledge base. My client would like that when some writes something in a support form, it links with related articles of knowledge base. They are looking for this funcionality: <https://help.signaturit.com/hc/es/requests/new>\n\nin Asunto, write \"Enviar un email\" you will see that answers displays these articles.\n\nCould you pls advice on this?\nThank you!"
  },
  {
    "poster": {
      "poster_name": "TJ R",
      "poster_handle": "tizane.rimmer"
    },
    "time_stamp": "2022-09-06 08:05:54",
    "text": "hi all - I am trying to create dynamic pages based on a hubDB. I kept having issues when applying the instructions to my own pages so have just tried to <https://developers.HubSpot.com/docs/cms/guides/dynamic-pages/hubdb|follow the steps on this page> literally to the letter but it isn't creating the extra page. I can get the table info to pull through to a page, or to a custom module but I cannot get the dynamic pages to appear as anything other than a 404. I have the dynamic pages slider on but am really struggling to see where the problem is stemming from. Can anyone help with this?"
  },
  {
    "poster": {
      "poster_name": "Ryan",
      "poster_handle": "ryan512"
    },
    "time_stamp": "2022-09-06 08:31:39",
    "text": "Hi everyone! My company, Cambium Advisors, is open-sourcing the HubSpot application development framework we’ve been building for the last nine months. The Framework allows developers to create enterprise-grade applications for HubSpot quickly. It creates fully serverless applications in AWS and includes the infrastructure necessary to support multi-tenant OAuth for HubSpot, HubSpot webhooks, and scripts to simplify the management of custom actions. The framework is ideal for new projects, but existing projects can benefit from borrowing ideas we use.\n\nIt has already been incredibly useful to us in development. However, there is still a lot of room for improvement and further evolution. We’d like to invite developers from the HubSpot community to take a look at the framework, try it, offer ideas – and contribute!\n<https://www.cambiumadvisors.com/blog/cambium-advisors-open-sources-its-proprietary-HubSpot-app-development-framework|https://www.cambiumadvisors.com/blog/cambium-advisors-open-sources-its-proprietary-HubSpot-app-development-framework>"
  },
  {
    "poster": {
      "poster_name": "hub.sketch",
      "poster_handle": "hub.sketch"
    },
    "time_stamp": "2022-09-06 08:32:16",
    "text": "anyone know? how can we use this syntax in blog listing and posting page with HubSpot theme?\n\n{% text \"authslug\" label=\"Author Slug\", export_to_template_context=True %}\n{{ content.widgets.authslug.body.value }}"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-09-06 09:22:27",
    "edited": {
      "time_stamp": "2022-09-06 09:24:15"
    },
    "text": "*Hey CMS Hub Developers, I have some developer experience questions for you.*\n\nHubSpot has a set of standard default modules. (Rich Text, image, gallery, etc).\n\nWhen you want to use those in your templates, our developer documentation shows the module tag, and field attributes available. Additionally you can view the code for any of our modules in the design manger within the `@HubSpot/folder` and by fetching that folder with the CLI.\n\nWhen you’re looking up information on them, *do you prefer to see the tabular list of fields like we do on our docs, or would you rather it be even easier to see the code for the module - which would mean you would see the `fields.json` file directly?*",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-06 09:43:20"
      },
      {
        "time_stamp": "2022-09-06 11:14:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-09-06 09:43:20",
    "text": "I hate to say it but both would be helpful. Another thing that would be nice is to also show an example tag with all of the options in it so you can see how to override the default values. Some default modules have complex nesting of attributes and it takes time to figure it out. Thanks for asking."
  },
  {
    "poster": {
      "poster_name": "Laura Isabel",
      "poster_handle": "lauraisabel543"
    },
    "time_stamp": "2022-09-06 10:01:59",
    "text": "Hi! I have a question. I'm doing the developer certification in HubSpot Academy, the final test is develop a theme, I already did it but I could not find how to generate the shareable link. If someone can explain to me I would be very grateful.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-06 10:03:46"
      },
      {
        "time_stamp": "2022-09-06 10:05:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-09-06 10:03:46",
    "text": "Do you have a published page using that theme? That should be it"
  },
  {
    "poster": {
      "poster_name": "Laura Isabel",
      "poster_handle": "lauraisabel543"
    },
    "time_stamp": "2022-09-06 10:05:39",
    "text": "```I thought I should share the link of the theme and I did not understand how, but I think it must be the link to a page that uses the theme that I developed. Thank you!```\n"
  },
  {
    "poster": {
      "poster_name": "Jay Phillips",
      "poster_handle": "jay695"
    },
    "time_stamp": "2022-09-06 11:13:10",
    "text": "Pity. That’s what I thought. From what I can tell it’s _almost_ possible by using the API to add the comments after importing the blog content, but it’s not possible to set the date of each comment, it just defaults to the current timestamp.\n\nThank you anyway. Just wish this was made clear on the blog import docs - it could have saved me some time."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-09-06 11:14:50",
    "text": "I agree, both would be helpful."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-09-06 12:14:40",
    "text": ":wave: Hey everyone, just an FYI that we spun up an <#C041BLR2AAG|inbound22> channel for everyone to discuss the happenings at INBOUND and also connect with others! Feel free top hop in there and have some peer-to-peer discussion!"
  },
  {
    "poster": {
      "poster_name": "Kris Gösser",
      "poster_handle": "kris443"
    },
    "time_stamp": "2022-09-06 13:51:54",
    "text": "I'm surprised how little documentation I have been able to find publicly on this, but basically:\n\nDoes the CMS tool work with a TLD?\ne.g. <http://example.com|example.com>\nI know it works with <http://www.example.com|www.example.com> which I've set up\n\nI'm trying to figure out how to have my root TLD work with the website on HubSpot's CMS when there isn't a dedicated IP given for the A record required by TLD's versus subdomains with a CNAME.\n\nThanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-06 19:23:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2022-09-06 19:23:38",
    "text": "Yes, it does. It requires a CMS subscription (not just a HubSpot marketing tier. You can just add the root in the domain tool and it should provide you IP addresses to use"
  },
  {
    "poster": {
      "poster_name": "Michael Niemeijer",
      "poster_handle": "michael915"
    },
    "time_stamp": "2022-09-07 00:50:25",
    "text": "Does anyone know what can be the issue if my HubSpot CTAs are not showing in my website? (chrome, fully updated)",
    "reply_count": 11,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-09-07 00:51:10"
      },
      {
        "time_stamp": "2022-09-07 01:26:28"
      },
      {
        "time_stamp": "2022-09-07 02:33:50"
      },
      {
        "time_stamp": "2022-09-07 02:37:43"
      },
      {
        "time_stamp": "2022-09-07 02:38:04"
      },
      {
        "time_stamp": "2022-09-07 02:38:32"
      },
      {
        "time_stamp": "2022-09-07 02:38:48"
      },
      {
        "time_stamp": "2022-09-07 02:39:17"
      },
      {
        "time_stamp": "2022-09-07 02:39:21"
      },
      {
        "time_stamp": "2022-09-07 02:40:06"
      },
      {
        "time_stamp": "2022-09-07 09:13:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-09-07 00:51:10",
    "edited": {
      "time_stamp": "2022-09-07 00:51:37"
    },
    "text": "do you have a Starter Tier?"
  }
]