[
  {
    "poster": {
      "poster_name": "leandro",
      "poster_handle": "leandrobarbosa"
    },
    "time_stamp": "2022-09-02 07:00:50",
    "text": ":wave: Bonjour à tous !",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-02 08:10:18"
      },
      {
        "time_stamp": "2022-09-05 03:24:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-09-02 08:10:18",
    "text": "Salut!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-02 20:11:45",
    "text": "inside the page editor, you can do preview, then open a preview link — that will always serve you a fresh page without having to click into the developer extension\\"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-09-02 20:36:43",
    "text": "The page editor preview doesn't always clear server side cache, I have run into this hundreds of times now where preview link doesn't reflect changes without busting the cache. Even if you don't want the chrome extension, you can manually add the parameter to the URL, that's what it's for..."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-02 20:39:28",
    "text": "What server side events do you speak of?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-02 20:48:12",
    "text": "I generally just cmd L, right arrow, fingers down home row when i don't feel like going to the editor. At times even with random query strings I'll need to go in and hard refresh the actual script file. \n\nI'll have to pay attention more, I know I'll have issues when I'm doing a resource library and using url palmettes and the normal page will refresh with preview link, and When I hit a different filter it will go back to cache and I'll need to go busy cache, but if I'm testing enough I just add that to my script to copy the hs preview stuff into the url on each quests change and it works well. \n\n"
  }
]