[
  {
    "poster": {
      "poster_name": "Jitendra Kushwah",
      "poster_handle": "jitendra"
    },
    "time_stamp": "2022-09-05 01:22:16",
    "text": ":wave: Hi everyone!"
  },
  {
    "poster": {
      "poster_name": "Antoine Louis",
      "poster_handle": "antoine927"
    },
    "time_stamp": "2022-09-05 03:24:23",
    "text": "Bonjour!"
  },
  {
    "poster": {
      "poster_name": "Mac Kang",
      "poster_handle": "mac630"
    },
    "time_stamp": "2022-09-05 03:58:26",
    "text": "Hi everyone! I'm testing HubSpot several chatbots in test page.\n• Site A: Chatbot A(has a link in script which links to Site B)\n• Site B: Chatbot B\n• Site C: Chatbot C\nbut it seems like Chatbot A still shows up even if I was moved to a Site B..\nwould there be a way to refresh chatbot conversation when I was moved to a new page?\n\nI found this Dev Docs.. <https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk>\nwould it be work?"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-09-05 05:52:11",
    "text": "Some general HubSpot CMS question. Since HubSpot also have a lot of API’s available and do offer a tracking script, what would be the absolute reason to keep developing inside HubSpot CMS, instead of building something custom with React/NextJS and implement the API’s/tracking from there? Or are some important marketing features not available",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-05 07:21:00"
      },
      {
        "time_stamp": "2022-09-05 07:56:00"
      },
      {
        "time_stamp": "2022-09-05 07:58:09"
      },
      {
        "time_stamp": "2022-09-05 08:30:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-05 07:21:00",
    "text": "every time I am building something I aways evaluate what I’m doing and why.\n\ndo I need react to build a simple marketing website? Do we have need to have the ability for marketers to make quick changes to the website to help convert users to help drive business.\n\nAll depends on your goals — am I going to use Java to build a todolist just because I need it to be available on lots of devices?\n\nThese are questions you have to answer yourself — if you are blindly throwing react at something and then making your marketing team depend on you to make page and website updates — then you’ve solved your job security problem, until they realize that there was a much better way of doing things.\n\nI don’t know what you are trying to build or your goals so I cannot answer your question."
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-09-05 07:56:00",
    "text": "Of course, content marketeers will have access to a custom (headless) CMS. The reason why I would go for something OTHER than HubSpot are:\n\n1. Developer experience\n2. Performance\n3. More flexibility in terms of functionality \nThis will give us the opportunity to create, maintain and use our own component and plugin library."
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-09-05 07:58:09",
    "text": "It is not that I am already sure to switch, but I am looking into all the options and possibilities. So my main question was: will everything be possible with the help of the API’s. So then I am talking about tracking, HubSpot forms and send leads to workflows, campaigns etc etc."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-05 08:30:12",
    "text": "I really don’t know how to answer you — I think you are asking very vague questions.\n\nYou can submit to forms via the api.\nHaving the tracking code implementing correctly will also pick up form fills.\n\nCampaigns are related to page and how you set those up — You’d have to look at how HubSpot events can be sent through the tracking code\n\nI’d go ahead and create a page and throw the tracking code on it and see what it does and how you interact with it and test out your use cases"
  },
  {
    "poster": {
      "poster_name": "Ciara",
      "poster_handle": "ciara.magee"
    },
    "time_stamp": "2022-09-05 09:57:40",
    "text": "Hi all, I've been crawling through forums to try to redirect a HubSpot form to a url based on the 'country_region' property selected, however my own attempts at embedding the code on our wordpress site have failed. Could anyone please review what I have below and let me know if there is something I've missed?\n\nI have 2 potential hypothesis as to where I'm going wrong:\n1. I copied the code from this blog however I'm not sure if it was intended to be embedded on external websites: <https://www.inbounddesignpartners.com/blog/customization-of-form-submission-redirects>\n2. The form was originally set up to redirect to a thank you page and every time I test this it still redirects me back to the original thank you page or thank you message - I'm not sure if it is possible to override this.\nAppreciate any guidance this community can provide.\n\n```&lt;div id=\"formTarget\"&gt;\n\n&lt;/div&gt;\n&lt;!--[if lte IE 8]&gt;\n&lt;script charset=\"utf-8\" type=\"text/javascript\" src=\"//js.hsforms.net/forms/v2.js?pre=1\"&gt;&lt;/script&gt;\n&lt;![endif]--&gt;\n&lt;script charset=\"utf-8\" type=\"text/javascript\" src=\"//js.hsforms.net/forms/v2.js?pre=1\"&gt;&lt;/script&gt;\n&lt;script&gt;\n  hbspt.forms.create({\n    region: \"na1\",\n    portalId: \"8867209\",\n    formId: \"e486c69a-7203-49c4-89c4-5a17461ac09e\",\n      target: \"#formTarget\",\n          onFormSubmit: function($form) {\n       \n        var ukLink = \"<https://www.yahoo.com>\";\n        var europeLink = \"<https://www.google.com>\";\n        var selectedCountry = $('select[name=\"country_region\"]').val();\n            \n            if (selectedCountry == \"United Kingdom\") {\n              window.top.location.href = ukLink\n            } else {\n              window.top.location.href = europeLink\n            } \n            \n          }\n  });\n&lt;/script&gt;```\nThank you,\nCiara",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-14 04:22:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Christian Gubaton",
      "poster_handle": "christian310"
    },
    "time_stamp": "2022-09-05 19:40:44",
    "text": "Is anyone can give me guide link how to show upcoming events only on the event page ? anyone can give me guide is apprepciated thank you :smiling_face_with_3_hearts:"
  },
  {
    "poster": {
      "poster_name": "Jitendra Kushwah",
      "poster_handle": "jitendra"
    },
    "time_stamp": "2022-09-05 22:04:02",
    "text": "Hi,\nis there any way for adding lazy loading in img tag in theme module"
  },
  {
    "poster": {
      "poster_name": "Jitendra Kushwah",
      "poster_handle": "jitendra"
    },
    "time_stamp": "2022-09-05 22:05:53",
    "text": "can we add height and width attribute in image tag in the theme module,\n(is there any other way for solve this so please  tell tell me)"
  }
]