[
  {
    "poster": {
      "poster_name": "Shalini Kashyap",
      "poster_handle": "swap.shalini"
    },
    "time_stamp": "2021-11-22 02:18:37",
    "text": "Hi, How can I get data from lists (under contacts tool) on the email in the leaderboard section: <http://prntscr.com/20gdqt3>?\nList - Static\nObject type - contact\nEmail template - Drag and drop template\nRight now, leaderboard section is created as a custom module with repeater option but I want user data i.e. user name, user email etc. from the lists.\n\nAs I found out, there are some restrictions on the object type.\n\"For security purposes, of the HubSpot standard object types only the \"product\" and \"marketing_events\" objects can be retrieved on a publicly accessible page. Any other standard object type must be hosted on a page which is either password protected or requires a CMS membership login.\"\n\nCan anyone help?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-11-25 03:56:16"
      },
      {
        "time_stamp": "2021-11-25 04:01:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-11-22 03:56:40",
    "text": "What is the nature of the emails being sent? If they are transactional, you could use the Transactional Email add-on which allows you to provide data in JSON form via the API. <https://knowledge.HubSpot.com/email/how-to-use-transactional-email-in-HubSpot>"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-11-22 04:00:37",
    "text": "I’m assuming you have some structure where you have a group of fields that can be any size, like form[info] = [field1,field2….n] and you would like to just print all of <http://form.info|form.info> in the email?\n\nAnother option could be to place the whole blob into a contact property like you suggested. Then make use of <https://knowledge.HubSpot.com/email/create-programmable-emails|the Programmable Email beta> to <https://developers.HubSpot.com/docs/cms/hubl/filters#fromjson|parse this blob back into a HubL variable>. Then print out whichever properties you are interested in."
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-11-23 00:45:14",
    "text": "It’d be better if they just let us drag in the modules we’ve already created into a DRY template using `{% block modules %}{% endblock %}`"
  }
]