[
  {
    "poster": {
      "poster_name": "Maksym Adamov",
      "poster_handle": "ma"
    },
    "time_stamp": "2022-04-21 05:41:23",
    "text": "To fix that I created a new account, to be a DEV portal, which is not related to PROD portal account. Then I ran \"hs auth\" command when I was only logged in DEV account."
  },
  {
    "poster": {
      "poster_name": "Maksym Adamov",
      "poster_handle": "ma"
    },
    "time_stamp": "2022-04-21 05:58:11",
    "text": "Hi folks, I am quite new in HubSpot CMS, so need some help.\nCurrently I am setting up development workflow. I have created developer account where I want to setup dev sandbox. As I am using a paid theme on my PROD portal I have a questions.\nDo I need to install paid theme in developers account (DEV portal)? If yes, then how?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-21 05:59:48"
      },
      {
        "time_stamp": "2022-04-21 06:00:17"
      },
      {
        "time_stamp": "2022-04-21 06:04:17"
      },
      {
        "time_stamp": "2022-04-21 06:05:34"
      },
      {
        "time_stamp": "2022-04-21 06:17:29"
      },
      {
        "time_stamp": "2022-04-21 06:19:05"
      },
      {
        "time_stamp": "2022-04-21 06:50:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-04-21 05:59:48",
    "text": "the developer account is only for testing and iirc you can´t migrate the content from a dev account to a production portal"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-04-21 06:00:17",
    "text": "however you can leave pages in Content Staging and or unpublished"
  },
  {
    "poster": {
      "poster_name": "Maksym Adamov",
      "poster_handle": "ma"
    },
    "time_stamp": "2022-04-21 06:04:17",
    "text": "It is clear about the content. I am intending to test modified and new code there. Such as new modules, templates etc."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-04-21 06:05:34",
    "text": "I think you can install a paid theme only in one portal, though i am not 100% sure about that"
  },
  {
    "poster": {
      "poster_name": "Maksym Adamov",
      "poster_handle": "ma"
    },
    "time_stamp": "2022-04-21 06:17:29",
    "text": "Yes, looks like it.\n\nIn your opinion, what is the most decent development workflow setup then? Doing development on PROD portal and testing it in Content Staging?\nThank you."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-04-21 06:19:05",
    "text": "yes you could do that.  This is also a really good guide: <https://developers.HubSpot.com/docs/cms/guides/github-integration>"
  },
  {
    "poster": {
      "poster_name": "Reya Ghosh",
      "poster_handle": "reya"
    },
    "time_stamp": "2022-04-21 06:38:37",
    "text": "Hello Developers, any comments on this:\nIn case of submitting one contact form and data storiation in HubSpot DB (Contact/Company list),\nWith an email when I’m submitting one set of details it’s creating new contact and with the help of Work Flow Diagram It’s converting to one deal, that’s perfect. But, when with the same email id I’m submitting same set of details with different values then the same contact details are getting updated, In that case what we want is to create 1 contact which will contain 2 different sets of values.\n\nExample:\nWith email - <mailto:reya@xyz.com|reya@xyz.com> I’m submitting one form with set of details,\nLOCATION : Canada\nPHONE: 8983456345\nROLE: Construction Manager\n\nIt’s creating one contact and with the help of Work Flow Diagram It’s converting to one deal.\n\n*BUT* when with the same email id - <mailto:reya@xyz.com|reya@xyz.com> I’m submitting the same form with same set of details but with different values,\nLOCATION : US\nPHONE: 9999456367\nROLE: Project Manager\n\nIt’s Updating the previous contact and deal details, and as a result the previous set of data getting deleted (LOCATION : Canada  PHONE: 8983456345    ROLE: Construction Manager) and we can only view the new set of details  (LOCATION : US   PHONE: 9999456367   ROLE: Project Manager).\n\n• We need to have multiple numbers of details under a single Contact/Deal Id with same set of details with different values.\n• Can we find some way like, system will check the primary key (email) first if it found duplicate, will check the secondary key (job role) if that not found duplicate then it will create a New contact/deal id?\nIs there any way to find a solution on that?"
  },
  {
    "poster": {
      "poster_name": "Maksym Adamov",
      "poster_handle": "ma"
    },
    "time_stamp": "2022-04-21 06:50:21",
    "text": "Thank you, Andreas!"
  }
]