[
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2024-12-16 01:19:44",
    "text": "The first thing I can spot is that the secret you are referencing is “Token” but your code is using “token” - these should match in order to use the api"
  },
  {
    "poster": {
      "poster_name": "Jason Jeffries",
      "poster_handle": "jason491"
    },
    "time_stamp": "2024-12-16 12:18:00",
    "text": "Hi <@U083SQZTHD1> I'm seeing if you have multiple custom code blocks if you click between the code blocks the outputs are being changed to the original one in the UI.\n\neg if you click on 1. Custom Code and the output is 'field1', then click on 2. Custom Code it will say the output is still 'field1'. But if you Refresh the browser winder and start by clicking on 2. Custom Code it will say the output is 'field 2' and then if you go back to 1. Custom Code, it shows 'field 2'\n\nSeems like a bug in the UI and you have to refresh the browser every time you switch between the code blocks."
  },
  {
    "text": "Hi! Just got invited to the community, excited to be apart of it!\n\nNot sure if anyones run into this before as the Service object is quite new. I'm trying to create a service object and pass a field for the Start Date and Target End Date, using Custom Code I've generated a \"Date\" field and a \"Datetime\" field and have tried passing both of these fields to the new object. In both cases I'm getting a error message about the values being invalid. I'm not sure how else I could pass in a Date or Datetime field to have this set.\n\nI'm wondering if this is an error with the new object and if anyone else has run into this.  Or possibly I'm just setting the date field\n\nThanks in advance!\nJason",
    "time_stamp": "2024-12-16 14:13:16"
  },
  {
    "poster": {
      "poster_name": "Ben Lerner",
      "poster_handle": "ben198"
    },
    "time_stamp": "2024-12-17 00:31:48",
    "text": "Has anybody tested and successfully created a workflow via the V4 Workflows API?  I have taken HubSpot's examples, and still getting nonstop 500 Internal Errors.   Does anyone have even a simple working call that I can then build off of?  Very frustruating. :smiley:"
  }
]