[
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2023-02-16 02:14:26",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-02-16 10:55:30"
      },
      {
        "time_stamp": "2023-02-16 13:26:31"
      },
      {
        "time_stamp": "2023-02-17 09:00:57"
      },
      {
        "time_stamp": "2023-02-17 12:40:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-02-16 10:55:30",
    "text": "How is the email built? Do you have any screenshots you can share or code samples?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-02-16 13:26:31",
    "text": "By chance, are the missing images built into the e-mail as background images? For example, if you set a section’s “Body Pattern” to an image to build a hero banner.\n\nBackground images are among the substantial and baffling list of styling functionality that aren’t supported by Outlook.\n\nOtherwise, it may be worth double-checking the images’ file formats. If someone got a little over-eager with file size reduction, or saved the images from a site that serves in optimized formats (webp, avif, heic, etc); they would display in clients that support modern formats, but wouldn’t be able to render in the Outlook family of e-mail clients."
  },
  {
    "text": "Hey Everyone. I’m building a custom email and adding in personalization. Unfortunately the values (firstname, and another custom property) are not populating in the emails. Here’s the line of code I’m using. Would someone mind taking a look to see what I’m doing wrong?",
    "time_stamp": "2023-02-16 14:09:49",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-02-16 14:57:13"
      },
      {
        "time_stamp": "2023-02-17 13:30:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-02-16 14:57:13",
    "text": "Unless you’re opted into the Programmable Emails beta, you can only use a limited subset of HubL functionality.\n\nIf you’re simply looking to provide a fallback value for missing contact properties, you can handle that with <https://developers.HubSpot.com/docs/cms/hubl/functions#personalization-token|the >`personalization_token()`<https://developers.HubSpot.com/docs/cms/hubl/functions#personalization-token| function>, like so:\n```Hello {{ personalization_token('contact.firstname', 'Friend') }}```\nIf you need to base it on a different condition, you might also be able to use the ternary operator (`{{ condition ? outputIfTrue : outputIfFalse }}` ), but don’t quote me on that one. :sweat_smile:"
  }
]