[
  {
    "poster": {
      "poster_name": "Ahmed Jamal Tariq",
      "poster_handle": "ahmed.jamal.tariq"
    },
    "time_stamp": "2023-02-17 06:19:38",
    "text": "I have created an email template which has a macro in it, that macro generates some random numbers every time. But the email is sending the same random number every time when I invoke and send email within a workflow after form submission. It seems like template is hard cached by HubSpot. How to get rid if this caching?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-27 18:35:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Srishida i",
      "poster_handle": "srishida.illath"
    },
    "time_stamp": "2023-02-17 09:00:57",
    "text": "This is a custom coded email. The images seem to display well in all other email clients and devices. It is only in the Outlook app of iPhone Mini and Samsung Galaxy S20, we are seeing this issue!"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-02-17 12:40:18",
    "text": "If you’re able to share your code, then we may be able to help further. Without that it’s pretty hard to suggest much more."
  },
  {
    "poster": {
      "poster_name": "RanJ",
      "poster_handle": "randy.okelly"
    },
    "time_stamp": "2023-02-17 13:30:52",
    "text": "Thanks <@U04AQA0QM8E> for taking a look at this. I’m definitely going to look at adding the beta to our portal.\n\nYour first suggestion worked perfectly. Thank you. But now I want to learn more about the ternary operator :)\n\nCheers:wine_glass:"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-02-17 15:58:41",
    "text": "Has anyone worked out a client-friendly (see: can be done in the drag-and-drop builder, doesn’t break if you look at it wrong) way to keep images aligned with the rest of the content after a multi-column layout reflows to a mobile/single-column layout? I continually get complaints about this when migrating clients over to HubSpot email, and I’d like to try and figure out a solution that’s more economical than “build a custom module for every single layout that pairs images and text” and less visually offensive than “exclusively use 20px inline padding.”\n\nBest as I can tell, the issue seems to come from the fact that most (all?) email elements with padding enabled receive the `hs_padded` class, that forces horizontal padding values at mobile widths — *except* for images. So, if you give an image a left or right padding value other than 20, it’ll be out of alignment with the rest of the email content when viewed on mobile. This behavior sure does walk like a bug and quack like a bug, but I know enough to know that I don’t know enough to say decisively. ;~)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-19 07:08:39"
      }
    ]
  }
]