[
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2021-01-11 08:47:10",
    "edited": {
      "time_stamp": "2021-01-11 08:47:16"
    },
    "text": "It would be good to enable embedding YouTube videos from the <http://youtube-nocookie.com|youtube-nocookie.com> domain.\n\nWe have CookieBot in use but YouTube iframe sets cookies even if not allowed. We could build our own video module, but that wouldn't help with videos embedded with the rich text editor. When I add a video module it uses this <https://www.youtube.com/watch?v=X1Rr5BFO5rg> as the default vide and embeds it as <https://www.youtube.com/embed/X1Rr5BFO5rg?feature=oembed> which sets cookies. The same video can be embedded from <https://www.youtube-nocookie.com/embed/X1Rr5BFO5rg?feature=oembed> without non-necessary cookies.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-11 10:11:37"
      },
      {
        "time_stamp": "2021-01-11 22:49:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-01-11 09:19:13",
    "text": "I'm kind of suprised this does not already exist in slack, but boy oh boy would it be nice to be able to send a slack message to a deal owner, company owner, or contact owner. I realize that you can send a slack message to an individual from the workflows or to a channel, but currently the only way to send it dynamically to the owner of the object is by using Zapier. Now that custom code is in place (beta) we've managed to replace our more complex Zapier needs with the custom code, but we constantly run into API limits... Since custom code requires an immediate lookup against the API, any higher volume workflows for \"nice to haves\" (such as slacking the deal owner) aren't something we can use custom code for lest we risk saturating our API count and interrupting an important custom code module that isn't so much a \"nice to have\".\n\nSince HubSpot seems to have an internal mapping of Slack users to HubSpot users, it would be so delightful if we could send Slack direct messages dynamically and would save us a lot of internal coding."
  },
  {
    "poster": {
      "poster_name": "Logan Allen",
      "poster_handle": "lallen"
    },
    "time_stamp": "2021-01-11 10:11:37",
    "text": "Hey <@U0149PQC0HK>, thanks for raising this concern. We can look into accepting `<http://youtube-nocookie.com|youtube-nocookie.com>` for the OEmbed service.\n\nIn the meantime, you should be able to insert the youtube embed via _embed code_ instead of the url (which goes through oembed). By using the _embed code_ you can easily update the `src` to be the desired `<http://youtubee-nocookie.com|youtubee-nocookie.com>` domain."
  },
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2021-01-11 22:49:36",
    "text": "Cool, thanks. Did not know about that. Might be a little difficult for our content producers but I'll try to write them instructions"
  }
]