[
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-06 07:27:52",
    "text": "That’s fine, but it’s still a heavier process than copying and pasting something if you just want to add a new field. And if you can see a live readout, it helps you learn what the json means in relation to how the field is working."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-06 07:29:33",
    "edited": {
      "time_stamp": "2021-01-06 07:30:26"
    },
    "text": "The other thing is when you fetch it brings in the ID values of all the fields… which is another question I’m not totally clear on, as I think there was some back and forth in the early phases of local development: What’s the best practice for field ID’s? Should we specify ID’s for all the fields, or let HubSpot determine that in the background? Are there implications if you’re using the same module across different portals?"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-06 07:38:25",
    "edited": {
      "time_stamp": "2021-01-06 07:39:12"
    },
    "text": "The danger I see in doing that is if the module is in use in different portals, adding an ID to fields after the fact will most likely delete all the content currently associated with the fields in all other portals, since the ID’s will have been different"
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2021-01-06 08:16:49",
    "text": "I typically add an ID for new fields that matches the field name. Makes it much easier to reference with visibility rules and such. If I'm working on something that already has an ID, I leave it alone."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-06 08:19:48",
    "text": "Thanks Ian… that sounds like a pretty smart approach to me."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-01-06 08:21:15",
    "text": "Lots of Ian love on this thread. Thank you to all Ians."
  }
]