[
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-06-07 01:01:07",
    "text": "Hi Community,\n\nAnyone has thought on the template level how I can get these modules aligned here?Regardless of the text the rich text module in grey always looks smaller than the image next to it:<http://5631553.hs-sites.com/-temporary-slug-77348077-0610-434d-bd5d-3e680aeee715?hs_preview=sTkytTBL-10154230769>\n\nIt should look like this:"
  },
  {
    "text": "",
    "time_stamp": "2019-06-07 01:01:23",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-06-07 06:12:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dante Panetta",
      "poster_handle": "dante.panetta"
    },
    "time_stamp": "2019-06-07 02:40:23",
    "text": "You can set the height of the text to be equal to the img. So, if you are using img that are 200px x 200px then set the text div height to 200px. What would be even better though is using flex and setting the divs to stretch"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2019-06-07 06:12:27",
    "text": "You can create a custom module and use a repeater to allow the customer to dynamically add/ remove rows. You can set the images as background images set to `cover` so that they fill the area regardless of the amount of text."
  },
  {
    "text": "Not sure what channel to put this in, *Link field bug*: our Marketing just launched like 10 new page updates from Content Staging, however the “Link” field type for a module updated the links to the “archived-0\" path, and did not retain the published pages path. Also in the dropdown list of the Link field type, it is showing the “archived-0” along with the replaced page, this has to be a bug, right?",
    "time_stamp": "2019-06-07 08:07:56"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2019-06-07 08:09:10",
    "text": "This publish of the new pages happen yesterday, so it has been multiple hours, seems like these staged “archived-0” pages should not be showing up in the list, and the links should not be updating automatically but retaining the published URL webpage"
  },
  {
    "text": "",
    "time_stamp": "2019-06-07 08:12:51"
  },
  {
    "poster": {
      "poster_name": "IeshaanK",
      "poster_handle": "ikmhs96"
    },
    "time_stamp": "2019-06-07 11:55:07",
    "text": "I use a custom button. Where the user can choose between cta/link/custom url. The problem is that I use this across multiple modules (most modules have a CTA Button). Is there anyway to nest this button module into the rest so I don't have to write the same code and create the same fields over and over again?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-06-07 11:56:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "IeshaanK",
      "poster_handle": "ikmhs96"
    },
    "time_stamp": "2019-06-07 11:56:38",
    "text": "I know you can call a module into a HTML template. Just want to know if the same is possible inside the module context."
  }
]