[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2019-06-30 07:25:49",
    "edited": {
      "time_stamp": "2019-06-30 07:26:08"
    },
    "text": "Okay it’s probably easiest to show the page\n<https://www.wightmanandparrish.co.uk/insights>\nAs you can see each listing is just loaded by JS on the page and adds a hash to the url.\nNow in the main navigation under insights you can go straight to a particular listing.\nSo if you are currently on the insights page the page doesn’t reload and it animates you down the page\nIf you are on a cachebuster version of the site however, when you click on an item in the menu it does reload the page because the query string get’s removed, this means I couldn’t debug the js that made it scroll down the page (I had some issues with the mobile nav version)\n\nThe only way I could test if my changes were working was to edit the links in the dom to add the cachebuster query so the query string doesn’t change.\n\nSo the idea is, append all links with the cachebuster query, that is currently in the url this would also mean if you made a sitewide CSS change you could also navigate the site and see the cachebuster version of each page to make sure it all works."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-30 13:48:21",
    "text": "I see what you’re saying.\nI’ll create an issue, I can’t garuntee how long it will be until the feature gets implemented, it’s not hotly requested and for situations like yours you can actually develop your way around the problem by using pushstate instead. Another solution would simply be use the cachebuster again after clicking.\n\nIf this gets implemented I think it will be a separate “advanced cachebuster” functionality. The reason is this might require more chrome permissions from the user and will result in page load times taking longer when using it as no assets at all would be cached."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2019-06-30 14:10:44",
    "text": "That’s cool, It’s not a major issue anyway, it was just a thought when I came to that particular problem. And it’s only for that very particular situation that using the cachebuster after clicking wasn’t an option."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-06-30 20:15:54",
    "text": "silly question, is there a way to force a trailing slash to all urls in HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-06-30 20:23:41",
    "text": "might be able to do something clever in the url redirects manager, whether that’s a good idea, idk"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-06-30 20:24:16",
    "text": "meh"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-06-30 20:24:21",
    "text": "but thanks"
  }
]