[
  null,
  {
    "text": "Has anyone else come across this error message when creating more than 1 Deal Pipeline (*Multiple Pipelines are NOT Available in HubSpot Sales Enterprise with the Salesforce Integration activated), in your Deal Settings with HS Enterprise Sales Hub with Salesforce Enterprise Integration?",
    "time_stamp": "2019-01-22 07:24:28",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-01-22 07:26:59"
      },
      {
        "time_stamp": "2019-01-22 07:46:14"
      },
      {
        "time_stamp": "2019-01-22 07:51:28"
      },
      {
        "time_stamp": "2019-01-22 07:59:25"
      },
      {
        "time_stamp": "2019-01-22 08:23:44"
      },
      {
        "time_stamp": "2019-01-22 08:54:56"
      },
      {
        "time_stamp": "2019-01-22 08:55:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-01-22 07:26:59",
    "text": "Hey <@UFGHSSMB6> this is expected right now. The SFDC connector doesn’t support multiple pipelines.  This is something the team is working on and has a small beta out right now."
  },
  {
    "poster": {
      "poster_name": "Austin Wright",
      "poster_handle": "awright"
    },
    "time_stamp": "2019-01-22 07:46:14",
    "edited": {
      "time_stamp": "2019-01-22 07:49:03"
    },
    "text": "Hey <@UFBNA9K9A>, thanks for getting back to me. The main reason we need alternate pipelines is to separate our HubSpot Deals from our Salesforce Opportunities (Deals) that are bi-directional syncing in from HubSpot Enterprise Sales, Marketing &amp; Service, and have the admin rights to choose not sync the HubSpot deals to Salesforce (**i.e. more like “Selective Sync” for Deal Mappings under Salesforce Integration settings in HubSpot.) Thoughts?"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-01-22 07:51:28",
    "text": "You might need a third party connector as their isn’t an equivalent of an inclusion list for Deals to limit certain deals from syncing to SFDC."
  },
  {
    "poster": {
      "poster_name": "Austin Wright",
      "poster_handle": "awright"
    },
    "time_stamp": "2019-01-22 07:59:25",
    "text": ":+1: Thanks. I’ve looked into some, is there a particular one for managing “selective sync” for field mappings in HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-01-22 08:23:44",
    "text": "Scribe is typically the most flexible connector but Bedrock offers some more hand holding out of the box and can get the job done in 80% of the cases in my experience"
  },
  {
    "text": "<@UFBNA9K9A> Thanks for your help Zach! I will look into the flexible connector applications to try and resolve",
    "time_stamp": "2019-01-22 08:54:56"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-01-22 08:55:21",
    "text": "Great movie!"
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-22 13:30:05",
    "text": "I have spots of knowledge that are missing. For instance, I created a node app that will update forms from my command line. I did this to test things out a bit.\n\nWhat i want to do is create a custom form (custom design and actions) on a HubSpot landing page. This needs to update the form with api and redirect to send the data either POST or GET to the next information page it is redirected to.\n\n\nSo my question is how do I use HubSpot to access the api? Do I just use a HubSpot javascript file? Also, what is the method to access the api? vanila javascript or jquery? Any examples of this anywherE?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-01-23 07:33:30"
      },
      {
        "time_stamp": "2019-01-23 07:33:58"
      }
    ]
  },
  null,
  null,
  null,
  null,
  null
]