[
  {
    "poster": {
      "poster_name": "Aaditya S",
      "poster_handle": "aaditya"
    },
    "time_stamp": "2022-11-02 04:03:22",
    "text": "Hi\n\nI’ve created two forms one with styling and one without and am noticing that the one with styling doesn’t broadcast the global form events, is there something I’m missing?\n\n<https://legacydocs.HubSpot.com/global-form-events>\n\nhere are two sandboxes with both the examples\n<https://jsbin.com/wihavok/edit?html,js,console,output>\n<https://jsbin.com/yateqir/edit?html,js,console,output>"
  },
  {
    "poster": {
      "poster_name": "Charanyan V",
      "poster_handle": "chara"
    },
    "time_stamp": "2022-11-02 09:16:44",
    "text": "Hi folks, an update on this would help us unblock our customers who depend on this event. We're currently working around this by switching to the HTML form for our customers and the styling is taking quite a while."
  },
  {
    "poster": {
      "poster_name": "Valentin Penisson",
      "poster_handle": "vpenisson"
    },
    "time_stamp": "2022-11-02 10:44:52",
    "text": "Hello all, regarding the new CRM card this is super easy to add things like image, text etc. Do you know if this is possible to add charts or we can only use the pre-defined types ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-11-02 10:50:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-02 10:50:15",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1667407556738219>"
  },
  {
    "poster": {
      "poster_name": "Jonathan Freihofer",
      "poster_handle": "jonathanf"
    },
    "time_stamp": "2022-11-02 18:14:30",
    "text": "Does anyone have experience with this React HubSpot hook? <https://www.npmjs.com/package/react-HubSpot-tracking-code-hook>\nI still need some help capturing custom properties for contacts. I'm sending an object as a second argument for setIdentity() and the values are not appearing in the HubSpot contact list. Could use some direction, I did verify that the property names matched the internal names, and that the object has values before sending onSubmit. Been stuck on this for a while not able to find much help. Thanks in advance"
  }
]