[
  {
    "text": "Hello, I'm working on a website where we are using the languageswitcher of HS. Default there is only a globe icon, without the active languague. I'm wondering if it's possible to achieve this as like on <https://www.HubSpot.com/>.",
    "time_stamp": "2018-05-18 01:53:23"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-18 08:11:46",
    "edited": {
      "time_stamp": "2018-05-18 08:20:28"
    },
    "text": "anyone interested in taking on a difficult client? we’re considering referring a client to someone else because we’re not sure we want to take on their next project. What to expect: \n\nClient has a difficult time understanding responsive design but insists on doing the design work in house. You will likely have to do a lot of teaching.\n\nClient has a tendency to make accusations. If something goes wrong, whether it’s a HS issue, or just they don’t understand something, they often will send messages accusing someone of doing something wrong.(I’d compare it to if you’re the tech savvy person in your family, and your not tech savvy relative uses a computer, if they don’t know how to do something, or run into a problem it’s your fault, despite you not being involved. That kind of thing)\n\nThey already have a HS COS site, currently on DM1. I don’t think they will want a full redesign atleast for another few years. What they are more looking for is more like a maintainer person - someone to build landing page templates, and create modules for them."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-05-18 09:26:19",
    "text": "Open to having a conversation with them to assess fit",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-05-18 09:41:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-05-18 09:27:13",
    "text": "As the primary HubSpot resource on our team, I think that adding another difficult client to our repertoire without proper backup would be foolhardy"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-05-18 09:27:22",
    "text": "Appreciate the offer though"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-18 09:41:03",
    "text": "Our team is still making a final decision(basically voting) on whether we want their next little project(odds are that it’s a no), I will let you know right away.\n\nSince we built their current HS site, I would give you a run down on how we did things and whatnot."
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2018-05-18 10:33:22",
    "text": "What is the best way to add help text to an image module"
  },
  {
    "poster": {
      "poster_name": "Jonathan Pavoni - Level 9",
      "poster_handle": "jonathanpavoni"
    },
    "time_stamp": "2018-05-18 10:33:57",
    "text": "I wanted to get in there suggested pixel dimensions for the page level users"
  },
  {
    "poster": {
      "poster_name": "Alex Girard",
      "poster_handle": "alexg"
    },
    "time_stamp": "2018-05-18 10:35:50",
    "text": "Hi all, Just a quick update that we've added a find and replace toolbar in the code editor of the new design manager. We've updated this blog post to include some more information on this update <https://designers.HubSpot.com/blog/keyboard-shortcuts-for-cms-development-efficiencies>."
  },
  {
    "time_stamp": "2018-05-18 10:44:45",
    "text": ""
  },
  {
    "poster": {
      "poster_name": "Colleen Cooney",
      "poster_handle": "ccooney"
    },
    "time_stamp": "2018-05-18 13:36:47",
    "text": "is there’s a way to see how many people received the resubscription email? i’m curious to know if a large number of contacts or only a small number of contacts have seen it."
  }
]