[
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2018-05-23 10:41:48",
    "text": "So.  How is everyone dealing with GDPR compliance.  I thought I had an efficient process in place for our clients, but upon testing, it doesn't seem so efficient anymore.\n\nHere was the planned process:\n\n1. Create a list of all european contacts.\n2. Send that list an email notifying of GDPR compliance and providing them with a form including \"Notice and Consent/Legitimate Interest (GDPR) fields so they can opt in.\n3. Immediately after sending this opt in email to that list, opt all list users out of email communication.\n\nProblems: after opting a user out of email communication, merely submitting the form with the \"I agree to communications\" checkbox ticked does not opt that user back in; they need to access a subscription preferences page and re-opt in."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-05-23 10:45:39",
    "text": "Could you use a workflow to update the user subscription preference based on the value of that \"I agree to communications\" checkbox?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-23 10:50:43",
    "text": "I thought HubSpot had some sort of double opt in type thing"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-05-23 10:50:57",
    "text": "They do have a new tool for the GDPR"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2018-05-23 10:51:23",
    "text": "I'm having trouble figuring out how to trigger that workflow.  <@U26BLKGE4> updating that value doesn't actually update a contact property"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2018-05-23 10:54:00",
    "text": "oh wait... it does seem to update a contact property called \" Legal basis for processing contact's data\""
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-05-23 11:00:38",
    "edited": {
      "time_stamp": "2018-05-23 11:00:47"
    },
    "text": "For anyone with GDPR questions, I would recommend checking out this \"playbook\" page which talks about all of the capabilities we built -- <https://www.HubSpot.com/data-privacy/gdpr/HubSpot-product-playbook>"
  },
  {
    "poster": {
      "poster_name": "Chandler Ives",
      "poster_handle": "cives"
    },
    "time_stamp": "2018-05-23 11:17:20",
    "text": "Hi all – wondering if it is possible to use a CTA Hubl reference within a custom module with boolean logic. I have a custom module that lets the end user check off which content offer they want to see on a blog post (within this offer there is a CTA that says, \"yes please\") this then takes you to a landing page... Only problem is when you use the embed CTA code, HubSpot does not properly track analytics on the CTA"
  },
  {
    "poster": {
      "poster_name": "Chandler Ives",
      "poster_handle": "cives"
    },
    "time_stamp": "2018-05-23 11:18:00",
    "text": "example post: <https://www.calypso.agency/blog/how-to-excel-at-your-next-media-interview> (see bottom of post) square content offer that says The Essential Guide to Preparing Your Brand for Crisis"
  },
  {
    "text": "If someone goes to the email preferences/subscription page and checks the box for the blog emails, which blog email are they getting subscribed to (daily, monthly, etc)? Right now, I don’t think they’re getting any of the blog emails even if they check this box. Can someone shed some light on how this checkbox connects to the blog emails?",
    "time_stamp": "2018-05-23 12:26:05"
  },
  {
    "poster": {
      "poster_name": "Ariel Luque",
      "poster_handle": "aluque"
    },
    "time_stamp": "2018-05-23 12:47:07",
    "text": "Question for you all. How often do you use static text in your custom modules?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-23 12:59:06",
    "text": "almost never, I try to make it so text is always changeable by the people in the page editor"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-05-23 13:04:39",
    "text": "I’ll do that on occasion if it’s a module used on a non-editable page like the blog listing."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-05-23 13:07:48",
    "text": "Or if the client, when given the ability to change copy on a page, goes mad with power and starts using the backend for evil and despotic purposes."
  },
  {
    "poster": {
      "poster_name": "Scott Burton",
      "poster_handle": "scott.burton"
    },
    "time_stamp": "2018-05-23 17:41:50",
    "text": "^ as with most content, \"it depends\"...."
  }
]