[
  {
    "poster": {
      "poster_name": "Barry Grennan",
      "poster_handle": "barry"
    },
    "time_stamp": "2022-07-07 06:34:21",
    "edited": {
      "time_stamp": "2022-07-07 06:37:16"
    },
    "text": "Hi Ryan. I've only done one Custom Quote template and it's a little while back now, last year maybe (what is time anymore??). I think it's still in Beta so chances are bits and pieces have changed since then.\n\nAnyway, there's a forum for it here: <https://community.HubSpot.com/t5/Custom-Quote-Template-Beta/gh-p/cpq-beta>\n\nThere's also documentation on the variables: <https://developers.HubSpot.com/docs/cms/hubl/variables/quotes>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-07-07 09:16:26",
    "edited": {
      "time_stamp": "2022-07-07 09:17:41"
    },
    "text": "If I delete a folder from design manager that has files that have live dependents, do those assets break immediately on the live dependents, or are they cached for a period of time? If so, how long?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-07-07 09:35:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-07-07 09:35:14",
    "text": "I don’t know if it also applies to images, but in my opinion it is the case that modules no longer work on live pages…. But that was also before themes when i had this issue, so this might have changed"
  },
  {
    "text": "hey everyone! I’m trying to import customer data and one of the columns in my spreadsheet has true/false values for “unsubscribed from all email” property. However, HubSpot does not accept it because apparently it’s a read-only property. Is there any way to get this data in without importing unsubs as a suppression list?",
    "time_stamp": "2022-07-07 11:11:24"
  },
  {
    "poster": {
      "poster_name": "Test",
      "poster_handle": "vic"
    },
    "time_stamp": "2022-07-07 14:02:52",
    "text": "Hi everyone! I'm trying to make a contact record in an event. Does anyone know what values are accepted in the 'subscriberState' field? I'm sending a string with only the word 'subscribed' and the documentation says a string value is allowed. Any ideas?\n`{\"status\":\"error\",\"message\":\"Unknown state for 'subscribed'\",\"correlationId\":\"4e4b270b-2df3-4fb5-b067-27fd37765e78\"}`"
  },
  {
    "poster": {
      "poster_name": "Laura Evans",
      "poster_handle": "laura146"
    },
    "time_stamp": "2022-07-07 14:54:49",
    "text": "Can anyone help me with a project? I have an app survey that I have connected to HubSpot through the API and want to test in Postman: So we would send either of the following:\n\n{\n“objectTypeId”: “0-1\",\n“name”: “residential_pool_pro”,\n“value”: “residential_pool_pro”\n}\n{\n“objectTypeId”: “0-1\",\n“name”: “commercial_pool_pro”,\n“value”: “commercial_pool_pro”\n}\n{\n“objectTypeId”: “0-1\",\n“name”: “distributor”,\n“value”: “distributor”\n}\n{\n“objectTypeId”: “0-1\",\n“name”: “homeowner”,\n“value”: “homeowner”\n}\n\nTest it in Postman if values will arrive and be updated in the contact record in HubSpot"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin-tekpartners"
    },
    "time_stamp": "2022-07-07 15:49:04",
    "edited": {
      "time_stamp": "2022-07-07 15:55:59"
    },
    "text": "I assume we’re able to view page analytics for dynamic HubDB generated child pages like we would be able to if they were normal pages? For instance, we have a HubDB dynamic page with slug `some-dynamic-listing` and we want analytics from one of its subpages, i.e. `some-dynamic-listing/example-1`? Can anyone confirm/deny, and tell me how to access them? Thanks.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-08 12:51:09"
      },
      {
        "time_stamp": "2022-07-08 12:51:24"
      },
      {
        "time_stamp": "2022-07-08 21:54:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Gabby Taborada",
      "poster_handle": "ryant"
    },
    "time_stamp": "2022-07-07 16:02:45",
    "text": "Thanks! Will check out the community. Everything works fine so far. I just wanted an added feature - adding fields that users can input data and have that data be displayed when the quote is downloaded into PDF."
  },
  {
    "poster": {
      "poster_name": "Ashleigh Gvero",
      "poster_handle": "agvero"
    },
    "time_stamp": "2022-07-07 16:10:06",
    "edited": {
      "time_stamp": "2022-07-07 16:11:52"
    },
    "text": "I am working with HubSpot serverless functions and am having trouble with being able to renew a 3rd party oAuth token at a set interval since the token exipres every 30 min. I can generate my token once just fine but if I try to add anything like a javascript setinterval in my function that generates my token, I get the following errors in the hs logs:\nUNHANDLED_ERROR - Execution Time: 575msTypeError: Callback must be a function. Received ‘getToken()’\n\nmy question is how can I make it so that my oAuth script runs every 30 min so that I can use my serverless function to pass along that third party token to where I need it to go?"
  },
  {
    "poster": {
      "poster_name": "Test",
      "poster_handle": "vic"
    },
    "time_stamp": "2022-07-07 17:27:00",
    "text": "Hello everyone. I'm adding subscribers to marketing events with email-upsert, everything looks fine, I don't get any errors, but when I make a POST request, it throws a 202 response and no error is shown. Any solution?"
  }
]