[
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-07-31 01:45:55",
    "edited": {
      "time_stamp": "2022-07-31 01:48:26"
    },
    "text": "<@U033VNNBBBP> Contacts data are privat data and under data protection. In Europe it is the *GDPR-Policy* (DSGVO), but in the United-States I think you have similar laws, that doesn't allow you to publish private user data, especially if the data collected within a web page.\n\nIn your case, the use of the *Contact-CRM-Object* is only valid from Membership functionality, and part of the Enterprise Edition. That is mean by \"privat\". If you want to provide unrestricted data access, use the *HubDB*, it's public, easy to use and well documented.\n\n_(I am not making any legally binding statements here! This is just a hint: In Europe you mostly need a signed non digital contract with the persons before you can publish the private data without their knowledge; even if its data from your employees. Without a contract you have to make sure, that the user agree before the data get published. Speak with a lawyer or a data protection officer. HubSpot has full support for GDPR and you can configure it very strict.)_"
  },
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2022-07-31 06:49:05",
    "text": "Thank you for your answer. What I wanted to achieve is, if someone fills out a form all the names are shown from the people who already filled out the form. The idea behind is an event registration that means everybody can see publicly who already signed up for that event. "
  },
  {
    "poster": {
      "poster_name": "Jeff",
      "poster_handle": "jmorris"
    },
    "time_stamp": "2022-07-31 14:04:01",
    "text": "Does anyone know how to sort an RSS feed that comes from a blog post?"
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-07-31 22:56:51",
    "edited": {
      "time_stamp": "2022-07-31 22:58:03"
    },
    "text": "Sounds like a use case for *custom objects*: <https://knowledge.HubSpot.com/crm-setup/use-custom-objects>\n\nYou can copy a contact property into a custom object within a workflow. And try to output the custom object properties on the web page. And I suggest you add a boolean checkbox for the subscription form, as an optional agreement. So that the user can decide to be on the list. If the user disagree you can list that person as \"unknown\", to show the number of participants.\n\nAnd check the marketplace there are helper tool for custom objects available."
  }
]