[
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-07-21 04:02:11",
    "edited": {
      "time_stamp": "2022-07-21 04:02:59"
    },
    "text": "A client of ours is on the Marketing Pro plan, so we have most of the features to build a website for them inside HubSpot. The only thing which is not ‘possible’, is to use the Website Pages without the HubSpot brandmark on the bottom of each page. But those pages could also be build using the Landing Pages.. So could someone explain me the difference between using Landing Pages instead of Website Pages? For me its looks like the same and we could just build the whole site using Landing Pages\n\ntldr; Why should someone build their website using Website Pages instead of Landing Pages, which looks like exactly the same.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-07-21 10:22:55"
      },
      {
        "time_stamp": "2022-07-21 10:23:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Wayne Mareci",
      "poster_handle": "wayne786"
    },
    "time_stamp": "2022-07-21 06:53:22",
    "text": "Anyone have a clue as to where the brandsettings file is located? I'm new here, so feel free to direct me to the appropriate channel."
  },
  {
    "poster": {
      "poster_name": "Yankun Ye",
      "poster_handle": "yankun"
    },
    "time_stamp": "2022-07-21 07:12:41",
    "text": "Hi everyone! I've a question about the API app verification (specially redirect url). Has any idea in which channel I can slack? Thanks."
  },
  {
    "poster": {
      "poster_name": "Rafael Cunha",
      "poster_handle": "rafael970"
    },
    "time_stamp": "2022-07-21 09:01:21",
    "text": "Hi there, im have installed the HubSpot tracking code on a react website, how can i identify contacts by email ? Im trying to use the follow code, but its not working :\n```var _hsq = window._hsq = window._hsq || [];\n_hsq.push([\"identify\",{\n    email: \"<mailto:rafaelcunhateste@gmail.com|rafaelcunhateste@gmail.com>\"\n}]);```",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-07-22 05:24:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-07-21 10:22:55",
    "text": "Landing pages live on a subdomain (like <http://pages.domain.com|pages.domain.com>) whereas a website is on the root domain.\n\nLanding pages are focused on conversions as they are usually a single page for an ad or offer. Website pages are generally better for SEO as your root domain _may_ rank better than a subdomain.\n\nOtherwise it can be ease of use - a website will automatically have an information hierarchy. Menus can be made for landing pages, and if it’s a small site that could work still."
  },
  {
    "poster": {
      "poster_name": "Amber Behring-Wojcek",
      "poster_handle": "awojcek"
    },
    "time_stamp": "2022-07-21 10:23:40",
    "text": "Really it’s mostly looking at the future - if they later change from a LP structure to a website, then they’ll lose all their historical website data"
  },
  {
    "poster": {
      "poster_name": "Timothy Purdy",
      "poster_handle": "timothy"
    },
    "time_stamp": "2022-07-21 15:42:37",
    "text": "Has anyone gotten emails about being selected for the Theme Accelerator Program yet?"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2022-07-21 16:05:58",
    "text": "Hey guys, I have a blog post template that is pretty unique and uses a LOT of added \"fields\" for displaying certain elements on the page and in blog modules. They are in the template like this:\n\n`{% module \"field_name\" path=\"@HubSpot/text\", label=\"Field Name\", value=\"Some default value\", export_to_template_context=True %}`\n\nIt's all working nicely. However, due to the amount of these fields, the left panel on the edit screen has a looong list of modules. Some will not always be needed. Is there a way to group these modules into sections that can be opened and closed to clean up that panel a bit?",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-07-21 16:06:57"
      },
      {
        "time_stamp": "2022-07-21 16:07:58"
      },
      {
        "time_stamp": "2022-07-21 16:13:40"
      },
      {
        "time_stamp": "2022-07-22 11:21:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Timothy Purdy",
      "poster_handle": "timothy"
    },
    "time_stamp": "2022-07-21 16:06:57",
    "text": "I definitely want to know the answer to this as well"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-07-21 16:07:58",
    "text": "i had this in a previous project and solved it with a grouping the fields in the custom module that contained them as well as leveraging display conditions"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-07-21 16:13:40",
    "text": "Yeah, using a custom module is the answer. No other way."
  }
]