[
  {
    "poster": {
      "poster_name": "Villa Skaar",
      "poster_handle": "ju"
    },
    "time_stamp": "2023-09-20 04:49:34",
    "text": "Hi all - need help from a developer here to apply some code to our custom themes. HubSpot made these for us back in the day before mobile editing was available. I need to apply repsonsive breakpoints to the themes we have so we can adjust the tablet and mobile view as the text and photos on a few landing pages are flowing into each other.\nHave no idea how this all works so if someone wants the job then please reach out so we can agree on a plan to get this done.\nIf I have posted in the wrong place then I apologise - as you understand I am a front end user that has no idea how the backend world works.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-20 06:34:07"
      },
      {
        "time_stamp": "2023-09-21 09:41:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-09-20 06:34:07",
    "text": "We can help with some dev work. Send me a message and we can discuss."
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-09-20 06:37:51",
    "text": "You, or your client, can go to any section while adding a page and Save that section. It takes a screenshot and you can give it a name and description. However, you can not edit these later. The best way is to create section templates in your theme. You have a folder for /templates and a folder for /modules... you need a folder called /sections. Inside here you would create a HTML template, just like theme page templates, except it's only the code of one section. The commented area at the top of this file should contain:\n\ntemplateType: section\n\nIt also has label, description, etc, like page templates. You can find more details here:\n<https://developers.HubSpot.com/blog/how-to-create-a-section-template-in-the-cms-hub>"
  }
]