[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-09-13 09:25:30",
    "text": "Is there any way to prevent HubSpot from down-scaling/optimizing images in the CTA banners? It just makes them look more blurry.",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-09-13 13:43:42"
      },
      {
        "time_stamp": "2023-09-13 14:10:58"
      },
      {
        "time_stamp": "2023-09-13 15:33:04"
      },
      {
        "time_stamp": "2023-09-14 20:40:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-09-13 13:43:42",
    "edited": {
      "time_stamp": "2023-09-13 13:43:58"
    },
    "text": "I forget you can set the optimization level directly on the image in the file manager. This still didn’t work to make it not appear blurry, in the previewer and editor, but published in production it isn’t blurry."
  },
  {
    "poster": {
      "poster_name": "Sasha Sosin",
      "poster_handle": "sasha"
    },
    "time_stamp": "2023-09-13 14:01:51",
    "text": "<@U03ADFUTHDW> did you ever figure this out? I'm struggling here."
  },
  {
    "poster": {
      "poster_name": "Sasha Sosin",
      "poster_handle": "sasha"
    },
    "time_stamp": "2023-09-13 14:04:18",
    "text": "Aw, <@U03KAK3R4GY> you just saved my life. I've been pulling my hair out for days trying to get this to work. Can't believe it's because of a typo :face_palm:"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-09-13 14:10:58",
    "text": "I’m not sure if this is applicable in the specific context you’re referring to, but in general, the blurriness on high-DPI screens is temporary. It takes some time to process and generate all of the different optimized image sizes and formats, so only the 1x variant is available immediately after publishing.\n\nIn every case I’ve encountered, images should appear sharp again after ~5 minutes, sometimes a bit longer.\n\nI’m not a heavy user of CTA functionality though, so it’s possible that this doesn’t apply there."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-09-13 15:33:04",
    "edited": {
      "time_stamp": "2023-09-13 15:36:50"
    },
    "text": "I’ve actually never noticed that before, thanks for the info! I think that’s probably the case here as well. EDIT: Although, it has beens hours in this case, and still seems to be blurry in the editor and previewer (with cache cleared), but looks fine launched and live on a page."
  }
]