[
  {
    "poster": {
      "poster_name": "Nikita Alexandar",
      "poster_handle": "nikita591"
    },
    "time_stamp": "2020-12-12 03:43:24",
    "text": "Hey, Everybody!\nIt is also first time for me to communicate with you guys here.\nI am also one of the developers who are using HubSpot APIs for our business website.\nIn the recent days I am facing one of the problem which I am not able to solve.\n\nMy problem is...\n• CRM Contact is created via API\n• After creating contact, assign an engagement(type is `TASK`) to an existing contact\n• The assigner will review the contact and will update the reviewing contact's property from the old value into the new value\nAt the moment when reviewer/assigner updates the reviewing contact property value, I am going to send an transactional email to the specific reviewing contact's email address\nAnd the email contact will be dynamic, that is, it can include some kind of link with any kind of specific value in it.\n\nHow can I do that?\nI already researched and I found there are some automation tools like `Sequence` or `WorkFlow`\nBut not able to send the dynamic email content via these tools\nIf anybody knows the way, please help me~!\nThanks",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-12-12 05:15:23"
      },
      {
        "time_stamp": "2020-12-12 05:53:41"
      },
      {
        "time_stamp": "2020-12-12 06:03:03"
      },
      {
        "time_stamp": "2020-12-12 11:12:14"
      },
      {
        "time_stamp": "2020-12-17 15:53:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2020-12-12 05:15:23",
    "text": "Hi, this is not an API question. You are looking in the right direction with Workflow.\n\nTo do what you want to do, you need to create a new email which will use a `Personalization Token` to add the dynamic content to the email. Then add that email as available for Workflows.\n\nThen you create a workflow, trigger is how you want to and when it’s sent the token will be replaced with the right value based on the contact."
  },
  {
    "poster": {
      "poster_name": "Nikita Alexandar",
      "poster_handle": "nikita591"
    },
    "time_stamp": "2020-12-12 05:53:41",
    "text": "Hi <@UCBDLK6SU> Thank you for your kind response, and I am much appreciated with that.\n\nI totally understand about your above approach and it should absolutely work.\nHowever, still in order to satisfy what I want to do, there are small problems.\n\n• If I follow your approach, I only am able to insert the contact property values, but I really would like to send another kind of dynamic content like `authorization_token` .\n       For example, user is going to signup to our platform, and after user signs up, we should send the confirmation email to the users. On the email, we will send the confirmation link including access_token.\n\n        In that case, how can I do?\n\n• I saw on the WorkFlow, there is an other option to call webhook event as a trigger.\nWhen I looked at this webhook option, there is no way to send param values to the endpoint.\nHow can we send the request param values to this POST webhook event api?"
  },
  {
    "poster": {
      "poster_name": "Nikita Alexandar",
      "poster_handle": "nikita591"
    },
    "time_stamp": "2020-12-12 06:03:03",
    "text": "cc to <@U01E6Q1958A>"
  },
  {
    "poster": {
      "poster_name": "Deep",
      "poster_handle": "deep"
    },
    "time_stamp": "2020-12-12 11:12:14",
    "text": "cc: <@U01EZ962GMN>"
  },
  {
    "poster": {
      "poster_name": "Carl Bateson",
      "poster_handle": "cbateson"
    },
    "time_stamp": "2020-12-12 12:44:36",
    "text": "Hey everyone - quick question. I did have a look on the community forums but couldn’t find my answer.\n\nI’ve been using the Owners API to look up owners which identifies the HubSpot users (who aren’t just owners) by having the `userId` field populated. Is there any way I can get more info about that user? Or is everything held within the owners api and that id is just internal? Any info would be great… thanks :)",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-12-17 15:55:00"
      },
      {
        "time_stamp": "2021-09-23 13:55:46"
      }
    ]
  },
  {
    "text": "Hello Everyone! I'm currently trying to get OAuth access tokens and i get getting this error. Does anyone know any tips on how to fix this? const REDIRECT_URI = '<http://localhost>:${PORT}/oauth-callback ';",
    "time_stamp": "2020-12-12 15:30:46",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-12-14 12:37:44"
      },
      {
        "time_stamp": "2020-12-17 15:56:35"
      }
    ]
  }
]