[
  {
    "poster": {
      "poster_name": "Manosij Roy Chowdhury",
      "poster_handle": "manosij"
    },
    "time_stamp": "2020-12-24 11:44:32",
    "edited": {
      "time_stamp": "2020-12-24 11:48:06"
    },
    "text": "Hey Guys, working on the Marketing Events API. Got a little confused making an app for marketing events. My understanding after going through the updated developers documents in HubSpot, I did not understand if I need to create an APP configured if I have all my marketing events created from HubSpot itself.\n\nIf I have already created the marketing events through HubSpot and then try to do a subscriber state change, the HubSpot will surely able to find the marketing event inside the HubSpot itself. I am not sure, in that case, does it make sense to configure an APP, set the target URL and to make an API just to make the same GET marketing-events API call??\n\nAlso, I did not understand how do we track a contact if he/she has regirtered for a marketing events? Will it be achieved internally by HubSpot when a Subscriber state change is trigerred? Or is it like we need to configure another app for showing up a customized  CRM card",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-12-24 12:04:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Manosij Roy Chowdhury",
      "poster_handle": "manosij"
    },
    "time_stamp": "2020-12-24 12:04:32",
    "text": "<@U01E6Q1958A>"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2020-12-24 12:40:25",
    "edited": {
      "time_stamp": "2020-12-24 12:42:20"
    },
    "text": "Google is telling secrets about what's coming in the API...\n<https://developers.HubSpot.com/docs/api/settings/user-provisioning>\n\nI'm hoping that the /settings/ will include some other choices such as the ability to set currency conversion rates as well as the ability to set some user settings such as signatures which we maintain centrally and would really like to be able to programmatically set.\n\nAny chance of getting the password for this page? :slightly_smiling_face:"
  }
]