[
  {
    "poster": {
      "poster_name": "Sharvil Khamkar",
      "poster_handle": "skhamkar"
    },
    "time_stamp": "2020-12-29 01:52:29",
    "text": "Or for that matter, for any apis like blogs and web pages, is there a way to get a list of only a few limited list of keys in the response json rather than the content?"
  },
  {
    "poster": {
      "poster_name": "Steve Newton",
      "poster_handle": "steve.newton"
    },
    "time_stamp": "2020-12-29 03:42:53",
    "text": "I have webhooks configured, but subscribed to creation and changes, the behaviour is odd.  If I create a contact as an example, it doesn't call my webhook once, it calls it multiple times with different property changes in each.  Even changing the throttling down to 1 per second doesn't help and is very difficult to deal with.  As creating a contact is one activity, surely it should call the webhook once or in other words once per user pressing save?  It doesn't even mark them as create, it has one create event and every property is change, but over several calls, so the third call could be a create and already processed the changes (which would fail).  As it stands, I am going to have to write a whole heap of code on the server side code to deal with this seemingly odd approach."
  },
  {
    "text": "How are these types of UI elements created ? Are they using Custom Objects?",
    "time_stamp": "2020-12-29 09:20:13",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-12-29 09:22:57"
      },
      {
        "time_stamp": "2020-12-29 09:23:22"
      },
      {
        "time_stamp": "2020-12-29 09:41:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lance Erickson",
      "poster_handle": "lance.erickson"
    },
    "time_stamp": "2020-12-29 09:22:57",
    "text": "<https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards>"
  },
  {
    "poster": {
      "poster_name": "Lance Erickson",
      "poster_handle": "lance.erickson"
    },
    "time_stamp": "2020-12-29 09:23:22",
    "text": "Is what it looks like to me."
  },
  {
    "poster": {
      "poster_name": "Niraj Shah (pandaflow.​io)",
      "poster_handle": "niraj"
    },
    "time_stamp": "2020-12-29 09:41:36",
    "text": "Thanks Lance. I will take a look at this."
  }
]