[
  {
    "poster": {
      "poster_name": "Karen Dasprez",
      "poster_handle": "kdasprez"
    },
    "time_stamp": "2020-03-09 10:43:07",
    "text": "<@UD5NW4PJ5> Worked great to exclude the global footer. Could you please let me know how to exclude certain web pages from the HubSpot search?  Thx!"
  },
  {
    "poster": {
      "poster_name": "Kacper Adach",
      "poster_handle": "kadach"
    },
    "time_stamp": "2020-03-09 10:46:31",
    "text": "You can either block the pages in your robots.txt file for the user-agent `HubSpotContentSearchBot` or add an html `&lt;meta name=\"robots\" content=\"noindex\"&gt;` tag to the page."
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-03-09 12:37:01",
    "text": "If the language switcher would go to other, published versions of that page you’ll be able to see it work in the Preview of the page. But if both versions are unpublished, I don’t think it will function.\nYou could use a system domain - you’d need to first make it a “secondary” domain, then you’ll see it as an option in the drop-down of the URL editor for that page: <https://knowledge.HubSpot.com/cos-general/display-system-subdomains-in-your-domain-manager>"
  },
  {
    "poster": {
      "poster_name": "Steve Kanter",
      "poster_handle": "steve.kanter"
    },
    "time_stamp": "2020-03-09 17:20:37",
    "text": "not 100% sure which channel this best belongs in. I’m creating page templates dynamically via the API. I’m also looking to upload assets via the API to have as the default assets to be used by that template, though ultimately want them to be editable via the CMS. should those assets go into the File Manager or into the Design Tools, and thus use the appropriate API for that? are there benefits to serving assets from one vs the other?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-03-10 07:17:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Karen Dasprez",
      "poster_handle": "kdasprez"
    },
    "time_stamp": "2020-03-09 22:13:57",
    "edited": {
      "time_stamp": "2020-03-09 22:14:16"
    },
    "text": "<@UD5NW4PJ5> Thank you. Is it possible to get a count of the search results?  In other words, we'd like to display the # of results for the search.  Thx for all your help!"
  }
]