[
  {
    "poster": {
      "poster_name": "Holland Dotts",
      "poster_handle": "holland.dotts"
    },
    "time_stamp": "2020-03-04 12:11:25",
    "text": "<@U6W3H6YN8> - I realize this post is a couple years old, but I have a somewhat related question and this is the best place in HS's Slack that I've found to ask...\n\nI'm trying to find out what options are available for pulling HubSpot Blog Feature Images into WordPress (so pretty much the opposite of what you're talking about, lol). We maintain our blog with HubSpot, but run our site with WordPress. At the moment, all I'm looking to do is pull in the 3 most recent  blog post titles and feature images (as thumbnails) to display in a \"Recent Posts\" section on the homepage.\n\nIs there a recommended plugin for this, or best practice? I imagine this is somewhat common, but I'm having trouble finding any helpful info. Any recommendations would be much appreciated. Thanks guys!"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2020-03-04 12:28:55",
    "text": "Does anyone know where I can see page revisions in the new website page builder? I don't see the option to click out of beta anymore and I'm not sure where that feature/functionality is now."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-04 12:29:30",
    "text": "i think it is in the top left side somewhere"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2020-03-04 12:30:20",
    "text": "Ah! Found it - you have to hover on \"autosaved\" and then a link appears with revisions"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2020-03-04 12:30:26",
    "text": "Thanks <@UBT0AHWLD>"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-04 12:30:32",
    "text": "yep"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-03-04 12:30:37",
    "text": "no problem"
  }
]