[
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2020-03-27 08:32:29",
    "text": "This will work. Just note that you can’t proxy from Cloudflare to HubSpot because Cloudflare doesn’t support proxying to itself."
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2020-03-27 08:43:41",
    "text": "<@U22PJPGK0> Can you clarify that? In practical terms what will that affect? Will <https://www> redirect to https:// without the security warning? I apologize for my ignorance."
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2020-03-27 08:48:07",
    "text": "redirects work fine. You just can’t proxy (no redirect in the browser)"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-03-27 13:31:35",
    "text": "Right, multi-language pages have been around since 2016, but the drop-down language selector in the Settings of the editor was rolled out in February.\n\n<@U25PYL3Q8>  it sounds like you’re trying to get rid of an extra language option that’s appearing in your site’s language menu (en-uk?), is that right?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 14:45:49",
    "text": "yeah <@UGY22E2KC> -- we unpublished the pages and they still show up"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 14:46:12",
    "text": "I have it hidden with js/css because we unpublished them all, but its only a temporary work around"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-03-27 14:55:56",
    "text": "Hm… I haven’t been able to reproduce that (unpublishing a page in one language (the only page of that language) and seeing that language stick around in the language picker). I did notice that it took a couple of minutes to update and I had to clear my cache, but I’m betting you probably already checked that stuff :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2020-03-27 14:58:34",
    "edited": {
      "time_stamp": "2020-03-27 14:59:06"
    },
    "text": "Correct me if I’m wrong, but it seems like there are two topics here, and it looks like the support chat was about one and not the other:\n1. The problem you’re seeing is English - United Kingdom is an option in your langauge picker even though you’ve unpublished all `en-gb` pages. \n2. You can’t un-set a language in the Settings of a page once a language has been set.\nLooks like the chat with Justine was about the language selector in Settings, but sounds like the real problem is the language picker holding onto `en-gb` as an option. Is that correct?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 15:10:21",
    "text": "It appears to have resolved itself from yesterday to today <@UGY22E2KC>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-03-27 15:26:55",
    "text": "\"Looks like the chat with Justine was about the language selector in Settings, but sounds like the real problem is the language picker holding onto `en-gb` as an option. Is that correct?\" as far as that statement goes, I was asking how to get it to not show up after unpublishing. I don't know anything about settings or where the language settings are. This is my first time using this stuff on HubSpot . (multi lingual)"
  }
]