[
  {
    "poster": {
      "poster_name": "Eelko Sterk",
      "poster_handle": "e.sterk"
    },
    "time_stamp": "2021-06-30 03:39:24",
    "text": "Hi everybody, I have a question about the API possibilities within HubSpot; I am trying to read a Street name from an external zip code api tool but is this even possible?\n\nIt's about the next endpoint\n<https://api.postcode.nl/documentation/rest-json-endpoint>\n\nSo I have to set up an APP within HS that handles the authentication\nand then be able to do a js reqeust on a form;\n\nIs this possible or can you only send HS data? I've been searching for a while now but keep coming back here <https://legacydocs.HubSpot.com/docs/overview>\n\ncan someone point me in the right direction?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:43:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott",
      "poster_handle": "scott.bremer"
    },
    "time_stamp": "2021-06-30 09:26:14",
    "text": "Hello everybody.\n\nI am trying to extract the prior day’s engagements in a nightly batch process. I’m using the v1 get recent engagements endpoint. What I would actually like is to get the engagements created during the prior day, and not the modified engagements - it seems that HubSpot updates records at random intervals which makes my extraction fail because the total number of records passes the 10,000 mark (it’s a small company, we may get 5% of that in a normal day).\n\nThere has to be a way to get this data without extracting all engagements and filtering out the ones I don’t want. I was wondering if any of you could share some insight. Thanks in advance!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:45:09"
      },
      {
        "time_stamp": "2021-10-28 09:36:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kelli Jost",
      "poster_handle": "kelli.jost"
    },
    "time_stamp": "2021-06-30 10:54:12",
    "text": "Hey all! Has anyone been able to successfully use the CRM API to import data with an association that is based on a foreign key and not the Company Id?\n\nI have a custom object, App Data, associated with Companies. The field app_id exists on both objects and is how I would associate the records. Below is what HubSpot support thought would work, but it does not. Instead it creates a new company record each time I run it.\n\nAny insight is appreciated. I've been spinning my wheels for days on this one.\n\n```\"ignored\": false,\n\"columnName\": \"app_id\",\n\"idColumnType\": null,\n\"foreignKeyType\": \"string\",\n\"propertyName\": \"app_id\",\n\"columnObjectTypeId\":\"0-2\",\n\"associationIdentifierColumn\": true```",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:46:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kelli Jost",
      "poster_handle": "kelli.jost"
    },
    "time_stamp": "2021-06-30 11:16:14",
    "text": "<@U019XAD5SFK> Were you ever able to get this to work? I'm running into a similar issue now and can't seem to find a solution. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Mike Rizzo (MarketingOps.com)",
      "poster_handle": "mikedrizzo"
    },
    "time_stamp": "2021-06-30 18:13:54",
    "text": "Is there a way to create a CTA via the HubSpot API? --- asking for a friend :stuck_out_tongue:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-06-30 18:14:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mike Rizzo (MarketingOps.com)",
      "poster_handle": "mikedrizzo"
    },
    "time_stamp": "2021-06-30 18:14:30",
    "text": "and get CTA's --- not their data just their ID's or information like \"TYPE\" etc."
  }
]