[
  {
    "poster": {
      "poster_name": "Christian",
      "poster_handle": "christian.petersson"
    },
    "time_stamp": "2021-06-08 01:10:55",
    "text": "<https://github.com/IssTech/HubSpot_update_exchange_rate>"
  },
  {
    "poster": {
      "poster_name": "Christian",
      "poster_handle": "christian.petersson"
    },
    "time_stamp": "2021-06-08 01:11:28",
    "text": "Here is the latest code, but I still missing a end-point from HS side to update the Exchange Rate information."
  },
  {
    "poster": {
      "poster_name": "Christian",
      "poster_handle": "christian.petersson"
    },
    "time_stamp": "2021-06-08 01:13:32",
    "text": "When I have a end-point from HS side I can then create a k8s container that you control how offend you need to update the currency."
  },
  {
    "poster": {
      "poster_name": "sahil dhiman",
      "poster_handle": "sahildhimansanour686"
    },
    "time_stamp": "2021-06-08 02:50:27",
    "text": "Hey Guys\nCan we use ajax method in custom form module to submit the data on HubSpot or is there any other way to post data after submit?"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2021-06-08 09:54:53",
    "text": "So I took a look through the code to see if I could figure it out. Up until we send the request of to Kafka to be processed we can garuntee the order. I don’t know enough about Kafka to know if it can preserve the order you sent it in so you <@U01QSRGBRPE> you may see some inconsistent behavior for which contact “wins” when sending multiple in the same batch"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2021-06-08 11:14:20",
    "text": "We don’t have anything for these types of webhooks in particular but I will pass this along to the team that owns it to see if adding this is feasible in the near term"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2021-06-08 15:55:39",
    "text": "yeah, and even if Kafka guarantees order, the order can be lost by the remote side tasks that extract from Kafka and push into the storage layer, if one of them hits a delay which the other one does not"
  },
  {
    "poster": {
      "poster_name": "Meggan Peters",
      "poster_handle": "mggnpeters"
    },
    "time_stamp": "2021-06-08 16:48:31",
    "text": "thank you for the reply. i was told that you have an existing API with other payroll companies to push &amp; pull data from HubSpot into the HRIS to eliminate duplication of information and data on the individual employees.....is that accurate?"
  },
  {
    "text": "It just says its a 404 error - what would you recommend? (I'm still new to JavaScript) Is there other debug output that I am missing?",
    "time_stamp": "2021-06-08 17:59:30"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2021-06-08 18:36:39",
    "text": "it looks like there are $ variables in the page that need to be given real values which are not being substituted... so then of course they 404 because they are not valid URLs by themselves"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2021-06-08 18:38:19",
    "text": "ah... employee provisioning... there is some recently added APIs for that... <https://developers.HubSpot.com/docs/api/settings/user-provisioning> and <https://developers.HubSpot.com/docs/api/crm/owners>"
  },
  {
    "poster": {
      "poster_name": "Matthew Hall",
      "poster_handle": "mhall"
    },
    "time_stamp": "2021-06-08 18:39:21",
    "text": "you'll have to code up some custom stuff, I have not personally used these yet but I want to do so relatively soonish"
  }
]