[
  {
    "poster": {
      "poster_name": "Jason Adams",
      "poster_handle": "jason475"
    },
    "time_stamp": "2020-05-13 07:18:45",
    "text": "When using the local development tools, I have all my files being watched and sync with my HubSpot portal. However, all of my files are nested inside of the theme folder, in another theme folder. For example, the main folder holding all my files has a folder in it, and that folder has all the same files, but that's the one that is syncing with my local machine. How do I get my files to sync to the root folder?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-05-13 07:23:11"
      },
      {
        "time_stamp": "2020-05-13 07:23:57"
      },
      {
        "time_stamp": "2020-05-13 08:35:24"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2020-05-13 07:20:22"
  },
  {
    "poster": {
      "poster_name": "Jason Adams",
      "poster_handle": "jason475"
    },
    "time_stamp": "2020-05-13 07:20:57",
    "text": "In the attached, you can see that the root Modules folder does not have the new module I created locally, but the nested folder does."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-05-13 07:23:11",
    "text": "To confirm, are you setting the destination of your watch command to be `Img-results`, not `Img-results/Img-results`"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-05-13 07:23:57",
    "text": "Also, does your local project have this nested nature?"
  },
  {
    "poster": {
      "poster_name": "Jason Adams",
      "poster_handle": "jason475"
    },
    "time_stamp": "2020-05-13 08:35:24",
    "text": "My watch command is nested, that must be the issue. What's strange is it is nested in a different folder. But let me adjust my watch command and see if that works. Thank you so much!"
  },
  {
    "poster": {
      "poster_name": "Juergen Koeck",
      "poster_handle": "juergen.koeck"
    },
    "time_stamp": "2020-05-13 09:45:35",
    "text": "ok thanks. I would be interested how you have integrated the hs cli and gitlab? here how I did it: i have installed the hs cli on the gitlab server and i will use a seperate config file for each project/pipe. I would be happy to continuously improve that setup :slightly_smiling_face:"
  }
]