[
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2020-08-25 05:17:09",
    "text": "Hi guys, we want to connect HubSpot to a vacancy database and import the available vacancies into HubSpot. The best way would probably be the HubDB API. The documentation however says it is not possible to filter HubDB based on contact properties when we create a marketing e-mail. Our goal is to send notifications about certain vacancies based on some contact properties. So that won’t be possible according to the developer documentation. We are currently investigating if we could get a RSS feed of these vacancies instead.\nAnyone had a similar functionality / case? I am really wondering how you guys would solve this.\n\n(<https://developers.HubSpot.com/docs/cms/features/hubdb>)"
  },
  {
    "poster": {
      "poster_name": "Aaron Dadap",
      "poster_handle": "wesleyadwebster"
    },
    "time_stamp": "2020-08-25 12:37:34",
    "text": "Hi is there a channel on the react cms boilerplate? Wanted to incorporate React into HubSpot and I successfully installed the boilerplate. But 1.) The state slider seems to be broken when sliding to increase the reasons to use react in CMS dummy text and 2.) I tried to edit it using CLI and my own editor and even npm build but it only reads the preloaded App.js in the dist/ file and none of my changes are reflected in the code or preview.\n\nAlso this was a few months ago but I just wanted to get back into setting up react environment not sure if its been fixed but will look at it now. Wanted to get a thread going but also make sure posting in the right place."
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2020-08-25 15:34:04",
    "text": "is there a way with dnd tags to not have the wrapper code, I have tried the no_wrapper=True but it still puts a bunch of divs in the code"
  },
  {
    "poster": {
      "poster_name": "Kate Hiscox",
      "poster_handle": "kate769"
    },
    "time_stamp": "2020-08-25 16:57:16",
    "text": "Hey all! Looking forward to helping where I can and getting some answers to my blonde questions :smile:"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2020-08-25 17:08:16",
    "text": "Yup, CMS comes with blog functionality"
  }
]