[
  {
    "poster": {
      "poster_name": "Phil",
      "poster_handle": "moneytech.ltd"
    },
    "time_stamp": "2024-03-18 03:22:07",
    "edited": {
      "time_stamp": "2024-03-18 03:27:27"
    },
    "text": "Hello everyone, I work for a client, I upload documents via <https://api.hubapi.com/filemanager/api/v3/files/upload> endpoint but this uploads the file to marketing->files. He wants the files to be uploaded to Sales->documents (I download the PDF proposals from EBP)\nI have read the documentation but apart from the possibility of choosing a destination folder in this part, I cannot find anything to upload a file elsewhere than in this marketing->files section. Do you have a solution for me?\nThanks in advance",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-18 06:50:35"
      },
      {
        "time_stamp": "2024-03-18 10:19:14"
      },
      {
        "time_stamp": "2024-03-18 11:56:23"
      },
      {
        "time_stamp": "2024-03-21 10:24:15"
      }
    ]
  },
  {
    "text": "Hi Everyone, I've been attempting to utilize the webhook functionality within HubSpot workflows to call the HubSpot API. Specifically, I'm trying to merge companies using the API endpoint <https://api.hubapi.com/crm/v3/objects/companies/merge>. However, I encountered below error during this process.\n\nThe error message suggests there might be an issue with the webhook setup, or the API call itself. Could you please confirm whether it's possible to invoke HubSpot APIs using webhook functionality? If so, I would greatly appreciate guidance on how to correctly configure the webhook to successfully call the HubSpot API endpoints",
    "time_stamp": "2024-03-18 04:08:19",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-20 07:43:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Yiz Segall",
      "poster_handle": "yiz.segall"
    },
    "time_stamp": "2024-03-18 06:23:35",
    "text": "yes. I no longer use the Node HubSpot library and just make the requests using Axios. It seems that they don't update that library so often and that there are higher chances of breaks"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-03-18 06:50:35",
    "text": "<https://community.HubSpot.com/t5/APIs-Integrations/Upload-file-in-sales-documents/m-p/875295>"
  },
  {
    "poster": {
      "poster_name": "Mohit Bisht",
      "poster_handle": "mohit.bisht"
    },
    "time_stamp": "2024-03-18 08:18:15",
    "text": "Hi Everyone, Is there a way to bulk remove association of contacts from companies based on certain filter criteria met."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-03-18 09:22:26",
    "text": "yeah, I use axios as well, just saw this in the docs, the node package is too much trouble for me to use"
  },
  {
    "poster": {
      "poster_name": "Paul Schreiber",
      "poster_handle": "paulschreiber"
    },
    "time_stamp": "2024-03-18 09:28:47",
    "text": "<@U01GW2U4WMA> That requires a record ID, which I don’t have. I have an emal address."
  },
  {
    "poster": {
      "poster_name": "Paul Schreiber",
      "poster_handle": "paulschreiber"
    },
    "time_stamp": "2024-03-18 09:29:39",
    "text": "I’m already make one API call to add the user (which succeeds if not present). then i add the user to the list."
  },
  {
    "poster": {
      "poster_name": "Paul Schreiber",
      "poster_handle": "paulschreiber"
    },
    "time_stamp": "2024-03-18 09:29:51",
    "text": "I don’t want to have to make 3 API calls just to subscrbe someone to a list."
  },
  {
    "poster": {
      "poster_name": "Paul Schreiber",
      "poster_handle": "paulschreiber"
    },
    "time_stamp": "2024-03-18 09:30:02",
    "text": "I would expect to be able to make a single UPSERT-like call."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-03-18 10:01:19",
    "text": "I hear you"
  },
  {
    "poster": {
      "poster_name": "Phil",
      "poster_handle": "moneytech.ltd"
    },
    "time_stamp": "2024-03-18 10:19:14",
    "text": "Thanks for reply, so I think it’s good suggestion for API developer, it’s a good feature to create haha :grin:"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-03-18 11:56:23",
    "text": "create an idea in <https://community.HubSpot.com/t5/HubSpot-Ideas/idb-p/HubSpot_Ideas> and get enough upvotes and maybe it'll happen."
  },
  {
    "poster": {
      "poster_name": "Norman Khine",
      "poster_handle": "nkhine"
    },
    "time_stamp": "2024-03-18 13:09:44",
    "text": "Hello,\nI want to clone a page using the API, but I get the following error\n```{\"correlationId\":\"c8c4c9e7-5341-4395-be4f-f8ad683f5c48\",\"message\":\"This oauth-token (pat-na1-***) does not have proper permissions! (requires any of [landingpages-access, sitepages-access])\",\"status\":\"error\"}```\nLooking at the settings for the private app, I don't see where to set these up, on the CMS, I only have\n```cms.domains\ncms.functions\ncms.knowledge_base.articles\ncms.knowledge_base.settings\ncms.performance```\nWhere do I set these permissions? Any advise is much appreciated"
  },
  {
    "poster": {
      "poster_name": "Matt Hofmann",
      "poster_handle": "matthew.hofmann"
    },
    "time_stamp": "2024-03-18 13:11:02",
    "text": "Hello all, attempting the api for adding records to a list. Lifting the Python code directly from the below site, and getting this error: \"AttributeError: 'Discovery' object has no attribute 'lists'\". <https://developers.HubSpot.com/docs/api/crm/lists>\nAny help would be appreciated!"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-03-18 13:54:21",
    "text": "I ended up looping through all results and filtering by tag...seems to work just fine and it doesn't seem to add too much load time. I wonder if I should be worried about anything else..."
  },
  {
    "text": "Hello everyone! Does anyone know if I can customize the payload sent to my destination URL webhook?",
    "time_stamp": "2024-03-18 13:56:58"
  },
  {
    "poster": {
      "poster_name": "Eric Hirsh",
      "poster_handle": "ehirsh"
    },
    "time_stamp": "2024-03-18 14:11:16",
    "text": "Hi Erik!\nI am the product manager of this API and I have a keyword notification on 'conversations api' here in Slack, but not as good of an automated listening mechanism out in the community forums, and not all posts get escalated up through the contributors and community managers to the product team.\n\nThanks so much for using this API and providing feedback about it!\n\nI\n• responded to your Idea request about conversation assignment, and included an explanation about why this API has been in beta so long\n• created bug investigation tickets about threadStatus filtering and lastMessageTimestamp sorting possibly not working\n• created a backlog item about @ mentioning in comments. That is a reasonable thing to ask of this API. No promises on timelines at this time, but now we know at least one person is interested in it. Will look to see if more people ask after it as well. "
  },
  {
    "poster": {
      "poster_name": "Tony Carpenter",
      "poster_handle": "tonycarpenter"
    },
    "time_stamp": "2024-03-18 15:58:45",
    "text": "Hey everyone!\n\nI'm having issues finishing up the marketing integrations for a completely custom price configurator for our company. Currently the pricing configurator is deployed and conversion event tracking is working for Google Tag Manager/Google Analytics/Google Ads/Facebook.\n\nMy questions are:\n1) What API do I use to enter the form data into the HubSpot CRM?\n2) What do I need to do for HubSpot to track ROAS from these leads generated from ads? (I'd like to clarify that I can NOT use HubSpot Forms and I do not want information about lead ads for Facebook and Google. This is for our custom configurator form).\n\nFor the first part about the API, I see this page here is for submitting data to a form <https://legacydocs.HubSpot.com/docs/methods/forms/forms_overview?_ga=2.223379995.1005207101.1644243643-1276624668.1642615444> which looks ideal, but then at the top of this page <https://legacydocs.HubSpot.com/docs/methods/forms/submit_form_v3_authentication> it says, \"This endpoint should not be used with <https://knowledge.HubSpot.com/forms/use-non-HubSpot-forms|non-HubSpot forms>.\" which conflicts with what the page before it says. (I cannot use native HubSpot forms and our site is a SPA so we can't use the HTML form tracking options, it has to be an API call). Can I use this API endpoint to pass form lead data to HubSpot?\n\nFor the second part, will sending that form data as a lead in the HubSpot CRM + Google's enhanced matching be enough for HubSpot to calculate ROAS from the Google Ads? If not, what information needs to be passed in the API call? Is there something specific Facebook needs as well?\n\nThanks in advance for any help or info!!!"
  },
  {
    "poster": {
      "poster_name": "Erik Kokalj",
      "poster_handle": "erik.kokalj4"
    },
    "time_stamp": "2024-03-18 16:39:58",
    "text": "Thank you <@U04B32JHTUZ>! I just replied, and it's totally understandable for all 3 points. Hopefully, bugs get sorted soon, and the features get implemented some time in the future:)"
  },
  {
    "poster": {
      "poster_name": "Luke Belgeri",
      "poster_handle": "lukebelgeri"
    },
    "time_stamp": "2024-03-18 16:48:14",
    "text": "I haven’t. I’ll add it in. Thanks."
  },
  {
    "poster": {
      "poster_name": "Romeo Mann",
      "poster_handle": "romeo963"
    },
    "time_stamp": "2024-03-18 16:49:00",
    "text": ":wave: Hello, team!\n\nQuick question.\n\nis it possible via the API to get the n*umber of records that have values for a particular contact proprety? Is this somehoe available by the API. or how could I get it?*\n\n*Thanks a lot folks*\n*romeo*",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-19 00:37:20"
      },
      {
        "time_stamp": "2024-03-19 04:52:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jessiemar Pedrosa",
      "poster_handle": "jessiemarpedrosa"
    },
    "time_stamp": "2024-03-19 00:37:20",
    "text": "I think you can use search request, then do a filterGroup, then do a filter for a specific propertyName and use your desired operator.\n```filters\":[\n          {\n            \"propertyName\": \"firstname\",\n            \"operator\": \"EQ\",\n            \"value\": \"Alice\"\n          }\n        ]```\n"
  }
]