[
  {
    "poster": {
      "poster_name": "Svitlana Vyshnevska",
      "poster_handle": "svitlana.vyshnevska"
    },
    "time_stamp": "2024-03-14 02:49:22",
    "text": "Hi Everyone!\nCould you please help me with it:\nWe need to store users who submitted a request from a meeting form. We want to get them using the API.\n\nWe are trying to use these methods:\n\n<https://developers.HubSpot.com/docs/api/crm/meetings>\n<https://developers.HubSpot.com/docs/api/crm/contacts>\nBut it seems that they are not suitable for us to solve our request.\n\nSo we have questions like this:\n\nCan we get users id with meeting request?\n\n<https://developers.HubSpot.com/docs/api/crm/meetings>\nGET /crm/v3/objects/meetings/{meetingId}\n\nWe don’t see in the documentation a method for obtaining the user to which the meet is associated does your API provide this feature? If so, what parameters need to be added to request?\n\nIn additional to this - how we can get additional meeting form field via API? (you can see on the screenshot - <https://prnt.sc/Gwr_mxTdYWZa>)\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Levon Stepanyan",
      "poster_handle": "levon"
    },
    "time_stamp": "2024-03-14 03:22:55",
    "text": "Hi! And again as I don't have access to the source code it is difficult to say anything. We need to understand the logic behind your integration, what is the trigger for deals route and how is it handled in the backend?"
  },
  {
    "poster": {
      "poster_name": "Levon Stepanyan",
      "poster_handle": "levon"
    },
    "time_stamp": "2024-03-14 03:23:48",
    "text": "As I understand your integration creates new deals?"
  },
  {
    "poster": {
      "poster_name": "Lars van der Water",
      "poster_handle": "l.vanderwater"
    },
    "time_stamp": "2024-03-14 03:25:57",
    "text": "Good morning <@U03N5FHUHQT>,\n\nI am a colleague of Roeland working on the issue discussed here and appreciate your suggestions.\n\nUnfortunately, the properties `hs_direction_and_unique_id` and `hs_object_source` seem to be read-only, which blocks us from updating existing objects or defining these properties for new ones.\n\nI also followed your advice to adjust `hs_email_headers`, but it didn’t resolve our issue. Similarly, changing hs_email_html to basic HTML was ineffective.\n\nI wrote down my own thoughts on the pertaining issue:\n\n_\"I think I have a lead on what the issue might be. The emails in the helpdesk environment are not engagement/email objects but are instead thread messages. This means the email objects I created are not visible in the help desk. This also leaves me puzzled on how to create threads AND (incoming) thread messages for a thread, especially since this functionality seems absent in the conversations API currently in Beta.\"_\n\nDo you have any alternative suggestions or insights? :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Khalifa Idris",
      "poster_handle": "khalifa.idris"
    },
    "time_stamp": "2024-03-14 06:11:43",
    "text": "Hey gang! Got a question for those savvy with publishing email templates via the API\n\nIs it possible to create an email template using the HubSpot drag and drop and then use said email template with the endpoint `<https://api.hubapi.com/marketing-emails/v1/emails>` for creating emails?\n\nContext: I've got an email template I created using HubL + HTML in `Design Tools`. Trouble is, my email team want a decent bit of control as to what goes into the template. They would prefer using the HubSpot UI to customise the email templates and then allow the API calls to populate the content where appropriate"
  },
  {
    "poster": {
      "poster_name": "Augusto Cardoso",
      "poster_handle": "augusto.cardoso"
    },
    "time_stamp": "2024-03-14 08:50:24",
    "text": "Hi, everyone! Hope you are doing well.\nI've got a question which support couldn't help me with, so they recommended me to look for this great channel.\nThe issue I'm facing is described in <https://community.HubSpot.com/t5/APIs-Integrations/Engagements-API-missing-data/m-p/927215#M71293|this> community post. Basically, there's missing data when getting engagements associated to deals: some Deals have all their engagements, some have just a few of them, and some have no associated engagements.\nI was wondering if anyone could help me up with this, please.\nThanks a lot!"
  },
  {
    "poster": {
      "poster_name": "Zak Jacobson",
      "poster_handle": "zak682"
    },
    "time_stamp": "2024-03-14 08:56:47",
    "text": "came here with the same question.\nOne other answer: <https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1704976994402659?thread_ts=1704963743.724799&amp;cid=C2YHAHB6K>"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2024-03-14 09:09:40",
    "text": "I am using the search API to create a React search module, it is working fine but what happens is when I search by multiple words it brings all results from any of those terms independently.\n\nExample if I search for “Red Dog” it will bring any page, post etc that has Red OR Dog, and I would want it to bring results that have both words together “Red Dog”.\n\nIs there a way to do this?? I checked in the documentation and in the slack channel and couldn’t find a solution.\nThank you\n\n<https://api.hubapi.com/contentsearch/v2/search>?"
  },
  {
    "poster": {
      "poster_name": "Cédric MOURIZARD",
      "poster_handle": "cedric.mourizard"
    },
    "time_stamp": "2024-03-14 09:16:50",
    "text": "Hello, when we synchronize ecommerce orders and HubSpot transaction, how can we push the information about discount coupons and taxes ? We can't create line item with negative amount by example."
  },
  {
    "poster": {
      "poster_name": "Paul Schreiber",
      "poster_handle": "paulschreiber"
    },
    "time_stamp": "2024-03-14 10:46:34",
    "text": "How do I use the PHP API library <https://github.com/HubSpot/HubSpot-api-php> to add a contact to a list (<https://legacydocs.HubSpot.com/docs/methods/lists/add_contact_to_list>) ?\n\nMaybe something like?\n```$HubSpot-&gt;crm()-&gt;lists()-&gt;membershipsApi()-&gt;add($listId, $data);?```\nwith data like\n```$data = [ \"emails\" =&gt; [ \"<mailto:jdoe@example.com|jdoe@example.com>\" ] ];```\n?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-15 06:03:22"
      },
      {
        "time_stamp": "2024-03-18 09:28:47"
      },
      {
        "time_stamp": "2024-03-18 09:29:39"
      },
      {
        "time_stamp": "2024-03-18 09:29:51"
      },
      {
        "time_stamp": "2024-03-18 09:30:02"
      },
      {
        "time_stamp": "2024-03-18 10:01:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ben",
      "poster_handle": "b.burden"
    },
    "time_stamp": "2024-03-14 11:09:19",
    "text": "<@U05R380MLMC> just in case this one slipped through the net - i have a deadline for tomorrow for delivery"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-14 11:27:04",
    "text": "Hey Ben, I'm traveling today and won't be back until Tuesday next week. Maybe someone else can provide you some support, or you can extend your deadline for next week."
  },
  {
    "poster": {
      "poster_name": "Ben",
      "poster_handle": "b.burden"
    },
    "time_stamp": "2024-03-14 11:27:52",
    "edited": {
      "time_stamp": "2024-03-14 11:32:29"
    },
    "text": "thanks Ryan - do you have any suggestions of who we can tag in here?"
  },
  {
    "poster": {
      "poster_name": "Richard Baeza",
      "poster_handle": "rbaeza"
    },
    "time_stamp": "2024-03-14 12:55:36",
    "text": "Does anyone have any experience using APIs to pull contact data from HubSpot and then reinsert data through python? I am working on a lead score in python, and have completed it, but am unsure of the best way to pull the test data and insert the results from the model.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-14 13:48:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Curtis Morte",
      "poster_handle": "cmorte"
    },
    "time_stamp": "2024-03-14 13:48:24",
    "edited": {
      "time_stamp": "2024-03-14 13:49:37"
    },
    "text": "I would use the batch endpoints to list the Contact data, then use a batch to update the Contacts.\n\nBatch read for contacts:\n`/crm/v3/objects/contacts/batch/read`\n\nBatch update for contacts:\n`/crm/v3/objects/contacts/batch/update`\n\nWhat data are you augmenting the Contact data with to provide lead scoring?\n\n> TBH, this seems like an anti-pattern unless you have a quality edge use case.\n*The scored properties in HubSpot (Seat / Tier dependent) are very robust.*\n\nWe've done HUGE scored property implementations that can leverage other data within HubSpot that the Contact record alone doesn't have access to but rather the Contact with all the Analytics and Engagement records its associated with does."
  },
  {
    "poster": {
      "poster_name": "Alfred Nnaemeka",
      "poster_handle": "ezakaphil"
    },
    "time_stamp": "2024-03-14 14:23:19",
    "text": "Hello, `is there an API to fetch my HubSpot Calendar availability times` which I set via the Sales &gt; meetings funnel after connecting my google calendar.\nWe want to implement the meeting bookings via a custom UI instead of the embedded HubSpot meeting widget"
  },
  {
    "poster": {
      "poster_name": "Steve Kanter",
      "poster_handle": "steve.kanter"
    },
    "time_stamp": "2024-03-14 15:23:47",
    "text": "does anyone know if it’s possible to add a second set of `Line Items` to a Deal that aren’t used for calculating Deal Amount, etc? I can’t seem to create a custom association from Deal =&gt; Line_Items",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-15 06:08:57"
      },
      {
        "time_stamp": "2024-03-15 07:35:09"
      },
      {
        "time_stamp": "2024-03-15 08:03:16"
      },
      {
        "time_stamp": "2024-03-15 08:04:13"
      }
    ]
  }
]