[
  {
    "poster": {
      "poster_name": "Brian Krainer",
      "poster_handle": "bkrainer"
    },
    "time_stamp": "2021-05-20 08:08:13",
    "text": "and while serverless itself is not in beta, there _is_ a serverless beta that includes support for managing dependencies via `package.json` and local serverless testing, if you're interested (once you get the personal access key stuff sorted out)"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-05-20 08:33:09",
    "text": "<@U7SL518D6> and <@UEKMY50SU> thanks guys! I was able to successfully get it running on my developer sandbox? account by creating a new portal there… It’s an account that I almost forgot about since our team uses so many different dev portals and I haven’t touched that one in a long time. I think I have a better understanding now of the differences in portal/account types, but a docs page to give an overview of the terminology, where you can find them, and their differences would be helpful (or maybe it exists and I missed it).\n\nThe serverless functionality is awesome btw! Opens a lot of doors for us. We’re not quite ready to do the beta yet, but I will probably dig into that soon—is that something that would be available on our prod portal if we do it? In the near future we are going to be launching a new careers section of our site that will rely heavily on serverless."
  },
  {
    "poster": {
      "poster_name": "Brian Krainer",
      "poster_handle": "bkrainer"
    },
    "time_stamp": "2021-05-20 08:35:21",
    "text": "yeah, you could sign up for the beta with your prod portal if desired. <https://docs.google.com/document/d/e/2PACX-1vRGX60V2wQ2Co9X1NO73hkLObcQdNWp2i49XE-pY_DRS6UjZnv4UuODz4nsI_g1gUIXFC1MhN4AFsnZ/pub> has information on the beta features as well as how to sign up"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-05-20 08:36:21",
    "text": "Excellent, thanks Brian!"
  }
]