[
  {
    "text": "Hi Everyone,\n\nI'm actually wondering, why this button is there but not working? I wanted to provide feedback here that it's strange that you have to fill the *updatedAt* and the *createdAt* field to create a form, but this button is not working on my end.",
    "time_stamp": "2024-08-06 10:21:03"
  },
  {
    "poster": {
      "poster_name": "Hannah Seligson - Developer Advocate",
      "poster_handle": "hseligson"
    },
    "time_stamp": "2024-08-06 11:16:43",
    "text": "Public Beta: Generic Webhook Subscriptions Starting on August 6th, 2024, you can now use 24 additional CRM object types with webhook subscriptions for both private and public apps. We are updating the format to follow the 'object.*' pattern to standardize the subscription types. Developers can now use the generic format to extend subscriptions to newly supported object types for their application use case. While immediate deprecation of legacy webhooks are not planned, it is advisable to start adapting to the new format. Consider modifying existing endpoints to adapt to the new format or create new ones as needed. Users should publish events to both subscription versions during the transition period. The HubSpot UI supports maintaining both legacy and new versions simultaneously, ensuring a smooth migration process. For more details, please refer to the Developer Changelog. Thank you! :rolled_up_newspaper: View on Changelog button :mega: View on Community Forum button",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-13 09:38:04"
      },
      {
        "time_stamp": "2024-08-20 06:34:36"
      },
      {
        "time_stamp": "2024-08-20 06:36:41"
      },
      {
        "time_stamp": "2024-09-04 11:47:48"
      },
      {
        "time_stamp": "2024-09-04 13:00:23"
      },
      {
        "time_stamp": "2024-09-04 13:03:06"
      },
      {
        "time_stamp": "2024-09-04 13:27:42"
      },
      {
        "time_stamp": "2024-10-10 02:20:10"
      }
    ]
  }
]