[
  {
    "poster": {
      "poster_name": "Chetan Jain",
      "poster_handle": "chetansirsa"
    },
    "time_stamp": "2021-11-08 06:48:48",
    "text": "HubSpot Developers I need a clarification.\n\nCorrect me if I am wrong. I suppose the blog post HTML is stored in AWS s3 as static files. Let us say I have 50 blog posts spanning across 5 HTML files.\nWhen I create a new blog post. It will be inserted in chronological order. Thereby changing the order of posts across all pages. Now HubSpot will update all s3 HTML files.\n\nNow my question is If 2 blog posts are published concurrently say by 2 authors simultaneously. There is a chance that conflicts will arise in files. How does HubSpot handle it? Does it have a lock kind of mechanism for such a scenario?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-11-08 07:51:29"
      },
      {
        "time_stamp": "2021-11-08 12:08:43"
      },
      {
        "time_stamp": "2021-11-08 12:18:01"
      },
      {
        "time_stamp": "2021-11-09 07:56:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-11-08 07:51:29",
    "edited": {
      "time_stamp": "2021-11-08 07:51:36"
    },
    "text": "Do you mean you're writing files to S3? Not sure what you mean here"
  },
  {
    "poster": {
      "poster_name": "Stephen Kvedaras",
      "poster_handle": "stephen.kvedaras"
    },
    "time_stamp": "2021-11-08 09:11:57",
    "text": "Thanks Kieran, very helpful"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-11-08 09:44:20",
    "text": "I would pay extra money today if there was an API to set team availability. Ideally we'd like to sync status with Slack (and yes I'll put this on the ideas forum) but honestly anything would be better than the current approach of manual available/unavailable.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-11-09 07:20:20"
      },
      {
        "time_stamp": "2021-11-10 09:52:37"
      },
      {
        "time_stamp": "2021-11-10 09:57:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jayne Burch",
      "poster_handle": "jayne"
    },
    "time_stamp": "2021-11-08 11:22:55",
    "text": "I’m new to this channel. I am a marketer, not a developer. I’m here because I need help with what questions to ask as we are investigating if it’s possible to integrate HubSpot with a platform the client is already using. The platform in use is a Pharmacy Management System (cloudbased) called LifeFile. They would like to sync some contacts and/or companies with this platform. Can someone help me to suggest how to begin the conversation with LifeFile. What information do we need from them? What questions should we be asking? I appreciate any assistance.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-08 14:55:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chetan Jain",
      "poster_handle": "chetansirsa"
    },
    "time_stamp": "2021-11-08 12:08:43",
    "text": "Sorry, It is an  question about HubSpot architecture. Here I suppose that HubSpot internally stores static html files in s3 buckets."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-11-08 12:18:01",
    "edited": {
      "time_stamp": "2021-11-08 12:20:54"
    },
    "text": "The HubSpot CMS isn't built on a static site generator, so I wouldn't be concerned about the scenario you've explained :slightly_smiling_face:"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-11-08 14:55:19",
    "text": "I may have answered my own question. I found Kyle’s HS Academy course on Integrations and DataSync and everything is a lot clearer now. The program the client wants it integrate is pretty obscure but at least I know what questions to ask now. iPaaS could be the key. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Lee Eriera",
      "poster_handle": "lee065"
    },
    "time_stamp": "2021-11-08 22:39:56",
    "text": "Hello from sunny Melbourne, Australia!\nI have an app installed (App ID: 354939; draft listing status; requires _contacts_ and _oauth_ scopes) under a developer account and when testing OAuth with a test sandbox account, it can connect just fine. However, if I try to use any external account (free portal, superadmin user) I get the following error message: \n\n_\"Couldn't complete the connection. This account doesn't have access to some HubSpot features that are required by this app.\"_\n\nI had a nose around but couldn't find much on this error previously posted. There was talk of free accounts being the issue some time ago, but the current developer docs say that free accounts should be able to use these scopes via the API. Any help would be very much appreciated, thanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-21 22:58:00"
      }
    ]
  }
]