[
  {
    "poster": {
      "poster_name": "Kadhiravan Vellingiri",
      "poster_handle": "kadhiravan.vellingiri"
    },
    "time_stamp": "2021-11-10 03:32:25",
    "text": "Hi Guys\n\nI have a question regarding the HubSpot API and Landing Pages. I have created a custom module with a text field called \"Event title\", I have added this module to a template and created multiple landing pages from that template. But the Event title field is not appearing in the HubSpot API for most landing pages even it contains the data. Please help me troubleshoot this issue."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-11-10 09:52:37",
    "text": "Yes sir. It is an exercise in cat herding to get people to remember to set status to away when they go to lunch or to set status to available when they return...\n\nIn a dream world we'd love to just sync our slack status (which has loads of other useful integrations like <http://reclaim.ai|reclaim.ai> that we leverage so that when somebody is on a meeting they go into DND mode) -  We are a highly automated company, so for example if somebody has booked a day off in our HR tool, we auto-add an OOO setting to their calendar for that day (and thereby we would want to ensure they are offline in HubSpot inbox)...  We let team members travel the globe, so sometimes their availability is changed by their time zone, and we actually love taking advantage of the ability to extend our support &amp; sales chat hours in response to those travels (e.g. we can now open chat 4 hours earlier if somebody is in Europe for a few months).... We use presence &amp; location in a lot of different ways that I would get value from in terms of HubSpot chat presence.\n\nMy guess is that our individual use case is pretty unique, so I would lobby for an API approach to let customers setup their own approach rather than trying to be prescriptive about it."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-11-10 09:57:35",
    "text": "Thanks for the extra details Arlo :slightly_smiling_face: I have passed this along to the team and will let you know if I hear anything."
  },
  {
    "poster": {
      "poster_name": "Rahmona Henry",
      "poster_handle": "rhenry"
    },
    "time_stamp": "2021-11-10 10:18:46",
    "text": "Hi <@UBRG1R3EW> we recently reduced the oauth access token expiry period from 6 hours to 30 minutes. This change was implemented this week. More details <https://developers.HubSpot.com/changelog/upcoming-expiration-of-oauth-access-tokens-is-changing|here>. Could this have affected your refresh process?"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-10 10:26:03",
    "text": "Hi Rahmona, I believe some HubSpot integrations are taking awhile to refresh OAuth tokens. We are not sure why. We just sent you an email and CCd you to our developers."
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-10 10:26:19",
    "text": "we made teh adjustment to check expires at"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-10 10:26:24",
    "text": "last wee"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-10 10:26:25",
    "text": "week"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-10 10:27:26",
    "text": "502 gateways have stopped though"
  }
]