[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2021-11-09 04:48:49",
    "edited": {
      "time_stamp": "2021-11-09 04:52:15"
    },
    "text": "Hello,\nI’m wanting to use the hubDB API <https://developers.HubSpot.com/docs/api/cms/hubdb>\nI want to batch update my rows so want the “Update rows in batch in draft table” API\n\nHowever the docs don’t tell me how to reference the rows to be updated, e.g. I want to update row 1 with data x, row 2 with y etc etc or will it just systematically update from the first row?\n\nOr should I be using the replace rows? again it doesn’t seem to reference the rowId though"
  },
  {
    "text": "Hey Arlo, are you referring to the status inside of the conversations inbox like shown here:",
    "time_stamp": "2021-11-09 07:20:20"
  },
  {
    "poster": {
      "poster_name": "Chetan Jain",
      "poster_handle": "chetansirsa"
    },
    "time_stamp": "2021-11-09 07:56:06",
    "text": "Thanks"
  },
  {
    "poster": {
      "poster_name": "Tommy Morrissey",
      "poster_handle": "tommymorrissey386"
    },
    "time_stamp": "2021-11-09 08:51:39",
    "text": "Hi all, getting a bizarre error when transferred from test to dev environments. Assuming it's an environment error, but hoping to get more specifics. All libraries/dependency are installed, but for some reason am getting the following error (You must include a hapi_key or access_token attribute when initalizing the API). I am using the exact same code from the test environment, and the exact same API key. Anyone know what is happening?"
  },
  {
    "poster": {
      "poster_name": "Marco Papavero",
      "poster_handle": "marco.papavero"
    },
    "time_stamp": "2021-11-09 09:15:20",
    "edited": {
      "time_stamp": "2021-11-09 09:16:26"
    },
    "text": "Hello everybody. How can I track PAID CONTACTS of a Google ADS campaign in HubSpot where the form where last conversion happens is a REACT form that send backend requests via API to HubSpot? This is the form: <https://app.tanaza.com/signup/>\n\nFor speed perfomance reasons, instead of using a HubSpot form, my developers launch a series of backend requests to register: login, logout, signin, signup, etc. I need to define the source of traffic for contacts that arrives from Google ADS and distinguish them as PAID CONTACTS. In this moment they are registered by HubSpot as organic and direct users. What is the existing or new property that I can use for this backend request?\n\nThanks for your support."
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2021-11-09 11:23:02",
    "text": "Yesterday, around 4:17 PM EST, we started seeing Bad Gateway (502) errors from HubSpot while refreshing tokens. Has anyone else been seeing those?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-11-10 10:18:46"
      },
      {
        "time_stamp": "2021-11-10 10:26:03"
      },
      {
        "time_stamp": "2021-11-10 10:26:19"
      },
      {
        "time_stamp": "2021-11-10 10:26:24"
      },
      {
        "time_stamp": "2021-11-10 10:26:25"
      },
      {
        "time_stamp": "2021-11-10 10:27:26"
      }
    ]
  }
]