[
  {
    "poster": {
      "poster_name": "Alyssa Rodriguez",
      "poster_handle": "alyssa.rodriguez"
    },
    "time_stamp": "2023-08-31 14:26:05",
    "text": "Hey all! HubSpot support referred me here because I had a question about gating web content. My company wants to build an online intranet (basically a website with content that is only relevant to employees) and we want to use HubSpot to do it because our public-facing site is also a HubSpot site. Many executives however, feel strongly that this content be gated by Azure AD SSO. Is there any way to use an Azure SSO to gate a HubSpot website?\n\nP.S. If this question belongs elsewhere, please let me know!",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-31 15:30:19"
      },
      {
        "time_stamp": "2023-09-01 03:33:55"
      },
      {
        "time_stamp": "2023-09-11 09:15:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-08-31 15:30:19",
    "text": "Hi Alyssa, my advice is that HubSpot is not the right tool for the job in this case.\n\nWith HubSpot CMS, you can set up different versions of gated content, but it is based on cookies only, so it's not a reliable authentication method for securing internal content on an intranet.\n\nHubSpot is best for external marketing sites.\n\nIt might be possible to set up a Private App that uses HubSpot data and APIs (assuming that you want to use customer data in HubSpot and display in your intranet), but this private app would still need to have its own authentication system and hosted on a different server.\n\nI would agree with something like Azure SSO in this case, but your intranet could be built on any cloud infrastructure and there are lots of possible SSO options such as OpenID Connect, OAuth, SAML... these options are most likely chosen by your development team.\n\nIf you don't want to (or don't have resources) to build the custom software for an employee intranet, that's ok... a lot of companies don't have their own custom intranet solution. Microsoft SharePoint is a common solution for this, as example. But there's lots of other Intranet SAAS (software as a service)s that you could look into, like Workplace from Meta, Simpplr, Staffbase, the list goes on and on."
  }
]