[
  {
    "poster": {
      "poster_name": "Marc Pozzuoli",
      "poster_handle": "marc293"
    },
    "time_stamp": "2023-08-02 09:34:21",
    "text": "Here is an interesting one to solve.  I've got a lead capture webform that submits and redirects to a HubSpot Meeting page.  The meeting page prepopulates the user's data that they just submitted on the previous page.  The calendar page intermittently does and does not have the prepopulated user's info included in the form.  I'm assuming this is a timing issue, i.e. sometimes the form has processed fast enough for the new contact to be created and sometimes it hasn't.  Any ideas on how I can get the calendar embed to load a couple seconds slower?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-02 20:25:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-08-02 09:45:39",
    "edited": {
      "time_stamp": "2023-08-02 10:12:16"
    },
    "text": "I've got a teams &amp; workload question–\n\nDo you work for an agency that builds custom designed websites for client companies on HubSpot? If so, on average how many developers do you have programming on your team, and how many medium-sized websites (20-30 page site) with fully customized design do you build and deliver to clients on a monthly basis? And do you have any other members dedicated for other non-development roles, i.e. QA / project management, etc.\n\nJust trying to hear a few examples of how other companies are operating. Finding a perfect balance of resources to fit the velocity of client requests can be a challenge... Anyone have any high level thoughts on this or feel like sharing?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-02 20:25:03",
    "text": "Came across literally this exact problem last week — you’re correct that the issue has to do with there not being enough time for the form data to process before the next page loads.\n\nMy theoretical solution was to have the first form redirect the user to an intermediate “Processing Page” with a loading spinner/text, and would use Javascript to redirect to the destination page after a 1–2s delay.\n\nOur team opted to structure the experience a little bit differently rather than implement a delay, as we didn’t want to count on the delays only needing to be a second or two. So, I can’t guarantee that it’ll do the job as needed."
  }
]