[
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-04-17 05:32:56",
    "text": "Hi BJ. I created a test page showing the issue. I have a 3 instances of an accordion FAQ module. Each module has a checkbox to generate faq schema based on the content entered into the faq. If a marketer adds multiple accordions to a page they may not know they are causing issues. So it would be nice to only load the first instance's schema block. Or I guess another idea would to do something like.. is_in_editor and module_instance == 1\n\n<https://45184218.hs-sites.com/faq-accordion-test>"
  },
  {
    "text": "Hi!! I'm encountering a challenge while customizing a HubSpot theme and could use some guidance. In the template for the homepage, I've added a navfooter module which contains a form. Within this form, there's a \"Privacy Policy\" hyperlink that should be displayed with a font size of 12px. However, it appears to be rendering with a font size of 16px.\nI've tried inspecting the element in my browser's developer tools to identify the CSS rule causing this discrepancy. While I can locate the rule and see its effect, when I navigate to the corresponding CSS file in the theme, either the rule is not present or it's empty.\nI understand that HubSpot themes can be complex, and there may be dynamic loading or compilation processes at play. Could someone provide guidance on the most effective way to pinpoint and modify the CSS rule affecting this hyperlink's font size?\nAny insights or suggestions would be greatly appreciated. Thank you in advance for your assistance!",
    "time_stamp": "2024-04-17 08:12:54",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-17 08:31:54"
      },
      {
        "time_stamp": "2024-04-17 09:59:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2024-04-17 08:24:08",
    "text": "Hi <@U04AQA0QM8E>, I was wondering if you could elaborate on using the height and width attribute to get the automatic optimization. The site i am working on mainly uses images that scales with the browser size, meaning that there isnt a set width value that I can use. What is the best practice to still utilise automatic resizing in this case?"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-04-17 08:31:54",
    "text": "Hey <@U06U1BWP1FB> in your screenshot it shows that the button-text class is in main.css.\nBut if you go to main.css you will only find a bunch of other CSS files:\nThe class will be in one of those files.\nPerhaps the easiest way to get what you want is to call the class in the theme-overrides css file which should take precedence. Just make sure you don't decrease all hyperlinks across the site to 12 px :slightly_smiling_face: Perhaps give the privacy policy a unique class name in the navfooter module"
  },
  {
    "poster": {
      "poster_name": "Sam Sharples",
      "poster_handle": "sam.sharples"
    },
    "time_stamp": "2024-04-17 08:43:18",
    "text": "Hey Jake. Does module_instance == 1 solve your issue?\nAlso, how are you loading the schema in the head and not inline with the module?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2024-04-17 08:59:19",
    "text": "I understand the issue — I guess I am just a bit confused as to why you need the FAQ schema in general? Is it a third party tool that is helping you with all of this? What value does the schema bring instead of making it just a module with repeater fields and generating the markup on the fly?"
  },
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-04-17 09:59:19",
    "text": "Oh, awesome! Thanks a bunch for the quick reply and such a stellar answer! You've been super helpful, really appreciate it!"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-04-17 11:45:22",
    "text": "<@U02K6V72MR8> module_instsance is something I made up and was proposing something like that could work."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-04-17 11:45:23",
    "text": "<@UQWGKUEN7> the FAQ schema is for SEO and helping search engines find this content and possibly display it in related questions in search results. You would do this to try and get more organic search traffic. The schema is built with hubl repeater loop and just output the content in key values. It's a quick read for search crawlers vs parsing html."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-04-17 11:49:20",
    "text": "<@U01EE8YSRFX> In general, all `img` elements should have intrinsic sizing set via `width` and `height` in all cases, even if the sizing and positioning is going to be altered by CSS. Here’s the relevant excerpt from <https://html.spec.whatwg.org/multipage/embedded-content.html#the-img-element|the WhatWG HTML spec on the >`img`<https://html.spec.whatwg.org/multipage/embedded-content.html#the-img-element| element>:\n&gt; The IDL attributes `width` and `height` must return the rendered width and height of the image, in <https://drafts.csswg.org/css-values/#px|CSS pixels>, if the image is <https://html.spec.whatwg.org/multipage/rendering.html#being-rendered|being rendered>; or else the <https://html.spec.whatwg.org/multipage/images.html#density-corrected-intrinsic-width-and-height|density-corrected natural width and height> of the image, in <https://drafts.csswg.org/css-values/#px|CSS pixels>, if the image has <https://html.spec.whatwg.org/multipage/images.html#density-corrected-intrinsic-width-and-height|density-corrected natural width and height> and is _<https://html.spec.whatwg.org/multipage/images.html#img-available|available>_ but is not <https://html.spec.whatwg.org/multipage/rendering.html#being-rendered|being rendered>; or else 0, if the image is not _<https://html.spec.whatwg.org/multipage/images.html#img-available|available>_ or does not have <https://html.spec.whatwg.org/multipage/images.html#density-corrected-intrinsic-width-and-height|density-corrected natural width and height>. <https://html.spec.whatwg.org/multipage/references.html#refsCSS|[CSS]>\nBasically, if an image is expected to be displayed at a fixed size, your `width` and `height` should be set to to match that display size. If an image’s display size isn’t fixed, and may change based on context (device size, page layout, etc.), the `width` and `height` should be set to match the resolution of the image at @1x pixel density — aka the “natural width” and “natural height” of the image. For images served via the HubSpot filesystem, you can get the natural width and natural height via the `width` and `height` attributes, like so:\n```{% set my_image = module.my_image %}\n&lt;img src=\"{{ my_image.src }}\" alt=\"{{ my_image.alt }}\" width=\"{{ my_image.width }}\" height=\"{{ my_image.height }}\"&gt;```"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2024-04-17 12:04:59",
    "text": "Ahhhhhh I see — so the schema is the same no matter what the content is in the FAQ — is that correct?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2024-04-17 12:06:08",
    "text": "Otherwise if the schema contains the contents of the FAQ won’t you need it to be added to the page each time the module is rendered? Even if there are multiple instances of the module on the page?"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-04-17 12:18:58",
    "text": "It contains the content of the FAQ but it would be nice if a module knew another one exists on the page and the schema would be combined into one. Maybe I'm asking too much but I brought it up because I could see a benefit of knowing how many module instances are on the page."
  }
]