[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-21 06:49:29",
    "edited": {
      "time_stamp": "2019-10-21 06:49:51"
    },
    "text": "Coded templates are more flexible, and do give you more fine grain control.\n\nMarketers sometimes prefer the drag n drop templates because they feel they can get in and make some small changes without requiring a developer.\n\nThat said, our new boilerplate(beta) + grid areas, kinda gives the best of both worlds. Developers have the control and flexibility they want, and designers have a simpler interface which enables them to drag n drop things around as needed.\n<https://github.com/HubSpot/cms-theme-boilerplate>"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-10-21 09:30:23",
    "edited": {
      "time_stamp": "2019-10-21 09:31:27"
    },
    "text": "Everything <@U7SL518D6> says. I think its more about how a marketing team wants to work. For example, I work with a content person that doesn't want to change page layouts (which makes both our lives easier). We have set page layouts for page types, then she plugs in the content. We've decided the layout design happens on the develop/design side and doesn't move past that team (aka me :wink: )"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2019-10-21 09:33:07",
    "text": "at our company we have found our clients don't mind coded templtes as long as you give them the flexibility they need within your custom modules"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2019-10-21 09:34:00",
    "text": "we typically build a single template with a flex column and then build the rest of the site with custom modules. that way the marketers stay within the functionality of each custom module and they can still drag and drop things up and down the page."
  }
]