[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-16 07:14:11",
    "text": "The <#CBBAW6Z3R|community-browser-extension> has been getting a lot of attention with hacktoberfest. I feel crankshaft is being underserved in this area. I realize the problem is that people don’t know how they can help.\n\nThe core thing we’re working on is the grid, then the rest will come more easily.\n\nIf you have ideas for how someone can start to contribute to this while we’re still in this early state, let me know I’ll get some issues put up on GitHub."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-10-16 08:34:05",
    "text": "ill be working on the grid stuff today for a bit. Will need some assistance in trying to figure out how the hell to do anything with Git as #newb in that area",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-10-16 08:58:13"
      },
      {
        "time_stamp": "2018-10-18 19:34:31"
      },
      {
        "time_stamp": "2018-10-18 19:42:23"
      },
      {
        "time_stamp": "2018-10-19 08:04:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-16 08:58:13",
    "text": "not a problem I can help with git. I’m not a total pro but once you get the basics of it, it’s really not to difficult, it’s even kinda fun/addicting"
  },
  {
    "poster": {
      "poster_name": "jim mikecz",
      "poster_handle": "jim.m"
    },
    "time_stamp": "2018-10-16 11:57:45",
    "text": "Hey all there are some new features in Crankshaft."
  },
  {
    "poster": {
      "poster_name": "jim mikecz",
      "poster_handle": "jim.m"
    },
    "time_stamp": "2018-10-16 11:58:22",
    "text": "It now has a MIT license. I convinced <@U7SL518D6> to lawyer up and get one.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-10-16 12:08:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "jim mikecz",
      "poster_handle": "jim.m"
    },
    "time_stamp": "2018-10-16 12:00:22",
    "text": "I also added an “advanced features” module (which our clients love). It’s basically a padding/margin slider feature for modules. We use it as a framework for new modules. It is similar to HubSpot’s default margin settings. The difference is that when you use the boilerplate module code you can get padding that works with background colors/images, etc."
  },
  {
    "poster": {
      "poster_name": "jim mikecz",
      "poster_handle": "jim.m"
    },
    "time_stamp": "2018-10-16 12:02:25",
    "text": "For some reason I am having trouble updating the file structure  in the CrankShaft repo so bear with me here."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-16 12:08:42",
    "text": "lol lawyer up, that sounds like I hired someone - we didn’t we just put the MIT license on it\n\nplain explanation of the license is here: <https://choosealicense.com/licenses/mit/>\n\nJust says everyone has permission to use it without restriction and it’s provided “as is” without warranty or liability on the authors end for what someone does with it."
  }
]