[
  null,
  null,
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-10-18 19:34:31",
    "text": "Just finally signed up for github and was playing around with it. Really hoping to contribute to <#CCQSQ2C6L|crankshaft>. Let me know some simple areas I could contribute to :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-18 19:42:23",
    "text": "Right now Aj has been working on the css grid, no commits posted yet so im not sure where we can help with that side of things but I'll try to come up with some tasks that need doing and put them up as issues in the GitHub.\n\nIf you have questions on how to work with git/github feel free to ask ill try to help where i can. Once you have the basics down its pretty easy and even addicting."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-18 20:22:40",
    "text": "Trying to add some issues to the github so it’s easier for everyone to grab something they want to work on and get started.\n\n<https://github.com/TheWebTech/CrankShaft/issues/9>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-18 21:12:00",
    "text": "I have to get to bed. I’ll try adding more Issues tomorrow.\n\nbasically though if you’re looking for a way to help, think of what frameworks like bootstrap and foundation have, and if you think of something you want to work on but aren’t sure if it makes sense to add it, create an issue, explain your idea, and feel free to tag me and we can talk about it before you spend time coding."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-10-18 21:12:32",
    "text": "I’ve also added some links in the readme file to great resources for getting started with git,  and github."
  }
]