[
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-08-12 07:10:30",
    "edited": {
      "time_stamp": "2021-08-12 11:34:20"
    },
    "text": "Morning, all. I wanted to get some opinions from you all. I’ve been hesitant to implement the new drag and drop functionality that HubSpot has released. However some of our clients have been requesting it as of late and I’m torn.\n\nPre the new drag and drop our team came up with a rock solid “modular” approach of which many of you probably do something very similar. It’s essentially one big flexible column that you can drag custom modules into to create your own unique layouts without going off-brand. It allows us to go “gridless” and create some really impressive modern layouts. Our design team loves it and I can’t say I miss a grid either. Our clients have been happy with this style of site management.\n\nMy hesitations with the drag and drop builds really boil down to a few things:\n\n• The need for a 12 column grid system. I try not to use a grid system these days and go “gridless” with CSS Grid or Flexbox. What if you want 5 columns in a 12 column grid? What if you want a “broken grid layout” Go custom module?\n• If you start making custom modules you start to have a mix of modules. Some full width and don’t work within columns, some that work within columns. Some that are drag and drop, some that are not. And that site management UX seems like it would be confusing to the client. Which module should I be using? I can adjust columns in this area, but not this one?\n• Drag and drop almost seems like too much control. Clients can (and most likely will) jack the site up with too much control. I do see pros to this as well, but it goes both ways. Our current modular method may be a bit more restrictive, but it prevents inconsistencies.\n• Etc.\nMaybe our team needs a mixture of both “modular” and “drag and drop”.\n\nTL;DR. I see some really impressive control with drag and drop, but at the same time its a bit limiting. What are your opinions. Are you all in on it? Don’t use it? Use a mixture?",
    "reply_count": 7,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-08-12 07:52:10"
      },
      {
        "time_stamp": "2021-08-12 07:55:47"
      },
      {
        "time_stamp": "2021-08-12 07:56:39"
      },
      {
        "time_stamp": "2021-08-12 07:59:53"
      },
      {
        "time_stamp": "2021-08-12 08:14:36"
      },
      {
        "time_stamp": "2021-08-12 10:49:33"
      },
      {
        "time_stamp": "2021-08-12 18:05:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-08-12 07:11:57",
    "text": ":wave: Yeah I think this is actually related to some new toolbar / dnd area UI we just finished rolling out. I hope to have a fix for this deployed to production today."
  },
  {
    "poster": {
      "poster_name": "Amrou Bellalouna",
      "poster_handle": "amrbellalouna"
    },
    "time_stamp": "2021-08-12 07:17:33",
    "edited": {
      "time_stamp": "2021-08-12 07:18:00"
    },
    "text": "Hey guys,\nCan someone help with the accounting extensions API ?\nI've been stuck at this for days\n Here's the thread <https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1628755645095800>"
  },
  {
    "poster": {
      "poster_name": "Sharmishtha Swaroop",
      "poster_handle": "sharmishtha.swaroop"
    },
    "time_stamp": "2021-08-12 07:19:10",
    "text": "<@U25PYL3Q8> I need to create a ticket , using HubSpot forms API is that possible"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-08-12 07:26:59",
    "text": "I pushed what I hope is a fix for this. Mind giving it another try and letting me know if it works better now?"
  },
  {
    "text": "You can go to your edit form, and then in the url you have the ID",
    "time_stamp": "2021-08-12 07:47:42"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 07:48:07",
    "text": "In my forms case, you can see the url, this is the part that is the form guid: `40abf6b4-afd4-47aa-ace6-0217b870cf22`"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 07:52:10",
    "text": "I pretty much solely use dnd areas. They make life way faster. Content teams seem to like it a lot better because they don’t need to rely on devs all the time. And it gives you the benefit of being able to build grid less if you want or with the standard grid. \n\nEach dnd section allows you to go full width. So if you use any of your gridless modules you can still make them do what they are supposed to do. \n\nIf you haven’t at the very least adopted themes yet I would say that you are pretty far behind the train in terms of making life heckin great for future you, your dev team, and your content team. "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 07:55:47",
    "text": "I def have a mix of custom modules that are grid based and not grid based. Never have had any real issues with clients on it. \n\nThey tend to stick to what is already on the site and often times will reference things that are already built. They might just click on it to see what the module is called and then pull it into the page that they are making. "
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 07:56:39",
    "text": "At the end of the day I think if your modules are named clearly — you shouldn’t have any real issues with it. And if you’re still worried about it you can build a modules page to showcase how modules are intended to be used. "
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2021-08-12 07:59:53",
    "text": "Thanks for the feedback, BJ. I definitely use Themes. That’s be fantastic. But I don’t however use the drag and drop functionality.\n\nWhat type of naming convention do you use for modules to help identify if something is full width or maybe a small element like a button that it to be used within the grid?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-12 08:14:36",
    "text": "We usually just add a FW prefix if it’s supposed to be Full Width. But typically if a client pulls something onto the page and it doesnt look quite right. It’s easy to figure out that you need to make it full width.\n\nAlso worth noting that you can now create premade sections. So you can create a whole area that a user can just drop into their page. Which means you can preset the section to full width if the module calls for that. Then there really isnt any configuring outside of the module that needs to be done"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-12 10:49:33",
    "edited": {
      "time_stamp": "2021-08-12 10:50:18"
    },
    "text": "Interesting side note. <https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Container_Queries|CSS container queries> are going to make it more easy to think of modules as adaptable to being used at multiple sizes."
  },
  {
    "text": "Is there any way to change the markup of blog comments without bruteforcing it with JS? I’d like to add avatars to the comments, which I could do by trying to grab their Gravatar from their email, but the comments module consists of (see image) which doesn’t really give me access to the markup or their email.",
    "time_stamp": "2021-08-12 11:30:15",
    "edited": {
      "time_stamp": "2021-08-12 11:31:38"
    }
  },
  {
    "poster": {
      "poster_name": "Sharmishtha Swaroop",
      "poster_handle": "sharmishtha.swaroop"
    },
    "time_stamp": "2021-08-12 12:43:05",
    "text": "yaa agreed. I have got the guid. Thanks for that. The other question that I am trying to figure is that I have a dashboard in HubSpot where I create a ticket. Can I customize this create ticket form such that I can send information from my which create a ticket in HubSpot"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:45:19",
    "text": "are you asking if you can create custom properties in a ticket?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:45:38",
    "text": "and then send them via form? If that is the question, I Don’t think so. I think you would need to create a custom object to add properties"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:45:42",
    "text": "but I’m not 100% on this"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:45:51",
    "text": "If you are asking how to do it via the api, you can see one of these two pages"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:45:56",
    "text": "<https://developers.HubSpot.com/docs/api/crm/tickets>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 12:46:02",
    "text": "<https://legacydocs.HubSpot.com/docs/methods/tickets/create-ticket>"
  },
  {
    "text": "awesome so we have a dashboard where I create tickets, can this api that you sent can help me get the data in here?",
    "time_stamp": "2021-08-12 13:07:44"
  },
  {
    "poster": {
      "poster_name": "Brian Dote",
      "poster_handle": "brian035"
    },
    "time_stamp": "2021-08-12 13:21:19",
    "text": "Great thank you <@U7SL518D6> I’ll do that today."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-08-12 13:58:43",
    "text": "has anyone tried to use Svelte in their HubSpot projects yet?",
    "reply_count": 11,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-08-12 14:10:12"
      },
      {
        "time_stamp": "2021-08-12 15:35:47"
      },
      {
        "time_stamp": "2021-08-12 15:52:42"
      },
      {
        "time_stamp": "2021-08-12 15:52:59"
      },
      {
        "time_stamp": "2021-08-12 18:38:06"
      },
      {
        "time_stamp": "2021-08-12 18:44:13"
      },
      {
        "time_stamp": "2021-08-12 18:44:44"
      },
      {
        "time_stamp": "2021-08-13 10:40:46"
      },
      {
        "time_stamp": "2021-08-13 10:46:20"
      },
      {
        "time_stamp": "2021-08-18 09:06:30"
      },
      {
        "time_stamp": "2021-08-27 11:44:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-12 14:10:12",
    "edited": {
      "time_stamp": "2021-08-12 19:15:10"
    },
    "text": "forget offhand who told me they’re using it (apologies as i know it was someone i talk to regularly). I can confirm I’ve heard of someone using Svelte on HubSpot and their impression was good."
  },
  {
    "poster": {
      "poster_name": "Brian Dote",
      "poster_handle": "brian035"
    },
    "time_stamp": "2021-08-12 14:32:19",
    "text": "It took a little bit it seems, works now, thank you!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-12 14:35:51",
    "text": "Thanks for letting me know, glad it’s working for you now!"
  },
  {
    "text": "these are the screenshot of how we create ticket on HubSpot",
    "time_stamp": "2021-08-12 14:50:53"
  },
  {
    "poster": {
      "poster_name": "Sharmishtha Swaroop",
      "poster_handle": "sharmishtha.swaroop"
    },
    "time_stamp": "2021-08-12 14:51:51",
    "text": "<@U25PYL3Q8> I am trying to create a ticket form on my website and hoping that will translate into a ticket in HubSpot"
  },
  {
    "poster": {
      "poster_name": "Sharmishtha Swaroop",
      "poster_handle": "sharmishtha.swaroop"
    },
    "time_stamp": "2021-08-12 14:52:16",
    "text": "so I am guessing this ticket API will help to do that ?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-08-12 15:15:05",
    "text": "I’m not so sure. I may not be the best resource for what you are tryin gto do"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-08-12 15:35:47",
    "text": "<@UQERM7BLY> I believe might have been the one"
  },
  {
    "poster": {
      "poster_name": "Sharmishtha Swaroop",
      "poster_handle": "sharmishtha.swaroop"
    },
    "time_stamp": "2021-08-12 15:39:45",
    "text": "ok thanks"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-08-12 15:52:42",
    "text": "I’ve used it for calculators/widgets. It works as a module pretty fantastically - simply because the bundles are so small."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-08-12 15:52:59",
    "text": "Looking into using it for a full-site. Not got to that yet though."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-08-12 18:05:05",
    "text": "Would the client be willing to pay more for the added control and functionality? The flexible column workflow sounds like you have it streamlined internal process which should make development faster and cheaper for client. So my  vote is do both."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-08-12 18:38:06",
    "text": "<@UQERM7BLY> did you include everything in a module.html file? Did you generate a module.js/css file when building? "
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-08-12 18:44:13",
    "text": "yes to both."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-08-12 18:44:44",
    "text": "In the rollup config you can simply specify where the js/css is emitted to"
  }
]