[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-08-26 06:26:59",
    "edited": {
      "time_stamp": "2021-08-26 06:28:45"
    },
    "text": "Hey I’m getting an error when saving in HubSpot design manager - Warning:\nMinification failed due to JS parsing error (Show output with ESLint enabled): `Unable to minify. Exception: For input string: \"102 83 255\"`\n\nAnybody seen this error before?"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-08-26 06:51:07",
    "text": "Hi everyone! Can the output of a custom code action in a workflow be used in any other way than using it in a ‘Copy property value’?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-26 07:05:10"
      },
      {
        "time_stamp": "2021-08-26 07:08:14"
      },
      {
        "time_stamp": "2021-08-26 07:08:35"
      },
      {
        "time_stamp": "2021-08-26 07:11:21"
      },
      {
        "time_stamp": "2021-08-26 07:11:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-08-26 07:05:10",
    "text": "Currently the only other place is a “value equals branch” action, but we have plans to make the outputs available in more places in the future"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-08-26 07:08:14",
    "text": "value equals branch, is that a filter?"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-08-26 07:08:35",
    "text": "And sounds great! I currently need a setup where I know if I can proceed with the workflow based on data I fetch with custom code."
  },
  {
    "text": "Yup, that sounds like a good use case for a “value equals branch.” It’s just a special type of if-then branch that only checks for whether the selected property or output exactly matches a value.",
    "time_stamp": "2021-08-26 07:11:21"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-08-26 07:11:33",
    "text": "Awesome! That is a great solution"
  },
  {
    "poster": {
      "poster_name": "Andrea Aldana",
      "poster_handle": "andrea115"
    },
    "time_stamp": "2021-08-26 07:12:12",
    "text": "Hello! Good morning community. I have a big doubt. We had an integration with zapier that created the contacts in HubSpot, but the original source was offline everytime. So, we did the Contacts Api integration to create the contacts, and the original source is still offline. What integration should be done to get the right source? We already have the tracking code installed in the website, and the non HubSpot form integrations, those work right. The problem is when the user does a google sign up, because is NOT a form, so I'm not sure what to try to make it work anymore."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-26 07:25:59",
    "text": "Just want to remind our community, if you’re looking for new projects, or looking for a new role at a new company, check out <#CBNDYJJAZ|jobs>. There’s been some activity in there lately."
  },
  {
    "subtype": "reminder_add",
    "time_stamp": "2021-08-26 07:29:10",
    "text": " set up a reminder “\"looking for HubSpot work? Check out jobs. Folks post both new job opportunities and projects they need help with there!\" every 4 mon” in this channel at 9AM Thursday, September 2nd, Central Daylight Time."
  },
  {
    "text": "Hello Everyone!\nI have issue when i try to login in HubSpot it showing me this page. How can i fix this? <#CDSFETF5X|help-the-community>",
    "time_stamp": "2021-08-26 07:53:14",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-08-26 08:17:37"
      }
    ]
  },
  {
    "text": "Hi Guys, Im tring to improve google speed insight, and I’m checking at the image options adding a custom maximum width in the module, but when I check the mobile google speed insight in mobile it is calling a bigger size for my image, what am i doing wrong?\n\nAttaching my settings in HubSpot, and attaching the google speed image loading in mobile",
    "time_stamp": "2021-08-26 08:08:54",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-08-26 08:52:42"
      },
      {
        "time_stamp": "2021-08-27 01:29:03"
      },
      {
        "time_stamp": "2021-08-27 03:12:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-26 08:17:37",
    "text": "Hey there, sorry to hear you’re having trouble logging in.\n\nWe have a help doc which shows troubleshooting steps you can take. If they don’t resolve the issue, you can use a form at the bottom of the page to contact support.\n<https://knowledge.HubSpot.com/account/why-can-t-i-log-into-HubSpot?_ga=2.185710507.309380568.1629724853-1888876121.1626111823>\n\nLet me know if you have trouble accessing this page."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-26 08:52:42",
    "text": "Those options there are really only specifying the visual size on screen. They will inline some CSS and set the width and height attributes on the img element.\n\nIf you want to bring in the image at a certain size you will either need to compress it yourself or use the `resize_image_url` function"
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2021-08-27 00:11:46",
    "text": "anybody using the adaptive testing on HubSpot landing pages? what's your pros and cons of it?"
  }
]