[
  {
    "poster": {
      "poster_name": "Amrou Bellalouna",
      "poster_handle": "amrbellalouna"
    },
    "time_stamp": "2021-08-15 05:50:11",
    "edited": {
      "time_stamp": "2021-08-15 05:56:26"
    },
    "text": "I don't mean to be rude or disrespectful but I find your response irrelevant and borderline arrogant because I asked for your help since dennis is always tagging you and the only thing you did is tell me you don't have time to teach me about something that I didn't even ask for in the first place.\n\nAnyway,\nI do understand it and I already have an application turning that takes in webhooks coming from HubSpot and does whatever it does.\nThe app has been authenticated and I have my token and all the scopes needed.\n\nIt's just that in the docs, once I get my token, I need to do the following \"Call the PUT <https://api.hubapi.com/crm/v3/extensions/accounting/user-account> endpoint with the OAuth access token that you just received, providing us with information about the account in your system that was connected with that Auth token.\"\nAnd why I do that, and I provide the necessary info, which is the accountId ( Or quickbooks company id), the request returns a 404 response and just don't know why :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ken Westfall",
      "poster_handle": "ken.westfall"
    },
    "time_stamp": "2021-08-15 19:41:27",
    "text": "<@U26BLKGE4> Just letting you know this worked for me too. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-08-15 23:46:48",
    "text": "Hi all, is it possible to do a user registration in HubSpot? I want to make a login page and save data for users like “liked recipes” and some other user related details. Is this possible?\nThanks alot!",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-16 07:14:54"
      },
      {
        "time_stamp": "2021-08-16 08:35:41"
      },
      {
        "time_stamp": "2021-08-16 08:37:21"
      },
      {
        "time_stamp": "2021-08-16 08:38:18"
      },
      {
        "time_stamp": "2021-08-16 08:38:41"
      },
      {
        "time_stamp": "2021-08-16 12:51:00"
      },
      {
        "time_stamp": "2021-08-16 15:28:17"
      }
    ]
  }
]