[
  {
    "poster": {
      "poster_name": "Rodrigo",
      "poster_handle": "rodrigo.castro"
    },
    "time_stamp": "2021-08-09 06:45:21",
    "text": "Hello everyone! Did anyone completed the HubSpot certification? If so, Did you create a theme from scratch or you can use the boilerplate as an starting point?"
  },
  {
    "text": "Hello!\n\nCan anyone tell me if it’s possible to put a HubSpot CRM iframe inside another system, like Twilio Flex?\nI would like to have the entire HubSpot interface for my agents within a service platform.\n\nI know HubSpot’s own team did this, however I don’t know if this iframe is available to any customers or if it’s something just for their internal team.\n\nExample:",
    "time_stamp": "2021-08-09 07:11:00",
    "edited": {
      "time_stamp": "2021-08-09 07:11:14"
    }
  },
  {
    "poster": {
      "poster_name": "Nick Verwymeren",
      "poster_handle": "nick759"
    },
    "time_stamp": "2021-08-09 08:23:57",
    "text": "Hello\nI’m wondering if anyone has any advice on how to integrate GTM’s <https://support.google.com/analytics/answer/9976101|Consent Mode> with HubSpot’s cookie banner. It doesn’t look like HubSpot is one of the integrated providers, so I’m guessing there would be some javascript that would need to be fired off to GTM once the HubSpot banner has been accepted."
  },
  {
    "poster": {
      "poster_name": "Mike Snyder",
      "poster_handle": "mikes"
    },
    "time_stamp": "2021-08-09 10:51:38",
    "edited": {
      "time_stamp": "2021-08-09 11:16:08"
    },
    "text": "Hi! Is there a way to pull tickets/activity from the zendesk/HubSpot integration via the API ?\nThe integration is showing my zendesk activity per contact in HubSpot and I'd like to access that data for a dashboard summary in my own application.\n\nI've tried both 'engagements' and 'emails' and no signs of zendesk in there."
  },
  {
    "poster": {
      "poster_name": "Daniel de Brito Sanchez",
      "poster_handle": "daniel772"
    },
    "time_stamp": "2021-08-09 11:46:12",
    "text": "Hello,\n\nToday 2 of my portals received an update and we simply can't select our templates to create new landing pages anymore. It only appears the option to choose themes and not our drag and drop templates.\n\nI need the accounts to go back to the previous version, to be able to recreate the landing pages with our templates.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-08-09 11:52:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-08-09 11:52:41",
    "text": "Hey Daniel I am sending you a DM right now on this :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-08-09 18:48:38",
    "text": "What's the best way to reset the default content of a global partial?"
  }
]