[
  {
    "poster": {
      "poster_name": "Jake",
      "poster_handle": "jake.msnellin"
    },
    "time_stamp": "2023-09-25 02:40:46",
    "text": "Hi all. I'm trying to add a script to the head tag of an embedded hs meeting form. The script is for configuring vwo a/b testing.\nIt's tricky as the form is on a different domain to the page. The browser is preventing me from accessing the iframe document\nfrom the parent. Is there a way to achieve this? Thanks for your help!"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-09-25 04:10:28",
    "edited": {
      "time_stamp": "2023-09-25 04:10:31"
    },
    "text": "It seems to be on every single page that’s hosted in HubSpot when I’m logged in."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-09-25 04:12:06",
    "text": "I’ve checked on 3 of my portals and is happening on all of them, pretty sure i’ve been getting it on others too"
  },
  {
    "poster": {
      "poster_name": "Alejandro Vieira",
      "poster_handle": "avieirabaa"
    },
    "time_stamp": "2023-09-25 04:15:37",
    "edited": {
      "time_stamp": "2023-09-25 04:15:54"
    },
    "text": "Good morning everybody, How are you?\n\nRecently we have been getting an increase of leads that complete a form submission and both original source and latest source are correctly populated, however it seems that the users are leaving the page open on the thank you page, once they resume their session after the original one ends, HubSpot changes their session as a direct traffic source. Is there a way we could mitigate this issue and keep the initial source populated instead of direct traffic?\n\nThank you very much for the help channel!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-25 14:57:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jaydeep Prajapati",
      "poster_handle": "jaydeepprajapati"
    },
    "time_stamp": "2023-09-25 06:00:39",
    "text": "Good Morning ALL,\n\nWe have a custom request a quote form within our website \"<https://theinvisiblecollection.com/>\" &amp; we have automated the form submission sent to the \"<mailto:quotes@theinivisiblecollection.com|quotes@theinivisiblecollection.com>\" email to create a ticket &amp; contact in HubSpot. We have set up an automation on the email so it is creating a lead/ticket on HubSpot but this is not creating a contact in HubSpot.\n\nCan anyone let us know what is wrong that I am doing."
  },
  {
    "poster": {
      "poster_name": "Jass Negi",
      "poster_handle": "jeetunegi04"
    },
    "time_stamp": "2023-09-25 06:31:12",
    "text": "you can ask me."
  },
  {
    "text": "For the HubDB tables, I’ve had my super admin set up a private app for me which I am using that access key to set up a JS API route endpoint which automatically updates the HubDB table. The issue is that it shows my super admin’s name on table updates. There isn’t any way to have it show the private app’s name instead, is there?",
    "time_stamp": "2023-09-25 11:23:54",
    "edited": {
      "time_stamp": "2023-09-25 11:24:31"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-25 14:49:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-09-25 12:29:41",
    "text": "Oh, that’s quite interesting — I didn’t notice when it disappeared, but I actually don’t see the Sprocket Menu at all anymore.\n\nThe thing that _really_ sticks out to me is the address that it’s referencing: I’m not aware of a way to run a local development server for HubSpot, so why would it be checking a local address for that purpose?\n\nMy only hunch is that it might be living in a service worker, which would go some ways to explaining the reference to local addresses. Have you tried flushing those to see if it resolves? You might have an outdated or otherwise bad version cached.\n\nOr, do you have any HS-related browser plugins installed?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-09-25 14:49:06",
    "text": "Not necessarily an ideal solution, but you could create a user account for that private app, then generate an API key using that account."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-09-25 14:57:23",
    "text": "Please let me know if you find a solution to this!\n\nOne of my associates has been having a similar issue of sessions attached to form submissions being incorrectly attributed as direct traffic, and we haven’t been able to find a workaround that doesn’t significantly degrade tracking performance in other areas."
  },
  {
    "poster": {
      "poster_name": "Girijesh Thodupunuri",
      "poster_handle": "girijesh.thodupunuri"
    },
    "time_stamp": "2023-09-25 21:09:06",
    "text": "Does anyone know how i can integrate authentication into a website I created using the interactive theme from market place?"
  }
]