[
  {
    "poster": {
      "poster_name": "Manoj Sharma",
      "poster_handle": "softengg.manoj"
    },
    "time_stamp": "2023-09-28 03:54:01",
    "text": "Hi Support,\n\nI want editor option in email templates (like: drag and drop feature). Please suggest me or provide me any documentation for the same.\n\nThank you.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-28 08:15:48"
      },
      {
        "time_stamp": "2023-09-29 00:04:59"
      },
      {
        "time_stamp": "2023-09-29 08:22:35"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2023-09-28 08:15:48",
    "text": "Hey Manoj - just to be clear, our Developer Slack isn't a HubSpot support channel, but rather a community of developer peers that may be able to help you with ideas. Thanks!"
  },
  {
    "text": "Did anyone notice the unique value setting for contacts is enabled now? Although, it doesn't seem to actually be treated as an alternate id. At least not with the manual import tool. I haven't tried the api yet though.",
    "time_stamp": "2023-09-28 09:05:33"
  },
  {
    "poster": {
      "poster_name": "Zoe Lusth",
      "poster_handle": "zoelusth"
    },
    "time_stamp": "2023-09-28 18:20:41",
    "edited": {
      "time_stamp": "2023-09-28 19:16:48"
    },
    "text": "*NEVERMIND! It is working. It seems like there is a delay between when you publish changes and Hubl starts working, sent the same email again without touching it a viola! Leaving this in case anyone else has the same issue. I noticed this before as well. If you can't see the HubL code in your template...wait.*  Hi there, I am trying to write some HubL to personalise email content based on a contact's properties. We have a property for the contact's assigned branch location, and so I'm writing conditional logic that says if branch location is DUR, display Durham, if JAX, display Jacksonville, and so on. I tested my logic with contact.firstname first to make sure everything was working as expected. Then I changed property and it stopped working, so the issue lies with that. I can't find information or just an example of how to target custom contact properties, the internal name is \"sb_branch_location\" but \"<http://contact.sb|contact.sb>_branch_location\" isn't working... I'm not looking for support just information. I have written this logic many times Iterbale's Handlebars, Braze's Liquid, even Mailchimp. I can't find any documentation or an example on this fairly basic personalisation exercise (i.e. how to reference contact properties in HubL)"
  },
  {
    "poster": {
      "poster_name": "Kobe Kapoor",
      "poster_handle": "kobe"
    },
    "time_stamp": "2023-09-28 21:12:18",
    "text": "Hey all, does anyone know if its possible to get a test account to have less than enterprise features to test the limits of an application?"
  },
  {
    "poster": {
      "poster_name": "Alina",
      "poster_handle": "alina.zubkova"
    },
    "time_stamp": "2023-09-29 00:04:59",
    "text": "Hey SJ Morris, where could I post a support question? chat within HubSpot subscription didne help me to find information for integration (Developer API key, client ID etc)?"
  }
]