[
  {
    "text": "Hello, everyone!\n\nI am trying to make an api call to create a new contact (through my app), when I send the request, it ignores the content (email, first, last name) and creates the body without them and returns HTTP 201 but the user created is empty like the picture down below. I tried sending the same body through the endpoint in the documentation, it works perfectly. I don't know what's the problem",
    "time_stamp": "2023-09-11 05:50:12"
  },
  {
    "poster": {
      "poster_name": "Grant Carlile",
      "poster_handle": "gcarlile"
    },
    "time_stamp": "2023-09-11 09:20:41",
    "text": "HubSpot.Extend() 2023??\n\nDo we’ve dates?",
    "reply_count": 7,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-09-11 09:21:41"
      },
      {
        "time_stamp": "2023-09-11 09:22:38"
      },
      {
        "time_stamp": "2023-09-12 09:08:34"
      },
      {
        "time_stamp": "2023-09-12 20:56:15"
      },
      {
        "time_stamp": "2023-09-13 08:45:30"
      },
      {
        "time_stamp": "2023-09-13 08:46:34"
      },
      {
        "time_stamp": "2023-10-10 12:53:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-09-11 09:21:41",
    "text": "Interesting, i thought about the same flying home from Inbound yesterday :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2023-09-11 09:22:32",
    "text": "Hello everyone, I see some of you already asked some questions related to this, but maybe there is an update or something. Is there a way to add custom code to the CTAs Beta, or to add a custom module for them? We have buttons in our site that look different from what we can get with the drag and drop and we need to be able to track this. What is the solution?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-09-11 09:22:38",
    "text": "Looks like last year was at the end of October"
  },
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-11 14:38:55",
    "text": "Hi everyone,\nI'm using this API: <https://api.hubapi.com/crm/v3/objects/contacts/batch/update> to set the value of a custom property for a contact. Afterward, an email will be sent using a workflow. However, I would like to know if there's any possibility to send customized data using this API, as I intend to use it in the email that will be sent from the workflow"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-09-11 15:51:22",
    "edited": {
      "time_stamp": "2023-09-11 15:51:39"
    },
    "text": "There seems to be a bug with creating new pages in Content Staging as of today. When creating a new staging page, it redirects to a blank page where the create a new page dialog pops up again, but then errors out when you try to select a template. You have to go back and then edit the page and it will tell you to select a template because the page has none set.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-11 15:53:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-09-11 15:53:30",
    "text": "And the “back to content staging” link on the page template selection takes you back to Website pages, rather than Content Staging."
  },
  {
    "text": "Hello everyone! I have a question... when I make a request using the PATCH method to a contact via email, I get a status code 405. This is an example of how I am making the request in postman:",
    "time_stamp": "2023-09-11 16:19:11"
  },
  {
    "poster": {
      "poster_name": "Daniel Mahadi",
      "poster_handle": "daniel.mahadi"
    },
    "time_stamp": "2023-09-11 21:31:58",
    "edited": {
      "time_stamp": "2023-09-11 21:33:11"
    },
    "text": "Hi everybody\nwe are looking at the pages that serve from HubSpot.. it contains many newlines and extra spaces. I am wondering if there is a way to clean it up properly before serve it down to the browser?\n\nIn other word.. i am looking for something like html document minifier"
  }
]