[
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-09-26 02:55:29",
    "text": "Hmm if I log in, in an incognito window, I don’t get the sprocket??"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2023-09-26 03:26:39",
    "text": "BUG:\nIt looks like if you clear all your cache and local storage on chrome or firefox, when you log in the sprocket will no longer appear.\nI think this might actually be an issue with the latest updates to chrome and firefox.\nThey’ve added privacy features <https://www.google.com/intl/en_uk/chrome/privacy-on-the-web>\nPeople in the past have run up against privacy extensions blocking them in the past.\n<https://community.HubSpot.com/t5/Blog-Website-Page-Publishing/Can-t-see-HubSpot-sprocket-icon-on-live-site/m-p/298805>\nThis needs to fixed!"
  },
  {
    "poster": {
      "poster_name": "Pete Brzezinka",
      "poster_handle": "peter212"
    },
    "time_stamp": "2023-09-26 06:11:44",
    "edited": {
      "time_stamp": "2023-09-26 06:13:01"
    },
    "text": "Hi!  Can someone walk me through an API request Ive submitted to Bullhorn?  THey've asked me to supply some info but I'm unsure what I need to give them:\n\n_This is Michael from Bullhorn Support. I am following up on Ticket 05332565. I have taken ownership of this ticket and I will be happy to assist you with this ticket._\n \n _I couldn't find any references indicating a HubSpot API user, so I am creating one for you._\n \n _Before I set up your credentials, I need some information from you or your developer:_\n \n _Redirect URI(s) – You can have multiple redirect URIs, but they need to be valid (for example, <http://www.bullhorn.com>). If you’re not sure what URI to use, please contact your developer._\n \n _Terms of Service – An agreement that must be accepted during the authentication process. This would also be provided by your developer if needed._\n \n _Once we have this information, I will complete the setup and send your new REST credentials!_",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-27 02:02:16"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2023-09-26 08:01:11",
    "edited": {
      "time_stamp": "2023-09-26 08:01:14"
    }
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-09-26 08:55:36",
    "edited": {
      "time_stamp": "2023-09-26 08:55:50"
    },
    "text": "<@UDJV5B73R> an update was rolled out that should have made this page (and a bunch of others) a lot more performant. Can you give it a spin and let us know if that's reflected on your end? Appreciate the feedback!"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-09-26 09:02:07",
    "text": "It appears to have fixed it!"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-09-26 09:05:33",
    "text": "Yes 2 years later someone finally fixed it :slightly_smiling_face:\nIt only takes a couple of seconds to load now I’ve seen faster pages but definitely so much better now!"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-09-26 09:06:35",
    "text": "Shout out to <@U7SL518D6>! Thanks for your persistence/patience, all!"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-09-26 09:06:44",
    "text": ":jon-m:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-09-26 09:42:32",
    "text": "Sorry that it took awhile to implement a good fix. The core issue was how the code blocks render, and those code blocks were implemented about a year ago almost exactly.\n\nIt’s been an issue that’s bugged me a long while but finally had some time to troubleshoot. The solution in-case anyone wonders, is that we now lazily run the syntax highlighting for the code blocks. Syntax highlighting requires HTML elements to be rendered to do all of the styling and well, on a page with 40+ code samples which could be more than 10 lines of code on average, it means hundreds to thousands of new HTML elements that have to render to the page. Previously the browser tried to render all of the html elements at once. Now we only do it when you’re close to possibly viewing the code block.\n\nThere are some other performance enhancements I’m interested in trying as well to make it more performant but we’ll see. They may be more negligible."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-09-26 09:56:08",
    "text": "I feel like there must have been more to it? was it recursively doing it or something as I can load the page and scroll to the bottom in less time than the page loaded previously. When I looked at it before in the network requests it was like it was waiting for some analytics or something (that eventually timed out) before it started actually loading the page.\n\nMight be completely wrong though.\n\nWhatever you did worked so I’m happy with that!\n\nI do notice there are still 4 x 400 errors when the page loads.\n\nBut yeah as you say anything else you do will be fairly negligible in comparison to reducing the response time from half a minute to 1-2 seconds"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-09-26 11:00:03",
    "text": "I’ll look into the 400 errors. Some I don’t have control over (there are multiple teams that own pieces of the site).\n\nThe lazy syntax highlighting was most of it.\n\nThe reason you’re experiencing such a difference is that loading the files was never the slow part. Basically what’s happening is that instead of handing your computer thousands of lines of HTML to render and repaint right while the browser is loading, you’re instead giving it  tiny pieces of that to render as the user is navigating the page.\n\nDrastically reducing CPU and memory needed at the initial page load."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-09-26 11:11:57",
    "text": "I’ve reported the 400 errors internally hopefully they can be resolved soon. I don’t think they have a drastic affect on performance though so that’s good."
  },
  {
    "poster": {
      "poster_name": "Rick",
      "poster_handle": "rgonzalez"
    },
    "time_stamp": "2023-09-26 13:16:41",
    "text": "Hi everyone, I've got a question, and I'm hoping you can assist me. I'm using the Wix CMS for my website, and I want to integrate a HubSpot form into it. However, when I insert the form script into a custom HTML module (similar to how it's done in WordPress), I'm encountering an issue. The form sometimes doesn't show up, and even when it does, the submit button doesn't seem to work consistently. Does anyone have insights into why this might be happening, or perhaps know the correct way to go about inserting it?"
  },
  {
    "poster": {
      "poster_name": "Vijay Vadlamani",
      "poster_handle": "vvadlamani"
    },
    "time_stamp": "2023-09-26 18:59:29",
    "text": "Sorry for the late reply here. Happy to chat. Feel free to book an appointment here - <https://meetings.HubSpot.com/vvadlamani>"
  },
  {
    "poster": {
      "poster_name": "Sahai",
      "poster_handle": "abhinav"
    },
    "time_stamp": "2023-09-27 00:54:54",
    "text": "Thanks Vijay, have booked for next time and added my colleagues"
  }
]