[
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-09-01 05:04:05",
    "text": "Yesterday I stumbled upon this, it might give some insights\n<https://community.HubSpot.com/t5/CMS-Development/How-convert-a-custom-local-module-to-a-global-module/m-p/681415>"
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-09-01 05:05:01",
    "text": "Found this aswell but did not work. I then made a new local module and copy and pasted"
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-09-01 05:16:27",
    "text": "I hadn't tried it myself yet, good to know. Sorta :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-09-01 07:59:25",
    "text": "you could alternatively allow the curly braces and wrap the code in a {% raw %}\n\n{% endraw  %}\n\nThis will cause the HubL renderer to ignore anything that looks like HubL between those tags."
  },
  {
    "poster": {
      "poster_name": "Sandip More",
      "poster_handle": "sandip"
    },
    "time_stamp": "2023-09-01 08:11:25",
    "text": "Hi All, I am looking for one inbound ticket. Let me know if anyone can help. "
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-09-01 10:21:10",
    "text": "Just a quick reminder that if you'll be at INBOUND next week, don't forget to join the <#C05GQ0GCMAM|inbound23> channel! We'll be sharing all kinds of cool updates specific to the developer community."
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-09-01 11:05:30",
    "edited": {
      "time_stamp": "2023-09-01 11:05:31"
    }
  },
  {
    "poster": {
      "poster_name": "Harris Kenny (Intro CRM)",
      "poster_handle": "harris"
    },
    "time_stamp": "2023-09-01 12:53:44",
    "text": "hi i have a test app account that doesn’t have trial access enabled, so i can’t test workflows etc. i’ve connected my app and done an API call to it. i just created it today through my developer account. any idea what might be going wrong?"
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2023-09-01 15:52:36",
    "text": "Does anyone have any ideas or already implemented processes for tracking custom features on client sites?  For example: we have a lot of HubSpot clients, multiple sites, and frequently need to find an example of feature \"xyz\" and it would great to have a way to track that and attach it to whatever domain/client/etc and have it be searchable etc.  Bonus points for anything automated since everyone knows after the first day I'll forget to enter stuff manually or will in fact forget where I was storing said information :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jordan Ryken",
      "poster_handle": "jordan.ryken"
    },
    "time_stamp": "2023-09-01 22:05:31",
    "text": "Hey everyone - Drafter AI is making a new tool (that already works, but we're cleaning and refining it) which generates perfect custom code actions for HubSpot (e.g. workflows) based on natural language (e.g. \"make a code that takes a contact and does xyz\"). I'm manually processing a few hundred pages of documentation pulled from the api documentation webpages. Does anyone have a clean download of the entire API and CMS documentation that could save me a few hundred hours of time?\n\n:bulb: Feel free to @ anyone at HubSpot who might be able to help! :bulb:\n\n The first tool generates custom code actions from natural language\n The second debugs custom code actions for a given code and execution log\n The third (in progress) will convert custom code actions into custom workflow actions ready to put on the marketplace"
  },
  {
    "poster": {
      "poster_name": "Jordan Ryken",
      "poster_handle": "jordan.ryken"
    },
    "time_stamp": "2023-09-01 22:05:47",
    "text": "CUSTOM CODE ACTION AND CUSTOM WORKFLOW ACTION EXAMPLES ARE ALSO VERY HELPFUL"
  }
]