[
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2023-09-14 01:16:02",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-09-15 09:18:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tom-Erik Paulsen",
      "poster_handle": "tom-erik"
    },
    "time_stamp": "2023-09-14 02:04:17",
    "text": "Does anyone know how to make a page-template out of an existing page?"
  },
  {
    "poster": {
      "poster_name": "Tom-Erik Paulsen",
      "poster_handle": "tom-erik"
    },
    "time_stamp": "2023-09-14 02:04:35",
    "text": "I want the modules along with the data they contain and settings ..",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-14 02:37:28"
      },
      {
        "time_stamp": "2023-09-15 00:11:03"
      },
      {
        "time_stamp": "2023-09-15 07:47:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andrea Mujica",
      "poster_handle": "andrea.mujica"
    },
    "time_stamp": "2023-09-14 02:18:42",
    "text": "Hello, I hope you are well. I have a query to see if you can help me with codes, I'm designing a landing page, and I have made a table with some buttons. In the computer version looks good, but then the responsive version looks messy buttons, I am told that can only be fixed with codes.\n\nCan you help me if possible with a solution?\n\nThank you very much!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-09-14 02:37:28",
    "text": "You can save sections of a page, but not entire pages"
  },
  {
    "poster": {
      "poster_name": "Milis",
      "poster_handle": "mahroucha4"
    },
    "time_stamp": "2023-09-14 03:10:13",
    "text": "Hello everyone,\nI'm using a workflow action to customize code. In this code, I have a property containing JSON data that I decode into an array. My question is, how can I use the output of this code in the next action in my workflow, which is to send an email?"
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-09-14 06:25:10",
    "text": "Hey developers,\nI’m getting the `403 Forbidden` error since I linked my domain to HubSpot.\n\nOn HubSpot, it says that the DNS records are correctly set up but when I open the site I get the errror: <https://afronorana.com>\nAny ideas on how to approach it?"
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-09-14 09:26:23",
    "text": "can you make hubL references within the source code on the web page editor UI?"
  },
  {
    "poster": {
      "poster_name": "Schuyler Maclay",
      "poster_handle": "smaclay"
    },
    "time_stamp": "2023-09-14 09:33:55",
    "text": "<https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1694705549802399>"
  },
  {
    "text": "is unitcost a property you created, or are you trying to target the one in my screenshot? If the latter, use the internal name - hs_cost_of_goods_sold.\n\nAlso - for any date properties, you will likely need to convert them to unix timestamps. Depending on whether or not they are date, or datetime fields, you may also have to set the date to midnight prior to converting to unix (though I guess you could do it after too if you really wanted. I wouldn’t recommend it though).\n\nLastly, I recommend using the *`/crm/v3/properties/{objectType}`* endpoint, which you can read a bit more on via the link I provided in my last comment. for objectType, use line_item. This way, you can easily identify all properties available to you on line_items, as well as other important details, such as fieldType and whether or not you’re able to edit those values.\n\nThe overview tab also contains very valuable info regarding the different field types and the values they will accept.",
    "time_stamp": "2023-09-14 09:56:41"
  },
  {
    "poster": {
      "poster_name": "Kauland Buchanan",
      "poster_handle": "kauland.b"
    },
    "time_stamp": "2023-09-14 10:13:57",
    "text": "I’m having trouble grabbing displaying site setting details from my account on my template page. I’m trying to render `{{ site_settings.company_name }}` but it’s returning empty. I definitely have a company name set in settings &gt; account defaults so I’m pretty confused. I tried running `{{ site_settings|pprint }}` to see what was coming through and it’s all empty. Am I looking in the wrong place?"
  },
  {
    "poster": {
      "poster_name": "Darren Brar",
      "poster_handle": "darren.brar.747"
    },
    "time_stamp": "2023-09-14 17:24:01",
    "text": "Does anyone happen know if Expression Engine can integrate with HubSpot? Thank you in advance "
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2023-09-14 23:28:43",
    "text": "Hi all,\nI would need to search for text, entered in input text field, in 2 richtext columns of a HubDB table; I have tried everything but can't get results on both columns. The search query is this:\n{% set query = query ~ \"&amp;question__icontains=\"~request.query_dict.ricerca_libera|urlencode ~ \"&amp;answer__icontains=\"~request.query_dict.ricerca_libera|urlencode %}\nwhere \"request.query_dict.ricerca_libera|urlencode\" is the input field where the user types in the text to be searched for\nFor now I solved it by inserting a third column in the table with both data: question and answer but I would like to understand if it is possible to search a richtext or text field across multiple columns\nThanks\n\nGiovanni"
  },
  {
    "poster": {
      "poster_name": "Tom-Erik Paulsen",
      "poster_handle": "tom-erik"
    },
    "time_stamp": "2023-09-15 00:11:03",
    "text": "Yes, I was hoping for a whole page."
  }
]