[
  {
    "poster": {
      "poster_name": "Danny Shekhtman",
      "poster_handle": "dshekhtman"
    },
    "time_stamp": "2024-06-17 08:15:44",
    "text": "Hey there. Could you describe your use-case a little bit more? Is there a reason you'd like to use a button rather than a link to take someone to an external page? There are some security as well as accessibility implications to taking users to external pages, especially without their knowledge, so it's something we are careful about. Hence why external domains on links will automatically receive an \"external link\" icon in the UI so the user is aware both visually and through a screen reader.\n\nBy the way, are you working on a private app or a public app?"
  },
  {
    "poster": {
      "poster_name": "dac dao",
      "poster_handle": "dacdao01"
    },
    "time_stamp": "2024-06-17 08:19:40",
    "text": "Hi Danny,\n\nThe app I am creating is a private app. So I wanted to take the user to a docusign document that the user can edit on a different window. I am running a function within my code that does a tons of post and get call and I wanted to take the user to the document once those api calls are done within my function."
  },
  {
    "poster": {
      "poster_name": "dac dao",
      "poster_handle": "dacdao01"
    },
    "time_stamp": "2024-06-17 08:23:14",
    "text": "So far my workaround is to have a crmactionbutton that I will hide, once all of the api calls are done, then that button is visible and the user have to click it to traverse to the docusign website. I just feel like that is an extra step that could be skip (for the user to wait and then click on another button to open a new tab)"
  },
  {
    "poster": {
      "poster_name": "Danny Shekhtman",
      "poster_handle": "dshekhtman"
    },
    "time_stamp": "2024-06-17 09:22:54",
    "text": "Thanks for the info. I think your workaround is a good solution for the time being. Let me take this to my team and see if there's anything nicer than can be done while still preserving our security guarantees to users."
  },
  {
    "poster": {
      "poster_name": "maxime ferret",
      "poster_handle": "m.13ferret"
    },
    "time_stamp": "2024-06-17 12:42:54",
    "text": "<@U03FJQPSC0Y> A usecase I have have in mind would be to log a meeting that is already defined, because booking a meeting involves filling a lot of information. Even if the meeting type is defined as well as all the associated details, by log a meeting or a call, I still have to fill every step.\nOr for example get access to a meeting link directly.\n\nAll of that could be done via a card, but as a UI component it would be nice :)"
  }
]