[
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2024-06-24 08:41:19",
    "text": "The github integration doesn't let me see any org repos or repos owned by other users where I'm the admin, is this intended?"
  },
  {
    "text": ":alert::alert: *UI Component Updates!!*\n\nHello, hello! We have some exciting updates for y'all today:\n1. NEW *<https://developers.HubSpot.com/docs/platform/ui-components/modal|Modal>*<https://developers.HubSpot.com/docs/platform/ui-components/modal| >*<https://developers.HubSpot.com/docs/platform/ui-components/modal|component>*: This can be used to create confirmation dialogs and popups. This component helps streamline user focus and can be used to signal destructive actions. See GIF below for visuals:tada: \n2. NEW API for *<https://developers.HubSpot.com/docs/platform/ui-components/panel|Panel component>*: We've updated our API for the Panel component to make it simpler and easier to open and close. We've added a new prop called *`overlay`* which allows for consistent usage across Panels and Modals. \n    ◦ Why this change?:thinkonk: We heard your feedback and made some changes to make this experience smoother. This new API makes overlays simpler to manager, has lesser functions to keep track of, and deals with additional popups like Notes from CrmActionButton better. \n    ◦ If you’ve used the Panel component in the past, the good news is that *nothing* needs to be changed on the design side. The primitives for the Panel remain the same.\n    ◦ There's no need to use `reactions` anymore. We are not deprecating the older reactions-based Panels just yet, but will be rolling it back slowly over time. We highly recommend shifting to this new API and we believe it'll make your life easier:star-struck:\n3. In addition to the docs, here's an *<https://developers.HubSpot.com/docs/platform/sample-projects#overlay-example|Overlay example sample>* that walks through the different kinds of overlays and guidelines of when to use them. \nThank you for your patience as we better our components and add to our ever-growing list. Please drop any feedback in the thread, would love to your thoughts on this new API:thread:",
    "time_stamp": "2024-06-24 13:32:02"
  },
  {
    "poster": {
      "poster_name": "Kobe Kapoor",
      "poster_handle": "kobe"
    },
    "time_stamp": "2024-06-24 19:11:40",
    "text": "Does anyone know how to make a box full width in a flex in a sidebar card?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-26 08:07:05"
      }
    ]
  }
]