[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-06-12 05:45:12",
    "text": "Last I knew you cannot trigger a webhook from a form submission.  But you could create a workflow based on a form submission and the add a webhook call.  This is only available for Market Enterprise though afaik.  I have not tried it but you might be able to use Zapier's webhook functions as well."
  },
  {
    "poster": {
      "poster_name": "Deborah Sanchez",
      "poster_handle": "deborah.sanchez"
    },
    "time_stamp": "2024-06-12 05:45:19",
    "edited": {
      "time_stamp": "2024-06-12 05:46:05"
    },
    "text": "Hi! I have a react app with some components on it. I have to bring those components to a hubSpot project (which I have never used before). Inside my react app I am using material ui, framer motion, maplibre-gl, react-map-gl, axios, and other libraries. Can I get all the code into HubSpot ? or I am not able to do that ?"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2024-06-12 06:37:12",
    "text": "Hey <@U077K3S44KY>, our overview doc <https://developers.HubSpot.com/docs/platform/ui-extensions-overview|here> contains some more info re: your question. We don't support non-HubSpot UI libraries, and due to the nature of our renderer + security precautions, we don't allow packages that touch the DOM. Could you tell me more about your use case?"
  },
  {
    "text": "Hi <@U04EJHVD8FM>! Thank you so much for your reply. I have a very specific hero that I needed to develop. I should be interactive and match a specific map tile we created, change map with each different tab and render the info of each marker (which appears on the map), on the right hand panel. I can provide an img of the result code in react:",
    "time_stamp": "2024-06-12 06:46:10"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2024-06-12 06:55:48",
    "text": "We allow the opening of an iframe in a modal <https://developers.HubSpot.com/docs/platform/ui-extensions-sdk#open-an-iframe-in-a-modal>. That might be better for your usecase here. That UI will be hard to re-create inside HubSpot."
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2024-06-12 14:47:35",
    "text": "If I want to get CRM associations within a custom card is the only way to use a serverless function and make an API call? Just want to make sure I am not missing anything similar to the fetchCrmObjectProperties  function",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-12 15:08:34"
      },
      {
        "time_stamp": "2024-06-12 15:09:29"
      },
      {
        "time_stamp": "2024-06-12 15:10:13"
      },
      {
        "time_stamp": "2024-06-12 15:10:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-06-12 15:08:34",
    "text": "Yeah currently that’s the only way, would be pretty sick to have a graphql function similar to the fetchCrmObjectProperties function "
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2024-06-12 15:09:29",
    "text": "Agreed, or at a minimum something mirroring crm_associations and crm_objects HUBL functions"
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2024-06-12 15:10:13",
    "text": "I just feel a little hesitant to call an api call (maybe more then one) on every page load theoretically"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-06-12 15:10:52",
    "text": "Yeah it’s a little annoying but honestly I do it a good bit with no issues"
  }
]