[
  {
    "time_stamp": "2023-02-07 08:00:11",
    "text": "Reminder: What cool things have you been working on? show it off we love to see everyone’s cool and creative work. If it’s a site built on HubSpot consider also posting to the <https://designers.HubSpot.com/inspire|Inspire gallery>."
  },
  {
    "poster": {
      "poster_name": "Jatin Sandilya",
      "poster_handle": "sandilya.jatin"
    },
    "time_stamp": "2023-02-07 09:02:03",
    "text": ":rotating_light: *Launch Alert!* :rotating_light:\n\nIntroducing Revert :sparkles: (<https://revert.dev><https://revert.dev%29|)> - a single API to build customer facing CRM integrations.\n\nOver the past 6 months, I spent a ton of time building a tool for developers that involved 50+ integrations.\n\nI spoke to 100+ developers &amp; 50+ companies in the process but no one wanted what I had built.\n\nDuring those conversations however, CTOs told me that instead of integrating third party tools (think Slack/ Salesforce) with their internal processes (which my product solved for), they’d rather have a faster way to integrate with their customer’s or user’s tools.\n\nHaving built some of the hardest integrations in the past (*cough* Salesforce *cough*) for my products and gone through the same pain of it myself, I wished there was a better experience around it for sure.\n\nThis is my attempt to fix just that.\n\nHere’s how we solve it:\n\n-&gt; We’re a single API/Schema to build all your customer facing CRM integrations.\n-&gt; The goal is to allow SaaS companies to ship their 6 month roadmap in a matter of few days with a 10x better DX (Developer experience).\n\nWe currently support:\n1. Salesforce\n2. HubSpot\n3. Zoho CRM\nI’m launching *hilariously* early as I build it (still in alpha) so that I can get my network’s thoughts on the problem and if you’d like to try it out as we build it.\n\nRequest early access!: <https://revert.dev>\n\nWe’re also live on Product Hunt!\n\nShow us your support: <https://www.producthunt.com/posts/revert-2>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-02-07 09:09:35"
      },
      {
        "time_stamp": "2023-02-10 01:36:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-07 09:09:35",
    "text": "Cool stuff, how do you guys compare to Sequin?"
  }
]