[
  {
    "poster": {
      "poster_name": "Janosch Franke",
      "poster_handle": "janosch.franke"
    },
    "time_stamp": "2023-12-04 07:17:36",
    "text": "Thanks <@U05EJLL49KQ>"
  },
  {
    "poster": {
      "poster_name": "Janosch Franke",
      "poster_handle": "janosch.franke"
    },
    "time_stamp": "2023-12-04 07:17:45",
    "text": "Any way to get the subject in this same GET requests?"
  },
  {
    "poster": {
      "poster_name": "Taras Sachavskyi",
      "poster_handle": "taras.sachavskyi"
    },
    "time_stamp": "2023-12-04 07:18:44",
    "text": "<@U049WTE7AEB> email subject?"
  },
  {
    "time_stamp": "2023-12-04 08:00:29",
    "text": "Reminder: Did you know you can message <@U02162GK9SP|sprocky> at any time to get HubSpot development questions answered? It’s an experimental chat bot built to tackle developer questions. It won’t read your code, but can answer a lot of questions about building on the HubSpot platform."
  },
  {
    "poster": {
      "poster_name": "Dave Elmer",
      "poster_handle": "delmer"
    },
    "time_stamp": "2023-12-04 10:38:24",
    "edited": {
      "time_stamp": "2023-12-04 10:43:27"
    },
    "text": "I am trying to use the built-in functionality of logic in HubSpot forms. My issue is that I have a hidden open-text field that I only want to reveal when the user responds to the current question with an \"Other\" response in a radio-button list. When I go to set up the logic in the Dependent field for the current question, I am unable to select my aforementioned hidden field from the resultant options in the drop-down that HubSpot force feeds me (even though the hidden field shows up if I look for it as part of our entire list of custom Contact Property fields elsewhere in HubSpot). And before you ask, the hidden field that I want to display has the property checked to \"Show in forms, pop-up forms, and bots.\"",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-06 05:36:29"
      },
      {
        "time_stamp": "2023-12-07 14:46:14"
      },
      {
        "time_stamp": "2023-12-07 15:02:05"
      }
    ]
  },
  {
    "text": "Anyone else getting off and on internal errors in the quote template editor?",
    "time_stamp": "2023-12-04 11:40:22"
  },
  {
    "poster": {
      "poster_name": "Chris Maki",
      "poster_handle": "chris.maki"
    },
    "time_stamp": "2023-12-04 12:56:23",
    "text": "Is there a fix for CTA pop up forms yet? I keep running across discussions where the HubSpot developers say they know it’s not working and they’ll fix it, but the last thread I read was from months ago. What’s the quickest way to add a pop up form into my page?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-12-04 13:50:25"
      },
      {
        "time_stamp": "2023-12-04 14:05:44"
      },
      {
        "time_stamp": "2023-12-04 14:18:00"
      },
      {
        "time_stamp": "2023-12-04 20:22:49"
      },
      {
        "time_stamp": "2023-12-05 07:20:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Conor Linehan",
      "poster_handle": "cplinehan"
    },
    "time_stamp": "2023-12-04 13:50:25",
    "text": "Hey Chris, dev on the CTA team here what problem are you having with adding a form to a popup cta?"
  },
  {
    "poster": {
      "poster_name": "Chris Maki",
      "poster_handle": "chris.maki"
    },
    "time_stamp": "2023-12-04 14:05:44",
    "text": "Hey- I’m using the new CTA to add a pop up form, but when I got to add it on the page I want it on through the content editor, it does not show up as one of the options to choose from"
  },
  {
    "text": "Can you share a screenshot of where it’s not showing up on the content editor?\n\n&gt; but when I got to add it on the page I want it on through the content editor\nAre you using the `call-to-action` module and the sidepanel appears like this?",
    "time_stamp": "2023-12-04 14:18:00"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-12-04 20:22:49",
    "text": "Popup CTAs have to be triggered from a link field. And that link field needs to have the call to action option turned on"
  },
  {
    "poster": {
      "poster_name": "James Player",
      "poster_handle": "james.player"
    },
    "time_stamp": "2023-12-04 20:37:17",
    "text": "Hi everyone. We’ve just added the HubSpot cookies consent banner onto our website but only enabled it for people from the EU. Just wondering if there’s any way to know with js whether the cookie banner is enabled on the page or not (since it won’t be enabled for people outside the EU), so we can know whether to show the manage cookie preferences button. Thanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-12-13 13:14:29"
      }
    ]
  }
]