[
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-12-22 01:50:31",
    "text": "Hello, I am building a multi language site now I have a languange switcher but it doesn't seem to save the cookie?\n\nI want it so the user sets the language and the next time they come back the language is in the latest language.\n\n```{% language_switcher \"language_switcher\" class=\"fas fa-globe\" overrideable=false, display_mode=\"localized\", label=\"Language Switcher\" %}```\n\n<https://knowledge.HubSpot.com/privacy-and-consent/what-cookies-does-HubSpot-set-in-a-visitor-s-browser#necessary-cookies>"
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2023-12-22 02:06:08",
    "text": "The only 2 cookies it shows in de console are __cfruid and __cf_bm"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-12-22 09:40:30",
    "text": "Hey all over the next few weeks there will be reduced presence from HubSpotters due to the holidays in the dev slack. We will still be enforcing the code of conduct but will not be nearly as active.\n\nIf you think something isn't working right on HubSpot's end contact HubSpot support <http://help.HubSpot.com|help.HubSpot.com>. If you just need help understanding something ask in the slack. You can also ask <@U02162GK9SP> both in DMs and in channels. The DevHelp bot is trained on HubSpot development. It is not GPT based for better and worse. So it may not always be able to answer your question but it won't lie to you. It sadly is not trained in React or UI Extensions so it's knowledge there may be limited."
  },
  {
    "poster": {
      "poster_name": "David Brownlow",
      "poster_handle": "david.brownlow"
    },
    "time_stamp": "2023-12-22 10:31:06",
    "edited": {
      "time_stamp": "2023-12-22 10:31:37"
    },
    "text": "Hello. I am employing a 3rd party to develop an application that will require a starter subscription.  How would this subscription work with the developer account? Would I need to create a new one that is linked to the subscription account?  Would the user controls within the subscription account apply to the developer account as well?"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-12-22 12:05:02",
    "edited": {
      "time_stamp": "2023-12-22 12:05:05"
    }
  }
]