[
  {
    "poster": {
      "poster_name": "Atul Gaur",
      "poster_handle": "atulg"
    },
    "time_stamp": "2023-12-20 05:11:52",
    "text": "Hey Team\n\nI'm developing an app and I've come across a roadblock when working with Custom Objects.\nI wanted to create 2 custom objects on the HS account of the user who installs the app. Now, the only Read is available in the scope of crm.custom.schemas.\nI looked around and came across this page &amp; form (<https://developers.HubSpot.com/docs/api/custom-objects-schema-pilot>) and wanted some clarity on the following:\n\n1. *Access will be granted for 60 days to define custom objects. If scopes are not utilized, access to scopes will be removed.*\n    ◦ Does this mean I'll get access for only 60 days and then have to apply again?\n2. *How long do I have to implement and define custom objects? - Custom object schemas for customers must be defined in the first 60 days.*\n    ◦ If I do define a Custom Object immediately after getting the access, will the 60-day limit remain? Like, will I be able to create more custom objects after the 60 days or the access will be revoked after 60 days anyway?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-20 23:53:27"
      },
      {
        "time_stamp": "2023-12-26 00:55:00"
      },
      {
        "time_stamp": "2023-12-26 05:50:07"
      },
      {
        "time_stamp": "2023-12-26 23:07:42"
      }
    ]
  },
  {
    "text": "Good morningg!! is there something going on with the Design Manager? it is failing to autosave very often and im having to refresh the page or make a “space” change for it to trigger the autosave (and sometimes failing again).. this is what is shows everytime",
    "time_stamp": "2023-12-20 05:22:27"
  },
  {
    "poster": {
      "poster_name": "Elise Ferguson",
      "poster_handle": "elise.ferguson"
    },
    "time_stamp": "2023-12-20 07:47:59",
    "text": "We just ran into an issue setting up a HubSpot site with Imperva as well, ended up doing the reverse proxy set up to get it to work. <https://developers.HubSpot.com/docs/cms/developer-reference/reverse-proxy-support>"
  },
  {
    "poster": {
      "poster_name": "Letícia Lima",
      "poster_handle": "lety"
    },
    "time_stamp": "2023-12-20 08:05:54",
    "text": "thank youuu"
  },
  {
    "poster": {
      "poster_name": "Stef Dijkstra",
      "poster_handle": "stef.d"
    },
    "time_stamp": "2023-12-20 08:28:24",
    "text": "Hello everyone, our company wants to offer the HubSpot CMS development service. We have a number of (front-end) developers and we would like to hire someone to give us training in HubSpot development. This must be done at very short notice, the job will of course be paid for.\n\nWe are in operation in Nederland Borne, we would like to receive someone on location for the first weeks of January.\n\nDo you know someone or are you that person, would you like to contact me? Thank you in advance!"
  },
  {
    "poster": {
      "poster_name": "Maggie Philbin",
      "poster_handle": "mphilbin"
    },
    "time_stamp": "2023-12-20 09:01:27",
    "text": "hey daniel! for sure would love to connect! you (and anyone else reading this thread hoping to chat about custom events) can use <https://8-04.na1.hs-sales-engage.com/Ctc/41+23284/8-04/JkM2-6qcW6N1vHY6lZ3l9W3F8xcV3cBKvfW3LvHWN22fbjwW2dfcgY3V76DmW6lGQRL1C7625W7wr2k47_HJ_JW4XV51r44bwyPW3Bq6763gK0QcW4s12vx90RwhJW8bs-Bd1CzB94W6VSQpM36gBctW1VNGCJ4fFpRYW3rBVtl8-nyR4N388tTLf5BycVLn1zs1NZW4mW49cbTV1BJgv5W5DkMyq52mpFGVd4dYW1KHF2GW4X49Hf6RwY_HW8T1T5R1jCnySW6yw4DS3JC6_HW4zvdcy1YlngYW7CqNr344Yvfxf9fpmtK04|this link> to grab some time on my calendar!"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-12-20 10:55:02"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-12-20 11:52:27",
    "edited": {
      "time_stamp": "2023-12-20 11:53:25"
    },
    "text": "Is there any way to see if a resource in file manager is being used. i.e. on multiple pages, a video is being used in a module, but the file manager \"File usage\" info for it says it's not being used anywhere."
  },
  {
    "poster": {
      "poster_name": "Daniel Raskin",
      "poster_handle": "draskin"
    },
    "time_stamp": "2023-12-20 12:17:49",
    "text": "Thx Maggie. I'll grab time in new year. Cheers!"
  },
  {
    "poster": {
      "poster_name": "Jose Nunez",
      "poster_handle": "joseenrique0595"
    },
    "time_stamp": "2023-12-20 16:48:09",
    "text": "Hi! I'm using personalized tokens with a custom objects on Automated emails, how can I test with a specific custom object? Like send a test email with the custom object property (I already have the custom object and property with the content I need to test it) Thanks!!!!"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2023-12-20 23:53:27",
    "text": "Hi Team,\nAny update on this?"
  }
]