[
  {
    "text": "Howdy! I was wondering if anyone in this channel has experience with custom property images in HubSpot emails. I have a client that is looking to add the contact's company logo into a email template. I know that HubSpot pulls the company logo from the domain of a contact, but I was wondering if there was a way to get a hold of this property and use it as a custom field in a way so that when the email was automated it would automatically send the contact's company logo on the email.\n\nThanks!",
    "time_stamp": "2021-04-01 11:44:56",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-01 12:08:15"
      },
      {
        "time_stamp": "2021-04-01 12:11:30"
      },
      {
        "time_stamp": "2021-04-01 13:47:40"
      },
      {
        "time_stamp": "2021-04-01 14:00:32"
      },
      {
        "time_stamp": "2021-04-01 14:02:30"
      },
      {
        "time_stamp": "2021-04-01 14:09:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dana Land",
      "poster_handle": "dland"
    },
    "time_stamp": "2021-04-01 12:08:15",
    "text": "Hi! I don't think that field can be used as it's not a traditional contact property. They could create a custom contact property that is multi line text, and then add a link to the company logo in that property. When building the email (if using D&amp;D), add the HTML module or create a custom module, add the code for an image and instead of the link, add the personalization token {{contact.propertyinternalvalue}} and there ya go, image personalization!"
  },
  {
    "poster": {
      "poster_name": "Curtis DeBrincat",
      "poster_handle": "curtis.debrincat"
    },
    "time_stamp": "2021-04-01 12:11:30",
    "text": "Thanks Dana! I will give that a shot"
  },
  {
    "poster": {
      "poster_name": "Dana Land",
      "poster_handle": "dland"
    },
    "time_stamp": "2021-04-01 13:47:40",
    "text": "No problem! Let me know if you have trouble, I can always whip up a quick tutorial video on it. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Curtis DeBrincat",
      "poster_handle": "curtis.debrincat"
    },
    "time_stamp": "2021-04-01 14:00:32",
    "text": "`&lt;center&gt;`\n`&lt;img src=\"{{contact.propertycompany_logo}}\" alt=\"company logo\" width=\"100\" height=\"auto\"&gt;`\n`&lt;/center&gt;`\nSo this it what I have, and I've been trying to get the image url to pull from the contact property, but it won't pull anything no matter what adjustment I make. I'm I using the property wrong here?"
  },
  {
    "poster": {
      "poster_name": "Dana Land",
      "poster_handle": "dland"
    },
    "time_stamp": "2021-04-01 14:02:30",
    "text": "Are you previewing as a customer who has something entered into that property? If not, nothing will show :slightly_smiling_face:"
  },
  {
    "text": "Yeah I went and made the property and filled it in for a few customers. I have have a personalization token set up below my html to make sure that I'm getting a url through it. I just don't know how to get the {{contact.propertycompany_logo}} to pass my field and pull the image url from the field.",
    "time_stamp": "2021-04-01 14:09:05"
  }
]