[
  {
    "poster": {
      "poster_name": "Carmen Carrillo",
      "poster_handle": "carmen"
    },
    "time_stamp": "2023-04-05 01:08:38",
    "text": "Hello everyone! I have a use case that I've want to solve, but I haven't find a way, so anyone up for the challenge is more than welcome :slightly_smiling_face: .\n\nContext:\nI use HubSpot as my CMS and Pardot as my CRM. So, for visitor identification and tracking I use the Pardot tracking code. Plus, for the cookie management I use a third party tool called CookieFirst. Finally I've implemented Souce Buster for tracking and UTMs retrieval.\n\nProblem:\nRecently I've found that even if the user hasn't accepted, or denies the cookies... the HS cookies + source buster get's fired. Which gives me the problem that is not GDPR compliant.\n\nTrying to solve it:\nI've tried to do a custom script in CookieFirst to block HS y SourceBuster cookies to be fired before the user confirms. But, HS cookies gets being fired.\n\nQuestion:\nDoes anyone have a custom script I can add in my HTML to block the HS cookies from being fired. I've confirmed with Customer Support and the HubSpotutk is not a mandatory cookie, so the CMS will keep on working even if I block this cookie. Nonetheless, I can't seem to be able to block it from being fired.\n\nAny suggestion is more than welcome :clap: .\nThank you all in advance."
  },
  {
    "poster": {
      "poster_name": "Eric Goldman",
      "poster_handle": "eric732"
    },
    "time_stamp": "2023-04-05 12:00:29",
    "text": ":wave: Hey everyone,\n\nAfter seeing our customers rapidly build complex integrations using Prisma ORM, we wrote a guide.\n\nIf you haven’t heard of Prisma, it’s a modern ORM built for JavaScript and TypeScript. It comes with all sorts of nice features to improve your productivity:\n• A modern, intuitive API\n• Type safety!\n• IDE support\n• Robust query engine to ensure data returns fast\nQuerying HubSpot through Prisma is delightful.\n\nWe were surprised how nested API calls can become one simple query. Plus, you can query across your application data (say a `users` table`) and your HubSpot data without even thinking about joins.\n\nGive the guide a read - we’d love to hear what you all think.\n\n<https://docs.sequin.io/integrations/HubSpot/playbooks/HubSpot-prisma>",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-05 12:01:22"
      },
      {
        "time_stamp": "2023-04-05 12:44:57"
      },
      {
        "time_stamp": "2023-04-05 12:50:11"
      },
      {
        "time_stamp": "2023-04-05 12:52:53"
      },
      {
        "time_stamp": "2023-04-05 12:55:37"
      },
      {
        "time_stamp": "2023-04-05 12:59:06"
      },
      {
        "time_stamp": "2023-04-05 13:00:53"
      },
      {
        "time_stamp": "2023-04-05 13:02:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 12:01:22",
    "text": "Could you make a case for using prisma over HubSpot graphql?"
  },
  {
    "poster": {
      "poster_name": "Eric Goldman",
      "poster_handle": "eric732"
    },
    "time_stamp": "2023-04-05 12:44:57",
    "text": "Great question <@U01QVR44MEY> - a couple differences that stand out:"
  },
  {
    "poster": {
      "poster_name": "Eric Goldman",
      "poster_handle": "eric732"
    },
    "time_stamp": "2023-04-05 12:50:11",
    "text": "1. With Prisma, you can query outside of HubSpot and JOIN the rest of your database\n2. You don’t have to worry about HubSpot rate limits/throttles\n3. Simpler syntax for filters, sorts, etc.\n4. Overall query speeds"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 12:52:53",
    "edited": {
      "time_stamp": "2023-04-05 13:04:42"
    },
    "text": "1. Yeah that's very true, could definitely be useful. One example I'm thinking of is stripe and HubSpot joining the payment data with the HubSpot data but then again you have to store both of them in the same database correct? So pretty much any database could do this. Honestly I've never used Prisma and am just really interested in learning."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 12:55:37",
    "edited": {
      "time_stamp": "2023-04-05 12:56:31"
    },
    "text": "2. GraphQL limits are very different from HubSpot rate limits, also doesn't have any throttles. Complex queries take up more points than simple queries and you get 500,000 points per rolling minute so you really don't need to worry about rate limits (HubSpot will also cache for you if you have redundant, calls) (you can definitely hit the minutely limit though, but if your query is written correctly you shouldn't have any problems)"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 12:59:06",
    "text": "3. Prisma pretty much copied the GraphQL SDL, \"The syntax of the Prisma schema is heavily inspired by GraphQL SDL. If you're already familiar with SDL, picking it up to model your database tables will be a breeze.\" so I think it should be about the same complexity"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 13:00:53",
    "text": "4. This one is making me think, I'd be really. interested in testing this out especially with some pretty complex queries (I think HubSpot will probably be slower when it comes to these), is there a pretty base line speed for prisma queries? Can you deploy in different ways for faster speeds?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-05 13:02:25",
    "text": "Really like the article, you guys did an amazing job on it. Thanks for answering my dumb questions"
  }
]