[
  {
    "poster": {
      "poster_name": "Chetan Kumar",
      "poster_handle": "kumarchetan.npr"
    },
    "time_stamp": "2023-05-30 16:20:10",
    "text": "can someone verify whether updating the HubSpot Marketplace theme impacts on the live web pages built on it.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-05-30 16:22:04"
      },
      {
        "time_stamp": "2023-05-30 16:25:08"
      },
      {
        "time_stamp": "2023-05-30 16:43:37"
      },
      {
        "time_stamp": "2023-05-30 18:28:34"
      },
      {
        "time_stamp": "2023-05-31 03:02:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-05-30 16:22:04",
    "text": "It does, that's why if you're releasing an update to an existing theme you should strive to not make breaking changes. HubSpot where possible provides  ways to make some kinds of changes non breaking like moving content fields to style fields."
  },
  {
    "poster": {
      "poster_name": "Chetan Kumar",
      "poster_handle": "kumarchetan.npr"
    },
    "time_stamp": "2023-05-30 16:25:08",
    "text": "That’s helpful, thanks <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-05-30 16:43:37",
    "text": "I should also add that your update doesn't instantly take effect on the customer account. They need to click a button to get your update. Making it a little safer since they have to take a conscious action before the changes apply.\n\nAdditionally if they've made a child theme, anything they've overridden stays as is until they integrate your changes."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-05-30 18:28:34",
    "text": "the update isn't automatically installed, but since HubSpot sends an automatic notification that there is an update available without any link to the release notes or changelogs, many users click the link in the email and update the theme without reading the documentation - if you introduce a change that requires them to take action, make sure you communicate it ahead of time :slightly_smiling_face:"
  }
]