[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-10-24 02:13:27",
    "text": "Maybe zapier?"
  },
  {
    "poster": {
      "poster_name": "David Essery",
      "poster_handle": "david297"
    },
    "time_stamp": "2019-10-24 07:17:57",
    "text": "Hi Guys\n\nHas anyone ever found a way to embed a hubl video_player tag in a custom module? I cant seem to find a way to allow the user to select a video. If I use a file field, I only get the URL to the file out of it as opposed to the ID to pass as the player_id.\n\nAny advice would be greatly appreciated!! Many thanks"
  },
  {
    "poster": {
      "poster_name": "Cameron Claffey",
      "poster_handle": "cclaffey"
    },
    "time_stamp": "2019-10-24 10:03:46",
    "text": "To anyone jumping in/looking at this thread: for a little more context we did recently change how our image resizing works. Before we were attempting to resize and return the resized image upon the initial request; however if the resizing took too long we were seeing timeouts.\n\nSo instead, we now return the original/non-resized image upon first request/subsequent requests while we resize the image. Then within a short period, once the image is resized, we serve it for requests.\n\nThe original issue was that the non-resized image (served upon initial request) was being cached for longer than we intended, so the resized image wasn’t being served though it was ready. This issue should now be resolved; and image resizing should be working as intended.\n\nCurrently this short period where the image is being resized is taking longer/delayed due to our queue being backed up as a result of other non-related factors. These other factors are temporary, and we will see image resizing times reduced back to normal once they are resolved, but for now with image resizing it can take up to several minutes before requests begin seeing the resized image.\n\n<@U3T21PDBK>, if you’re not seeing image resizing work (either due to original request being sent before fix was pushed and cache busting not working; or net new images not resizing as opposed to just being delayed) can you DM me the file URL which isn’t resizing/page on which you’re not seeing it resize?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-10-24 10:20:17",
    "text": "<@UBT0AHWLD> thats one of the options im looking into :slightly_smiling_face:"
  },
  {
    "text": "In the `tag` option in custom modules, when I select “name” for the value return type, it is returning the slug, not the name.",
    "time_stamp": "2019-10-24 13:44:12"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2019-10-24 13:45:34",
    "text": "One tag for this particular blog is “People &amp; News”, but `people-news` is getting returned… so this is problematic."
  }
]