[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-12-26 18:50:10",
    "text": "very weird and that is pretty bad advice on support’s end."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 18:51:58",
    "text": "My thoughts exactly. You can always tell by their voice when they are struggling for an answer. This was her out"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-12-26 18:54:46",
    "text": "whenever I get a support rep that either doesn’t get the technical issue I’m trying to solve or whatnot I usually try to write out steps to reproduce the issue and an explanation of what I’m expecting to happen, and tell them to pass that on to the Dev Team. usually then they get someone else involved and things start getting somewhere"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 18:55:36",
    "text": "We walked through it and reproduced the error. "
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 18:55:54",
    "text": "That is when I was told this should be added to the template"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 18:57:26",
    "text": "BTW, I figured out the issue, had a text field to give the module a custom class and I had placeholder text in it, but it was generating a random number. Removed that field and all was good"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 18:57:49",
    "text": "Unsure if a quirk or something systemic"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 19:00:22",
    "text": "Never used placeholder before. Thought I would try instead of a helper field which I find too obscure and I didn't want to have a default value"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-12-26 19:11:46",
    "text": "interesting.\n\non the support topic, I feel like there needs to be a better process on HS’s end for handling support for more technical queries.\n\nI get them maybe not wanting to do a dev support(beginners might waste their staffs time with basic questions that could have been answered here) but when we have a complicated technical issue I wish there was a better process in place for escalating the issue to someone who is better equipped to help.\n\nI’d rather hear “I’m sorry I don’t know the answer/how to fix this, I’m going to see if a developer can take a look. It may take a day or so to get a response from the developer. Thank you for your patience.”\n\nthan having to teach the person how to use HubSpot tools. A real experience I had with a ticket: I unfortunately got a support person that didn’t understand the concept of the content staging tool, and instead of referring me to someone more able to help after his initial attempt failed, he started asking “why would you want to stage a page?“. I facepalmed and posted to this slack asking for :sprocket:  help because I was desperate, the problem was serious and was preventing me from meeting deadlines, and I hate bugging the staff here, for actual support stuff as that’s not their job and not the point of this slack."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-12-26 19:16:36",
    "text": "Agreed. There have been a few times where you can almost hear them reading a script (former younger life, I have been there)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-12-26 19:27:02",
    "text": "yea, like I completely understand the support people not being equipped for the crazy things I contact em for. I just want them to redirect my request to someone who is better equipped.\n\nthe support reps are likely more used to solving customer issues that are more the customer doesn’t know what they’re doing kinda thing.\n\nlike:\n“how do I change the picture facebook uses when I share my pages?”\n\nnot:\n“Hi, I just stumbled into a bug that broke half my clients site and I can’t find a work-around. Help please, they’re breathing down my back. Steps to reproduce. screenshots, screencasts.”"
  }
]