[
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2017-11-02 05:29:19",
    "edited": {
      "time_stamp": "2017-11-02 05:29:37"
    },
    "text": "What happened to the \"Personalization tokens in CTAs\" feature that was in beta a while ago? Was it discontinued? <https://ux.HubSpot.com/beta/cta-personalization>"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2017-11-02 05:36:13",
    "text": "Hi Thomas! This original implementation of personalised CTAs was indeed discontinued. The way it was architected didn't solve the problem correctly, it didn't allow for personalisation in CTAs used in Emails, or for personalisation of the redirect URL, and it couldn't be extended to allow that. Rather than release a feature that didn't solve the problems it set out to, we sunset it and went back to the drawing board to rework the CTA architecture to allow complete personalisation. We're very deep in that work right now, but it's likely that we won't be ready to introduce complete personalisation until next year."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2017-11-02 05:36:42",
    "text": "Would love to learn a little more about the goals you have for personalisation, are you able to share? Feel free to DM me too :+1:"
  },
  {
    "poster": {
      "poster_name": "Thomas Bennedbæk",
      "poster_handle": "thomas_katalysator"
    },
    "time_stamp": "2017-11-02 06:15:51",
    "text": "Alright, thanks for clearing that up, <@U24DCSJBE> :slightly_smiling_face: Looking forward to hear more about the updates to the CTA tool!\n\nWell, to be honest it's not something we've put a lot of thought into, but we were beta testers of the personalized CTAs and did briefly implement some basic personalization in CTAs to make our lead nurturing feel a bit more human. For example a CTA that would say something like: \"Hey Shay, here's an e-book that could really help [Your company] drive more sales. Grab your copy here\".\n\nI imagine that, given the possibility, people could do some really cool stuff with personalized CTAs.\n\nAs for the goal... A better user experience and higher conversion rates, I guess? And ease of use for the marketers :slightly_smiling_face:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2017-11-02 09:27:17"
      },
      {
        "time_stamp": "2017-11-07 01:55:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Patrick O'Neal",
      "poster_handle": "poneal"
    },
    "time_stamp": "2017-11-02 08:08:04",
    "text": "Is anyone noticing any issues with the COS right now? We’re noticing instances where we now have to clear the cache multiple times to see stylesheet changes on published pages. Sometimes, after I make 5-10 published changes from a certain state, my refreshes tend to revert to that state. (for instance, a section with no padding or overlay I updated to have padding and overlay, every single update would refresh to no padding or overlay until I refreshed again)\n\nIs anyone else seeing this?"
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2017-11-02 08:37:39",
    "text": "<@U6TBZ66FN>"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2017-11-02 08:37:53",
    "text": "Yes, I believe it is a known issue."
  },
  {
    "poster": {
      "poster_name": "Libo Song",
      "poster_handle": "lsong"
    },
    "time_stamp": "2017-11-02 08:43:28",
    "text": "<@U2E6FUEEP> It is a known issue. Thanks <@U2H1Q3F8R>."
  },
  {
    "poster": {
      "poster_name": "Patrick O'Neal",
      "poster_handle": "poneal"
    },
    "time_stamp": "2017-11-02 08:56:00",
    "text": "Awesome. Thanks guys!"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2017-11-02 09:27:17",
    "text": "Amazing, thanks for your feedback Thomas! Pretty clear where the value is in your case. As we have news on this, and any other changes we can definitely keep you in the loop as part of beta group :+1:"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-11-02 11:55:51",
    "text": "Anyone havings issues where they are making menu changes and they are not taking effect?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-11-02 11:56:05",
    "text": "I deleted a nav item from a menu in a client portal and the item still shows on the frontend"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2017-11-02 11:56:59",
    "edited": {
      "time_stamp": "2017-11-02 11:57:58"
    },
    "text": "looks like clearing the cache got rid of it, but shouldnt the menu's be updated on front end once they are done on the backend? (it may have just been a delay of a about a min or two as well)"
  },
  {
    "poster": {
      "poster_name": "Libo Song",
      "poster_handle": "lsong"
    },
    "time_stamp": "2017-11-02 12:05:09",
    "text": "<@U2H3TT8F2> it is known issue. I am working on it."
  },
  null
]