[
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2019-01-09 08:29:32",
    "text": "you can use <https://app.HubSpot.com/l/marketplace/products/trunghnguyen1/announcement-bar>"
  },
  null,
  {
    "poster": {
      "poster_name": "Jason Wang",
      "poster_handle": "alhappyma"
    },
    "time_stamp": "2019-01-09 12:35:17",
    "text": "Hi experts. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jason Wang",
      "poster_handle": "alhappyma"
    },
    "time_stamp": "2019-01-09 12:35:43",
    "text": "Who ever used blog template which has category for divide blogs into them."
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-09 15:09:29",
    "edited": {
      "time_stamp": "2019-01-09 15:10:45"
    },
    "text": "just curious, those who have submitted to the marketplace, *are you guys able to push updates to your templates to people who purchased your template?*"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-09 15:10:32",
    "text": "I ask because I’m about to modify the truck out of the HubSpot Stratus template for a client and I don’t want to break HubSpot’s ability to update the template through whatever channel the marketplace may have"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-01-09 15:54:53",
    "text": "we actually talked with HubSpot about this a few weeks ago (so maybe it's changed) but when you update a module, the udpate isn't pushed and needs to be re-downloaded by the user"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-09 17:55:10",
    "text": "Interesting. Wonder how this could be improved. Itd be nice if it worked like a wordpress child theme. Youd have a marketplace version thats unchangeable by end user, if they want to change they creat like a child version that only substitute s the parts they need to change then when an update happens it shows under the notification panel(with ability to mute these notifications) then you can hit a button and it would like stage update to the new version and youd get a chance to test a page using the template or module with your child theme before pushing the update live"
  }
]