[
  {
    "poster": {
      "poster_name": "Fabian Glaw",
      "poster_handle": "fabian643"
    },
    "time_stamp": "2022-06-03 01:45:38",
    "edited": {
      "time_stamp": "2022-06-03 01:46:21"
    },
    "text": "Hello there, I do have an issue with global theme settings. I switched my font for h1 from roboto to verdena, then saved and published the theme changes to100+ assets. When I check my live pages they still use the old rules. Only in preview mode I see the changes. The only way I found to set the changes live is by updating the page induvidually. Is there a global way to set theme setting changes live to all pages?\nAnd how is this possible? Do we have two different main.css files? One on a page or one on the theme level? The font is defined in the _typography.css font-family:\n```{{ theme.typography.h1.props.font_style.font }};```\nThank you for your answers"
  },
  {
    "text": "Hello everyone :slightly_smiling_face: I have a problem with react application on HubSpot template: I can't see content of my react app when I put it on my website (this website contains HubSpot modules and my custom modules), but I can see react app content when I put application module on an empty template. Has anyone had a similar problem?  Why does the react module not show the content when I insert it into the finished page?",
    "time_stamp": "2022-06-03 07:34:31",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-03 11:27:33"
      },
      {
        "time_stamp": "2022-06-04 03:14:34"
      },
      {
        "time_stamp": "2022-06-04 03:14:43"
      },
      {
        "time_stamp": "2022-06-06 01:22:11"
      },
      {
        "time_stamp": "2022-06-06 09:51:02"
      },
      {
        "time_stamp": "2022-06-07 01:35:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Danny Holland",
      "poster_handle": "dannyh"
    },
    "time_stamp": "2022-06-03 11:27:33",
    "text": "Hi <@U03J8LLBSTE> - what do you mean by empty template?"
  },
  {
    "poster": {
      "poster_name": "Danny Holland",
      "poster_handle": "dannyh"
    },
    "time_stamp": "2022-06-03 11:30:28",
    "text": "<@U03CH3JFK7T> - I just had a PR get merged this week on the CMS-React-Boilerplate. It had been neglected and therefore had a few issues with an out dated package causing install issues.\n\nBut it should be all good now as a great starting point add a react module to a HubSpot page/theme"
  }
]