[
  {
    "poster": {
      "poster_name": "Olivier Janssen",
      "poster_handle": "info467"
    },
    "time_stamp": "2022-06-21 08:46:29",
    "text": "Hi! I’ve been playing around w/ the boilerplate today and I was wondering whether I’m there’s an alternative (flexbox-based) grid available that works with the editor"
  },
  {
    "poster": {
      "poster_name": "Olivier Janssen",
      "poster_handle": "info467"
    },
    "time_stamp": "2022-06-21 08:48:30",
    "text": "I ordinarily use my own theme boilerplate for customer projects but it will take a lot of effort to rebuild it to fit the editors functionality",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-21 10:01:54"
      },
      {
        "time_stamp": "2022-06-21 10:16:40"
      },
      {
        "time_stamp": "2022-06-21 10:17:49"
      },
      {
        "time_stamp": "2022-06-21 10:18:05"
      },
      {
        "time_stamp": "2022-06-21 13:43:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2022-06-21 10:01:54",
    "text": "Hey Olivier :wave: we don't have flexbox used for the grid right now but something we are hoping to tackle in the near future (this issue is a bit old but some good context here: <https://github.com/HubSpot/cms-theme-boilerplate/issues/319>). I think others from the community have definitely put together some alternatives for the time being (e.g. <https://stefenphelps.com/blog/custom-grid-gutters-on-HubSpot/>) if that might work better in the interim."
  },
  {
    "poster": {
      "poster_name": "Olivier Janssen",
      "poster_handle": "info467"
    },
    "time_stamp": "2022-06-21 10:16:40",
    "text": "Hi Jason,\n\nThanks, steps definitely a step in the right direction. It does solve the entire issue with the layout system though, as dnd_area’s/modules/etc don’t seem to allow users to select col-widths for 3-4 different breakpoints. Of course this can be easily resolved from a theme dev perspective, but somehow it doesn’t seem possible to block the column resize functionality. How would you go around that (while still enabling adding &amp; removing modules and sections in the editor)?"
  },
  {
    "poster": {
      "poster_name": "Olivier Janssen",
      "poster_handle": "info467"
    },
    "time_stamp": "2022-06-21 10:17:49",
    "text": "To give you a little more insight into what I’m trying to achieve, here’s a recent project I did for a customer: <https://ydentic.com>"
  },
  {
    "poster": {
      "poster_name": "Olivier Janssen",
      "poster_handle": "info467"
    },
    "time_stamp": "2022-06-21 10:18:05",
    "text": "fully integrated with HubSpot, but Wordpress based"
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2022-06-21 13:43:42",
    "text": "Okay so I just want to make sure I'm fully following. Just to clarify - is your main goal to have full control of the layout but still allow someone to drag and drop modules in or more that the people editing the page should have the ability to edit col/module widths at different breakpoints vs. right now where they all basically stack at 100% width at 767px? If I'm way off on what you're looking for let me know. Just want to make sure I fully understand so I can help answer/pass along feedback."
  }
]