[
  null,
  {
    "poster": {
      "poster_name": "Prabhakar Gopalan",
      "poster_handle": "pg"
    },
    "time_stamp": "2017-01-12 16:13:25",
    "text": "hello, i have a question. could somebody in the HubSpot cos team help me?"
  },
  {
    "poster": {
      "poster_name": "Prabhakar Gopalan",
      "poster_handle": "pg"
    },
    "time_stamp": "2017-01-12 16:16:15",
    "edited": {
      "time_stamp": "2017-01-12 16:17:48"
    },
    "text": "Consider this (my) client Acme's situation:\n1) website is on HubSpot COS - <http://www.acme.com|www.acme.com>\n2) app is a Python app - <http://app.acme.com|app.acme.com>\n3) website has a HubSpot CTA on the home page - 'Sign Up Now'\n4) a visitor (could be from any 'source' = paid social, paid search, organic, direct, etc) visits <http://www.acme.com|www.acme.com>.  vistor's url has all the UTM parameters you'd imagine (source/etc)\n5) visitor clicks on  the HubSpot CTA button on the COS page \n6) visitor lands on the <http://app.acme.com|app.acme.com> python app site.  there is <http://segment.com|segment.com>'s JS code on that <http://app.acme.com|app.acme.com> page.  HubSpot is integrated with this segement 'source'.  so <http://segment.com|segment.com>'s JS code is sending data to HubSpot\n7) visitor fills the sign up form and becomes a new user\n8) visitor is added to HubSpot as a new contact (besides becoming a new user in the python app).\n9) inspecting the visitor/new contact's record in HubSpot we see their Original Source field value as Direct Traffic - no matter what their actual Original Source was.  whether they come from a facebook ad or from a google ad or a social website referral, they are always being shows an Original Source = Direct Traffic in HubSpot.\nquestion #1 - how can we  get the Original Source contact property value for new sign ups to be the correct/actual value and not be marked as Direct Traffic all the time, in HubSpot?  [we do not have an option to collect the visitor’s email in a HubSpot form first *before* they enter their info on the secure app sign up form]  question #2 - in general what is the best way to deal with issues like this where the first user/visitor registration on a site may not be a HubSpot form, but i’d want the original source, drill down1 and2 fields to be populated correctly with their actual values and not ‘offline sources/api’ or ‘direct traffic’ default values etc."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2017-01-12 17:13:02",
    "text": "Hey <@U3CKY9VPY> looks like you need to make sure that you are capturing the HubSpot session cookie. This can be done with a hidden field I believe"
  },
  {
    "poster": {
      "poster_name": "Prabhakar Gopalan",
      "poster_handle": "pg"
    },
    "time_stamp": "2017-01-12 17:37:18",
    "edited": {
      "time_stamp": "2017-01-12 17:37:29"
    },
    "text": "<@U25C65C3S> thanks.  is there detailed instructions/documentation on how to go about doing this?"
  },
  {
    "poster": {
      "poster_name": "Prabhakar Gopalan",
      "poster_handle": "pg"
    },
    "time_stamp": "2017-01-12 17:38:03",
    "text": "in general if there’s any documentation on segment integration, that would be good too. i’ve been looking for both the above case and segment-HubSpot integration that goes beyond what is on the official segment site."
  },
  {
    "text": "<@U25C65C3S|remingtonbegg> uploaded a file: <https://HubSpotdev.slack.com/files/remingtonbegg/F3R2WBASH/submitting_via_forms_api_without_script.txt|Submitting via Forms API without script> and commented: You could submit this form via javascript/jquery on submit of your other form.",
    "time_stamp": "2017-01-12 17:43:00"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2017-01-12 17:45:01",
    "text": "<http://developers.HubSpot.com/docs/methods/forms/submit_form>"
  }
]