[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-07 08:32:08",
    "edited": {
      "time_stamp": "2020-04-07 08:35:19"
    },
    "text": ":rotating_light: HubSpot CMS Update :rotating_light:\n\nCalling all web developers!\n\n*Today we are pumped to release CMS Hub, the next version of our content management system that now includes themes and many other powerful new features.*\n\nWith CMS Hub, you can use your preferred local development tools to build robust websites that marketers can easily edit and expand thanks to a new visual content editing experience. \n\nVisit our <https://designers.HubSpot.com/tutorials/getting-started|Getting Started Guide> to take themes and the other new features for a test drive.\n\nOr, if you want to learn more before diving into the tools, check out these resources:\n\n• Blog post: <https://developers.HubSpot.com/blog/what-cms-hub-means-for-web-developers|What CMS Hub Means for Web Developers>\n• Academy Video Course: <https://app.HubSpot.com/academy/6322442/lessons/673/3414|Themes quickstart for developers>\nWe’d love to hear your feedback. We really do read it and use it to improve.\n\nThanks!"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2020-04-07 08:34:30",
    "text": "<@U6GNQ7JBU>, just seeing if there any update here on why my Site Setting import would not get applied to my templates that were using variables from that import"
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2020-04-07 08:35:14",
    "text": "Still working on this. There were some changes to site settings around domains so I think it could be related to that but I am still trying to track down the change"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-07 08:53:53",
    "edited": {
      "time_stamp": "2020-04-07 08:54:09"
    },
    "text": ":rotating_light: HubSpot API Update :rotating_light:\n\nHey developers,\n\nIf you’ve ever been frustrated by the lack of consistency across HubSpot’s APIs, we’ve heard your feedback and have an exciting update for you.\n\nOver the last year, our team has been working on a solution, and today we are pleased to announce that we will be releasing the next generation of HubSpot’s APIs over the coming weeks, along with an updated <https://developers.HubSpot.com/docs/api/overview|API documentation site>. \n\nBy improving consistency across all endpoints and adding additional functionality, our next generation “v3 APIs” are designed from the ground up to ensure you spend less time troubleshooting and more time building innovative apps and integrations. \n\nAs you may have already noticed, the <https://developers.HubSpot.com/docs/api/crm/understanding-the-crm|CRM API v3> was released into general availability on March 31st and is now ready for public consumption. In addition to improved consistency, this API includes some robust new endpoints. We’d love to hear your feedback as you dive in and make some experimental API calls.\n\nYou can learn about our vision and how the new APIs are evolving in <https://developers.HubSpot.com/blog/building-the-next-generation-of-HubSpots-apis|this post.>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-04-08 03:34:51"
      },
      {
        "time_stamp": "2020-04-09 05:17:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2020-04-07 13:51:47",
    "text": "<@U6GNQ7JBU>, any update about that change"
  }
]