[
  {
    "text": "Hello all! :wave:\nEvery time I pull out adding image to a blog post option I receive this error message in HubSpot. What might it be?\nIt happens when I click *Insert image button* in a blog text editor and do nothing else, do not select nor upload na image, simply when the sidebar appears :thinking: ",
    "time_stamp": "2024-04-11 04:31:41"
  },
  {
    "text": "quick question! I'm trying to give a developer *crm.objects.companies.read* permissions. it looks like the settings are correct, however, the user is reporting that they still cannot access.\nis there another way to confirm they have the correct access?",
    "time_stamp": "2024-04-11 07:31:32",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-11 08:16:12"
      },
      {
        "time_stamp": "2024-04-11 09:07:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-04-11 08:16:12",
    "text": "Hey <@U06FL0P7E9X> this is just access to the HubSpot account. The developer probably needs access to a private app that has the permission (scope) you mentioned"
  },
  {
    "poster": {
      "poster_name": "Megan Miller",
      "poster_handle": "millerm"
    },
    "time_stamp": "2024-04-11 09:07:10",
    "text": "Thank you! I finally made the connection a few minutes after I posted this. clearly I needed more coffee."
  },
  {
    "poster": {
      "poster_name": "David Voigt",
      "poster_handle": "david.voigt"
    },
    "time_stamp": "2024-04-11 09:37:50",
    "text": "Not 100% sure, but probably not. I'm guessing, because data sync usually supports property fields, while the subscription is not a property. I think you would have to work around that by using a trigger field and a workflow."
  },
  {
    "poster": {
      "poster_name": "David Boyd",
      "poster_handle": "dboyd"
    },
    "time_stamp": "2024-04-11 11:29:32",
    "edited": {
      "time_stamp": "2024-04-11 11:30:47"
    },
    "text": "Hello - Question - does i make sense to build out separate CMS sites for each of our brands?\n\nTo me it would seem to create a single Marketing CMS site which can then be used as a jumping off point to access each of our brands ecommerce stores.\n\nIs this a common practice? A single marketing website or is it more common to build out a bunch of marketing sites, one for each store?\n\nAll ecommerce activities are done out side of HubSpot - data is feed to HubSpot marketing/CRM via other means"
  },
  {
    "poster": {
      "poster_name": "Jonas De Mets",
      "poster_handle": "jonas297"
    },
    "time_stamp": "2024-04-11 13:04:33",
    "text": "<@U05MVV9KWEL> we created  <https://koalify.io/> to make deduplication easy in HubSpot. The features are fully embedded in HubSpot. It's possible to merge manually (using CRM cards) as well as automated (using workflow actions). We have a free trial so you can try it out first:\n<https://ecosystem.HubSpot.com/marketplace/apps/marketing/data-management/koalify-io>"
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2024-04-11 14:44:23",
    "text": "Does anyone know how page tracking works if two contacts get created with the same hutk? I have a client who has a form that applies the hutk to the contact(Via the /submissions/v3/integration/submit/ endpoint), and i am wondering how page views get associated in the case where one user submits the form then in the same session maybe after some more page views another user submits the form."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-04-11 15:26:14",
    "text": "is there a graphql channel?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-12 08:23:38"
      },
      {
        "time_stamp": "2024-04-12 08:25:07"
      },
      {
        "time_stamp": "2024-04-12 08:26:23"
      },
      {
        "time_stamp": "2024-04-12 08:26:43"
      }
    ]
  }
]