[
  {
    "poster": {
      "poster_name": "Martin Dahlén Jansson",
      "poster_handle": "martin631"
    },
    "time_stamp": "2024-04-23 07:14:21",
    "text": "Hello!\nDo the external site cookie consent banner need the correct url to show? Im trying to test it on a local dev env. but it wont show up :sweat_smile: and if it needs the same url to show is there a way to trigger it anyways with an id or something?"
  },
  {
    "poster": {
      "poster_name": "Jared Pereira",
      "poster_handle": "jared982"
    },
    "time_stamp": "2024-04-23 08:24:18",
    "text": "Hi! We are looking to upgrade our HubSpot -&gt; Shopify app in HubSpot. When we click uninstall we get this message\n\nIf disconnected, existing data will stay in HubSpot, but will no longer update. Reports, lists, and workflows using your data will also stay, but will be turned off.\n\nPlease note when you install the new Shopify integration you will not be able to access your existing workflow, list, or report data.\n\nHowever, a staged migration plan is being developed, and upon completion, the first phase will allow for the migration of supported workflows.\n\nIs there any additional information concerning: *Please note when you install the new Shopify integration you will not be able to access your existing workflow, list, or report data?*\n\nWe need to plan out this work so trying to figure out which workflows, lists or reports will be impacted and to what extent? Also, why do they stop working? Do we need to remap any fields etc?"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-04-23 09:00:07",
    "edited": {
      "time_stamp": "2024-04-23 09:00:11"
    }
  },
  {
    "poster": {
      "poster_name": "Paul Maxwell",
      "poster_handle": "paul235"
    },
    "time_stamp": "2024-04-23 10:29:18",
    "text": "Is there a channel / group for inbound 2024? Would love to know if there will be a HubSpot devs meetup there.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-24 08:14:10"
      },
      {
        "time_stamp": "2024-05-17 09:02:01"
      },
      {
        "time_stamp": "2024-05-17 09:55:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alex Davis",
      "poster_handle": "alex.davis"
    },
    "time_stamp": "2024-04-23 22:40:53",
    "text": "Hey everyone! We are currently using HubSpot private pages to host content and authenticate using azure b2c. I am having trouble figuring out how to allow users to sign out of azure b2c within the private pages.  Right now we have a page when users sign out that is its just &lt;ourdomain&gt;/_hcms/mem/logout but when we try to go to the main sign in page it acts like it never signed the user out.\n\nAny help on this would be greatly appreciated as I have been smacking my head against the wall for days and probably just missing something stupid.\nThank you!"
  }
]