[
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2024-04-02 03:22:06",
    "edited": {
      "time_stamp": "2024-04-02 03:47:04"
    },
    "text": "How do you effectively blank fields in mass?\n\nImports don't overwrite field values with empty.\nI am assuming just doing it via a workflow.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-02 05:45:57"
      },
      {
        "time_stamp": "2024-04-02 06:52:46"
      },
      {
        "time_stamp": "2024-04-02 07:00:27"
      },
      {
        "time_stamp": "2024-04-02 07:52:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-02 05:43:44",
    "text": "Locally you can use a tool such as NGROK to create a https tunnel locally.  I know there are other tools like this but this is the only one I have used <https://ngrok.com/>"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-02 05:45:57",
    "text": "The \"Clear Property Value\" action in workflows will do exactly that."
  },
  {
    "poster": {
      "poster_name": "Irena Koval",
      "poster_handle": "i.irenakoval"
    },
    "time_stamp": "2024-04-02 06:11:12",
    "edited": {
      "time_stamp": "2024-04-02 06:41:28"
    },
    "text": "Hello! I am trying to fix an issue in the navigation. The newly redesigned page is not published (draft), and there are some links present that should redirect to the main domain page. But those links redirect not to the main domain page but to the other dev domain on which is redesigned page. How can I make them redirect to the main page? I am using the link element `{% set href = module.testimonial_link.url.href %} <a href=\"{{ href }}\">See more </a>`  . On the page it renders like `<a href=\"?hsLang=en\">See more</a>`  whereas it should 'https:\n//example-domain/see-more-page. Thanks in advance for your help!"
  },
  {
    "poster": {
      "poster_name": "David Boyd",
      "poster_handle": "dboyd"
    },
    "time_stamp": "2024-04-02 06:33:06",
    "text": "Hello - Newbie here.  When one is using Hub CMS and wants to have multiple stores , are each of these stores independent from each other?  Similar to how shopify does things?"
  },
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2024-04-02 06:52:46",
    "text": "gotcha. I was thinking maybe I missed some sort of a setting on import. But would work via a workflow. Thanks for confirming."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-02 07:00:27",
    "text": "No problem.  I use the Clear Property Value action in a few workflows so that I can then use that cleared field as a trigger in a another workflow that then reset some calculated fields.  Lots of ways to go at this stuff."
  },
  {
    "poster": {
      "poster_name": "Siddhart Dutt",
      "poster_handle": "siddhart.dutt"
    },
    "time_stamp": "2024-04-02 07:31:14",
    "text": "Hi everyone, does anyone have experience with captcha design? As soon as I turn captcha on, the design created within webflow gets lost and transits back to its original HubSpot form. Any got a clue?"
  },
  {
    "poster": {
      "poster_name": "opeyemi ahmed",
      "poster_handle": "icongigsconsulting"
    },
    "time_stamp": "2024-04-02 07:45:01",
    "edited": {
      "time_stamp": "2024-04-02 09:23:46"
    },
    "text": "Hi, does anyone have the experience of creating a custom button or link in HubSpot Company page/Contact page or anywhere in HubSpot?  The link will open a URL in a new tab. The URL needs to be built using data from the Company record and current User. This link will be built by concatenating: 1) User Email, 2) a custom Company ID. etc."
  },
  {
    "poster": {
      "poster_name": "Mike Bergsma",
      "poster_handle": "mbergsma"
    },
    "time_stamp": "2024-04-02 07:46:30",
    "text": "I'm building custom cards for the first time to optimize how we enter information about line items. I'm using the CRM Development tab, and creating a dev sandbox, but it seems to only copy over objects associated to 100 contacts, so it's pulling in a few deals, companies etc., but none of our current Line Item data/config. This makes it very hard to actually design something using real data - is there a way to get a dev sandbox and specify which records to pull over?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-04-02 07:52:04",
    "text": "Actually, now that I remember, I have scheduled tasks in a private app that search for certain properties that are clear and perform tasks on those objects (deals mostly)"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-04-02 09:00:07",
    "edited": {
      "time_stamp": "2024-04-02 09:00:14"
    }
  },
  {
    "poster": {
      "poster_name": "Shourya Gupta",
      "poster_handle": "shourya.gupta"
    },
    "time_stamp": "2024-04-02 10:39:07",
    "text": "Hi All! While scheduling a meeting on HubSpot the default status is kept to \"No Value\" - and as of right now, we don't have the functionality to set a meeting outcome as a default value. Alternatively, is there a way to create a workflow where if meeting created is without an outcome, the value changes to 'Scheduled'?"
  },
  {
    "text": "Hi Team,\n\nI'm facing an issue. As you all know, HubSpot allows us to add custom modules to the body of our blog post content. However, Google Search Console considers this as a structured data error.\n\nGoogle has indexed the page, but it mentions structured data issues. If anyone has experienced this error before or knows of a solution, please shed some light on it.",
    "time_stamp": "2024-04-02 10:39:39"
  },
  {
    "poster": {
      "poster_name": "Ayush Rana",
      "poster_handle": "ayush390"
    },
    "time_stamp": "2024-04-02 18:06:23",
    "text": "really appreciate your assistance Scott, Edmond. I have now used ngrok create a https tunnel locally however, I still see this error-\n```[Error] Blocked a frame with origin \"<https://b99f-220-240-68-102.ngrok-free.app>\" from accessing a frame with origin \"<https://app.HubSpot.com>\". Protocols, domains, and ports must match.\n\t```\nI tried adding the <https://b99f-220-240-xx-xx.ngrok-free.app/contact/> url to \"Additional site domains\" but it doesn't seem to work with these urls too"
  }
]