[
  {
    "poster": {
      "poster_name": "Sonal Sachdev",
      "poster_handle": "sonal.sachdev"
    },
    "time_stamp": "2024-04-10 06:51:53",
    "text": "Hi All,\nI'm facing an issue. I am using HubSpot chatbot for my website where I have many users who will be using chatbot.\nIssue is if I log in as <mailto:abc@gmai.com|abc@gmai.com> use chatbot and then after signing out of <mailto:abc@gmail.com|abc@gmail.com> I signed in to <mailto:xyz@gmail.com|xyz@gmail.com> then too chatbot continues referring as <mailto:abc@gmail.com|abc@gmail.com>. Any suggestion on how to handle the issue"
  },
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-04-10 08:05:44",
    "text": "I'm Zori. I've just started working with HubSpot at a company, and I'd like to learn HubL and how to create custom themes in HubSpot for my company. I would appreciate any help on how to get started or any recommended tutorial videos, as well as any advice you can provide. For now, I'm trying to develop my first project, but when I try to connect with the key provided by HS, I get an error and can't proceed past that point. Any advice",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-10 08:07:10"
      },
      {
        "time_stamp": "2024-04-10 08:09:04"
      },
      {
        "time_stamp": "2024-04-10 08:18:21"
      },
      {
        "time_stamp": "2024-04-10 08:19:43"
      },
      {
        "time_stamp": "2024-04-10 08:20:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2024-04-10 08:07:10",
    "text": "In case you hadn't already chanced upon it: <https://academy.HubSpot.com/>"
  },
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-04-10 08:09:04",
    "text": "Thank you Harun im already watching the videos :slightly_smiling_face:"
  },
  {
    "text": "Does anyone know what this error is due to when I enter my key to connect with HubSpot",
    "time_stamp": "2024-04-10 08:18:21"
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2024-04-10 08:19:43",
    "text": "sorry I am unable to help with this one. may be you should ask it in the main thread instead."
  },
  {
    "text": "Does anyone know what this error is due to when I enter my key to connect with HubSpot",
    "time_stamp": "2024-04-10 08:20:21"
  },
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-04-10 08:20:37",
    "text": "thanks!!"
  },
  {
    "poster": {
      "poster_name": "Ravi Kishan Pandey",
      "poster_handle": "rkpandey"
    },
    "time_stamp": "2024-04-10 08:52:10",
    "text": "I'm Ravi, and I'm currently tasked with creating a workflow in HubSpot. This workflow involves incorporating multiple departments and clients. Each client will submit a resume for assessment, which will be reviewed by various departments. Additionally, each department will provide comments, feedback, and log the time spent on the assessment. Ultimately, I aim to aggregate the total time expended by all departments. Moreover, I aim to seamlessly export this data to Excel. Could someone please advise if this is achievable within HubSpot, and if so, could you provide guidance on how to proceed?"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-04-10 10:55:02"
  },
  {
    "poster": {
      "poster_name": "Sean Dizon",
      "poster_handle": "sean.dizon"
    },
    "time_stamp": "2024-04-10 12:43:25",
    "text": "Hello, I'm Sean and working on creating a Shopify storefront that connects to HubSpot. We are looking at purchasing an Operations Hub Starter account in order to gain access to Custom Mappings for the HubSpot &lt;-&gt; Shopify contact sync. Does anyone know if these mappings include the ability to sync a customer's email subscription status on Shopify to HubSpot's Communication Subscriptions?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-11 09:37:50"
      },
      {
        "time_stamp": "2024-04-12 11:47:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-04-10 14:14:54",
    "text": "Hello amazing dev community! I'm not one to bug y'all in here, but this is important.\n\nSome of you may have recently received some emails asking if you wanted to stay subscribed to the HubSpot Developer Newsletter. Hopefully you said yes! Didn't get one, or not already receiving the newsletter? Let's change that. Our monthly newsletter is jam packed with what you need to know:\n\n• Our latest tutorials\n• Doc updates\n• Developer changelog rollups with all the the most important breaking changes, sunsets, and product rollouts and updates that affect what you're building\n• Upcoming developer events \n• If you're lucky, a joke from <@UD53A9UUR> \nSo be sure to :subscribe:*<https://offers.HubSpot.com/developer-newsletter-signup|subscribe here>*:subscribe: - we promise we'll only hit you up monthly, usually the third or fourth week of the month. Y'all are the best!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-10 14:16:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-04-10 14:16:35",
    "text": ":wink:"
  },
  {
    "poster": {
      "poster_name": "Don Dioscoro Jones Platan",
      "poster_handle": "dondioscorojones"
    },
    "time_stamp": "2024-04-10 22:55:38",
    "text": ":wave: Hi everyone! I just recently started to learn HubSpot CMS. :grin:"
  },
  {
    "poster": {
      "poster_name": "Jeppe Wienziers Stenbæk",
      "poster_handle": "jeppe.stenbaek"
    },
    "time_stamp": "2024-04-11 00:58:55",
    "text": "Hi All we have migrated to HubSpot native calling, this works fine, however, a few countries are not supported, we have therefor bought additional numbers via Twilio, however, HubSpot only supports outbound with external numbers, anyone that has solve the inbound numbers with an external number?"
  }
]