[
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2024-04-26 01:51:28",
    "text": "Have you noticed a difference between how HubSpot measures sessions and google analitycs? I have 20-30% more sessions recorded in HubSpot than GA. :thinking:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-04-26 01:56:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2024-04-26 01:56:14",
    "text": "I've got this explanation from HS support AI, anything more to add to this?\n\n```HubSpot measures a session by the referral domain that brings a visitor to your site, whereas Google Analytics measures a session based on the referral source/medium.\nHubSpot segments metrics differently from Google Analytics, with discrepancies in how sources and channel groupings are handled.\nIn HubSpot, a new session is created if the source of a visitor's session changes due to interactions like ads, CTAs, or links in emails. This differs from Google Analytics.\nSessions in HubSpot include a series of visitor activities like page views, CTA clicks, and events, expiring after 30 minutes of inactivity. New sessions begin with a return after 30 minutes of inactivity or from a new session campaign.\nGoogle Analytics counts a session when someone reaches your site from a referring source within a given time frame, with a session ending after a period of inactivity, not restarting at midnight.\nThe discrepancy in session numbers between HubSpot and Google Analytics is expected due to these differences in how sessions are defined and tracked in each platform.```"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-04-26 02:23:25",
    "text": "Hey <@UF6M5BW4C> there's no notification unfortunately. There is however an \"Approval\" functionality but you need Enterprise.\n<https://knowledge.HubSpot.com/website-pages/approve-HubSpot-content|https://knowledge.HubSpot.com/website-pages/approve-HubSpot-content>"
  },
  {
    "poster": {
      "poster_name": "Hugo Carvalho",
      "poster_handle": "hugo.carvalho"
    },
    "time_stamp": "2024-04-26 07:26:23",
    "text": "Hi everyone!!\nWe have a client complaining that some quotes are being shown as expired when accessed by the customers even though the expiry date is set to be more than a month from now . Does anyone know if this issue is a known bug?"
  },
  {
    "text": "Hello, everyone, I have a question about domains  and subdomains  in HubSpot. I already spoke with support, but they told me that what I'm asking for is not possible. However, I'm not entirely convinced and I think there might be some confusion. To help clarify the issue, I have added a graphic that illustrates my query. is this possible?",
    "time_stamp": "2024-04-26 11:11:46"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-04-26 12:05:01",
    "edited": {
      "time_stamp": "2024-04-26 12:05:06"
    }
  },
  {
    "poster": {
      "poster_name": "Kenny Buckles",
      "poster_handle": "kenny962"
    },
    "time_stamp": "2024-04-26 15:12:45",
    "edited": {
      "time_stamp": "2024-04-26 16:24:06"
    },
    "text": "I am attempting to use `/crm/v3/associations/{fromObjectType}/{toObjectType}/batch/read` to retrieve all company associations from a contact, but it's only returning the primary. Am I missing something in the documentation to show all associations?"
  }
]