[
  {
    "poster": {
      "poster_name": "Spencer Knisely",
      "poster_handle": "spencer680"
    },
    "time_stamp": "2021-08-29 14:08:28",
    "text": "Hello everyone. I’m gathering through the documentation available that there is no way to add timeline events to the ticket object via the API. Do you all concur?"
  },
  {
    "poster": {
      "poster_name": "Paresh Bhavsar",
      "poster_handle": "paresh"
    },
    "time_stamp": "2021-08-29 22:50:45",
    "text": "Need API expert’s help…\n\nWe have an in-house system on  .NET platform that is used by subscribers to login and get access to various tools, video, content etc.\n\nAll subscriptions for users are currently managed in their system. We want to move subscriber management in HubSpot for the internal sales team to manage everything related to subscribers and their Subscriptions from HubSpot.\n\n*Here are 3 main issues that we are not sure how and if possible in HubSpot. Can someone help?* \n\n1. Reset user password - We want an ability for a sales rep to click on a link in a contact record in HubSpot for reseting password.\nWhen a rep clicks on the link in HubSpot record, an api connection from HubSpot would trigger our system with request and our system will reset and send email to user from our system.  Our system will send info back to HubSpot and a timeline activity record will be created for password reset requested and reset email sent.  This needs to happen in real time.\n\n2. There is a bunch of user activity in our system, from login audit trail, to meetings minutes left, documents accessed etc.\n\nWe want sales reps to see this information for a subscriber from HubSpot. May be this can be done through crm cards. We don’t want to store this info in HubSpot but ONLY show when a sales rep clicks on a drop down for a particular card and once that is closed, the info would not be stored in HubSpot.\n\nWe want to show info from our system in HubSpot in real time as there are 30000 subscribers and many pieces of info for each subscriber so they don’t want to store all that in HubSpot.  Possible to show in real-time?\n\n3. Some information will be updated in HubSpot like user email, subscription products and add on products.  We want to push info to our system from HubSpot the moment it is changed in HubSpot."
  }
]