[
  {
    "text": "Hi everyone... today im starting with getting information from the saved contacts in HubSpot. I read that it is posible to add certain parameters to get more information of the contacts. I was wondering if there is a list with al the available properties? I read somewhere that u can use hs_lead_status to get the lead status, but i don't know the other property names.",
    "time_stamp": "2021-08-31 01:51:56",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-01 13:31:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Divan Egers",
      "poster_handle": "divan.egers"
    },
    "time_stamp": "2021-08-31 02:32:55",
    "text": "Hi Everyone,\nI have some timeline events API questions I was hoping someone could help with;\n1. Is it possible to use the associations API to associate an existing timeline event to another object. Lets say we wanted to associate a Contacts timeline events (of a certain type) with the Contact's Deals. So these timeline events would now be associated with both a Contact and a Deal(s)?\n2. Is it possible to associate the same Timeline Event to multiple objects of the same time. So 1 Timeline Event to multiple Deals? Or do we need to duplicate the Timeline Event for each Deal?\n3. An <https://www.intercom.com/help/en/articles/2128216-HubSpot-app-send-leads-and-conversations-to-HubSpot|integration> is exposing a workflow trigger, is there anyway to tell if the Timeline Event is available to a custom coded workflow action?"
  },
  {
    "poster": {
      "poster_name": "Lukas Pangonis",
      "poster_handle": "lukas.pangonis"
    },
    "time_stamp": "2021-08-31 03:13:28",
    "text": "Hello,\n\nI am looking for some information/ best practice how to integrate *HubSpot with Auth0*.\n \nWe are working on integration to track users sign ups and logins to our online product. \nFor user identification we are using Auth0.\nWe have very similar option to signin or sign up as Airtable: \n\nWhat would be the best why to track sign up and logins by passing couple addition things to contact level such as: \n_SIGN UP TYPE_\n_FIRST LOGIN_\n_LAST LOGIN_\n\nShould we be using Auth0 rules for this?\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "B Bahrami",
      "poster_handle": "bahramibh7"
    },
    "time_stamp": "2021-08-31 04:57:38",
    "text": "any body can help ?"
  },
  {
    "text": "Hi all :wave:\n\nI am using the Supermetrics connector for Data studio and trying to replicate a report I have already built in HubSpot.\n\nIt has applied filters, which I’ve replicated in DS, however, there is one aspect, which I can’t resolve.\n\nIn the report, I am showing MQLs,Leads+Deals by URL, so the summary table is super simple, showing a first page seen, and a ‘count of contacts’ and ‘associated deals’\n\nWhere I am finding trouble replicating the report is that, in DS, the table only shows the page with deals, as well as the contacts that are associated with the deals (even if they are more than 1), whereas in the HubSpot report, there are data entries counted, which do not have any deals associated with them.\n\nAs a result I am seeing a difference in the total values (pics attached)\n\nIs there any way that you are aware of that this can be resolved?\n\nHere is what I’ve tried so far and didn’t work:\n• using instead of the contacts (name) count, a count of the company name, or the email and do a count of that\n• Creating a custom field using concat of (First name,” “, Last name) to do a count of\n(please feel free to share my post in other channels, where you think it might be more suitable)",
    "time_stamp": "2021-08-31 06:50:53",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-31 06:52:17"
      },
      {
        "time_stamp": "2021-09-01 00:32:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lazarina Stoy",
      "poster_handle": "lazarina.stoy"
    },
    "time_stamp": "2021-08-31 06:52:17",
    "edited": {
      "time_stamp": "2021-08-31 06:52:50"
    },
    "text": "<@UQTKSQC5A> <@U01MBAU8KU1> - not sure if you might be able to help?\n\nAny input would be appreciated :pray:"
  },
  {
    "poster": {
      "poster_name": "Tom Wright",
      "poster_handle": "tom210"
    },
    "time_stamp": "2021-08-31 08:09:11",
    "text": "hi all!!\nI deleted a custom object as it had a spelling error in the name. I went to reregister it and it says it can't because it's already registered, although it doesn't appear in the portal. I saw on a support group that you need to purge them after you delete them, but when I purge them, it says that it can't be completed because the object doesn't exist?\nAny help would be greatly appreciated!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-31 14:08:13"
      },
      {
        "time_stamp": "2021-09-01 01:19:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rajiv Subrahmanyam",
      "poster_handle": "rajiv"
    },
    "time_stamp": "2021-08-31 14:08:13",
    "edited": {
      "time_stamp": "2021-08-31 14:09:19"
    },
    "text": "<@U02052679KJ> The following works for me:\n• Get the id of the deleted object using `<https://api.HubSpot.com/crm/v3/schemas?archived=true>`\n• Purge the object after deletion using `<https://api.HubSpot.com/crm/v3/schemas/2->&lt;id&gt;/purge` \n• Re-create the object"
  },
  {
    "poster": {
      "poster_name": "Amrou Bellalouna",
      "poster_handle": "amrbellalouna"
    },
    "time_stamp": "2021-08-31 14:33:53",
    "text": "Has anyone had any luck using the accounting extension API to search for invoices, and to fetch invoice details by id ?"
  },
  {
    "poster": {
      "poster_name": "Heikki Kauma",
      "poster_handle": "heikki.kauma"
    },
    "time_stamp": "2021-09-01 00:32:01",
    "text": "Not quite sure if I understood the situation correctly, but I think the problem is that field called \"Contacts\" in Supermetrics HubSpot connector gives the number of contacts associated with the deals when it is used together with Deals dimension field. And this is how that dimension field is designed to work. We use the same field “Contacts” (aka contact_total_count) in three different contexts:\n• When this data comes from Page Analytics - it is Number of new contacts in the time period.\n• When it comes from Deals - to count associated contacts (and this seems to be the case here)\n• For Contacts this is all the contacts rows count result (filtered by date period) - so it is basically the same thing.\n"
  }
]