[
  {
    "poster": {
      "poster_name": "Paul Kemps",
      "poster_handle": "paul"
    },
    "time_stamp": "2019-11-14 04:09:24",
    "text": "I'm migrating from Marketo to HubSpot. In Marketo i can make campaigns and put campaign-info in properties and use that info plus contact-info in emails. The advantage is that i can copy a campaign, change the campaign-info and several emailtemplate (register follow-up, reminder email) fills with the right info. In HubSpot i need to make emails for each \"workflow\". Does have somebody a idea to copy that from Marketo? HubDB is not a option, because there is not a HS-CMS used.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-11-14 08:16:38"
      },
      {
        "time_stamp": "2019-11-14 09:31:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-11-14 08:16:38",
    "text": "Hey <@UFALG0N9W> This is a feature that we don’t really have an equivalent for.  As a workaround, what some people is to “overload” contact tokens to contain campaign details. You can use the workflows tool or a csv upload to bulk set those fields before each campaign launches.  For situations where that doesn’t work, you really just have to go into each campaign asset and change the information manually. You may want to upvote this idea <https://community.HubSpot.com/t5/HubSpot-Ideas/Tokens-at-campaign-and-system-level/idi-p/188352> and add your use case. PMs look at that forum to help influence our roadmap (personally I would love to see us add a feature like this)"
  },
  {
    "poster": {
      "poster_name": "Paul Kemps",
      "poster_handle": "paul"
    },
    "time_stamp": "2019-11-14 09:31:10",
    "text": "Thanks for the response. I was already afraid that this was the answer. We have many events, masterclasses and webinars, and this workaround would pollutes our property list dramatically. Then i will choice the way to make several emails for each campaign. Is also better for the statistics."
  }
]