[
  {
    "poster": {
      "poster_name": "Aleksander Krupski",
      "poster_handle": "a.krupski"
    },
    "time_stamp": "2019-11-27 07:52:40",
    "text": "<@UKJ2HSVT2>\n\nNot sure whether I got your questions right, but let me try to explain it as well as I can.\n\n*1st thing* is you need to make GTM recognize the fact of the form submission actually taking place. There are several ways to do it (using all sorts of listeners), but the most reliable one is to attach to: *onFormSubmit* callback.\n\nWhich can be done:\na) while the form is being created (hbspt.forms.create())\nb) anywhere on the website\nboth way have their pros &amp; cons so it really depends on your particular case.\n\n*2nd thing*. Use it to fire GTM's event which then you will turn into GTM's trigger and use dataLayer's data (populated by the code fired upon callback).\n\nSo bottom line is:\n\n1. Make GTM know that the form's submission took place.\n2. Use data sent in dataLayer.push() to fire Google Analytics tag with proper information. "
  },
  {
    "poster": {
      "poster_name": "Aleksander Krupski",
      "poster_handle": "a.krupski"
    },
    "time_stamp": "2019-11-27 08:04:53",
    "text": "<@UR1UYRN14>\n\n\n&gt;  I'm no coder and no designer, but i have fun with it\nWe all do :slightly_smiling_face:\n\nHard to say, without knowing the structure of that HubDB table and the query. You are either getting no results for those two particular fields (for row[0]) or you got those two fields' names wrong."
  },
  {
    "poster": {
      "poster_name": "Aleksander Krupski",
      "poster_handle": "a.krupski"
    },
    "time_stamp": "2019-11-27 08:06:47",
    "text": "<@UJ7FCC734> Not sure whether that's even possible. Nonetheless, I would probably suggest using Google Optimize for it anyway."
  },
  {
    "poster": {
      "poster_name": "Chris Beyeler",
      "poster_handle": "chris193"
    },
    "time_stamp": "2019-11-27 09:08:02",
    "text": "Thank you, especially since I am aware that a lot of information is missing. It's no HubDB table it's only a blog post with an custom hubL variable. And i got no results. No error message, nothing. Meanwhile i figured out that i got no results except for absolute_url."
  },
  {
    "poster": {
      "poster_name": "Aleksander Krupski",
      "poster_handle": "a.krupski"
    },
    "time_stamp": "2019-11-27 09:12:31",
    "text": "Gotcha. Well, at this point, all I can say is that I'm out of ideas without taking a look at the code. Sorry :slightly_smiling_face:"
  }
]