[
  {
    "text": "To confirm, there’s no way to add font color via the section styles, correct? I’m using the section styles to add a background color (which is dark) and I’d like for the font color to be white so there’s contrast. If not achievable here, are there workarounds you’ve found?",
    "time_stamp": "2020-11-13 10:18:58",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-11-13 10:25:07"
      },
      {
        "time_stamp": "2020-11-13 10:25:58"
      },
      {
        "time_stamp": "2020-11-13 10:26:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2020-11-13 10:25:07",
    "text": "At the moment there isn’t a way to set font color on the layout nodes (like sections / column / rows). To get around this you’d have to update the styles of the individual modules inside the section "
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-11-13 10:25:58",
    "text": "so this is only possible inside of a custom module right now"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-11-13 10:26:36",
    "text": "gotcha. thx! it’d be a great addition if this were possible."
  },
  {
    "poster": {
      "poster_name": "Victor Rojas",
      "poster_handle": "victor058"
    },
    "time_stamp": "2020-11-13 13:08:36",
    "edited": {
      "time_stamp": "2020-11-13 13:41:10"
    },
    "text": "I want another member on my team to review blog designs without making the blog post live.\nAfter chatting with support, it was determined I don’t have CMS Hub Enterprise, so I cannot make a new private blog, and the per-post private functionality is outlined in <https://community.HubSpot.com/t5/HubSpot-Ideas/Allow-private-registration-blog-post-level-not-only-entire-blog/idi-p/378794|this idea>, which I upvoted.\n\nCurrently I created posts on my development account and uploaded a modified theme using the `hs` cli.\nI want to allow our content creators to preview the blog with the new design. I am aware of the `Preview` mode available through the `Edit` interface, though this does not account for previewing the listing page.\n\nSupport staff suggested to add a new landing page or website page and copying over code from my blog template. I thought I would be able to import a generated folder using the XML import, though HubSpot no longer has XML export for blogs.\n\nSince blog themes don’t show up in the website pages options, how do I convert my customized list and post templates to use within a new website page?\nIs the proper approach to copy and paste individual modules and then adjust the fields? Will this need to be done every time there is an update to the templates? There is no way to upload the templates/stylesheets/corresponding fields.json file?"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2020-11-13 13:50:33",
    "text": "In the theme boilerplate there is a related post macro, is there a way to find the length of items passed to the macro? When you have no posts it still shows the \"Read on\" header and I would like this to only appear if there are items shown. I tried loop.index but that didn't work <https://github.com/HubSpot/cms-theme-boilerplate/blob/6df499e68d6323984330a6e412eb09298136def6/src/templates/blog-post.html#L53>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-11-13 15:28:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2020-11-13 15:28:01",
    "text": "Hey Jacob! Would you mind filing an issue in boilerplate for this? This seems like a bug on our end. I believe you should be able to pass count and total into the macro and then check to see if the count equals one `{% macro recent_post(post, count, total) %}{% if count == 1 %}your code here{% endif %}{% endmacro %}`"
  }
]