[
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-14 09:07:20",
    "edited": {
      "time_stamp": "2018-11-14 09:10:53"
    },
    "text": "heads up HS team <https://spin.d.pr/aA6xJP+>\nOld nav is still live, not trying to be annoying in pointing it out, just watching it because I will drop support in the <#CBBAW6Z3R|community-browser-extension> for the old nav once the new nav is officially fully rolled out. Hopefully improving speed and reliability of the developer menu."
  },
  null,
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2018-11-14 10:55:32",
    "text": "BUG: Windows 10 -- Chrome:\nIt looks like after a copy/paste in the header HTML editor, the 'undo' option is not registering the previous actions. I've noticed some lack of responsiveness with the undo in the expanded HTML editors as of late --  I do have this one error:\n```schemas.js:48 Error: usage-tracker event error: Missing required event property \"screen\". Event \"pageView\" requires that a value be passed for event property \"screen\". Received \"undefined\".```"
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2018-11-14 10:55:52",
    "text": "Not sure if that is related to the lack of the undo state capture or not"
  },
  {
    "poster": {
      "poster_name": "Dana (Holdt) Pesendorfer",
      "poster_handle": "dana.holdt"
    },
    "time_stamp": "2018-11-14 11:03:06",
    "text": "Ah -- So I think this is a UI issue more than anything. -- It seems with this situation, the 'Undo/Redo' are impacting the underlying template -- while I'm actively looking at the HTML code for that item. This becomes problematic for having a relational idea of what is going on as I can't undo a change (even with ctrl + z ) in the HTML editor, but unseen changes are happening to the template in the BG"
  },
  null,
  null,
  null
]