[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-13 12:20:39",
    "text": "the form builder, if there is html in the labels of fields it displays the code.\n\nReason this matters - client thought they had to use the richtext feature to add formatting - they had a form that had no labels because all of it was in the rich text areas instead.\n\na vision impaired person using a screen reader would have probably and fairly thrown around a few curse words and went on to find a different company to handle their stuff."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2018-11-13 13:22:25",
    "text": "#accessibilityMatters"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-13 13:30:19",
    "text": "I’ve been trying to be more conscientious of it lately. Had to work on a project where accessibility while it wasn’t a primary concern, I knew for fact a lot of people who needed to use assistive technologies or keyboard navigation would be using the site. Made me do a lot of digging into best practices. it’s a humbling experience to try to use those tools yourself and go through an old project, just to go… oh man… I completely failed some people."
  },
  {
    "poster": {
      "poster_name": "Joel Warren",
      "poster_handle": "joel"
    },
    "time_stamp": "2018-11-13 14:36:07",
    "text": "Oh man using something like JAWS is an eye opener, thinking about giving the team a turn on it."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-13 14:38:07",
    "text": "honestly I feel like a great policy to have would be to be like - all the devs and decision makers at the company have to use JAWS or mac OS’s built in thing for a minimum of 2 hours  every friday"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-13 14:38:09",
    "text": "or something"
  },
  {
    "poster": {
      "poster_name": "Joel Warren",
      "poster_handle": "joel"
    },
    "time_stamp": "2018-11-13 14:39:06",
    "text": "ha it'd drive people batty"
  },
  null,
  null,
  null,
  null,
  null
]