[
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2020-01-14 01:07:53",
    "text": "Hello everyone"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-01-14 14:12:25",
    "text": "Hey - Is this new editing experience alongside the drag and drop modules (now out of beta) going to replace the design manager? It feels like theres quite a cross over now between both experiences - giving the content editor the ability to customise themes is more of a design experience right?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-01-14 15:19:32"
      },
      {
        "time_stamp": "2020-01-14 15:22:30"
      },
      {
        "time_stamp": "2020-01-14 15:53:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-01-14 15:19:32",
    "text": "Hey Kieran!\n\nNo tools are going away anytime soon, however, as you have noted, many of the features we have been releasing recently represent a new approach to building websites.\n\nThey are tools that allow developers to utilize coded files and local development which open up websites on the HubSpot CMS to many of the advancements in the front end web development ecosystem.\n\nAdditionally, the content creator is able to make content, style and layout changes all within easy to use tools.\n\nThis new approach is designed to let developers build using the workflows, tools and technologies they prefer, while freeing up content creators to easily update websites.\n\nAny and all feedback on this new approach to building websites, Themes and anything else are ALWAYS welcome :smile_cat:"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-01-14 15:22:30",
    "edited": {
      "time_stamp": "2020-01-14 15:23:01"
    },
    "text": "Makes sense - Thanks for the detailed response :slightly_smiling_face: I like this direction very much! Can you say if the marketplace be open to coded templates anytime soon?"
  },
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-01-14 15:53:47",
    "text": "Hi Kieran. We are still finalizing the future of coded templates and themes in the marketplace. Stay tuned for more information coming soon!"
  },
  null,
  null
]