[
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2019-09-27 09:16:11",
    "text": "I recently ran across HubSpot Canvas, <https://canvas.HubSpot.com>.  Is anyone using this to build out their UI?  I would think these components would be available in CMS by default - what am I missing?",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-09-27 10:02:03"
      },
      {
        "time_stamp": "2019-09-27 10:02:59"
      },
      {
        "time_stamp": "2019-09-27 13:05:44"
      },
      {
        "time_stamp": "2019-09-27 13:27:59"
      },
      {
        "time_stamp": "2019-10-02 12:44:47"
      },
      {
        "time_stamp": "2019-10-03 10:33:05"
      },
      {
        "time_stamp": "2019-10-14 12:50:03"
      },
      {
        "time_stamp": "2022-04-07 06:27:17"
      },
      {
        "time_stamp": "2022-04-07 07:46:59"
      },
      {
        "time_stamp": "2022-04-07 07:57:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-27 10:02:03",
    "text": "Canvas is used by HubSpot for HubSpot branded stuff.\n\nIt would not make much sense for another company to use canvas. That said it is a design system and it is published because others can learn from our design system, like we learn from others.\n\nFor other examples of design systems: <https://designsystemsrepo.com/design-systems/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-27 10:02:59",
    "text": "It’s effectively a web/digital version of what traditionally marketing agencies referred to as Brand Guides"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2019-09-27 13:05:44",
    "text": "Thank you for clarifying the purpose behind CANVAS.  FWIW - from a developer that has developed C# .NET Applications as well as on Shopify, Volusion, Magento, and Wordpress - the key, basic components you have in Canvas are completely missing from your CMS (e.g. Modals, Tabs, Side Navigation, heck mobile navigation for that matter). It makes development on your CMS platform difficult for non-developers and takes developers who need to spend their time coding more dynamic functions 10 times longer to develop on your CMS because we need to hand-code basic simple features that are typically available in most modern CMS platforms.  That being said, I do have a great appreciation for the thought put into module development in regards to repetition and visibility based on other selections.  Now, if I could just get HubSpot to not wrap every module in the drag/drop interface with extranneous divs...."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-27 13:27:59",
    "edited": {
      "time_stamp": "2019-09-27 13:30:18"
    },
    "text": "Regarding the tabs/modals/side nav etc. we try not to force our way of coding them onto developers because developers have different ways of working. Like any CMS platform, be it WordPress, Magento, Shopify, etc - we want to allow the developer to use the tools they want to use. You would need to install plugins for many of those features on WordPress, or code your own. If you would rather not do as much of the front end development work, we have a marketplace of templates and modules.\n<https://marketplace.HubSpot.com/products?subType=CUSTOM_MODULE>\n\nFor developers that like to learn from and build off of eachother’s work, we recently launched the HubSpot CMS Developer Code Gallery.  A collection of user submitted CMS assets.\n<https://designers.HubSpot.com/code-gallery>"
  }
]