[
  {
    "poster": {
      "poster_name": "Josh Markus",
      "poster_handle": "josh010"
    },
    "time_stamp": "2022-11-15 07:58:42",
    "text": "theme-overrides.css &amp; theme settings\n\nI'm a bit confused on best practice for applying theme settings in the theme-overrides stylesheet. For example, if I look at the Growth theme, the primary_font css variable is only getting applied to \".error-page:before\" selector and secondary_font isn't applied at all.\n\nJust wondering best practice for applying these css variables to selectors. Also taking into consideration that the headings, body, etc also have their own font settings. Does anyone have any examples they've found for how to properly set this up in the theme-overrides stylesheet?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-15 08:08:46"
      },
      {
        "time_stamp": "2022-11-15 08:26:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2022-11-15 08:08:46",
    "edited": {
      "time_stamp": "2022-11-15 08:12:22"
    },
    "text": "Hey Josh :wave: that is a great question! Speaking specifically for HubSpot built themes we generally use the primary/secondary fonts and colors as a top level field that will then flow through the rest of theme settings using field inheritance. So while the actual field value may not be used a lot in the stylesheet it is mainly used as quick spot to start setting theme settings that then flow through more widely referenced fields (e.g. primary font is inherited by body font which is used a lot more in the stylesheet).\n\nQuick example in boilerplate you can see how the primary font field <https://github.com/HubSpot/cms-theme-boilerplate/blob/main/src/fields.json#L50-L70|here> is later inherited via the body font field <https://github.com/HubSpot/cms-theme-boilerplate/blob/main/src/fields.json#L383-L390|here>. So essentially we set it up this way so that a user can initially go into theme settings and make a small number of changes to get the majority of their theme look closer to the brand and then they can optionally update more granular settings if they wish."
  },
  {
    "poster": {
      "poster_name": "Josh Markus",
      "poster_handle": "josh010"
    },
    "time_stamp": "2022-11-15 08:26:54",
    "text": "Thanks for the clarification Jason, that makes more sense now. And I see that the secondary font is then inherited by the heading. Makes sense now."
  }
]