[
  {
    "poster": {
      "poster_name": "Max Hart",
      "poster_handle": "max370"
    },
    "time_stamp": "2022-11-29 02:53:46",
    "text": "Hi everyone. I’m hoping someone can help me. I want to have multiple domains within our portal and I’m of the understanding that I’ll need a separate theme per-domain so I can update the brand colours on a per-domain basis. The modules across the themes will remain the same, for this reason I believe using a parent/child theme is the correct approach to achieve this.\n\nIs it possible to have a global module across multiple themes / domains? I can create variations of the global module on a per-language basis; ideally this functionality would be extended, so we can manage the 1 global module across multiple themes, and create a ‘per-theme variation’. Ideally I want to avoid having to create a new global module for each theme. Would love some guidance / some advice on the best approach for this? Thanks in advance!",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-11-29 11:27:06"
      },
      {
        "time_stamp": "2022-11-29 13:07:38"
      },
      {
        "time_stamp": "2022-11-30 08:22:10"
      },
      {
        "time_stamp": "2022-11-30 08:22:53"
      },
      {
        "time_stamp": "2022-11-30 08:24:08"
      },
      {
        "time_stamp": "2022-11-30 08:25:20"
      },
      {
        "time_stamp": "2022-11-30 08:25:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-11-29 11:27:06",
    "text": "I am pretty sure if you create your global module outside of your theme it should work. One thing im not sure of is if global modules in themes are scoped  to the theme or account level."
  },
  {
    "poster": {
      "poster_name": "Max Hart",
      "poster_handle": "max370"
    },
    "time_stamp": "2022-11-29 13:07:38",
    "edited": {
      "time_stamp": "2022-11-30 01:19:18"
    },
    "text": "<@UG7S8J18D> i did consider that, but it still leaves the question of how to modify the logo, links etc. for each domain :thinking_face: if the global module is scoped to the theme; perhaps copying + pasting the theme will do the job, providing the templates that include the module are including the right global module. Just need some concrete clarification from someone before i can commit to a solution / approach!"
  }
]