[
  {
    "poster": {
      "poster_name": "Adam Nissen Feldt",
      "poster_handle": "anfe216"
    },
    "time_stamp": "2022-11-21 01:46:01",
    "text": "Would it be possible to let the user toggle between two themes via a toggle on the websit front page or similar?",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-11-21 06:56:22"
      },
      {
        "time_stamp": "2022-11-21 07:03:03"
      },
      {
        "time_stamp": "2022-11-21 13:17:59"
      },
      {
        "time_stamp": "2022-11-21 13:20:55"
      },
      {
        "time_stamp": "2023-11-06 06:55:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-21 06:56:22",
    "text": "I'm very interested in this question, what exactly is the use case? is it a dark/lightmode thing? maybe <@U03AKL6Q1B2> has some ideas"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2022-11-21 07:03:03",
    "text": "I've seen the dark/light mode toggle on a website before, is that what you're thinking or beyond colors?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-11-21 13:17:59",
    "text": "Not sure if there are HubSpot-specific utilities that would facilitate a full-blown theme selector.\n\nHowever, you can certainly accomplish it through traditional means — using a cookie or the localStorage API to keep track of a user’s preferred theme, and using JS to set body classes/append appropraite stylesheets on page load. You might be able to leverage some of HubSpot’s conditional content tools for this, but I don’t think there’d be much of an advantage over rolling it yourself.\n\nIf you’re just looking for a light/dark theme selector, you can also accomplish that through use of the `prefers-color-scheme` media query, with the option for a manual override using the above techniques."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-21 13:20:55",
    "edited": {
      "time_stamp": "2022-11-21 13:21:06"
    },
    "text": "<@URP2UL0PJ> will need to answer this but I think that he wants to change the entire HubSpot theme, and I think this is only possible if you host different versions of the HubSpot page and then redirect to other version depending on which theme the person wants to use. But yeah if it's just a color or simple theme selector definitely just use cookies like <@U04AQA0QM8E> recommends"
  },
  {
    "poster": {
      "poster_name": "Michael Neely",
      "poster_handle": "michael892"
    },
    "time_stamp": "2022-11-21 14:08:03",
    "text": "I'm building a theme for a client and they want to change the system page subscriptions-preferences.html into a theme-oriented page bringing in only the email_preferences module. We've built the page in staging but when testing the page, it throws a forbidden error. Any way to get this module to work in content staging?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-21 20:00:42"
      },
      {
        "time_stamp": "2022-11-22 06:44:05"
      },
      {
        "time_stamp": "2022-11-22 06:58:58"
      },
      {
        "time_stamp": "2022-11-22 06:59:46"
      },
      {
        "time_stamp": "2022-11-22 07:46:24"
      },
      {
        "time_stamp": "2022-11-22 07:47:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "M Patel",
      "poster_handle": "mitesh726"
    },
    "time_stamp": "2022-11-21 20:00:42",
    "edited": {
      "time_stamp": "2022-11-22 06:32:43"
    },
    "text": "Subscription types are only for Email (your contacts) and it is scoped under contact. I don't think you can use it in pages. But confirm with the HubSpot team."
  }
]