[
  {
    "poster": {
      "poster_name": "Lazarina Stoy",
      "poster_handle": "lazarina.stoy"
    },
    "time_stamp": "2021-10-15 08:26:06",
    "edited": {
      "time_stamp": "2021-10-15 08:49:28"
    },
    "text": "Hello all - HubSpot newbie here, usually a Tech SEO Analyst :sweat_smile:\n\n*Project:* Devise a scalable solution to reporting on client HubSpot data in Data Studio\n\nI*deal scenario:* \n• Simple set-up (coding manageable, if any is required for the setting up that won’t be a problem, but ideally this can be used by other people, with just a how-to guide and within our organisation there aren’t many comfortable with coding)\n• low/no-cost for connecting multiple accounts\n• Security and anonymous data pulls - we are an agency reporting on the data, so we’d like to *not* be able to view contact information, but pull data from the dimensions contact+ deals count, first page seen (&amp; other web analytics data), contact country, number of pageviews, original source, inbound/outbound, type of contact, etc.  (see image). \n• Filtering - we don’t want to be collecting data that is not used, so filtering should be applied. e.g. source = organic, etc. \n• bypass then need of having given superadmin access to the account (so limited in terms of API use)\n*What I’ve tried so far:* \n• Zapier - works, but pulls too much unnecessary data which is both a pricing and a security concern, hindering scalability, filtering does not work ideally and required additional filters implemented in DS, as well as creates a risk for unsecured and unnecessary collection  of personal data\n• Supermetrics - not an option due to the pricing point, also the need of having superadmin access \n• API - not possible due to access limitations (though I would love to see recommended resources on integrating easily with sheets, the ones I’ve found so far were : <https://medium.com/how-to-lean-startup/create-a-HubSpot-custom-dashboard-with-google-spreadsheet-and-data-studio-27f9c08ade8d> , and this discussion (<https://community.HubSpot.com/t5/CRM/Populate-Google-Sheets-With-HubSpot-Data/td-p/34082>, though this does not address the concern about anonymising the data). \nIf you have a system for anything related to exporting the data for reporting, even if it involved manual exporting the data, or semi-automation, I’d love to hear about it, if you are willing to share.\n\nAny help with this will be appreciated.",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-15 10:24:42"
      },
      {
        "time_stamp": "2021-10-15 10:26:38"
      },
      {
        "time_stamp": "2021-10-15 10:27:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-15 10:24:42",
    "text": "There isn't a lot of good options I've looked into this pretty extensively. There are some low cost options using community connectors this seemed to be the cheapest <https://datastudio.jivrus.com/connectors/crm/HubSpot>"
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-15 10:26:38",
    "text": "If you don't mind exporting you could put it into Google Sheets then use their Google Sheets community connector. This is very cumbersome and slow process and depending on what you are trying to do may not work due to data limitaitions."
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-10-15 10:27:33",
    "text": "If this is a big need I suggest having a developer create one it isn't that complicated that is what I'm doing."
  }
]