[
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2022-04-25 03:37:38",
    "text": "Hi <@UE5D6CXPA>, thanks for this thought!\nThat would require JS though and we need a server-side solution for the problem we are trying to solve. So a HubL variable would be great. But which one?"
  },
  {
    "poster": {
      "poster_name": "Bernardo Salazar",
      "poster_handle": "bernardo"
    },
    "time_stamp": "2022-04-25 04:19:47",
    "text": "Hi <@UHDEVB0S1>, maybe: builtin_body_classes"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-04-25 08:09:06",
    "text": "Hey <@UHDEVB0S1> — what are you trying to solve for exactly? Does it have to do with making system pages “Multi-lang” by chance?\n\nI ran into this issue on a recent build that I made and couldn’t find any tags that were specific to page type that were easily accessible. Which was a huge bummer.\n\nBut I did manage to come up with a solution to make this work. But not sure if it will work for your use case!"
  },
  {
    "poster": {
      "poster_name": "Liz Mac",
      "poster_handle": "emacdougall"
    },
    "time_stamp": "2022-04-25 08:49:49",
    "text": "Hi all! I'm really struggling with trying to get blog post widget data to display in the results of a `related_blog_posts`  function. I've got a couple choice fields that are being set like so in the blog-post.html &gt; `{% choice \"type_of_blog\" label=\"Type of Blog Post (Required)\", value=\"Blog Post\", choices=\"Blog Post, News, Event\" export_to_template_context=True %}` . I then have a section that calls related_blog_posts and uses post_formatter to display them with a macro. But so far post.widgets, post.widget_data, and post.contents.widgets are all displaying empty. Has anyone gotten this working before?"
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2022-04-25 08:59:08",
    "text": "<@UE5D6CXPA> - Ah, now I get it :wink: Good idea! I just tested it and there seems to be the class `hs-content-id-0` which is applied for system pages. They all do seem to have an id of 0. I did not test all of the system pages yet, but that could be the way. Thank you very much!\n\nat all: Still open for any alternative suggestions ;)\n\n<@UQWGKUEN7> - We would like to be able to show a dedicated pair of header/footer for system pages, while being able to configure the settings in one central place. This is already working for page, landing-page and blog, but not system pages, because it is not so easy to check for those.\n\nWe partly solved “Multi-lang” for system pages, by inserting translation via HubL variables. The system pages only get translated to the main language of the domain though.  Were you able to translate system pages to the language chosen by the user?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-04-25 09:07:50",
    "text": "So the language switcher likely won’t show up on that page at all because you can’t actually have translated content (as im sure youre aware)\n\nWhat I ended up doing was looking for the `{{request.referrer}}` variable to see what the previous page path was. If it, in my case, contained `\"/de/\"` then I would make the assumption that the viewer was looking at the German translated content and then I would make sure to show the German content for that system page — Which was stored in hubl similar to what your are describing above."
  }
]