[
  {
    "poster": {
      "poster_name": "Stefan Ionita",
      "poster_handle": "stefan.i"
    },
    "time_stamp": "2024-10-02 03:06:46",
    "text": "I have a email template and a rich text module in it.\nThis module contains placeholder text, and when my API exports an email and its content, it is pulling both the placeholder text and the actual content that has replaced it for that specific email. As you can imagine, this causes confusion since it retrieves two different types of content.\nIs there a way to check how long has the placeholder text been there?\nHow can I identify if there were any other placeholder text before this one?\n\nI want to understand if there is a way to view history for this module in the backend to understand how long this text has been present.\nThis way, our analytics team can set rules to exclude the current placeholder text and any historic ones used for this template"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-10-02 03:55:17",
    "text": "Hey folks, quick question about HubL functions and filters... what is the impact of using these on the size of the email? I'm looking at a project where we'd be hardcoding some pretty extensive if/then logic into an email module to support localization, but I'm worried too much of this will impact email size and lead to premature cutoffs or outright bounces in emails.\n\nAt the same time, I know that there's a render engine that an email goes through before it's sent. Is code like {% if %} statements and so on included in the final email, or is the render engine where this logic is processed and then all of that HubL code is not rendered in the final email?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-02 04:02:11"
      },
      {
        "time_stamp": "2024-10-02 04:03:06"
      },
      {
        "time_stamp": "2024-10-02 04:04:04"
      },
      {
        "time_stamp": "2024-10-02 04:04:07"
      },
      {
        "time_stamp": "2024-10-02 04:06:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-10-02 04:02:11",
    "text": "Hey Bob,\nhubl is handled server-side. So it has no impact on client-side - i.e email size.\n\nThe result of the if-then might have an impact on the other hand - for instance if you set something like \"if first name equals \"Anton\" show one image, elif first name equals \"Bob\" show 5 images\" it will have an impact since your email will have 5 images, mine only one:slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-10-02 04:03:06",
    "text": "Ah, no in this case it's mostly on text, just one for a small label but that's a relatively small icon"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-10-02 04:04:04",
    "text": "And always just 1 icon anyway"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-10-02 04:04:07",
    "text": "Ok thanks!"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-10-02 04:06:54",
    "text": "gotcha. then it shouldn't have an impact on email size"
  }
]