[
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-10-03 01:16:20",
    "text": "I'm currently working with the \"crm/v3/objects/emails\" endpoint. While I can retrieve all emails and their details, and I can get the content of a particular email using its email ID, I am encountering an issue.\nI would like to filter the emails to retrieve those specific to a particular *contact*, but I haven't been able to figure out how to do this. Can someone help me on this?"
  },
  {
    "poster": {
      "poster_name": "James Hooks",
      "poster_handle": "james.hooks"
    },
    "time_stamp": "2024-10-03 11:55:53",
    "edited": {
      "time_stamp": "2024-10-03 13:40:25"
    },
    "text": "Hi folks, I was sent here from HubSpot support and hoping someone may be able to help me solve an issue with email links page view tracking.\n\nI cannot get the page view tracking to work through email links to cross domain sites. Even when tracking works in a other contexts e.g. submitting a form we have hooked up through the api and associating the user with _hsq.push(['identify', {email}]).\n\nI have whittled my test page on my external site down to a simple single html file with the HubSpot script embedded and I have verified\n• External domain is part of \"Additional Site Domains\" in the tracking settings\n• The HubSpot tracking script and all subsequent scripts load correctly and are visible in the <head>\n• Cookie banner shows and cookies are accepted\n• The HubSpotutk and other HubSpot tracking cookies are  set\n• The tracking parameters exist in the redirect url from the email i.e. _hsenc, _hsmi, utm_medium, utm_content, utm_source\n• A request to <https://track.HubSpot.com/__ptq.gif>.... appears in the network traffic and is successful\n• No settings or extensions are blocking tracking\nGiven all this, I get no page view entries in the contact associated with the email links. What might be wrong here?"
  }
]