[
  {
    "poster": {
      "poster_name": "Nicola Kemp",
      "poster_handle": "nicola.kemp"
    },
    "time_stamp": "2020-09-10 03:28:32",
    "text": "Hey everyone :slightly_smiling_face: Sorry, if this has been addressed multi times, but: is there any workaround for setting up the *double opt in mail in multiple languages*?\nI have tried working with smart content but this wasn't very reliable as HubSpot was not quick enough to check the contacts record for list membership / language etc.\nThx!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-10 03:33:52"
      },
      {
        "time_stamp": "2020-09-10 03:42:27"
      },
      {
        "time_stamp": "2020-09-10 06:00:56"
      },
      {
        "time_stamp": "2020-09-10 07:10:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Serhat",
      "poster_handle": "serhat"
    },
    "time_stamp": "2020-09-10 03:33:52",
    "text": "Hey <@UEL6YT0Q4>,\n\nIt is not possible from the DOI settings.\nThus, needs to be done with a workaround which is to turn off the native DOI feature, and create a custom DOI property + custom DOI email and a custom confirmation CTA.\n\nThen, multiple workflows can be created to handle the rest of the process.\n\n\ne.g\n\nWorkflow DOI Germany\n\n1. Check language of the contact\n2. IF language is DE, trigger the workflow\n3. Send the custom DOI email\n\nIn another workflow, you can put the contacts who clicked on the confirm button on the custom DOI.\n\n\nThis way, you can collect each contact in a separate DOI list based on the email clicks ( like contacts from Germany go into the Germany DOI list, France into the France DOI list and so on ).\n\n\nAnd you should adjust the other workflows in a way that being in a DOI list should be one of the criteria.\n\nHope it is clear :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nicola Kemp",
      "poster_handle": "nicola.kemp"
    },
    "time_stamp": "2020-09-10 03:42:27",
    "text": "Great! Thank you very much ! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nicola Kemp",
      "poster_handle": "nicola.kemp"
    },
    "time_stamp": "2020-09-10 06:00:56",
    "text": "<@USRE524EA> as your answer was so great before, could you tell me which page is then used for the doi-confirmation page as I can't choose this anymore when I turn the doi switch off. Is it the same as the confirmation page for the subscription types?"
  },
  {
    "poster": {
      "poster_name": "rouault",
      "poster_handle": "juliane.rouault"
    },
    "time_stamp": "2020-09-10 06:52:33",
    "text": "Hi everyone, I am creating a new template for a blog. I used the same module for the header but in the template impossible to see it appear. Has anyone ever had this concern and how was it resolved ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-09-18 15:32:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Serhat",
      "poster_handle": "serhat"
    },
    "time_stamp": "2020-09-10 07:10:00",
    "text": "<@UEL6YT0Q4>, DOI confirmation page should be prepared in the desired language and linked to the CTA in the custom DOI email.\n\n\nSo clicking on the confirm button on the DOI email can lead the user to the custom confirmation page."
  }
]