[
  {
    "poster": {
      "poster_name": "sahil dhiman",
      "poster_handle": "sahildhimansanour686"
    },
    "time_stamp": "2022-05-20 02:48:00",
    "text": "Hello Everyone,\nI have implemented the language switcher module and created the multiple page as per different different language according to this article: <https://knowledge.HubSpot.com/website-pages/create-pages-in-multiple-languages>\nSo, language switcher is working fine but i needed that when i select Arabic then content page content should be shown in Arabic language. But right now it just changing the positioning of module but content is still in English language.\nSo, is there any way that we do need to add the content manually or it can be just handle by language switcher like language translator?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-05-20 09:59:14"
      },
      {
        "time_stamp": "2022-05-20 11:00:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2022-05-20 09:59:14",
    "text": "Hey <@U01FH92LP6W>! The language switcher creates the separate version of the page with the correct html lang attribute, but it doesn’t translate the page. You’ll need to go into the page editor, select “Arabic”, and input the content manually.\n\nIf you check the second screenshot in that article, where is says “French” under “My new homepage” is how you swap to the other language in the page editor to edit the content."
  },
  {
    "poster": {
      "poster_name": "sahil dhiman",
      "poster_handle": "sahildhimansanour686"
    },
    "time_stamp": "2022-05-20 11:00:50",
    "edited": {
      "time_stamp": "2022-05-24 05:28:36"
    },
    "text": "Hey <@U02NJACH5QS>\nyou are right that we need to add content manually as per requirement through the editor. But I was looking in way that we do not need to add content manually. It will auto translate the content which we select from language switcher.\nBut, I think till it is not possible.\n\nThank you for your advise :pray:"
  }
]