[
  {
    "poster": {
      "poster_name": "Archie Makuwa",
      "poster_handle": "archie.makuwa"
    },
    "time_stamp": "2019-09-09 08:59:41",
    "text": "Hi everyone, quick question (both might not be related but any point in the right direction would be highly appreciated):\n1) Can I do some integration work with OAuth on a developer account? I have been struggling to connect using OAuth for a while (through my app and also through the community login). I get directed to the authorization page but I get this error: <https://prnt.sc/p3u7wu>\n\n2) For my app above, I am using this library: <https://www.npmjs.com/package/HubSpot>  – I haven’t gotten to the right and working version o the app. I just wanted to know if I wil experience CORS issues going forward. The app i built on VueJS (Nuxt). I’m new to both VueJS and HubSpot APIs. I don’t want to waste a lot of time on something that one of you might have done already and knows if it will work or not."
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2019-09-09 09:06:51",
    "text": "you can use oauth with a developer test portal , but not your developer account (the one you use to create apps)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-09 09:08:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Archie Makuwa",
      "poster_handle": "archie.makuwa"
    },
    "time_stamp": "2019-09-09 09:08:46",
    "text": "Okay, sweet. Thank you."
  },
  {
    "poster": {
      "poster_name": "Archie Makuwa",
      "poster_handle": "archie.makuwa"
    },
    "time_stamp": "2019-09-09 09:46:15",
    "edited": {
      "time_stamp": "2019-09-09 09:46:51"
    },
    "text": "I’m still unable to get the above to work. I tried from two test accounts. I also can’t seem to authorise the dev accounts on some of the HubSpot site, like: <https://community.HubSpot.com>\n\nI get the same: “Couldn’t complete the connection” error."
  }
]