[
  {
    "poster": {
      "poster_name": "Luca Bartoli",
      "poster_handle": "bartoli"
    },
    "time_stamp": "2019-09-16 08:01:08",
    "text": "Hi guys! Anyone know how to trigger something (app webhook or workflow webhook) every time there is a new association, in a general way?\nLet's say: I want a trigger everytime a company has a new connected contact. Or everytime a company is connected to a deal.\nThe only things I found are the workflow triggers \"company id has been updated in last X days\" and \"company id is known\", but they only fire once and they are only applicable to 1 to n relationships (not to contact-deals for example, because the second associated object does not fire anything).\nMoreover, the transition to external relationships will break these kind of associations as they will not be embedded in properties anymore.\nIn beta, for example, companies can be associated n to m to other crm_objects and this feature will make \"company_id\" in objects useless.\nWhat do you guys think?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-17 07:36:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-16 09:39:26",
    "text": ""
  },
  {
    "poster": {
      "poster_name": "Jason Ng",
      "poster_handle": "jason.ng"
    },
    "time_stamp": "2019-09-16 18:36:05",
    "text": "Hi All! We’re looking to connect our backend ‘trial end’ alert to trigger an email that is connected to our automated email in HubSpot. We’re looking into <https://developers.HubSpot.com/docs/methods/engagements/create_engagement>\nbut the instructions there say that for emails, we should include the content of the email in the API request\nWe have those emails saved in HubSpot so the question is, how do we send an email from a template we made in HubSpot, instead of sending an email with the email content in the API request?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-17 07:16:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Hugo Welke",
      "poster_handle": "hugowelke"
    },
    "time_stamp": "2019-09-16 21:49:44",
    "text": "Hello (old) friends! I feel that I should know this - but does HubSpot API allow other platforms to add/import images/files directly on to HubSpot Files?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-17 07:10:51"
      }
    ]
  }
]