[
  {
    "poster": {
      "poster_name": "Nenad Kostic",
      "poster_handle": "nenad"
    },
    "time_stamp": "2019-11-12 02:04:58",
    "edited": {
      "time_stamp": "2019-11-12 02:05:39"
    },
    "text": "Hello everyone. I'm owner of Bones, new Hub Spot partner. I joined here in order when I stuck with building my start up web site get valuable information to move on. And to show some gratitude on that by helping others if they stuck. Love to be in your company. Cheers."
  },
  {
    "poster": {
      "poster_name": "tpushpathadam",
      "poster_handle": "tom541"
    },
    "time_stamp": "2019-11-12 18:12:47",
    "text": "Hi, I’m new to HubSpot, evaluating the CMS for a client job. I created an account to test a sandbox CMS. Instead of the screen in the documentation I’m seeing a prompt for a 14 day trial. How do I access a sandbox CMS",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-11-12 18:14:18"
      },
      {
        "time_stamp": "2019-11-12 18:20:16"
      },
      {
        "time_stamp": "2019-11-12 18:21:09"
      },
      {
        "time_stamp": "2019-11-12 18:24:35"
      },
      {
        "time_stamp": "2019-11-12 18:26:10"
      },
      {
        "time_stamp": "2019-11-12 20:22:14"
      },
      {
        "time_stamp": "2019-11-12 22:15:05"
      },
      {
        "time_stamp": "2019-11-14 02:54:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-12 18:14:18",
    "text": "Can you send me a link to the page you tried to sign up for a sandbox account on?"
  },
  {
    "poster": {
      "poster_name": "tpushpathadam",
      "poster_handle": "tom541"
    },
    "time_stamp": "2019-11-12 18:20:16",
    "text": "<https://designers.HubSpot.com/discoverykit/dashboard>"
  },
  {
    "poster": {
      "poster_name": "tpushpathadam",
      "poster_handle": "tom541"
    },
    "time_stamp": "2019-11-12 18:21:09",
    "text": "the link on the page is <https://app.HubSpot.com/signup/standalone-cms-developer>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-12 18:24:35",
    "text": "Thank you, hmm these pages shouldnt be triggering a timed trial, i will look into this. Fair warning I likely wont have an answer or solution until tommorow"
  },
  {
    "poster": {
      "poster_name": "tpushpathadam",
      "poster_handle": "tom541"
    },
    "time_stamp": "2019-11-12 18:26:10",
    "text": "ok .. I tested HubSpot years ago so Im guessing starting a fresh account with another email could be a workaround. I’ll check in tommorrow"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-12 20:22:14",
    "text": "Hi <@UQ3A13F18> it appears that if you are signed into a HubSpot account when you go through that it will prompt  you to sign into your existing account. We’re looking into a solution.\n\nI realize you want to get in and get going with your sandbox. Some possible work-arounds while we’re getting this fixed:\n- you could try using incognito when creating the sandbox account (not 100% sure that will work but would be the easiest workaround)\n- As you suggested using a different email account would work. You could then invite your main HubSpot account as a user on that portal, enabling you to sign in through your main account.\n- same premise as above - when you go through the sandbox sign up flow, instead of choosing your existing portal, click “create account” I believe which shows below the portal selector.\n\nLet me know if you give any of those methods a shot. We are working to fix the issue itself but in-case it takes awhile we want to make sure others have a solid workaround."
  },
  {
    "poster": {
      "poster_name": "Don Graham",
      "poster_handle": "don625"
    },
    "time_stamp": "2019-11-12 22:15:05",
    "text": "hello all:wave:.  I’m new to the group. And the incognito suggestion worked like a charm. Thanks."
  }
]