[
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2021-03-12 02:57:49",
    "text": "So you have enabled blog types in module’s settings. Have you added that module to the blog page template also?\n\nWith blog templates, there is not such thing like “add module” or drag it from the left sidebar. You have to add those modules to the template to use them :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2021-03-12 03:05:35",
    "edited": {
      "time_stamp": "2021-03-12 03:06:22"
    },
    "text": "Local files are not replaced automatically. If you want update your local files when fetching, you should use `--overwrite` flag. I also heavily recommend you to specify folder you are fetching and the destination folder like this:\n`hs fetch /templates-folder-in-HubSpot ./  --overwrite`\n\n`./`  = this means the folder where you are with your terminal.\n\nRead more about this from the <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli#fetch|fetch documentation>."
  },
  {
    "poster": {
      "poster_name": "Amitay Soffer",
      "poster_handle": "amitay.soffer"
    },
    "time_stamp": "2021-03-12 09:00:18",
    "text": "Hi <@UJLMJNX6G>, and thank you for your reply!\n\nI did try that, but I can’t see the template in the Blog Pages. How can I add the template there?\n\nThanks a lot"
  },
  {
    "poster": {
      "poster_name": "Sergio Fuentealba",
      "poster_handle": "sergio"
    },
    "time_stamp": "2021-03-12 14:25:09",
    "edited": {
      "time_stamp": "2021-03-12 14:28:15"
    },
    "text": "Hi guys, I need help with my menu. HubSpot made the migration of the web. The original menu was only “hamburger” style and now I need it “traditional horizontal menu” and live the hamburger only for mobile version. Any one now how can I do this? Thanks a lot. I’am sure this is possible by settings and no need any code or not?"
  },
  {
    "poster": {
      "poster_name": "vicki alden",
      "poster_handle": "vicki"
    },
    "time_stamp": "2021-03-12 14:43:39",
    "text": "I'm not sure if this is the right place for this but maybe someone can direct me to the right place/slack channel. I have a developer related issue\n\nI'm trying to use my proxy server to access HubSpot data. we set up our subdomain on HubSpot so that it can access the content directly, but when i set my subdomain to point at my proxy server, and then try to forward the request to HubSpot i get a 403 forbidden.\nso in other words:\n\n1. The content loads when my subdomain DNS CNAME is pointing to HubSpot\n2. It doesn't work when i point my subdomain to my proxy server and then try to forward the request to HubSpot and i get a 403 forbidden.\nWe're using the knowledge base software which doesn't have code injections. the end goal is to just have more control over who sees the content.\n\nany help would be greatly appreciated :pray:",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-03-12 14:49:06"
      },
      {
        "time_stamp": "2021-03-12 14:51:01"
      },
      {
        "time_stamp": "2021-03-12 14:51:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-12 14:49:06",
    "text": "I’m not sure #2 is supported"
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-12 14:51:01",
    "text": "I know you can do this with the CMS / website offering, but that you need CMS Enteprise."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2021-03-12 14:51:14",
    "text": "but I don’t know about the Knowledge base."
  }
]