[
  {
    "poster": {
      "poster_name": "Tom",
      "poster_handle": "tom494"
    },
    "time_stamp": "2021-03-17 02:17:17",
    "text": "Hey <@UD53A9UUR>, that's good news, but how does that work? I use a clientsecret and clientId that was generated through my HubSpot developer account to let our users who want the HubSpot integration in our software authenticate themselves through oauth. That clientsecret and id are bound to expire right?\n\nThe case is this: I have created an \"appstore\" in our software package. Users can \"install\" the HubSpot app, which makes them authenticate to HubSpot using oauth. For testing purposes, i have used the clientid and secret that ive obtained with my developer account, and make a couple of test accounts to implement the oauth flow. How do I obtain a permanent clientId and secret so users can keep using my integration after the developer account expires?"
  },
  {
    "poster": {
      "poster_name": "Mergen Orynbayev",
      "poster_handle": "m.orynbayev"
    },
    "time_stamp": "2021-03-17 04:34:15",
    "text": "Hi, HubSpot developers! I am very new to HubSpot and working at custom template for quotes.\nLooking for a solution to calculate the net price of the line item by three columns. At the moment it’s calculated by quantity x price, but I want to add a third value, like years x quantity x price.\n\nI already know that we can display anything using a custom template.\n\nBut it doesn’t make sense because the quote itself will be stored with existing values and we also want to use quotes as a calculation tool and make it clear for us and for customers.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-03-17 07:29:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-03-17 07:29:19",
    "text": "Hi <@U01RGPC7BCK>, If you are participating in the custom quote template beta I highly encourage joining the custom quote template beta group on the community forums: <https://community.HubSpot.com/t5/Custom-Quote-Template-Beta/gh-p/cpq-beta>\n\nIn it users actively share tips tricks and answer each others questions on this functionality."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-03-17 08:16:20",
    "text": "you will use the access token that will be a parameter in your redirect url to initiate the authentication.  this will get you an access token which will expire in 6 hours.  you will need to refresh that token using the aptly named refresh token.  read more about it <https://developers.HubSpot.com/docs/api/oauth/tokens|here>.\nHere is the <https://developers.HubSpot.com/docs/api/oauth-quickstart-guide|oauth quickstart guide>\nAnd here is the <https://app.HubSpot.com/l/academy/tracks/71/593/2967?_ga=2.220510040.1116083397.1615820588-1273358196.1598626193|HubSpot Academy course> that also might be helpful"
  }
]