[
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2020-04-17 07:56:06",
    "edited": {
      "time_stamp": "2020-04-17 08:00:14"
    },
    "text": "Hi!\nTo make a truly local development workflow, I need to be able to work _without_ HubL locally, but compile / build it in my task runner (or the other way around).\nWe have the following build steps:\n`[local]` We develop with a gulp/webpack setup, so we can utilise ES6,  Sass, browsersync and more, and are able to see what we’re doing as we go along. (we can’t do this with HubL)\n`[testing]` Continuously as we move through a client project, we push  these “static” templates into any test-server, so milestones can be delivered and tested.\n\nWhat I would love to do, is add a third step `[production]`, which essentially utilises HubSpot-cli, and adds that as a step in the workflow, so we can push (also continuously) into HubSpot. But having the HubL rendered.\n\nI can go both ways, adding the HubL -&gt; HTML build, or the opposite perhpas with annotations `&lt;!-- start_dnd_section --&gt;` etc. but I’m not finding any solutions out there for this purpose yet.\n\nDo any of you have any resources, or ways you’re working with this? :raised_hands:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-07 08:17:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Corey Olsen",
      "poster_handle": "corey"
    },
    "time_stamp": "2020-04-17 10:14:11",
    "text": "New HubSpot dev here. I'm taking over for a consulting company that is moving on. I've been a dev for 20 years but never in the CMS arena. I started reading through the documentation and really appreciate the concept of local development. One question I have, is the local development only for templates? Is there a way to bring the entire website down to my local machine? I'm not even sure what the right vocabulary is here but I can see there's a designer tool / ide and using `hs fetch` I can pull those files down. Any way to pull down the actual pages that use the templates and run that locally or even just edit them locally? How do you all develop and test locally before pushing something up for everyone else in the company to start using things? I'm used to having complete accountability for the content of websites I've built but maybe in this world there's a bigger dividing line between developer and content editor?",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-04-17 10:26:44"
      },
      {
        "time_stamp": "2020-04-17 10:47:07"
      },
      {
        "time_stamp": "2020-04-17 11:21:02"
      },
      {
        "time_stamp": "2020-04-17 11:22:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-04-17 10:26:44",
    "text": "You can’t pull down pages themselves via the local editor; those are in the CMS database."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2020-04-17 10:47:07",
    "text": "As long as the site has the cms addon you will be able to use staging in the cms portal."
  },
  {
    "poster": {
      "poster_name": "Corey Olsen",
      "poster_handle": "corey"
    },
    "time_stamp": "2020-04-17 11:21:02",
    "text": "ok, that makes sense. thanks for the clarification."
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-04-17 11:22:33",
    "text": "There was once a local server to run a local version of your site for development purposes, but the CLI and the in-portal staging environment has ended up being a much smoother process"
  }
]