[
  {
    "poster": {
      "poster_name": "Paul Lovell",
      "poster_handle": "paul273"
    },
    "time_stamp": "2024-03-04 14:21:22",
    "text": "Hello Everyone , I an co-founder of Pixel compress a HubSpot app for image compression. I have been an seo for many years and constantly found that image compression in HubSpot was an issue and have had many client spend many hour compressing images. Hence the birth of Pixel Compress , Please do enjoy and I am always here for feedback form the community <https://ecosystem.HubSpot.com/marketplace/apps/marketing/seo/HubSpot-image-compression>"
  },
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2024-03-04 21:42:34",
    "text": "*WOW!  Introducing Alpha X Pro: Elevate Your Website Experience!*\n\n*Exciting news!* Following the phenomenal success of our 'Alpha X' theme, we are thrilled to announce the launch of 'Alpha X Pro' – the ultimate solution for crafting stunning websites with ease!\n\nDesigned to empower businesses of all sizes, 'Alpha X Pro' takes website customization to the next level with its array of robust features and intuitive drag-and-drop modules, now available exclusively on the HubSpot Marketplace.\n\n*What sets 'Alpha X Pro' apart?*\n\n• *Enhanced Robustness*: We've supercharged 'Alpha X Pro' with even more powerful features to help you create a standout online presence.\n• *Intuitive Drag-and-Drop Functionality*: Seamlessly design and customize your website layout with our user-friendly drag-and-drop modules, making web development a breeze.\n• *Unmatched Versatility*: From sleek landing pages to dynamic e-commerce sites, 'Alpha X Pro' offers limitless possibilities to bring your vision to life.\nExplore 'Alpha X Pro' on the HubSpot Marketplace: <https://ecosystem.HubSpot.com/marketplace/website/alpha-x-pro-theme-by-unique-coderz|Alpha X Pro Theme by Unique Coderz>\n\nReady to elevate your website game? Don't miss out on the opportunity to unlock the full potential of your online presence with 'Alpha X Pro'. Get started today!\n\nThanks\nRaman"
  }
]