[
  {
    "poster": {
      "poster_name": "Marek Piorko",
      "poster_handle": "m.piorko"
    },
    "time_stamp": "2020-02-25 08:46:12",
    "text": "Hello there, Friends. My question might be considered naive but I am really trying to make first and second and third steps in HubSpot world. I am currently trying to get certification from HubSpot Academy and I got stuck on practicum excersise. Essentially what I am battling against is creating repeatable group of Photos - each has a small bar underneath with name and position. It should be responsive with 1 Photo on Mobile, 2 on Tablets and 4 on Desktop. Sadly, despite uploading the photos into HubSpot, I cannot make it into fully working repeatable group. What I am doing wrong? Firstly, it seems I cannot have 1 photo and bar with text within one Div, because it extends to below (see the screenshot below)."
  },
  {
    "text": "Here is how it looks like",
    "time_stamp": "2020-02-25 08:47:03",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-02-28 18:23:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marek Piorko",
      "poster_handle": "m.piorko"
    },
    "time_stamp": "2020-02-25 08:47:55",
    "text": "Secondly - My changes are not being saved. I need to upload the photos and change names every time i open this module. I am aware these are rookie questions, but in order to stop being a rookie, I am seeking your help"
  },
  {
    "poster": {
      "poster_name": "Marek Piorko",
      "poster_handle": "m.piorko"
    },
    "time_stamp": "2020-02-25 08:50:23",
    "text": "here is my code"
  },
  {
    "text": "",
    "time_stamp": "2020-02-25 08:51:21"
  },
  {
    "text": "Hello, I would appreciate the help. Im trying to change the button height?",
    "time_stamp": "2020-02-25 09:58:25",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-02-26 06:51:23"
      },
      {
        "time_stamp": "2020-02-26 06:51:52"
      }
    ]
  }
]