[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-08 05:24:53",
    "text": "So what I'm thinking could be going on, is you said you were uploading multiple images through the other server, the hubdb image column only supports 1 image per instance of the column per tire. Even if the other server shows an interface for adding multiple images."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-08 05:27:29",
    "text": "This would explain why you're ending up with corrupt data or broken links in the image field."
  },
  {
    "poster": {
      "poster_name": "Yukta Nigam",
      "poster_handle": "yuktanigam"
    },
    "time_stamp": "2019-04-08 07:45:52",
    "text": "actually I'm not uploading multiple images to a single column per instance...i'm uploading multiple images in multiple columns...even then 1 image per instance of the column per tire. is not rendering"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-08 08:02:08",
    "text": "I only see 1 column for images in your screenshot?\n\nAre the images you are adding actually in the file manager, or are you using the URL function?"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2019-04-08 08:07:57",
    "text": "<@UG52C29EE> any update on this. Not trying to push you just want to know the likelihood of being able to use heading tags in the future… even if i could say not now but within X months we’ll have this option"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2019-04-08 08:14:47",
    "text": "<@U24GZQ3GF> We are considering to implement this but no timeline from our side yet."
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2019-04-08 14:34:27",
    "text": "If we do add this, we will also likely add a limit for the size of the HTML, probably around 50k."
  },
  {
    "poster": {
      "poster_name": "Yukta Nigam",
      "poster_handle": "yuktanigam"
    },
    "time_stamp": "2019-04-08 22:01:55",
    "text": "Nopes, there are more columns for images in this hubdb table...and I'm adding images from file manager directly not the url"
  }
]