[
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2025-01-09 03:32:28",
    "text": "To migrate content from an existing website in HubSpot CMS to a revamped version within HubSpot, you'll need to follow a structured approach to ensure a smooth transition while preserving SEO, design integrity, and functionality. Here are the steps:\n1. *Pre-Migration Planning*\n• *Audit Existing Website*: Review the current website structure, including pages, blog posts, landing pages, emails, forms, and files.\n• *Identify Changes*: List what will be changed in the revamped website, such as updated templates, layouts, or new features.\n• *Backup the Current Website*: Before making any changes, back up the existing content and templates. Export pages, blogs, and media files from HubSpot if possible.\n2. *Set Up the New HubSpot Website*\n• *Create a New HubSpot CMS Instance*: If you’re working in a sandbox or staging environment, set up the new version of your website in HubSpot’s CMS.\n• *Install New Themes or Templates*: Design and implement the new website’s templates, using HubSpot's CMS tools. You can either create custom templates or modify existing ones.\n• *Set Up SEO Structure*: Ensure the URL structure, meta tags, and other SEO elements align with the new design to avoid SEO issues during migration.\n• *Implement New Features*: Add any new features or functionalities that are part of the revamped website.\n3. *Content Migration*\n• *Pages*: Migrate existing pages to the new templates. If the URLs remain the same, HubSpot will handle redirects automatically, but if URLs change, you must create redirects to preserve SEO rankings.\n    ◦ *Manual Content Transfer*: Copy and paste content (text, images, videos, etc.) from the old pages to the new ones.\n    ◦ *Bulk Migration*: If you're migrating a large number of pages, use HubSpot's import tools or APIs to import them in bulk.\n• *Blogs*: Export existing blog posts and import them into the new design. Ensure categories, tags, and authors are preserved during migration.\n    ◦ *Preserve Media*: Ensure that images, videos, and downloadable assets are properly migrated to the new site and linked correctly.\n• *Landing Pages*: If the design or structure changes significantly, rebuild landing pages in the new templates, then transfer the content manually or via import.\n• *Forms and CTAs*: Recreate forms and CTAs in the new website. Ensure any form submissions from the old site are redirected to the new forms.\n4. *SEO Considerations*\n• *301 Redirects*: Set up redirects for any pages that change URLs. This ensures that users and search engines are directed to the right pages.\n• *Meta Data*: Copy meta descriptions, title tags, alt text, and other SEO elements from old pages to the new ones.\n• *Update Sitemap*: Once the new site is set up, update the sitemap and submit it to Google Search Console.\n5. *Testing*\n• *Quality Assurance*: Test the new website thoroughly for broken links, missing content, design inconsistencies, and functionality.\n• *Preview Pages*: Preview all migrated pages to ensure that the content appears correctly in the new templates.\n• *Check Forms and Tracking*: Ensure all forms are working correctly, and the proper tracking codes (e.g., HubSpot tracking code, Google Analytics) are in place.\n6. *Launch the Revamped Website*\n• *Final Review*: Double-check all aspects of the site, including user experience (UX), mobile responsiveness, and page load speed.\n• *Publish the Site*: Once everything is tested, publish the revamped version of the website. Ensure that the domain is pointing to the new HubSpot CMS site.\n• *Monitor Site Post-Launch*: After the launch, monitor the website's performance, SEO rankings, and user interactions.\n7. *Post-Migration Monitoring*\n• *Track Performance*: Use HubSpot Analytics, Google Analytics, and other SEO tools to track the website’s performance, traffic, and search engine rankings post-migration.\n• *Fix Issues*: Address any issues that arise post-launch, such as missing content, broken links, or performance problems.\nBy following these steps, you can ensure that the migration process goes smoothly and the revamped website continues to perform effectively."
  },
  {
    "poster": {
      "poster_name": "walter lentfert",
      "poster_handle": "walter"
    },
    "time_stamp": "2025-01-09 05:36:00",
    "text": "<@U0460KSQ1KL> a new theme typically means handle content differently ie using different modules and apply different styles. with HubSpot APIs you can extract page content and insert it into new modules, using the same, however as Raman is saying you are typically better off manually migrating.. as the page layout is changing typically it is not a 1-1 migration."
  }
]