[
  {
    "text": "<@U048C858Y94> Yes, I am referring to the dark grey on the side. It’s the part of the email body.\n I have marked in the screenshot below-",
    "time_stamp": "2024-12-24 04:43:13"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-12-24 07:17:41",
    "text": "So this is going to be an issue with other code in your email. You’ve done the right thing by setting your image to 100% width. But something else is restricting it’s size. Is this a drag-and-drop email, or a custom template?"
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2024-12-24 07:37:54",
    "text": "<@U048C858Y94> Yes its a drag and drop template but with a custom module for the image.  I created the custom module by adding the CSS code I shared above."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-12-24 07:41:51",
    "text": "Then as far as I'm aware you are out of luck. I'm fairly confident that the code that is creating those margins is not editable in a drag and drop template."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-12-24 07:42:44",
    "text": "I just saw that you are using a drag and drop template. You have no control over dark mode issues like this."
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2024-12-24 09:16:57",
    "text": "<@U048C858Y94> Ohh Ok. What would you suggest in that case? Do we need to create a custom email from scratch by coding?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-12-24 09:27:28",
    "edited": {
      "time_stamp": "2024-12-24 09:27:43"
    },
    "text": "In my opinion, the amount of effort required to fix this issue by creating a custom email template far outweighs what you’re actually gaining. Most issues inherent with using drag-and-drop emails are a much bigger deal than what you’re experiencing. If it were me I would just leave it as is and move on."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-12-24 09:28:33",
    "text": "And also, for what it’s worth, subjectively I think this looks great and I think that if the gray margins were missing that it would look worse. :shrug:"
  }
]