[
  {
    "poster": {
      "poster_name": "Muhammad Ammar",
      "poster_handle": "malik.ammar"
    },
    "time_stamp": "2024-09-19 01:49:43",
    "text": "Hello\ni create a developer account and then created a test account, now i am trying to install the app to perform the cti operation but before installing the app we have to authorize our app with oauth method, can anyone please tell me how i can do this oauth process?  i also look into this <https://developers.HubSpot.com/beta-docs/guides/apps/authentication/working-with-oauth> link but i am unable to perform oauth. please help me how i can do this?"
  },
  {
    "poster": {
      "poster_name": "Pratik Bhatt",
      "poster_handle": "pratik095"
    },
    "time_stamp": "2024-09-19 03:55:30",
    "text": "Hello\n\nI need help to fire third party js call on below action on chat can anyone help me here?\nchatbot_opened\nsend_message\n\nfile_attached\n\nchatbot_closed\n\nemail_submit_in_chatbot\n\nlink_clicked_in_chatbo"
  },
  {
    "poster": {
      "poster_name": "Samuel Ballesteros",
      "poster_handle": "sballesteros"
    },
    "time_stamp": "2024-09-19 13:15:52",
    "text": "Hello everybody, does someone has the same error when trying to create a from using the Form API?\n\n*Lifecycle stage provided were not valid*\n\nIm sending this value as suggested by the documentation:\n\n`lifecycleStages: [`\n        `{`\n          `\"objectTypeId\": \"0-1\",`\n          `\"value\": \"lead\"`\n        `}`\n`]`"
  },
  {
    "poster": {
      "poster_name": "Nick Gehring",
      "poster_handle": "ngehring"
    },
    "time_stamp": "2024-09-19 14:00:15",
    "text": "Hello. I am trying to remove/archive some third-party installed properties from third-party apps we've uninstalled. It would seem this is not possible? I understand why core HubSpot properties would be protected, but why other types?"
  },
  {
    "text": "Hello. i make a developer account and test account, now i want to run my app in softphone, so how i can run my app on sofphone? and other question is in the top navigation bar there is a telephone and that icon is locked. how that phone is open? and is that phone icon is open, should i run third party app in that phone?",
    "time_stamp": "2024-09-19 23:44:11"
  }
]