[
  {
    "poster": {
      "poster_name": "Mohammad Wahid",
      "poster_handle": "mwahid.eng"
    },
    "time_stamp": "2023-01-26 05:34:36",
    "text": "*How can I integrate REST API with my product?*\nHello, I want to know the actual process to send an email to a contact list. From the legacy documentation I understand that, I can create marketing email using the API but the email stays as draft. Is it directly sendable to contact list? Or do I have to use single-send-api for sending the drafted email? Maybe for using the single-send-api, I need transactional-email permission. But I faced the following issue when I went for the permission.\n1. Private App: Scope (transactional-email) is unavailable for this account. (I have super admin permission).\n2. OAuth 2.0: This account doesn’t have access to some HubSpot features that are required by this app. Please contact the app developer. (without transactional-email feature, it works).\nAnyone has solution? Thank you!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-01-26 07:30:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-01-26 07:30:58",
    "text": "<https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1674736433692109>"
  },
  {
    "poster": {
      "poster_name": "Vijay Vadlamani",
      "poster_handle": "vvadlamani"
    },
    "time_stamp": "2023-01-26 11:45:24",
    "text": "Hey folks - I'm on the product team at HubSpot. Trying to get in touch with customers /partners / developers who have embedded HubSpot chat widget inside a mobile app (as a workaround for mobile chat SDK). Anyone here tried it and is willing to hop on a quick chat?",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-18 22:49:02"
      },
      {
        "time_stamp": "2023-09-19 07:59:37"
      },
      {
        "time_stamp": "2023-09-22 01:21:15"
      },
      {
        "time_stamp": "2023-09-26 18:59:29"
      },
      {
        "time_stamp": "2023-09-27 00:54:54"
      },
      {
        "time_stamp": "2023-10-05 06:56:16"
      },
      {
        "time_stamp": "2023-10-05 07:02:04"
      },
      {
        "time_stamp": "2023-10-05 07:02:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Steve Werner",
      "poster_handle": "steve682"
    },
    "time_stamp": "2023-01-26 13:49:43",
    "text": "Hi everyone. I'm trying to get some help with embedded forms. Is this a good place to ask?"
  },
  {
    "poster": {
      "poster_name": "Steve Werner",
      "poster_handle": "steve682"
    },
    "time_stamp": "2023-01-26 13:56:01",
    "text": "We're using an embedded HubSpot form on our website. This is not a Wordpress site. There is an explicit height set on the iframe. After the form is submitted, and the 'success' message is displayed, the height of the iframe does not change, so there is a huge blank spot in the middle of our web page. It looks terrible. Is this standard behavior with embedded HubSpot forms? If so can anyone recommend a method I can use to change the height upon submission?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-01-26 15:34:20"
      },
      {
        "time_stamp": "2023-01-26 16:20:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-01-26 15:34:20",
    "text": "Keeping the size of embedded iframes fixed is a pretty standard practice. Resizing an iframe is super expensive from a performance standpoint, as it triggers layout rendering on the external page AND the page inside of the frame.\n\nIf you’d like more control over the formatting and styling of the form, you could turn on the *“Set as raw HTML form”* option in the *Style &amp; Preview* tab of the form configurator. As the name implies, this will embed the form directly on to your page, rather than containing it within an iframe.\n\nThe downside of this is that it means you won’t get any of the HubSpot-provided styling. However, it _does_ mean that you get direct access to the form’s markup; this allows you to make any adjustment you’d like using CSS and Javascript — including attaching animations or restyle events to the submit button."
  },
  {
    "poster": {
      "poster_name": "Steve Werner",
      "poster_handle": "steve682"
    },
    "time_stamp": "2023-01-26 16:20:30",
    "text": "Okay, thanks."
  },
  {
    "poster": {
      "poster_name": "Arno Rinker",
      "poster_handle": "arinker"
    },
    "time_stamp": "2023-01-26 23:32:05",
    "text": "To all those who need to comply with *GDPR* and *embed 3rd party content in webpages*.\n\nPlease support the following idea: *<https://community.HubSpot.com/t5/HubSpot-Ideas/Cookie-consent-banner-API-Possibility-to-set-consent-status-by/idi-p/746725|Cookie consent banner API - Possibility to set consent status by category via JavaScript>*",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-01-27 09:23:06"
      },
      {
        "time_stamp": "2023-02-14 13:09:28"
      }
    ]
  }
]