[
  {
    "poster": {
      "poster_name": "Ken a",
      "poster_handle": "ken854"
    },
    "time_stamp": "2023-01-20 05:53:03",
    "edited": {
      "time_stamp": "2023-01-20 05:59:10"
    },
    "text": "Hi I was sent here by HubSpot help as they didnt seem to have any information. I have various dev accounts to test my app integration. Some are for manual tests and others are for integration tests which i dont want to mess about with. I recently got an email for all of my dev accounts saying:\n\n\"Your HubSpot plan has changed and doesn't allow primary Email, Knowledge base HubSpot (system) domains, so you'll need to head to Domains &amp; URLs within 89 days to remove them. Or, if you do nothing, on Apr 19, 2023 we'll automatically remove them.\"\n\nproblem is that I cant really understand what it wants me to do as I do not have any domains registered on these accounts...\nI might just be misunderstanding what it wants me to do so please clarify if you have any ideas.\n\nThanks in advance - also apologies if this isnt the right place to be posting this.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-01-20 11:31:35"
      },
      {
        "time_stamp": "2023-01-21 14:01:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sabir Buxsoo",
      "poster_handle": "sabir"
    },
    "time_stamp": "2023-01-20 06:57:05",
    "text": "Hi <@U03AKL6Q1B2> Thanks for those docs. They are a massive help! Cheers!"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-01-20 08:05:55",
    "text": "We'd love to see more technical community meetups. If you've ever been interested in hosting a HubSpot meetup, check out this event coming up next week! <https://events.HubSpot.com/events/details/HubSpot-HubSpot-global-presents-how-to-become-a-hug-leader-HubSpot-user-group-ama-with-kyle-jepson/>"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-01-20 11:31:35",
    "text": "I recently received a similar e-mail as well. I _believe_ this gets sent when one of your test accounts hasn’t been active for 90 days."
  }
]