[
  {
    "poster": {
      "poster_name": "Mohammad Wahid",
      "poster_handle": "mwahid.eng"
    },
    "time_stamp": "2023-01-28 03:08:05",
    "text": "Good morning team!\nI am posting here on behalf of our company named Newsletter Glue. We have a newsletter plugin which has already integrated many popular email service providers like Mailchimp, MailerLite, AWeber etc. Our customer install the plugin in their WordPress website and connect with their email service providers. Our plugin offer lots of features like customer can collect their subscribers using our plugin, they can write article in their website but it will be automatically converted in custom email then they can broadcast it to their lists/segments of subscribers. Everything is working using REST API of email service provider. As we have seen HubSpot is most popular and useful in this era, we want to integrate the HubSpot in our system too and we believe that will be more helpful for HubSpot customers. In the mean time, after doing some R&amp;D on HubSpot's API documentation, I could not find any email broadcasting API that sends custom email to a group of contacts. Do you have this type of API already exist or have any plan to create in future? Please let me know. Thank you.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-01-28 08:27:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mohammed Sidhpura",
      "poster_handle": "sidhpuram.oappsit"
    },
    "time_stamp": "2023-01-28 06:02:38",
    "text": "Hello Everyone,\nWhy HubSpot is adding an embedded javascript file in &lt;head&gt; ?\nIt was decreasing my theme performance.\nThe embedded javascript files like banner.js, conversations-embed.js, fb.js, etc.\nIs there any solution to add all these javascript in footer ?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-01-28 08:21:40"
      },
      {
        "time_stamp": "2023-01-29 14:44:49"
      },
      {
        "time_stamp": "2023-01-29 16:05:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-01-28 08:21:40",
    "text": "Did you try deferring /asyncthe javascript? or does it need to be to loaded in on page load"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-01-28 08:27:03",
    "text": "<https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1674898459658659>"
  }
]