[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2022-12-13 02:31:17",
    "edited": {
      "time_stamp": "2022-12-13 02:37:04"
    },
    "text": "Looking back to this year, which was pretty tough mentally and physically, I’d like to say a big thank you. No, GIGANTIC thank you! To the HubSpot community and especially the HubSpot team.\n\nGrateful for your constant support for <@UN7CEHC9X> and me during these dark times. Your kindness was one of those beams of light that helped us keep carrying on. Every opportunity you gave us kept the hope for a better future alive.\n\nThank you <@U2H3TT8F2> <@UD53A9UUR> <@U02094DEMTK> <@U7SL518D6>\nSorry for being slow with replies and overall communication. I wish I could contribute more to the community as I was planning back in January. Despite that, you still were there.\n\nThank you to the most amazing community :orange_heart: :thanku:",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-12-13 02:43:53"
      },
      {
        "time_stamp": "2022-12-13 05:46:32"
      },
      {
        "time_stamp": "2022-12-13 07:03:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Roman Kozak",
      "poster_handle": "roman.gruit"
    },
    "time_stamp": "2022-12-13 02:43:53",
    "text": "I am also thankful to the HubSpot community, the HubSpot team, and the amazing people I’ve had the pleasure of working with and getting to know. You have all been a source of inspiration and have given me the strength and motivation to keep going during a challenging year. I would also add to the list <@U0310AHEKMY> who has been incredibly supportive and encouraging.\n\nAnd lastly, I would like to thank <@UMZFZHVUJ> for being such an incredible friend and partner."
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-12-13 05:46:32",
    "text": "You are both an inspiration.  Thank you!!"
  },
  {
    "poster": {
      "poster_name": "Chris Riley",
      "poster_handle": "criley"
    },
    "time_stamp": "2022-12-13 07:03:41",
    "text": "What an awesome message to wake up to you two! Thank you"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-12-13 14:07:37",
    "edited": {
      "time_stamp": "2022-12-13 14:07:55"
    },
    "text": "To the HS team who saved me today… THANK YOU"
  }
]