[
  {
    "poster": {
      "poster_name": "Sebastian Scholten",
      "poster_handle": "scholten.seb"
    },
    "time_stamp": "2023-09-27 02:07:08",
    "text": "Hello\n\nI am fairly new to the HubSpot extension sdk. I am trying to build a custom card but getting the following error on the console when I use \"propertiesToSend\" in runServerless()\n\nThis only happens when using local development. If I run hs project upload, the serverless function work 100%. When testing the serverless function with hs project dev, it errors about missing scope\n\nError: Cannot fetch context object properties: StatusCodeError: 403 - {\"status\":\"error\",\"message\":\"This app hasn't been granted all required scopes to make this call. Read more about required scopes here: <https://developers.HubSpot.com/scopes>.\",\"correlationId\":\"33afdde9-efb2-4313-9b20-cc8b26f9b20e\",\"errors\":[{\"message\":\"One or more of the following scopes are required.\",\"context\":{\"requiredGranularScopes\":[\"crm.schemas.contacts.read\",\"crm.objects.contacts.read\"]}}],\"links\":{\"scopes\":\"<https://developers.HubSpot.com/scopes>\"},\"category\":\"MISSING_SCOPES\"}",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-09-27 02:08:02"
      },
      {
        "time_stamp": "2023-09-27 08:56:55"
      },
      {
        "time_stamp": "2023-09-27 17:59:44"
      },
      {
        "time_stamp": "2024-12-03 07:44:30"
      },
      {
        "time_stamp": "2024-12-24 11:49:44"
      },
      {
        "time_stamp": "2024-12-29 16:02:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sebastian Scholten",
      "poster_handle": "scholten.seb"
    },
    "time_stamp": "2023-09-27 02:08:02",
    "text": "I do have the following scopes configured in app.json\n```\"scopes\": [\n    \"crm.objects.contacts.read\",\n    \"crm.objects.contacts.write\",\n    \"crm.objects.deals.read\",\n    \"crm.objects.deals.write\",\n    \"crm.schemas.contacts.read\"\n  ],```"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-09-27 08:54:37",
    "text": "Hi Kellen, I'm confirming that we dont' yet support multiple apps in projects, and I am going to get the docs sorted. Thank you for bringing it up, and apologies that you had to go through the confusion.\n\nHowever, it looks like you are trying to add multiple cards to a project. If that is the case, you can do that without adding multiple apps."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-09-27 08:56:55",
    "text": "Hi <@U05TP3X5SLX> this missing scopes error is for your personal access token, and not the app itself. Can you deactivate and re-generate the personal access token and try again?"
  },
  {
    "poster": {
      "poster_name": "Kellen Rogers",
      "poster_handle": "kellenr"
    },
    "time_stamp": "2023-09-27 09:21:46",
    "edited": {
      "time_stamp": "2023-09-27 09:22:08"
    },
    "text": "Hello Sejel, thank you for confirming this and I appreciate you guys hopping on it quickly.\n\nWe have definitely been taking advantage of the multiple cards feature. It has been super helpful and saved use from having 10 different projects.\n\nMy goal was to setup a single project such that all the tooling was already in place for other DEVs to easily add a new private app that pulls in packages from within our monorep.\n\nWe have built out some additional tooling that pulls down all the object schema and associations from a HubSpot portal and creates TypeScript types for all the objects, as well as helpful mappings for easily getting the associationTypeId given two objects (and possibly a label). We ran into issues switching between a DEV sandbox and our production portal that this really helped solve.\n\nI should be able to do the same setup with multiple projects instead of multiple apps, it will just be one more level of nesting in our monorepo.\n\nThank you for the help!"
  },
  {
    "poster": {
      "poster_name": "Michael Mitchell",
      "poster_handle": "michael.mitchell"
    },
    "time_stamp": "2023-09-27 10:36:31",
    "edited": {
      "time_stamp": "2023-09-27 10:37:39"
    },
    "text": "I fetched my HubSpot theme using the terminal in VS Code.  I added a new folder in the theme that includes a library I want to use.  When I use the npx hs upload command and target the folder, it uploaded it an the 1 file that was in it, but it did not upload the subfolder and the files in it.  Is there an something that I need to add to the command to make it upload everything in the folder?  In this case I used npx hs upload theme_name/folder-name theme_name/folder-name",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-09-29 15:25:57"
      },
      {
        "time_stamp": "2023-10-02 13:12:00"
      }
    ]
  },
  {
    "time_stamp": "2023-09-27 13:00:01",
    "text": "Reminder: Don’t forget to keep your HubSpot CLI up to date to ensure you have the latest CLI features, bug/usability fixes and performance improvements. • <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli#upgrade|How to upgrade your CLI to the latest version>."
  },
  {
    "poster": {
      "poster_name": "Sebastian Scholten",
      "poster_handle": "scholten.seb"
    },
    "time_stamp": "2023-09-27 17:59:44",
    "text": "<@U03FJQPSC0Y> That worked. Thank you very much!"
  }
]