[
  {
    "poster": {
      "poster_name": "maxime ferret",
      "poster_handle": "m.13ferret"
    },
    "time_stamp": "2024-03-15 04:44:53",
    "text": "Hi there :wave:\n\nIs it possible to install a report template with my app package?\nI'd like to present the performance of my app based on custom properties I've created and other natives (and not having every single user to create one on their side).\n\n\nI've checked all around and couldn't find the answer",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-15 10:32:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Wilson Akira",
      "poster_handle": "wilson.akira"
    },
    "time_stamp": "2024-03-15 04:54:42",
    "text": "<@U05R380MLMC> do you say about the module? Yes we do"
  },
  {
    "poster": {
      "poster_name": "Ana Godoi",
      "poster_handle": "ana.godoi"
    },
    "time_stamp": "2024-03-15 06:34:22",
    "text": "<@U06PNAHJWDQ>"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 07:11:26",
    "text": "Can you share a few screenshots of the ticket creation workflow, the step that creates the ticket, a screenshot of the newly closed deal, the newly created ticket, the associated contact which has more than 1 company association, and the associated company to the deal?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 07:12:13",
    "text": "I want to make sure I understand the problem before recommending a path forward"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 07:12:36",
    "text": "Redact anything you don't want or send as dm"
  },
  {
    "text": "<@U05R380MLMC> thank´s a lot for help us\n\n4 first screenshoots\n• Deal and company association\n• Ticket created with corret deal association and principal company (and contact)\n• Ticket association\n",
    "time_stamp": "2024-03-15 08:10:36"
  },
  {
    "text": "This ticket was created by workflow. Is in portuguese, if you need some extra information...",
    "time_stamp": "2024-03-15 08:12:41"
  },
  {
    "text": "",
    "time_stamp": "2024-03-15 08:12:52"
  },
  {
    "text": "And last, contact and associated company",
    "time_stamp": "2024-03-15 08:15:34"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 08:36:55",
    "text": "Ok.  Reviewing now."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 08:46:47",
    "text": "Can you confirm that the \"deal\" record has an associated contact as well?"
  },
  {
    "poster": {
      "poster_name": "Wilson Akira",
      "poster_handle": "wilson.akira"
    },
    "time_stamp": "2024-03-15 09:01:22",
    "text": "just complementing...this scenario above was created manually.\nWe also have a scenario for creating tickets automatically via API by another system, in which after creating the ticket, we associate it with a company and a contact. We noticed that when a contact is associated with more than one company, this ticket automatically ends up taking more associated companies.\n\nHowever, the question is that a contact sometimes has 10 associated companies and in this creation it only took 2 companies, we did not find the pattern as to why this happens. If suddenly every object should have an association like \"primary\""
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 09:01:26",
    "edited": {
      "time_stamp": "2024-03-15 09:35:08"
    },
    "text": "____\n\nFrom what I can tell, the workflow is associating the contact from the deal correctly but when the task is created, you did not select \"Empresas associados ao negovio inscrito\"\n\nHere is my theory....\n\nThe ticket gets created and associated to the correct contact but HubSpot will try to pull in additional context automatically (like associated company) and since the contact has a primary company association (this is important because the contact has 15 associationed companies) the default will be the primary company of the contact.\n\nMy suggestion....\n\nCheck the box \"Empresas associados ao negocio inscrito\" in addition to \"Contatos associados ao negocio inscrito\"\n___\n\nI'm not sire if this will then create two associations on the ticket but worth trying to see if this will overwrite the default behavior when the ticket gets created."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 09:05:47",
    "text": "___\n<@U04CY7LLMQE>\n\nThanks for this information.\n\nIf creating tickets via API - are you then \"manually associating\" to the contact/company?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 09:07:00",
    "text": "Are you trying to solve for both scenarios a.) Workflow ticket creation on deal close and b.) Ticket creation via API?"
  },
  {
    "poster": {
      "poster_name": "Wilson Akira",
      "poster_handle": "wilson.akira"
    },
    "time_stamp": "2024-03-15 10:04:34",
    "text": "<@U05R380MLMC>\nNo manually, they are all via API, so there are 3 endpoint calls, one for creation, one for contact association and one for company association\n\n\nabout this:\n`Are you trying to solve for both scenarios`\n\nYes, we are trying to solve the same problem where the Hub appears to be automatically associating more companies than it should"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-03-15 10:32:59",
    "text": "Supered app allows reports and dashboards to be copied from one account to another, if they can create them I imagine it'd be possible for your app to do it...?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 10:53:58",
    "text": "You should be able to create the ticket and define the associations in a single call as opposed to create then update.  My assumption is that HubSpot defaults are being applied first."
  },
  {
    "text": "",
    "time_stamp": "2024-03-15 10:54:27"
  },
  {
    "poster": {
      "poster_name": "Wilson Akira",
      "poster_handle": "wilson.akira"
    },
    "time_stamp": "2024-03-15 14:19:57",
    "text": "We tried that way too, but we still faced problems so we separated, that way we had fewer problems, but it still didn't happen"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-03-15 14:22:34",
    "text": "Ok - It's difficult to really know what the core of the issue is without spending dedicated time to review what's in place and determine root cause.  If you would like for me to help with this further, send me a DM and we can explore ways to work together."
  },
  {
    "poster": {
      "poster_name": "Shani Shoham",
      "poster_handle": "shani.shoham"
    },
    "time_stamp": "2024-03-15 17:24:01",
    "text": "Hi there:wave:,\n\nWe have a marketing site that funnels traffic to a registration page on our webapp. Users can register using Google or Github Oauth. Two questions:\n1. How can we ensure end-to-end traceability given that the conversion is done using Oauth? \n2. For the meantime we keep originating UTM in a cookie that we manage. Is there a HubSpot contact field that we can update to manage attribution and properly measure the ROI on HubSpot campaigns.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-18 10:52:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Emily Kersey",
      "poster_handle": "emily.kersey"
    },
    "time_stamp": "2024-03-15 17:41:01",
    "edited": {
      "time_stamp": "2024-03-15 17:42:22"
    },
    "text": "Hi! I'm using OneTrust to place a cookie banner on my HubSpot landing pages. Since the HubSpot embed code is automatically added to the landing pages, I need to block tracking when users opt-out of targeting or performance cookies. I used the following code to add in the __hs_do_not_track cookie but I still see cookies added. Are the cookies being dropped but it's not being tracked? How do I verify that it is actually not tracking? See screenshot in reply. Thank you!\n\n  _hsq.push(['doNotTrack']);",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-15 17:42:45"
      },
      {
        "time_stamp": "2024-07-29 09:51:41"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-03-15 17:42:45"
  }
]