[
  {
    "poster": {
      "poster_name": "Jessica Strachan",
      "poster_handle": "jstrachan"
    },
    "time_stamp": "2024-03-20 05:22:20",
    "text": "Hello, I hope this is the right channel. I’m a front-end developer, VERY new to HubSpot and have inherited a site built by another dev (one I can’t contact).\nI’m having trouble using the Search Assets field. I will search for class names, or mark up that I can literally see in an open file, yet no results are returned.\n\nEssentially, I just want to be able to search a project the same way I would search all files in an IDE like VS Code for example. I’m finding it extremely hard to navigate code written by someone else right now!\nDo I have the wrong expectation of the search functionality and if so what are those search parameters?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-20 05:31:27"
      },
      {
        "time_stamp": "2024-03-22 05:50:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jessica Strachan",
      "poster_handle": "jstrachan"
    },
    "time_stamp": "2024-03-20 05:31:27",
    "text": "I have a feeling it searches file names only and not any code within those files. Which feels quite restrictive"
  },
  {
    "poster": {
      "poster_name": "Adriano dos Santos Ribeiro",
      "poster_handle": "adriano.ribeiro"
    },
    "time_stamp": "2024-03-20 10:33:42",
    "text": "Hi!\n\nI need you help guys to unsdertand some behaviour from webhook event interface from HubSpot. I'h implement few data extraction workflows to objects like: deal. This workflow have some rules for triggering.\n\nDeal object receives updates to specific properties in high frequency from multiple workflows, We noticed that not all event changes triggered published to the webhook. Seems that the HubSpot have some kind of \"transaction lock\" that publish new object version to webhook between these changes. For example:\n\n• I have a deal 12\n    ◦ with property my_company_workers=12 and my_ticket_counting=10\n• some body update a company associated to that deal and update the property this way my_company_workers=13\n• but the deal it's already concurrently been updated for another ticket workflow and updating my_ticket_counting=10\nIn this scenario do we receive and event with my_ticket_counting=10 and the old my_company_workers=12 value. We do never receive the my_company_workers=13 update.\n\nIs this related to high frequency cross workflows object?\n\nHopes i'm clear enough :sweat_smile:\n\nthank you for any help"
  }
]