[
  {
    "poster": {
      "poster_name": "Martin Hlavacka",
      "poster_handle": "mhl"
    },
    "time_stamp": "2022-06-06 02:21:58",
    "edited": {
      "time_stamp": "2022-06-06 04:08:27"
    },
    "text": "Hi everyone, I am just starting with Marketplace apps now, here is how I understand it so far - is that correct?\n\n1. Create an app - just fill out the form\n2. Give it a redirect URL\n3. Save the app and install it on any account\n4. On the redirect page, you get a \"code\" parameter\n5. This can be used to generate an *access_token* as *refresh_token*\n    a. <https://developers.HubSpot.com/docs/api/oauth/tokens|https://developers.HubSpot.com/docs/api/oauth/tokens>\n6. Access token can make API calls, refresh token can generate new access tokens when they expire\n7. I am supposed to save both access and refresh tokens in database (external), located where my redirect page is\n8. I can then make any changes via API calls (limited by an access scope of API key)\n9. I can create a settings pages for an app and see log for changes\n10. These settings can be obtained in external app and they can be used to conditionally execute any remote code\n    a. *Question:* How can I access these settings?\n11. I am not storing any code on the HubSpot's servers at all - all the \"Apps\" do is that they ask user if they want me to have an access to their account and share the API keys with me. \n    a. *Question:* Correct?\n12. *Question:* How should I understand webhooks in this context? Are they perhaps used to send data to my remote app? To \"notify\" it that something in watched objects has just changed, meaning that there might be a need for some update to be done via this external system, too?\n    a. <https://developers.HubSpot.com/docs/api/webhooks|https://developers.HubSpot.com/docs/api/webhooks>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-23 08:15:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kumar B",
      "poster_handle": "kumar.b"
    },
    "time_stamp": "2022-06-06 02:56:54",
    "text": "hello"
  },
  {
    "poster": {
      "poster_name": "Kumar B",
      "poster_handle": "kumar.b"
    },
    "time_stamp": "2022-06-06 02:56:56",
    "text": "i need build HubSpot app for message and calling between HubSpot and my own app"
  },
  {
    "poster": {
      "poster_name": "Kumar B",
      "poster_handle": "kumar.b"
    },
    "time_stamp": "2022-06-06 04:00:42",
    "text": "??"
  }
]