[
  {
    "text": "Awesome stuff coming soon...",
    "time_stamp": "2023-04-28 10:08:30",
    "edited": {
      "time_stamp": "2023-04-28 13:53:34"
    }
  },
  {
    "poster": {
      "poster_name": "Erlend Mongstad",
      "poster_handle": "erlend.mongstad"
    },
    "time_stamp": "2023-04-28 16:25:47",
    "text": "Hi all! Just a quick question. I want to make custom workflow actions, wrapped in a function that I can manage locally (together with other crm ui extensions) and deploy to our HS instance. Is that even possible with the HubSpot cli/crm development beta?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-28 20:38:38"
      },
      {
        "time_stamp": "2023-04-28 20:39:21"
      },
      {
        "time_stamp": "2023-04-29 00:26:50"
      },
      {
        "time_stamp": "2023-04-29 07:30:35"
      },
      {
        "time_stamp": "2023-04-29 11:34:45"
      },
      {
        "time_stamp": "2023-04-29 14:51:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-28 20:38:38",
    "text": "Currently workflow actions are only supported through public apps (marketplace apps) and also can't trigger a project function (unless you make that function the endpoint for the action, of course (although a CMS function would be the recommend course of action for this type of thing)) but this is something the team has mentioned thinking about implementing in the future"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-28 20:39:21",
    "text": "also keep in mind that just because it's called a public app that doesn't actually mean it's public facing or hosted in the marketplace you can have it only installed on one portal and not host it in the marketplace"
  },
  {
    "poster": {
      "poster_name": "Erlend Mongstad",
      "poster_handle": "erlend.mongstad"
    },
    "time_stamp": "2023-04-29 00:26:50",
    "edited": {
      "time_stamp": "2023-04-29 00:27:04"
    },
    "text": "Ok, thanks for clarifying! I guess what I need then is to figure out how a minimum «public app» that can trigger static workflow actions can look like then. I have several «custom code» actions now that I just need to get under source control. I guess there are better ways than copy/paste from my repo into the workflows manually :sweat_smile: "
  }
]