[
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-04-25 10:56:03",
    "text": "Hi all, quick announcement and CTA for anyone in the beta who's using the CLI to interact with Development Sandboxes.\n\n*On May 8th*, we’ll be making an update that requires users of development sandboxes to *re-generate their personal access key in their production account and their existing development sandboxes*.\n\nMore details in the :thread:",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-04-25 10:56:21"
      },
      {
        "time_stamp": "2023-04-25 10:56:36"
      },
      {
        "time_stamp": "2023-04-25 10:57:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-04-25 10:56:21",
    "text": "*What to expect?*\n\nOnce we implement these updates some users may:\n• Encounter errors when attempting to run a resync of crm object definitions from their production account to their development sandbox.\n• Miss some developer scopes. \n"
  },
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-04-25 10:56:36",
    "text": "*What to do?*\n\nIf you're one of the users who encounter an error, we recommend that you go through the following steps to remediate this:\n\n1. Deactivate your current personal access key in your production account. \n2. Re-generate your new personal access key in your production account.\n3. Run &lt;hs auth&gt; to update your CLI with your new personal access key. \n4. Repeat steps 1 to 3 in your existing Development Sandbox.\n"
  },
  {
    "poster": {
      "poster_name": "Denise Thijzen",
      "poster_handle": "dthijzen"
    },
    "time_stamp": "2023-04-25 10:57:53",
    "text": "Please note that after deactivating and re-generating your new personal access key, there may be a slight delay in seeing the CRM Development Navigation tab in your Development Sandbox. This should be resolved after a few minutes.\n\nIf you run into any issues, please feel free to nudge us on this thread.\nWe're also always open to speak to anyone who has any feedback related to Development Sandboxes, so just let me know directly :slightly_smiling_face:\n\nThank you!"
  }
]