[
  {
    "poster": {
      "poster_name": "Daniel Lemesh",
      "poster_handle": "daniel392"
    },
    "time_stamp": "2022-09-01 05:38:06",
    "text": "Hi,\nquestion regarding the *Conversations SDK:*\nI don’t want the chat widget to appear regularly.\nI have a button that toggles the widget’s visibility, I did it with css and not with `window.HubSpotConversations.widget.remove()` because I want the user to be able to show/hide the widget without loosing it’s data (the widget data, messages etc).\nthe problem is that sometimes when I refresh the page, the widget is loaded and shown, even though I set `loadImmediately: false` under the settings object.\n\nI found that `window.HubSpotConversations.widget.status().pending` is `true` *SOMETIMES* after I refresh and the widget is visible.\nso I’m using this condition to hide it, *BUT* it’s not bullet-proof :disappointed:\n\nanyone can help?\nthanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-02 21:24:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kyle Arrington",
      "poster_handle": "kyle.arrington"
    },
    "time_stamp": "2022-09-01 09:07:02",
    "edited": {
      "time_stamp": "2022-09-01 09:10:10"
    },
    "text": "Hi Folks. I'm currently trying to wrap my head around using JS Frameworks in CMS Hub. I think I understand at this point that each module essentially operates with its own webpack bundle, and is its own self-contained app. So I have 2 questions:\n\n1. Our current website has a number of smaller interactive widgets that are shared across otherwise basic content pages. Do each of those widgets have to exist as a separate app/bundle. I worry I'm going to end up with a bloated dist directory/webpack config file. \n2. How possible is it to share state between these modules? For example, if I built a custom Navbar in react as a module with a cart component, and a module with an \"Add to Cart\" button, could I use something like Redux to communicate from the Add-to-Cart module to the Navbar module that an item had been added? Basically I'd want the cart icon on the navbar to have a counter that kept track of how many items were currently in the cart. Is that possible given the modules have no connection to each other? "
  }
]