[
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2022-04-07 06:27:17",
    "text": "I know this is like three years old now, but can I double click on this. I can add a second selector to the generic layout.css classes to have any grid layout I want even if it's 16 columns instead of 12? "
  },
  {
    "text": "Anyone known with this issue while connecting a private app? With a public app we don’t have this issue..",
    "time_stamp": "2022-04-07 07:22:35",
    "edited": {
      "time_stamp": "2022-04-07 07:32:19"
    }
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-04-07 07:46:59",
    "text": "There are a few different ways what you’re saying can be interpreted.\n\nSo I apologize for this vague answer, it just covers each of the different ways I can see that question to mean.\n\nIf you can do it in CSS, yes, you can do that. You control that file.\n\nBe aware though the page editor will not suddenly start allowing you to drag and drop items on a 16 column grid. It will still generate the same class names, you can’t control the class names generated, only the CSS that actually does something with the class names. You can also wrap the elements at the template level with a class so you can target the inner elements for styling.\n\nSo you certainly could use a 16 column grid in your modules, and templates, it’s just that the dnd area portion itself would be based on 12 columns."
  },
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2022-04-07 07:57:06",
    "text": "Yeh, that's what I'm doing now, but it would be nice to cut out some of that excess code."
  },
  {
    "poster": {
      "poster_name": "Rachel Gatlin",
      "poster_handle": "rachel904"
    },
    "time_stamp": "2022-04-07 12:11:13",
    "text": "Hello! I’m pretty sure this is possible but I am stumped on how to do it. I have a boolean field to show a link in the code, only if the boolean is toggled. I want to also show/hide the editable module if the boolean is toggled. I think its in the “display conditions” but I’m not 100% sure."
  }
]