[
  {
    "poster": {
      "poster_name": "Willy Hernandez",
      "poster_handle": "willy"
    },
    "time_stamp": "2024-08-27 15:56:58",
    "text": "@channel HS Developers and friends! Hiya :smile:\n\nI'm excited to share the launch of our company, <http://withampersand.com|Ampersand>! This is a revolutionary way of creating _*Native Product integrations*_, managing them, and making sure we're closer to your customers.\n\nHere's the TL;DR on Ampersand's offering for SaaS companies:\n\n• :arrow_double_down: *Deep, native product integrations*: this is a huge need for products that need to go into the 4 standard objects (contacts, company, deals, &amp; tickets) and additional objects that HubSpot has or maybe something custom in your customers CRM/MAP/Sales Enablement/etc. tools.\n• :books: *Vast library of over 100+ apps in the GTM stack:* breadth is also very important to consider. There are hundreds of applications and the ability to go wide is crucial to keep up with your competition, or keep close to your customer. Our GTM library is, carefully curated and ever-growing. If there’s an app, you’re curious about let us know.\n• :globe_with_meridians: *Open source (MIT license):* see an app that you wanna work in? Well, you'll be able to see how we've made it work and if you have ideas on how to make it better you certainly are able to! Our founding team is all about the community and we believe that the best way and making amazing connectors is by source in these ideas from what's out there in real use cases\n• :moneybag:*Pricing:* No BS, simple pricing. You pay for what you use and if you like what you use, we could talk about incentives an annual commitments. We wanna make a win-win-win between you, your customers, &amp; Ampersand powering the connectivity. BTW, we have a power-packed free tier for you to use today!\nCheck us out: <http://withampersand.com|withampersand.com> or send me a DM - happy to share more or give some insight on the product integration landscape!"
  }
]