[
  {
    "poster": {
      "poster_name": "Harry Daniels",
      "poster_handle": "harry088"
    },
    "time_stamp": "2023-10-24 02:58:42",
    "text": "Hi all, when pulling the email history from the <https://api.hubapi.com/crm/v3/objects/contacts> api. I'm getting multiple values, one with the sourceType 'IMPORT', the other with the sourceType 'EXTENSION'. Is anyone able to tell me what these mean?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-24 03:00:13"
      },
      {
        "time_stamp": "2023-10-24 03:04:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-10-24 03:00:13",
    "text": "well, Import could be an initial contact Import into the CRM, right? And Extension, do you maybe have apps that create Contacts?"
  },
  {
    "poster": {
      "poster_name": "Harry Daniels",
      "poster_handle": "harry088"
    },
    "time_stamp": "2023-10-24 03:04:29",
    "text": "I'll reach out to our Account managers to understand their processes better. Thanks Andreas!"
  },
  {
    "poster": {
      "poster_name": "Adam Chubak",
      "poster_handle": "adam.chubak"
    },
    "time_stamp": "2023-10-24 05:54:43",
    "text": "Hi just to update everyone here. In the end per HubSpot support the HubSpot Associations History view on an object page does not present all association types only those that are unlabeled. So our PUT request was replacing all the existing associations between contact and company but there’s no record of it in the history because the association was labeled. Once the primary company to contact association was deleted and replaced, there was no company to meeting association."
  },
  {
    "poster": {
      "poster_name": "Paul Kavouras",
      "poster_handle": "paulkchem"
    },
    "time_stamp": "2023-10-24 07:24:51",
    "edited": {
      "time_stamp": "2023-10-24 07:25:06"
    },
    "text": "Hello, I'm having a bit of trouble with automated emails missing from the API. I'm using the /email/public/v1/campaigns/ endpoint with no query parameters besides the offset used for pagination. According to a conversation I had with support, automated emails are not excluded from said endpoint, so my last resort is to ask here. Is there anything specific I need to do to get those automated/workflow emails that's not listed in the docs?"
  }
]