[
  {
    "poster": {
      "poster_name": "Vadim Volnitskyi",
      "poster_handle": "vadim"
    },
    "time_stamp": "2023-10-18 03:31:55",
    "text": "Hey anyone, I have a question about form automation; I need to send emails with link to the page where the form was submitted, and one more important thing, I need a link with all URL parameters. I have tried to use this snippet:\n{{ personalization_token(‘contact.hs_analytics_last_url’, ‘alternative link’) }}\nbut it works wrong"
  },
  {
    "poster": {
      "poster_name": "Mubariz Muneer",
      "poster_handle": "mubariz.muneer"
    },
    "time_stamp": "2023-10-18 08:05:25",
    "text": "Hey there guys, I wanted to know if we can use APIs on Website pages of the HubSpot which is the frontend ?"
  },
  {
    "poster": {
      "poster_name": "Chris Bartlett",
      "poster_handle": "chris.bartlett"
    },
    "time_stamp": "2023-10-18 09:10:46",
    "text": "Hi all!\nI am pretty new to HubSpot and taking over an existing integration in our system.  We currently have our project set up to add companies and contacts to HubSpot using the node package.  This is fired off from a queue so it is not happening in real time.  Some of these users that create companies/contacts come from another site with the same domain but different sub domain so the HubSpot utk cookie follows them.  Our main problem is that we want to link these users cookie to the company/contact that gets created.\n\nTo do this we have been told to submit a form since this is the only endpoint that accepts the utk cookie.  I cannot seem to find the endpoint or a wrapping function in the HubSpot node package, do we just have to do a raw http request to the endpoint?  Or is there another way that others have found to connect the two?"
  },
  {
    "poster": {
      "poster_name": "Kevin Williams",
      "poster_handle": "kevin872"
    },
    "time_stamp": "2023-10-18 21:59:08",
    "text": "Hello, I’m trying to create an association to a deal using the batch end point “<https://api.hubapi.com/crm-associations/v1/associations/create-batch>” My body in post man is fine and everything works but I’m wondering how I can populate the association label via this the PUT call?\n`[`\n  `{`\n    `\"fromObjectId\": 20705052,`\n    `\"toObjectId\": 15693151622,`\n    `\"category\": \"HubSpot_DEFINED\",`\n    `\"definitionId\": 4`\n  `}`\n`]`",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-20 07:07:13"
      },
      {
        "time_stamp": "2023-10-20 07:11:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "sai ram",
      "poster_handle": "sairambms2"
    },
    "time_stamp": "2023-10-18 22:24:40",
    "edited": {
      "time_stamp": "2023-10-18 22:26:38"
    },
    "text": "Hello,\nIm trying to integrate HubSpot to my api for that i need to know if there any api to retrieve data of primary object(for support Deals) and there child objects(Line Items) data using Object Id ( for example Deal.Name and there corresponding child line items multiple Line_Item.Tax Rate  ?"
  }
]