[
  {
    "poster": {
      "poster_name": "Lou Graziani",
      "poster_handle": "lou020"
    },
    "time_stamp": "2021-10-01 10:17:02",
    "text": "Hi, I'm trying to use some CSS with the HubSpot \"Growth\" theme.  This means I need to use a child theme or a cloned theme (I'm not sure the difference?) and put my css into the \"Design Manager\".   In either case the css I'm trying to change is not doing anything.  What am I missing here?  How do I know that I'm in the right file?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-03 01:00:51"
      },
      {
        "time_stamp": "2021-12-15 08:56:35"
      },
      {
        "time_stamp": "2021-12-15 09:00:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brennan Nowers",
      "poster_handle": "brennan034"
    },
    "time_stamp": "2021-10-01 13:15:12",
    "text": "Hello! Encountering a weird issue regarding the default form field in a HubSpot module and accessibility. Out of the box, the default form field snippet generates this empty h3 element:\n```&lt;h3 id=\"hs_cos_wrapper_form_231107163_title\" class=\"hs_cos_wrapper form-title\" data-hs-cos-general-type=\"widget_field\" data-hs-cos-type=\"text\"&gt;&lt;/h3&gt; ```\nand this is flagging an accessibility issue using the WAVE Chrome plugin, since heading elements should have discernable text. However, when embedding the form using the embed code given to you when publishing/updating a form, that empty h3 is not present in the code.\n1. Is this heading tag able to even have text added to it? No where in the possible sub-fields indicate a form title.\n2. If not, how I can I remove this without resorting to a js script that waits for it to load, then removes it? \nTL;DR I would much rather utilize the built in form field in the module's fields section so that content editors can easily swap out the form, but currently that method of form insertion does not comply with accessibility standards. Is there a fix or an alternative?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-10-16 22:42:09"
      },
      {
        "time_stamp": "2021-10-17 06:08:10"
      }
    ]
  }
]