[
  {
    "poster": {
      "poster_name": "Aitor",
      "poster_handle": "aitor.tomas"
    },
    "time_stamp": "2019-07-15 01:15:04",
    "text": "I was wondering if there is anyone using the Service Hub and in particular the Support Form. We opened a ticket about it around 12 days ago with HS support and it still opened meanwhile we think it is quite an important topic. Therefore, we would like to check if only we are affected or it is a general thing"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2019-07-15 08:21:08",
    "text": "<https://marketlytics.com/analytics-faq/exclude-url-query-parameters>\n\nI am pretty sure this will help you filter those parameters out."
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-15 10:14:07",
    "text": "Thanks and sorry for the very slow  reply. I'm not a developer, but I'd greatly appreciate any tips in fixing this."
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-15 10:48:45",
    "text": "Hi everyone - I'd like to be able to send out an invite to a slack channel when someone submits a form with their email address. Essentially, after hitting submit I need to access a custom URL. For example if someone enters the email address <mailto:xyz@abc.com|xyz@abc.com>, I need to access \"<https://slack.com/api/users.admin.invite?token=dsfhjkdsfah123456&amp;email=xyz@abc.com>\". Is there a simple way to do this? Any help would be greatly appreciated.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-07-15 10:49:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-15 10:49:49",
    "text": "<@U25C65C3S> set this up recently for his site"
  },
  null,
  {
    "poster": {
      "poster_name": "Johanna Tchon",
      "poster_handle": "johanna.tchon"
    },
    "time_stamp": "2019-07-15 10:52:33",
    "text": "Hello!  Using the HS embed code and form global events, is there an event for when dependent fields propagate?  I only see these options <https://developers.HubSpot.com/global-form-events>"
  },
  {
    "poster": {
      "poster_name": "Johanna Tchon",
      "poster_handle": "johanna.tchon"
    },
    "time_stamp": "2019-07-15 10:53:48",
    "text": "We need to localize the labels/descriptions of the form after the dependent fields are added to the dom."
  },
  {
    "poster": {
      "poster_name": "David Ly Khim",
      "poster_handle": "dkhim"
    },
    "time_stamp": "2019-07-15 13:53:12",
    "text": "Hey Karis, am I understanding the desired flow correctly?\n\n- Core website is hosted on WordPress\n- Some landing pages are hosted on WordPress\n\n1. User uses search bar on HubSpot landing page\n2. You want the user should see WordPress pages in that search\n3. (this is when I get confused) When the user clicks on a WordPress page, it takes them to the WordPress page? Or the HubSpot-hosted landing page?\n\nNot sure if I understand correctly, but maybe this answer will provide a conclusion: the default search functionality won’t show content you host outside of HubSpot."
  }
]