[
  {
    "poster": {
      "poster_name": "Julie Costales",
      "poster_handle": "julie609"
    },
    "time_stamp": "2019-07-16 02:27:27",
    "text": "Hi All,\n\nIm not a backend developer expert and would like to ask for assistance. In our web pages, we have created a form with the below tag.\n\n{% form \"my_form\" form_to_use='08bd9f0d-3be9-41c2-93b6-231a3a71b143', title='Free Trial' %}\n\nHow do I know what are the values getting of HubSpotutk when someone submit the form? Please help.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-16 08:15:50"
      },
      {
        "time_stamp": "2020-05-08 13:57:28"
      },
      {
        "time_stamp": "2020-05-08 14:01:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-07-16 08:15:50",
    "text": "Hi <@UE0QCBRPY> Can you tell me how you’ll be using the HubSpotutk?  There are a couple different ways to ge this value and determining which one is “right” depends on the use case."
  },
  {
    "poster": {
      "poster_name": "Liz Eagar",
      "poster_handle": "yourfreelancer3000"
    },
    "time_stamp": "2019-07-16 09:58:21",
    "text": "Hello! I am new to HubSpot and trying to work out a kink. I'm hoping I'm just overlooking something. I created a set of templates in my developer account, with an attached stylesheet, everything looked great. I copied them over to a client's portal. I confirmed that everything looked good on their portal. The next day, I worked in the client portal to add media queries to the stylesheet, again confirming that everything looked good. Today, half of the styles from the stylesheet aren't showing up on the preview. When I try to make changes on the template sheet, those also don't show up. I was able to make changes by entering css into the in-line styles box on the edit pane in the drag and drop editor. It's like the stylesheet wasn't connected, except that some of the styles are working just fine...I tried a number of things to fix it and was able to get things working by creating a new stylesheet (not cloning) and copy/pasting the css from the old one and using that instead. I'm glad it worked out, but I'm concerned that the styles might disappear from the front end again since I'm not sure what the problem was in the first place. Does anyone have any insight into what happened here? Much appreciated!"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-07-16 10:20:44",
    "text": "Make triupple sure you dont have an error in your styles. That will get you every time"
  },
  {
    "poster": {
      "poster_name": "Liz Eagar",
      "poster_handle": "yourfreelancer3000"
    },
    "time_stamp": "2019-07-16 12:35:24",
    "text": "Reply Thanks <@U38EZFVFE> I don't think that's the problem since the new, working file has exactly the code as the old file, but I'll triple check."
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 14:44:56",
    "text": "Any tips on how I modify the CSS to fix this would be greatly appreciated (I'm not a serious developer :-))."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 14:49:07",
    "text": "You’ll need to know how to inspect the form and see the styles affecting it - then write a css selector that is more specific than the one that is applying the styles you don’t want. Then apply your styles there.\n\n<https://css-tricks.com/specifics-on-css-specificity/>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 14:50:36",
    "text": "as for the inspecting thing. I don’t know how they managed to make this a 7 step thing, it’s really 2 steps. but here’s a guide\n<https://www.wikihow.com/Inspect-Element-on-Chrome>"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-07-16 14:51:48",
    "text": "1. Right Click\n2. Inspect\n3. scroll\n4. clikc on another element\n5. keep scrolling\n6. toggle a checkbox\n7. close"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-07-16 14:53:32",
    "text": "I forgot you had to enable developer tools on a mac..."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 14:54:04",
    "text": "I know you have to do that for safari but I don’t think Chrome makes you do that"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 14:54:40",
    "text": "and firefox is probably like “Pffft, you’re a developer, here’s all the tools, go break stuff!”"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 15:47:12",
    "text": "Thanks all. I can see the problem with inspect (wrong background color), but not sure where I make the change to CSS to fix this."
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 15:47:32",
    "text": "BTW, if I'm reading the inspects elements tab correctly, this does appear to be in an iframe:"
  },
  {
    "text": "",
    "time_stamp": "2019-07-16 15:47:38"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 15:48:51",
    "text": "the iframe is above it, it doesn’t appear to contain the element you’re trying to style.\nas for background color, click the color name in the styles panel, the rest should make sense once you do that"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 15:51:27",
    "text": "This is a pop-up form, so there are is no styles button (unless I'm not looking in the right place)!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 15:53:19",
    "text": "you will need to add the css to a stylesheet on your website"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 15:55:16",
    "text": "Do you know which stylesheet is used for the pop-up form?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 15:56:05",
    "text": "one you don’t control. Any stylesheet loaded onto that page should be able to style that area, as it does not appear to be inside of an iframe based on your screenshot"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 16:24:16",
    "text": "Sorry - I know this sounds dumb - but how to do I add the style so that it only relates to the pop-up form (and doesn't change my whole page?"
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2019-07-16 17:17:23",
    "text": "hello, dunno if im making sense here but the idea is having a dedicated/embedded search field that when you added values in the input it redirects you to the search page from the core/main website from wordpress when you click the button"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-16 18:25:38",
    "text": "You need to make your selector for the styles more specific. Kinda like if you had to tell someone to fetch an object from another room, you can tell them what that object is inside of, what its next to, or aspects of that thing to more specifically help them target that object.\n\nThe specificity article should help with that"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2019-07-16 18:33:14",
    "text": "Thanks, John. I read the article, but not sure I understand how I derive the specificity that would influence the popup form....."
  }
]