[
  {
    "poster": {
      "poster_name": "Mette Andersen",
      "poster_handle": "mette.olesen"
    },
    "time_stamp": "2021-02-03 02:43:25",
    "text": "Is there and ETA of when this i being released? :heart_eyes: or how can we participate in the beta testing?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-02-03 11:07:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-03 08:16:13",
    "edited": {
      "time_stamp": "2021-02-03 08:17:24"
    },
    "text": "I just talked with the email team. We feel confident that `dnd_area` style functionality in email will be coming at a minimum to beta within the year. It will not be within Q1 of this year. The team is working very hard and this change is part of a larger effort to make HubSpot’s email capabilities more powerful. They are focusing on getting it right and making sure it’s a positive experience."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-03 11:07:08",
    "text": "<https://HubSpotdev.slack.com/archives/CES6JU0RY/p1612365373030600?thread_ts=1611702671.017500&amp;cid=CES6JU0RY>"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-02-03 13:40:42",
    "text": "Can we have an outline of the functionality they’re aiming for at least?\n\nFor example can I build a base template with partials, styles etc, reference that and just drag and drop the modules I need into it?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-02-03 15:06:07",
    "text": "Unfortunately I can’t share the roadmap. The general goal is to bring the email development experience closer to the CMS experience. Obviously some differences will be there because email dev itself is different than traditional web dev."
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-02-03 21:36:04",
    "text": "So just to be clear, the functionality you mentioned earlier will allow custom coded modules to be dragged into a preset HubSpot template, but not a fully coded one?\n\nAlso does this also mean it won’t allow us to edit CSS in the head, maintain a single template for repeated sections of the email (header/footer etc), fine tune dark mode or reduce the amount of generated code?\n\nJust want to be clear on what’s available now and what isn’t :slightly_smiling_face:\n\nThanks as always Jon!"
  }
]