[
  {
    "poster": {
      "poster_name": "Marius Richardsen",
      "poster_handle": "marius729"
    },
    "time_stamp": "2021-11-01 07:03:42",
    "text": "Hello! We have an issue with transferring a substantial amount of Blog Posts over to a new template. The issue is that the Blog Posts look awful with the new template due to the layouts being very different, so we must take one Blog Post at the time and make changes to its content (images, spacing, etc). However, there is no Content Staging for Blog Posts and you can only switch the template for all Blog Posts at the same time. Has anyone come across a similar issue before?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-11-01 12:55:29"
      },
      {
        "time_stamp": "2021-11-02 01:18:32"
      },
      {
        "time_stamp": "2021-11-02 05:01:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Danel October",
      "poster_handle": "doctober"
    },
    "time_stamp": "2021-11-01 08:29:34",
    "text": "Hi, is there a way for an account that only uses BLOG to export all the blog post urls, including the blog listing page?..",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-11-01 09:07:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-11-01 09:07:52",
    "text": "If you only need the URLs you could pull them with a tool like Screaming Frog."
  },
  {
    "poster": {
      "poster_name": "Chris Bisnett",
      "poster_handle": "chris825"
    },
    "time_stamp": "2021-11-01 10:43:47",
    "text": "Loving the addition of Associations so far. This is something we've been trying to work around for quite a while. One way we use them is to track which of our customers came through a reseller so we can track that relationship. Can we generate reports using these Associations so that we can see which of our customers are from a reseller and to be able to list all the customers associated with a given reseller? If we can't do that today, what's the timeline for when this will be available?"
  },
  {
    "poster": {
      "poster_name": "Hugo Brandao",
      "poster_handle": "hugo.brandao"
    },
    "time_stamp": "2021-11-01 10:49:32",
    "text": "Greetings, everyone,\nWhich is the best channel to ask about webhooks and company properties?"
  },
  {
    "poster": {
      "poster_name": "Anand jain",
      "poster_handle": "me1194"
    },
    "time_stamp": "2021-11-01 12:55:29",
    "edited": {
      "time_stamp": "2021-11-01 12:56:53"
    },
    "text": "A good way will be to export all the blog posts and import them into a new blog with a temp URL. You may then change to the new template, make suitable corrections and switch blog URLs. That should do the trick."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-11-01 19:29:50",
    "text": "Any webpack power users on the team?"
  }
]