[
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2021-11-11 08:04:59",
    "text": "*Can we get Call-To-Action as a Re-enrollment Trigger in Workflows?* \nDidn't see a reason why it's forbidden? Can anyone tell me what the reasons behind this are?\n```Workflow tells me: The following enrollment conditions can't be used for re-enrollment. Marketing email activity; clicked the link to; CTA.```\nUse case is that I want to detect if a button, link or CTA is click more than once in a mail. Currently, the workflow can only perform its action once."
  },
  {
    "poster": {
      "poster_name": "Shea Martin",
      "poster_handle": "shea"
    },
    "time_stamp": "2021-11-11 08:06:36",
    "text": "I would like to build an application that appears to live within the HubSpot application.  i.e., add a menu item in HubSpot, say under Marketing -&gt; MyApplication. When you click that menu item, it shows a page running my react application. Is that possible? Or do I have to build a standalone application that lives on my server?"
  },
  {
    "poster": {
      "poster_name": "Milos Miljkovic",
      "poster_handle": "miljkovicmisa"
    },
    "time_stamp": "2021-11-11 08:12:48",
    "text": "If anyone has any experience with sending 2FA PIN over SMS and handling such implementations in HubSpot I would very much like to hear your thoughts/ideas over at the community in my question:\n<https://community.HubSpot.com/t5/APIs-Integrations/Integrating-a-two-factor-authentication-cycle-by-sending-a-2FA/m-p/524792/highlight/true#M48619>",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-11-12 10:54:00"
      },
      {
        "time_stamp": "2021-11-12 11:30:12"
      },
      {
        "time_stamp": "2021-11-12 12:34:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-11-11 09:37:09",
    "text": "If you’re trying to customize the HS menu (as in the HubSpot app menu), then I’m afraid you’re out of luck"
  },
  {
    "poster": {
      "poster_name": "Shea Martin",
      "poster_handle": "shea"
    },
    "time_stamp": "2021-11-11 16:47:08",
    "text": "Thanks, that is what I needed to know."
  }
]