[
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:49:10",
    "text": "<@U2H3TT8F2> Not sure if you would know, but I've been reading a lot up on Featured Snippets and wonder if you have and data or expertise on the frequency or change of actually changing the Featured Snippet type (i.e., the current FS winner is a paragraph but you optimie your page for a list version). Everyone seems to be saying to just copy the same format, which makes sense, but I'm also curious to see how much harder it is to actually switch the type"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:51:32",
    "text": "As far as the changing and rates at which those can be changed I do not, I have done alot of looking into those and it seems the mahority of the winners for general web are paragraph, list, and question types"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:52:44",
    "text": "As far structuring them, you can copy what they have but usually in the paragraph ones, it comes down to making sure your markup is correct so you want to make sure for the Paragraph and Questions ones you have proper H1's and H2s with your paragraph"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:53:33",
    "text": "as far as listings, you want to make sure you have the table markup with your tables headers in there as well. Again this is just from what I have noticed"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:53:42",
    "text": "do you use SEMRush of Moz at all?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:55:51",
    "text": "ive usually used SEMRushs keyword magic tool for finding what serps are available with what I am looking to find and then ty to mimic their structure as well (while cleaning up the markup where neccessary)"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:56:03",
    "text": "Yeah I use SEMRush for all of this"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:56:49",
    "text": "Moz has a good reference for these as well: <https://moz.com/learn/seo/serp-features>"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:57:18",
    "text": "While I'd like to copy the format (paragraph to paragraph), I'm getting pushback from the upper levels saying it doesn't make sense to try to win on that when we are using a listicle post. So basically, I'm having low expectations of us winning the FS since the current winner is a parargaph and we are trying to win using a list"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:57:45",
    "text": "Yeah, I  think I've read like 50 articles on FS over the past two days haha"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:57:49",
    "text": "thanks though!"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 08:58:49",
    "text": "I've already cleaned up the HTML though so if anything, we just at least have a more logical HTML structure instead of using styled divs for all headers"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:59:54",
    "text": "yea markup is key for those. AS far as being able to take it over, its just a matter of normal SEO optimizations on the pages, at the end of the day, if you can prove your content is better than what is ranked in the SERP feature, you should win in the end"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 08:59:59",
    "text": "as far as timing, i have no clue on that lol"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 09:01:22",
    "text": "yeah I think the first article I read was HubSpots and they talked about seeing changes within 24 hours and I got really excited. I guess what I didn't realize was, I'm not HubSpot"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 09:03:58",
    "text": "Yea thats the big things, smaller sites wont have as easy as a time doing it. I tweeted out to John Mueller  (webmaster trends analyst at Google) about this, hopefully he responds. If not, ill see if i can dig around and find anything: <https://twitter.com/ajlaporte/status/1104049655090999296>"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-08 09:05:56",
    "text": "Rock on, thanks AJ! I'll keep looking into too since I have a feeling its going to become a common question as Google focuses on FS and people want to be it"
  }
]