[
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-13 13:35:00",
    "text": "So I'm just reading about this for the first time today, but apparently dwell time is NOT an SEO factor? Everything I've read says it is, except for people from Google who say it's not. The farther down this rabbit hole I go, the more I'm seeing prominent SEO thought leaders say one thing, and Google saying the exact opposite (dwell time, click through rate, etc). It's starting to really make me wonder what Google actually factors into SEO. From what I can tell, Google just says \"just make 10x better content and the rest will work itself out\" which seems like a pretty weak answer imo. Any thoughts <@U2H3TT8F2>?"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-13 13:37:39",
    "text": "I finally thought I was learning SEO and now I feel like nobody actually knows what's going on"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-13 13:46:34",
    "text": "hahaha.\n<@UDFSF3N1F> I always feel that SEO is the the voodoo of the web world"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-13 13:49:31",
    "text": "No one knows what’s real or not"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-13 13:50:45",
    "text": "just give me the blue pill and let me pretend I didn't read any of this conflicting information"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:13:31",
    "text": "Im with Google on this, I can see how some would think Dwell Time could be a factor but in reality, how long someone spends on a site doesn't equal their satisfaction or not.\n\nFor example, if we go with the assumption a high dwell time means better rank factor in SEO then one can easily see why stackoverflow is always on the top spots when searching for things, however, if you think of some use cases, some might Google a question, find stackoverflow and then scroll to the green check mark, see the solution and bounce. This would be a low dwell time but the fact that they got their answer means its successful as well, so maybe a lower dwell time is better"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:14:16",
    "text": "as you mentioned, and you hit it on the head, until search engines release their ranking metrics, everyone is always guessing and applying their own weird form of logic to just about anything"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:16:27",
    "text": "all we do know is, the best way to rank successfully is to\n- Provide content thats useful for people\n- Increase the speed of your pages so users dont bounce from frustration\n- work on ways to keep people engaged with your site (conversions, offers, related articles)\n- dont get hacked lol"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:17:37",
    "edited": {
      "time_stamp": "2019-03-13 14:19:09"
    },
    "text": "Honestly dwell time is something that you can think about but when it comes to measuring your SEO, just dont let it be the sole factor that you use to make decisions as there are still alot of what if's on it"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-13 14:22:22",
    "text": "Also to add to your list - make your site easy to use(google has stated accessibility helps to a small degree, and they tell you in the google page speed reports to have big tap targets for mobile)"
  },
  {
    "text": "a quick example, looking at this avg time on page, we can see that 7 minutes is pretty good to have a user on the page, though, in reality, this is a simple thank you page with one line of text and a link. So its hard to think that users are really spending that much time on it. it's most likely, they downloaded the file, have their web browser open and are looking at the file at the same time.",
    "time_stamp": "2019-03-13 14:23:24"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:25:03",
    "text": "to <@U7SL518D6>'s point :100: absolutely make you site easy to use. Accessibility is a HUGE thing in web that needs to be made sure is always accounted for. Ideal tap targets and doing other things like that are what help the user's experience to be enjoyable and not quickly peace out of your site. So UI/UX is a definite must"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-13 14:27:32",
    "text": "fortunately SEO, performance, and accessibility are all kinda intertwined, makes things slightly more sane"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:27:40",
    "text": "agreed"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-13 14:28:16",
    "text": "hopefully that all helped a little bit <@UDFSF3N1F> (even though I am sure it was just as a 50/50 as some of the stuff out there on it)"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-13 14:37:43",
    "text": "haha no this was super helpful! I'm glad I just found out that it's more complicated that I originally thought"
  }
]