[
  {
    "poster": {
      "poster_name": "Jorge Rodri",
      "poster_handle": "jorge378"
    },
    "time_stamp": "2019-02-21 08:52:45",
    "text": "Hello Y’all! I’m Jorge Rodri from NC in USA! Go Heels! :ram:… I’m a full-stack developer and just recently accepted a position where some of our projects are in HubSpot and I’m looking for best practices to make my development more productive and easier to transition from a more traditional development shop. I do React/Redux, Express, Mongo, Rails. So if you want to talk about these or other technologies please send me a message. Excited to learn more!!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-02-21 09:39:36"
      },
      {
        "time_stamp": "2019-03-03 08:21:11"
      },
      {
        "time_stamp": "2019-03-03 08:21:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-02-21 09:39:36",
    "text": "Hey, welcome in Jorge! Always happy to see another full-stack oriented dev in here. If you ever need any translation for where certain things may be in HubSpot, feel free to reach out :slightly_smiling_face: Like Rails, HubSpot is pretty opinionated, so there are only certain ways to do certain things, but once you learn those developing on it gets pretty fast and simple."
  },
  {
    "poster": {
      "poster_name": "Cameron Sechrist",
      "poster_handle": "csechrist"
    },
    "time_stamp": "2019-02-21 10:50:20",
    "text": "<@U22PKFRU5> So far so good!  I still am learning and trying to learn it all!"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-21 10:59:05",
    "text": "Amazing - glad to hear it's going well. Feel free to ask questions and collaborate in this slack as you're learning - We're all here to help"
  },
  {
    "poster": {
      "poster_name": "Cory Park",
      "poster_handle": "cory"
    },
    "time_stamp": "2019-02-21 13:59:52",
    "text": "HI GANG! All about me --&gt; <https://www.linkedin.com/in/john-cornelis/>  It's my first HubSpot site but I've implemented countless CMSs... looks legit :sunglasses::+1:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-03 08:23:06"
      }
    ]
  }
]