[
  {
    "poster": {
      "poster_name": "Peter W",
      "poster_handle": "pwelte"
    },
    "time_stamp": "2024-01-04 12:36:20",
    "text": "Hi all! Does anyone know if it’s possible to *quickly see what a custom module’s config is across many pages*?\n\n*For context:* I want to change the naming or structure of the fields defined in `fields.json` for my custom module (to match some changing requirements) - but from reading older posts on this channel it appears if I do so, I’ll potentially break pages. So I’m wondering if I can quickly find the pages that use a specific field and then I’d be able to manually update those (assuming there is not yet a way to do this automatically).\n\nThanks!",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-01-04 12:56:45"
      },
      {
        "time_stamp": "2024-01-04 15:31:15"
      },
      {
        "time_stamp": "2024-01-04 17:24:20"
      },
      {
        "time_stamp": "2024-01-04 19:16:52"
      },
      {
        "time_stamp": "2024-01-05 09:46:06"
      },
      {
        "time_stamp": "2024-01-05 11:04:24"
      },
      {
        "time_stamp": "2024-01-05 11:05:08"
      },
      {
        "time_stamp": "2024-01-05 11:08:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-01-04 12:56:45",
    "text": "The answer to your first question is “no,” but the second half should be doable by adding an ID to the fields you want to change. So long as your field ID remains the same and you don’t change the field type, you should be able to safely move/rename/relabel or otherwise adjust your fields without worry. _(some field types are interoperable, like `text` and `rich_text`, but I don’t know if there’s any official documentation on that)_\n\nIf your module is created via design tools, your fields _should_ already have IDs and should largely be safe to tinker with. If you wrote your module’s fields.json manually, you just need to add an `id` key and associated value to the field definition.\n\nA disclaimer: I’ve never tried adding an ID to a field that didn’t already have one, so I don’t know how existing module instances will behave when they’re added. I would recommend doing a controlled test to ensure it’s safe before making that update in a production environment."
  },
  {
    "poster": {
      "poster_name": "Peter W",
      "poster_handle": "pwelte"
    },
    "time_stamp": "2024-01-04 15:31:15",
    "text": "Thanks <@U04AQA0QM8E>!\n\nThat’s good to know about the id.\n\nFor more context, I’m making a bit of a structural change, moving from repeating a text field to repeating a group that contains this text field.\n\nSo the old structure is like:\n\nNames (group)\n• Firstname field (repeats)\nto\n\nNames (group) - repeats\n• Firstname field\n• Lastname field\nBecause the field will need to change from repeating to not repeating, do you see any options for locating those pages that use this?"
  },
  {
    "text": "Oh, hmm — I’m actually not sure if there would be a way to preserve content while making that particular change. Personally, I would create a new module with your new field structure, and disable the old version. That’d allow you to manually migrate over to the new version without risking any data loss. A bit of a pain, but I’m not sure that there’s a great alternative in this case.\n\nAs far as figuring out where a module is being used, you can right-click the module in the Design Tools file browser and select “Show dependents” _(see screenshot,)_ That’ll let you see everywhere that the module is currently in use, including published pages and theme files. However, there isn’t any way for you to filter that down to only instances that use a certain field or feature — you’ll have to figure that out manually.",
    "time_stamp": "2024-01-04 17:24:20"
  },
  {
    "poster": {
      "poster_name": "Peter W",
      "poster_handle": "pwelte"
    },
    "time_stamp": "2024-01-04 19:16:52",
    "text": "Ah ok, thanks! That could be a good workaround."
  },
  {
    "poster": {
      "poster_name": "Ankit",
      "poster_handle": "ankit188"
    },
    "time_stamp": "2024-01-05 00:15:49",
    "text": "Hey all! I hope you all are doing great.\nI have an issue with the CMS theme; when i make any changes to theme modules, it is not reflected in\ntheme template that we are using on the page, please suggest\nI have cloned the theme and made changes to it using a clone theme template on a new page.\nThanks !",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-05 07:35:55"
      },
      {
        "time_stamp": "2024-01-05 09:07:25"
      }
    ]
  }
]