[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-01-03 02:49:57",
    "text": "I also wonder what these `hublData.hubl.html` files are. I have some CI/CD code that noticed these files which existed in production HubSpot environment but not in source code.\n\nWould love to know what they are, if for no other reason than I can know whether they should be ignored by CI/CD or not.\n\nAny info from anyone at HubSpot? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Marcus Shannon",
      "poster_handle": "mshannon"
    },
    "time_stamp": "2024-01-03 06:17:56",
    "text": "Hello, they can safely be ignored, they are not used at the moment and will be deploying a fix to remove them this AM, thanks for report!"
  },
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2024-01-03 08:03:34",
    "text": "*# HubSpot CMS Product Currency Display Issue*\n\nChecking out HubSpot CMS's new Product module, I noticed it always displays the product's currency in dollars.\n\nAfter examining the code, I found that the currency formatting function has no parameters. But, a quick look at the documentation showed that adding parameters could let us specify the desired currency.\n\nOne way to fix this locally is to clone the module and tweak the `format_currency_value` function to allow currency selection.\n\nLike:\n`{{ 100 | format_currency_value(locale='en-GB', currency='EUR', maxDecimalDigits=6, minDecimalDigits=1) }}`\n\nHowever, since it's a standard module, HubSpot might update it eventually. So, I can either wait or clone and correct the module myself...\n\nReference: <https://developers.HubSpot.com/docs/cms/hubl/filters>"
  },
  {
    "text": "Hey! Does anybody know how to solve the following issue when posting a module to the marketplace?",
    "time_stamp": "2024-01-03 11:24:57"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-01-03 11:43:59",
    "text": "I’ll include `srcset` and sizes depending on the use case, but in most cases, I just lean on HubSpot’s <https://developers.HubSpot.com/docs/cms/developer-reference/cdn#image-compression-optimization-and-automatic-resizing|automatic image compression and optimization> features to generate sizes for me. So long as your image is hosted on HubSpot and has defined `width` and `height` attributes, HS will automatically generate your size variants, as well as the `srcset` and `sizes` tags necessary to leverage them.\n\nI typically only manually write responsive image sizing and markup in cases where performance is critical and I want to serve hand-optimized images, or when I’m using `picture` elements to provide editors more creative control over image appearance at different display sizes."
  }
]