[
  {
    "poster": {
      "poster_name": "Dan Stillgoe",
      "poster_handle": "dan126"
    },
    "time_stamp": "2020-06-02 03:11:42",
    "text": "Hey Chris, any update here?"
  },
  {
    "poster": {
      "poster_name": "Mike / Resonate",
      "poster_handle": "mkruchkov"
    },
    "time_stamp": "2020-06-02 13:18:05",
    "text": "I still can’t see it in a marketplace. Did themes appear for anyone yet?"
  },
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-06-02 14:07:31",
    "text": "*Themes in the Marketplace Update*\n\nThe events of the past month have resulted in a very difficult time for America and beyond. At HubSpot, we recognize the impact these events may have on our providers, customers, and colleagues. We've decided to adjust our approach toward launching themes in the Marketplace in hopes of being mindful of this impact on our community.\n\nYesterday, we planned on launching the full Marketplace shopping experience for themes. Instead we opted for a soft launch of themes. Providers who submit themes will be sent the link for customers to purchase their theme upon approval, and are free to promote and share this theme link. A list of approved themes will also be available as a resource to internal teams working directly with clients.\n\nThis was a hard decision to make as we understand that some of you were relying on this launch to support your own customers, but we felt it was important to provide time and space to our community. If you have any questions or feedback please feel free to share in the comments below or message me directly. Thank you :HubSpotheart:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-06-03 01:48:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-06-02 14:09:03",
    "text": "Just posted an update in the channel. Let me know if you have any questions."
  }
]