[
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-05-15 08:58:42",
    "text": "This is a fun discussion. Starting tomorrow, I'll be setting aside 45 minutes every morning to go through the channels that fit my personal skill sets and answer or engage with as many questions as I can. I will do this for 10 days straight."
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-15 09:12:26",
    "text": ":partyporg: im gonna set aside... 8 hours a day :rolling_on_the_floor_laughing:"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-05-15 09:14:24",
    "text": "Legit, he’s committed"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-05-15 09:14:56",
    "text": "The 45 mins is actually on my calendar though, not satire "
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-15 09:17:02",
    "text": "That's awesome, I usually look in the morning too. But putting it on the cal is a good idea"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-05-15 09:17:43",
    "text": "It was a fun habit of mine maybe a year ago but it filled up"
  },
  {
    "text": "Hi all - I'm on our Product team and wanted to share that we've built a way to make files uploaded to custom file properties 'public' (rather than private, which was what was preventing these fileIDs from being used externally). This change will apply only to newly created custom file properties in the short-term, but we plan to enable it for existing file properties in the longer-term.\n\nIf you'd like access to this change &amp; would be willing to test it out, please share your portalID and I can give you access today.",
    "time_stamp": "2024-05-15 10:58:29"
  },
  {
    "poster": {
      "poster_name": "Christian Dow",
      "poster_handle": "christianrdow"
    },
    "time_stamp": "2024-05-15 11:22:55",
    "edited": {
      "time_stamp": "2024-05-15 11:26:20"
    },
    "text": "Thanks for the reply. This is not the issue here, but that is good to know.\nTo reiterate, previously the file property would return the string or url stored within it. Essentially acting similarly to a rich text property / and thus acting as the src attribute for an image as one example. At the time of the update/this post it returns just the file ID, and no longer returns the url associated with the file, this breaking the image in this example.\nI had created a support ticket for this previously and support was unaware and unsupportive (a growing trend sadly with all development questions). We ended up moving away from using this property type post update due to lack of support at the time, and swapped all instances to text properties.\nThese text properties use the same urls (and files / file permissions / visibility’s / etc) from within the file manager. So the file permissions are unrelated sadly. Thanks for following up though!"
  },
  {
    "poster": {
      "poster_name": "Harris D",
      "poster_handle": "harris.douglas"
    },
    "time_stamp": "2024-05-15 15:52:59",
    "text": "It should be possible to use a normal form and trigger API call on submission using hidden properties"
  }
]