[
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 11:29:09",
    "text": "how can we get someone at HubSpot to actually get behind this? Super simple and highly needed by I would say 99% of marketers that care about some level of attribution around meetings booked…\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Hidden-Meeting-Fields/idc-p/975922#M179609>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-15 15:52:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-14 13:26:31",
    "text": "Like not to be rude but what does it take to get a good response on here? I’m always searching first, trying to post in an appropriate channel, and trying to frame my question/issue as clearly as possible, and still strike out a lot",
    "reply_count": 17,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2024-05-14 14:20:26"
      },
      {
        "time_stamp": "2024-05-14 14:21:04"
      },
      {
        "time_stamp": "2024-05-14 14:58:26"
      },
      {
        "time_stamp": "2024-05-14 16:29:13"
      },
      {
        "time_stamp": "2024-05-14 16:29:28"
      },
      {
        "time_stamp": "2024-05-14 19:31:05"
      },
      {
        "time_stamp": "2024-05-14 20:02:22"
      },
      {
        "time_stamp": "2024-05-14 20:03:28"
      },
      {
        "time_stamp": "2024-05-14 20:08:15"
      },
      {
        "time_stamp": "2024-05-14 20:09:37"
      },
      {
        "time_stamp": "2024-05-14 20:11:55"
      },
      {
        "time_stamp": "2024-05-15 08:58:42"
      },
      {
        "time_stamp": "2024-05-15 09:12:26"
      },
      {
        "time_stamp": "2024-05-15 09:14:24"
      },
      {
        "time_stamp": "2024-05-15 09:14:56"
      },
      {
        "time_stamp": "2024-05-15 09:17:02"
      },
      {
        "time_stamp": "2024-05-15 09:17:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 14:20:26",
    "text": "seriously though"
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-14 14:21:04",
    "text": "so it’s not just me lol"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-05-14 14:58:26",
    "text": "Hey Tony! This is a community space for developer peers to connect, help each other and share ideas. Because it’s Slack, it’s sometimes hard to ensure that the right person that can help you will see your question at just the right time. You’re doing all the right things, but I might suggest pitching in with answering any questions you can help your peers with - the hope is that that karma will come back around to you, and by getting to know what your peers are working on in here, you have a better chance of knowing who may be able to help when you need support. \n\nThat being said, I know we don’t all have the time or bandwidth to commit to getting more involved in a community, so I might suggest the following - if you have tried going through support but got sent here, <http://help.HubSpot.com|try again> and ask them to open a ticket internally. \n\nIf you are truly looking for community support, you might also try posting in the HubSpot community forums. There is one dedicated to <https://community.HubSpot.com/t5/HubSpot-Developers/ct-p/developers|developers>. The forums are a bit less ephemeral than Slack. \n\nFinally, I’d suggest reading through this <https://developers.HubSpot.com/blog/how-to-get-the-most-out-of-the-HubSpot-developer-community|blog post> to learn how to get the most of the HubSpot developer community. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 16:29:13",
    "text": "<@UQNEXHW14> there’s still no response in the forums even after something is asked for by many"
  },
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 16:29:28",
    "text": "<https://HubSpotdev.slack.com/archives/C22PJ878V/p1715707749742289|ie >"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-05-14 19:31:05",
    "edited": {
      "time_stamp": "2024-05-14 19:33:46"
    },
    "text": "Very fair! The ideas forum is a little different than the rest of our community spaces as it’s designed for feature requests not community questions. Completely agree that someone from HubSpot should respond with a response as to whether or not that’s a feature being worked on. But most of the time, outside of the ideas forum and in places like the developer (and other) forums, the hope is that fellow community members will answer each others questions. We know it’s not a perfect solution though, so we definitely appreciate your feedback! "
  },
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 20:02:22",
    "text": "Any way you could bump that one up internally? :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-14 20:03:28",
    "text": "You can't get mad at HubSpot. This is a community space where the idea is for the community to help each other.\n\nThe challenge is that there are far more people asking questions than answering them. I do my best to look through channels and answer what I can, but I can't do that all day. If no one sees your message, it might get buried among the new questions.\n\nI encourage you (and everyone) to spend some of their free time browsing the Slack and answering questions they can. If we all did that, we'd have a lot more answers. :grin:"
  },
  {
    "poster": {
      "poster_name": "Luis Camacho",
      "poster_handle": "hello640"
    },
    "time_stamp": "2024-05-14 20:08:15",
    "text": "Not mad, but then there’s misconnect.\n\nThe only reason I found out about this community was bc a customer service rep told me to come here with my (original) question after they weren’t able to answer it; the forum thing is separate, but people have been asking the same thing since 2020 and there hasn’t been a single response from HS.\n\nBut I get it, communities are hard.\n\nAt the same time, to your comment about spending free time browsing, I would say most people don’t have free time to sit here and sift through questions that they _might just_ have answers to, and there’s no incentive either other than good will."
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-14 20:09:37",
    "text": "I do that too, Bradley"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-14 20:11:55",
    "text": "Luis your argument supports my point: if no one has free time, then no one will be available to provide answers.\n\n The \"incentive\" is community."
  }
]