[
  {
    "text": "Hi. HubSpot developers.\nI have a big problem.\nI was going to use workflow extensions.\nIt was created as a TEST using the API below.\n\n```POST <https://api.hubapi.com/automationextensions/v1/definitions?hapikey=>&lt;&lt;hapikey&gt;&gt;&amp;applicationId=&lt;&lt;app ID&gt;&gt;```\nAnd as I used the UPDATE API, errors began to come to response.\n\nThe update was not made due to an error. So I tried to erase it. So I tried to use the delete API, but it is not working either.\n\nThere is an error, and only “message”: “There was a problem with the request.” is coming. It doesn’t teach me which request went wrong.\n\nI’ll attach a picture.\nWhen inquired by GET, it can be seen that two were deleted through deleted At.\nHowever, the first workflow extensions that were created are not deleted.\n\nI think we really should do something to solve this problem.\nCan anyone help me?",
    "time_stamp": "2021-10-21 03:29:39",
    "edited": {
      "time_stamp": "2021-10-21 03:31:55"
    },
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-10-21 07:53:32"
      },
      {
        "time_stamp": "2021-10-21 19:14:45"
      },
      {
        "time_stamp": "2021-10-25 08:42:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-10-21 07:53:32",
    "text": "Hey <@U01S5KAF7U4>, I looked through our logs and I think I see what the internal error was. I made a change that I think should prevent you from running into the error you were running into—can you try again when you get a chance and let me know what you get?\n\nAlso, I just wanted to note that you’re using the old version of the custom actions API, which is less well supported. <https://developers.HubSpot.com/docs/api/automation/custom-workflow-actions|The newest version is here>, and you can reference your extension definitions using the same IDs that you’re using with the API that you’re currently using."
  },
  {
    "text": "Hi everyone!\nWe are facing a console error while loading our website, concerning livechat. Is anyone familiar with this issue? Thanks!",
    "time_stamp": "2021-10-21 09:46:38"
  },
  {
    "poster": {
      "poster_name": "taehojo",
      "poster_handle": "jotang.hello"
    },
    "time_stamp": "2021-10-21 19:14:45",
    "text": "<@U0157R7AQ84> The old version of API still has errors.\nHowever, the newest version of API was used, and an error message was received on the reason why it was not deleted. This is because it was being used in one portal. Thanks to this, I was able to solve this problem. I’m so thankful."
  }
]