[
  {
    "poster": {
      "poster_name": "KJ",
      "poster_handle": "karlon"
    },
    "time_stamp": "2019-03-21 09:43:56",
    "edited": {
      "time_stamp": "2019-03-22 03:22:46"
    },
    "text": "Hi Community,\n\nHas anyone did this before or something similar where they can provide insight in mapping Sitecore form submissions to HubSpot?\n\nStep 1\n*The form submission data from (Sitecore) must be stored on a server that another API can access it\n\nStep 2\nHave a form in HubSpot that should mirror the Sitecore form. Put all the fields in your custom form on the HubSpot form\n\nStep 3\nSubmit in the correct format\nUse the v3 submission endpoint which accepts a JSON object.(<https://developers.HubSpot.com/docs/methods/forms/submit_form_v3>)\n\nMake the POST request to the form submission endpoint when your custom form is submitted.\n\nI struggling with:\n\nNot clear how the server listens to or would know when HubSpot wants to pull data in HubSpot. What must be provided and it what format to allow HubSpot to know when there is a submission and to automatically pull the information into HubSpot. Any feedback/insight here?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-21 12:05:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Russell Benzing",
      "poster_handle": "rbenzing"
    },
    "time_stamp": "2019-03-21 12:05:21",
    "text": "HubSpot is always listening.\n\nOnce you have a form created in HubSpot your custom form can use the v3 endpoint to submit to it.\n\nExample:\n<https://api.hsforms.com/submissions/v3/integration/submit/{portal_id}/{form_guid}>\n\nYou will see the submissions clicking on the number under the submissions column.\n\nIf you have GDPR you need to include the legitimateInterest params.\n\notherwise you just need:\nvar data = {\n\"fields\": [\n        {\n          \"name\": \"email\",\n          \"value\": \"<mailto:example@example.com|example@example.com>\"\n        },\n        {\n          \"name\": \"firstname\",\n          \"value\": \"Jeff\"\n        }\n      ]\n}"
  },
  {
    "poster": {
      "poster_name": "Andy Mc",
      "poster_handle": "andy"
    },
    "time_stamp": "2019-03-21 12:18:29",
    "text": "afternoon. I'm trying to work with the engagement API to delete all activity associated with a certain company. Somewhat just testing stuff I can do in API, somewhat for practical application in a larger toolset I'm working on.\nIs there any way to get the engagement ID of a record from the front-end of the CRM? I was hoping in dev tools I'd be able to see an id of some sort associated with each record that  it's using to tie in the delete function, but I can't find one anywhere.\nWhen just looping through the API to find records associated with a company I stopped it after 30min and hundreds of thousands of results and still not finding a record that was associated with the company I was testing.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-22 07:19:36"
      }
    ]
  }
]