[
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 01:46:27",
    "text": "Hi  I want to create a record from a custom module.  I've got the module to collect all the data  I want to insert in the record.  but how do I create a record (its a custom data object record) and then populate its properties with the data I collected in the custom module.   Thanks",
    "reply_count": 12,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-12-04 01:47:49"
      },
      {
        "time_stamp": "2023-12-04 14:07:17"
      },
      {
        "time_stamp": "2023-12-04 18:21:11"
      },
      {
        "time_stamp": "2023-12-04 18:47:01"
      },
      {
        "time_stamp": "2023-12-04 19:27:51"
      },
      {
        "time_stamp": "2023-12-04 19:29:42"
      },
      {
        "time_stamp": "2023-12-04 19:33:01"
      },
      {
        "time_stamp": "2023-12-04 21:05:52"
      },
      {
        "time_stamp": "2023-12-05 13:06:22"
      },
      {
        "time_stamp": "2023-12-08 09:01:15"
      },
      {
        "time_stamp": "2023-12-08 09:08:23"
      },
      {
        "time_stamp": "2023-12-10 12:26:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 01:47:49",
    "text": "I see plenty of documentation about how to do this via apis.  but surely, I don't need to leave HubSpot environment to create a data record. surely"
  },
  {
    "poster": {
      "poster_name": "Jonathan Brake",
      "poster_handle": "jonathan.brake535"
    },
    "time_stamp": "2023-12-04 14:07:17",
    "text": "If you aren't using a HS form to do this then it is likely you will need serverless functions to achieve this so you can post to the relevant api end point with your private app secret (which should not be on the client browser... EVER)."
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 18:21:11",
    "text": "what is it about the hs form module that enables it to create custom data object records?  how can I observe that part of the code?"
  },
  {
    "poster": {
      "poster_name": "Jonathan Brake",
      "poster_handle": "jonathan.brake535"
    },
    "time_stamp": "2023-12-04 18:47:01",
    "text": "If the fields you are making the form up with are from the properties of a/the custom record, pretty sure it will create one on form submission, its automatic to HubSpot so no code to look at and will probably associate that custom object with the contact at the same time. try it out in a sandbox environment for POC."
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 19:27:51",
    "text": "thanks.  that has been my experience.  going in another direction, do you know if you can add more 'smarts' to the form.  for example, I would like to make one of the text box inputs to be a drop down list. I'm basically trying to bring creating an object record automatically and a rich user experience together, without having to resort to using apis."
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 19:29:42",
    "text": "i can write the html/hubl code to be a great user experience in a module ... but it doesn't go anywhere i.e. doesn't create a record.    and I can create a record automatically in forms, but I can't make it a great user experience.  ... looks like using api is the only method - but that seems crazy to me"
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-12-04 19:33:01",
    "text": "even if I could just update a record in a custom module ... I could make this work by creating a 'blank' record with forms and then sending user to a custom module to add the details in a good ux."
  },
  {
    "poster": {
      "poster_name": "Jonathan Brake",
      "poster_handle": "jonathan.brake535"
    },
    "time_stamp": "2023-12-04 21:05:52",
    "text": "forms and APIs are the way to go, but with the API you will need CMS Enterprise(?) for serverless functions."
  }
]