[
  {
    "poster": {
      "poster_name": "Karolis",
      "poster_handle": "karolis.m"
    },
    "time_stamp": "2021-05-06 03:05:30",
    "text": "Hello,\nI have a question about the app certification process.\nWe have our app listed in HubSpot marketplace (you can see it <https://ecosystem.HubSpot.com/marketplace/apps/marketing/analytics-data/whatagraph-201083|here>), and now we would like to get it certified by HubSpot.\nWhen I log in to my HubSpot account and go to App Marketplace -&gt; Listings, I see our app there and also \"Certify app\" button appears on our app (which, according to info <https://developers.HubSpot.com/docs/api/applying-for-app-certification|here> means that our app is eligible to apply).\nNext step is to create demo video to submit certification application. And according to information in website video should include:\n• A brief overview of your integration\n• The installation process and any additional set up steps or requirements\n• A walkthrough of the post-installation customer experience, including:\n    ◦ Tasks performed\n    ◦ Data flowing to and from HubSpot\n    ◦ APIs used to push/pull data\n    ◦ HubSpot UI components (CRM extensions, timeline events, workflow extensions) your app integrates with or extends\n    ◦ The uninstall flow\nBut our video does not include exactly all information mentioned above (you can see our demo video <https://www.youtube.com/watch?v=Mf4NsPlphi8|here>).\nSo my questions would be:\n• If I would apply for certification with this video, and application will be rejected - does this mean we will need to wait for 6 months in order to apply again? (because in in minimums certification requirements it is written that: Your app must not have applied for and failed to achieve certification or have triggered any unresolved support escalations in the last six months.)\n• If demo video does not include all the information mentioned above - is there any chance to get certified? If no - we would create another video.\nMaybe anyone can help with this?\n\nThanks in advance!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-05-07 21:25:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adrianna LeBlanc",
      "poster_handle": "adrianna"
    },
    "time_stamp": "2021-05-06 07:38:06",
    "text": "•  I have an issue with a language script that I can’t find. Have any of you run into this issue? On some of my pages, HubSpot is adding ‘?hsLang=ko’ to the end of my URLS, which means the blog options in the footer can’t operate how I need it to: *<https://www.molocoads.com/ko/blog?hsLang=ko|블로그> <https://www.molocoads.com/en/blog?hsLang=ko|EN> | <https://www.molocoads.com/ko/blog?hsLang=ko|KR> | <https://www.molocoads.com/ja/blog?hsLang=ko|JP> — the page redirects EN and JP to KO.* <https://www.molocoads.com/ko/mobile-life-after-lockdown>"
  }
]