[
  {
    "poster": {
      "poster_name": "Cameron Taljaard",
      "poster_handle": "cameronstaljaard"
    },
    "time_stamp": "2021-05-25 01:35:04",
    "text": "I know this is a basic question, but have not been able to get an answer for multiple days now.\n\nCould anyone help elaborate a few things for me?\n\nWhen editing a template, changing the CSS margin of a drag and dropped component is blanked out and tells you to use developer tools, but where is this?\n\nSecondly, when working on a web page on HubSpot using my own template, is there any way to add classes and id's to the existing drag and drop components such as individual video embeds?\n\nThank you in advance.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-25 06:45:51"
      },
      {
        "time_stamp": "2021-05-25 17:46:30"
      },
      {
        "time_stamp": "2021-06-08 15:11:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-05-25 06:45:51",
    "text": "&gt; When editing a template, changing the CSS margin of a drag and dropped component is blanked out and tells you to use developer tools, but where is this?\nCan you provide a screenshot of the message you’re seeing.\n\nDeveloper tools likely is referring to the HubSpot CLI - that said I’d like to understand the context of where you’re seeing this.\n\n&gt; Secondly, when working on a web page on HubSpot using my own template, is there any way to add classes and id’s to the existing drag and drop components such as individual video embeds?\nUnfortunately we don’t provide a way to place classes/ids on the grid wrappers. We’re working on a few things that should help resolve the issue in multiple ways.\n\nIt would be a better idea generally to structure your custom modules with a wrapping div or section element inside your module and target your styles based on that."
  },
  null,
  {
    "time_stamp": "2021-05-25 06:46:15",
    "edited": {
      "time_stamp": "2021-05-25 06:46:18"
    },
    "text": "The CLI (Command Line Interface) provides a way to upload, fetch, and watch files to/from the developer file system. Because you are working with actual files on your computer it opens up a world of benefits like the ability to use your preferred code editors, build tools, version control like git, etc. Additionally the CLI provides a ton of helper benefits like `hs create` which lets you quickly create modules, serverless functions, themes from tried and true boilerplates. Additionally the CLI often gets features faster than the Design Manager because any features we add to the design manager also require UX design and front end development. With the CLI everything is file based, so as soon as we add functionality to the back-end we can make it available in the CLI. If you've been using HubSpot for a while but are new to the CLI we recommend our getting started with local development tutorial: <https://developers.HubSpot.com/docs/cms/guides/getting-started-with-local-development>"
  },
  {
    "poster": {
      "poster_name": "Cameron Taljaard",
      "poster_handle": "cameronstaljaard"
    },
    "time_stamp": "2021-05-25 17:46:30",
    "edited": {
      "time_stamp": "2021-05-25 17:46:38"
    },
    "text": "Sure!\n\nHere is a screenshot of what I am referring to, and my main concern at this moment.\n\nIt seems like something with a simple solution, but have no idea how to accomplish what it's asking of me.\n\n<https://i.imgur.com/vnvMX2L.png>"
  }
]