[
  {
    "poster": {
      "poster_name": "Grégory Jannin",
      "poster_handle": "gregory.jannin"
    },
    "time_stamp": "2021-06-07 01:43:21",
    "text": "Hi Everyone!\n\nQuick intro. My name is Greg from Europe but live on the East coast. Will be Certified Gold Partner from the 15, looking to grow within HubSpot. So excited to be part of this community!\n\nVery basics question - we built an Excel Add in using HubSpot API to extract, update, delete almost any objects, but would like to publish a more traditional and HubSpot certified integration through the Marketplace. I already have my dev and testing accounts. I would just need to know where to start and which path I should take to get there.\n\nCould you please advise?\n\nThank you all!\nGreg"
  },
  {
    "poster": {
      "poster_name": "Faraz Hussain Rohaila",
      "poster_handle": "farazhussain.tw"
    },
    "time_stamp": "2021-06-07 03:19:27",
    "text": "Hello Everybody!\nShort introduction:\n My name is Faraz from Multan,Pakistan. I am PHP developer, developing WordPress Themes to be sold on Theme-forest.\n New To HubSpot CMS, started learning from docs &amp; official tutorials. Any help about perfect start-up will be appreciate able.\nThank you all!\nFaraz Hussain Rohaila."
  },
  {
    "time_stamp": "2021-06-07 12:00:11",
    "edited": {
      "time_stamp": "2021-06-07 12:00:14"
    },
    "text": "Reminder: Are you a developer new to HubSpot, looking to get started building on CMS Hub? Check out our <https://developers.HubSpot.com/docs/cms/guides/getting-started|quick start guide> to get a quick taste. When you’re ready to learn more head on over to our <https://developers.HubSpot.com/docs/cms/guides|tutorials and guides> to learn by doing. When you’ve got a chance, we recommend looping back and reading the <https://developers.HubSpot.com/docs/cms/key-concepts|Key Concepts> of the CMS. It explains how all of the pieces of the CMS fit together. Welcome to HubSpot development, there’s never been a better time to be HubSpot developer!"
  }
]