[
  {
    "poster": {
      "poster_name": "Rémy Desjardins",
      "poster_handle": "r.desjardins"
    },
    "time_stamp": "2021-06-14 12:25:24",
    "text": "(Mac User) Hi everyone,\n\nI’m new to HubSpot CMS design manager, just now trying to set up a local dev folder for the custom quotes I need to make.\nI did everything on the HubSpot dev page, as far as init and fetching goes, everything works but the actual server itself.\n\nI tried an http-server where I served the whole folder, navigated to the file I wanted to see, but it’s not actually compiled…\n\nHow can I setup my local Vs code to be able to visualize the changes?\n\nty^^",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-06-14 13:04:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-06-14 13:04:06",
    "edited": {
      "time_stamp": "2021-06-14 13:05:23"
    },
    "text": "<@U02162GK9SP> explain previewing templates"
  },
  {
    "time_stamp": "2021-06-14 13:04:08",
    "edited": {
      "time_stamp": "2021-06-14 13:04:10"
    },
    "text": "CMS Hub is deeply integrated with the whole HubSpot App (CRM, Workflows, Email Marketing, Personas, social media, ads, forms, conversations, reporting etc).  Because CMS Hub is a SaaS platform we can quickly make improvements, seamlessly without requiring manual updates. In-fact we make updates to the platform many many many times a day.\nTo make the whole system work seamlessly and identically to the live app offline would require obnoxiously frequent updates on your end as well as emulation of nearly all of HubSpot. In-addition some app capabilities rely on cloud-centric technologies and redundancy that would be difficult to reproduce offline. Because of this you cannot fully run your website locally.\nWhile you cannot run CMS Hub offline, What you can do is use the CMS CLI, and your favorite code editor, in-tandem with a developer sandbox account and use that as a full featured, always up-to-date development environment.\nFor more tips on setting up a good development workflow see <https://designers.HubSpot.com/tutorials/creating-an-efficient-development-workflow>",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-06-14 13:04:18"
      },
      {
        "time_stamp": "2021-06-15 06:15:06"
      },
      {
        "time_stamp": "2021-06-15 06:44:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-06-14 13:04:18",
    "text": "<@U024WU748AZ>"
  }
]