[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-04-03 05:20:27",
    "text": "Its an okay channel to ask in. Are you on Enterprise with the memberships feature? Or hope are you doing logins?"
  },
  {
    "poster": {
      "poster_name": "Tumai",
      "poster_handle": "tumai"
    },
    "time_stamp": "2019-04-03 09:21:23",
    "text": "*`Need help to create webpage templates in HubSpot`*\n\nHello,\nI am in the process of revamping our website and I am looking for an expert who can build 4-5 page templates (including some modules if necessary) within HubSpot for us.\n\nThe design work will be done by a separate agency so part of the job would be to apply the designs to the templates.\n\nDo you know anyone who might be able to help?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-04-03 09:33:58"
      },
      {
        "time_stamp": "2019-04-03 23:44:39"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2019-04-03 09:33:58",
    "edited": {
      "time_stamp": "2019-04-03 09:41:48"
    },
    "text": "Hi <@UHMAHML69> my company Spin Group (<https://www.spingroup.com/>) specializes in HubSpot development, we partner with marketing agencies to build HubSpot sites based on their designs, so this is very much in our wheelhouse.\n\nAs for our expertise, don’t let the hair in my profile pic fool you. I personally at our company have given a dev talk at HubSpot’s developer day, and lead the work on the HS Developer Chrome extension - used by 984+ developers, and I was the first person HubSpot CMS Developer Certified. We’re in the CMS every day and are active in this community.\n\nIf you’re interested we can schedule a call and discuss details, feel free to DM me or <@U7TAZ6V2Q>."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2019-04-03 23:44:39",
    "text": "Hi <@UHMAHML69> We are HubSpot Premier Integration Partner and  working on HubSpot cos templates as we also provide the service.\n<https://makewebbetter.com/HubSpot-cos-development-service/>\nAnd listed many templates on HubSpot Marketplace. If you want to check our portfolio on HubSpot Marketplace you can check through the link given below.\n<https://marketplace.HubSpot.com/products?provider=MakeWebBetter&amp;subType=COS_TEMPLATE_PACK>\n\nIf you are interested then feel free to Connect with us on <skype:makewebbetter> or DM me or <@UF09V9A30>"
  }
]