[
  {
    "poster": {
      "poster_name": "Martin Carlin",
      "poster_handle": "martin264"
    },
    "time_stamp": "2022-04-14 02:24:54",
    "edited": {
      "time_stamp": "2022-04-14 02:30:44"
    },
    "text": "```header {\n    background: radial-gradient(colour1, colour2);\n}```\n<https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/radial-gradient>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-14 05:01:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevinm",
      "poster_handle": "kevinm451"
    },
    "time_stamp": "2022-04-14 05:01:09",
    "text": "thank you. But can you please point me which file or where in hubpl i can put this?"
  },
  {
    "text": "Hi, has anyone used child themes yet? We were under the impression it would be an exact clone that we can then work off of but changes are applying to modules on the child theme unless they are all cloned first.\n\nHere's an example. The top accordion is visually broken because we fixed an accessibility issue. We had to add it to the page _after_ cloning the module. The one below it was added to the page before cloning and its reference isn't being updated to see that we've overwritten that version.\n\nIs there a way to tell the child theme to use certain versions that we are missing?",
    "time_stamp": "2022-04-14 09:48:47",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-14 10:22:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2022-04-14 10:22:56",
    "text": "its not an exact clone; it’s more like a collection of overrides.\n\ni’m using one with a bunch of custom modules. the custom modules “belong to” the parent theme, and are re-styled/re-scripted with CSS and JS in the child theme.\n\nto be fair, the parent theme is also a custom theme i’m building, so I’m able to add whatever modules I want to it. but if i were going to use a module solely in the child theme, i’d build it there."
  }
]