[
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2024-09-25 09:50:41",
    "text": "Hey dev friends!\n\nI've been working on a little side project that's finally starting to take shape, and I wanted to share it with you first, since it's still in prototype mode. I actually worked out some final bugs this morning, so there's a GOOD chance it might still error out on you, haha! But that's why I'm sharing it with my fellow devs as it’s not quite ready for civilian use yet. :sweat_smile:\n\n<https://cro-ai-72462d843a7b.herokuapp.com/|Check out the app here>!\n\n*How to Use It:*\n\nEnter the URL of a website or landing page, and behind the scenes, it will take a screenshot of the page and send it to *OpenAI’s Vision API*. The AI will analyze the screenshot and give *conversion rate optimization feedback* based on a set of CRO principles that I’ve trained it on. These are the same optimization rules I use when consulting my website clients—so it’s basiclly like having a mini-consultation with an AI version of me! :smile:\n\nI originally got inspired to build this when OpenAI came out with their <https://platform.openai.com/docs/guides/vision|Vision API>. If you're not familiar, GPT-4o, GPT-4o mini, and GPT-4 Turbo all have vision capabilities now so they can analyze images -- now they can \"see.\" which is also kinda scary but it got me thinking: *what if AI could visually analyze a website and give CRO feedback*, just like I do with clients?\n\nWhat started as a simple idea turned out to be a bit more complex than I thought, but it’s been really fun (and quite a learning experience)!\n\n*Tech Stack:*\n• *Vue.js* on the frontend: my fav JS framework for building interactive UIs.\n• *Node.js/Express* backend: Node for running JavaScript on the server, Express as the web app framework.\n• *Heroku* for hosting\n• *Puppeteer* for screenshots: Headless browser for capturing website screenshots.\n• *Redis* and *Bull* for job queuing: Redis stores the job data, Bull manages the job queue and worker processes.\nI originally didn't plan to use Redis and Bull, but I ran into *rate limits on Heroku*. Between capturing screenshots and waiting for OpenAI to process them, longer websites sometimes took more than 30 seconds to complete—pushing me past Heroku’s 30-second timeout limit. So, I had to set up a job queuing system to handle this smoothly. This was a unexpected bump in the road but actually made me a better developer, forcing me to learn how to manage complex workflows in a more scalable way!\n\nWhat's Next:\nRight now, this is a barebones MVP—just wanted to get the idea out of my head and into the world. Some next steps I’m thinking about:\n• Improving the UI so users don’t need to select which type of page they’re optimizing.\n• Not sure how I’ll monetize this yet. :man-shrugging: Maybe I’ll offer it as a free tool to my HubSpot theme customers, or as a lead gen tool for my agency (eg: HubSpot’s website grader) Who knows, maybe I’ll sell it to an agency or a company like SEMrush and add it to their toolset. The possibilities are endless!\nLet me know what you think—I’m open to feedback!",
    "reply_count": 7,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-09-25 23:44:18"
      },
      {
        "time_stamp": "2024-09-25 23:46:14"
      },
      {
        "time_stamp": "2024-09-26 05:21:10"
      },
      {
        "time_stamp": "2024-10-03 02:32:30"
      },
      {
        "time_stamp": "2024-10-03 06:38:13"
      },
      {
        "time_stamp": "2024-10-29 15:38:20"
      },
      {
        "time_stamp": "2024-10-29 15:47:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Subroto Shuvo",
      "poster_handle": "subrotokumar199"
    },
    "time_stamp": "2024-09-25 13:34:06",
    "text": "Hey Everyone, We support Sales &amp; Ops teams w/ tasks like\n\n-finding + verifying emails *(using <http://Apollo.io|Apollo.io>, &amp; <http://Lusha.com|Lusha.com> etc ~ 40% cheaper rate)* \n-scraping LinkedIn/web pages\n-handling large data entry (the boring work)\n\n Can we chat?\n\n*<https://www.linkedin.com/in/subrotoshuvofreelancer/|LinkedIn Profile Link>*"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-09-25 23:44:18",
    "text": "Love the idea!!!"
  },
  {
    "text": "Just tried it for the HubSpot homepage :grin:",
    "time_stamp": "2024-09-25 23:46:14"
  }
]