[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 08:40:20",
    "edited": {
      "time_stamp": "2018-05-17 08:45:37"
    },
    "text": "on password protected pages it’d be nice if the current user is signed into HubSpot and has page editing capabilities if there was a button that would either appear on the password form, or in the sprocket menu to “bypass” the password.\n\nI’m glad it initially shows the password. I am, makes me feel more comforted seeing it prompt for it. but I hate when a client or someone sets a password and I have to edit the page, go to the settings tab, then go copy and paste the password to sign into the page or a preview of the page.\n\nIf you can do a button that appears in the password form from a UI point of view it should have a Sprocket on it and match the style of the sprocket menu as a visual indication that you are only seeing that button because you are signed in. a tooltip explaining that could be nice as well."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 09:09:52",
    "text": "Can we get the documentation for `resize_image_url` updated to state if the booleans default to false or true.\n\nI would assume false is default but prefer to have it in writing :wink:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 09:54:21",
    "text": "that or Open source the documentation - and with the simple :+1::thumbsdown: from a dev I can update the documentation to include it :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-05-17 11:07:53",
    "text": "I'm sure someone's said this before, but would love the ability to \"Clone to...\" templates, so I can take a password prompt page and clone to a 404 page, or a page template and clone to a blog template. Even if HS just dropped the template-specific module(s) just at the top of the cloned template, it would save a lot of time",
    "reply_count": 5,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2018-05-17 11:09:10"
      },
      {
        "time_stamp": "2018-05-17 11:11:46"
      },
      {
        "time_stamp": "2018-05-17 11:12:21"
      },
      {
        "time_stamp": "2018-05-17 11:20:35"
      },
      {
        "time_stamp": "2018-05-17 11:27:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-05-17 11:09:10",
    "text": "If it's a coded template just copy the code :wink: But I assume you're referencing the Drag-n-Drop visual editor"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-05-17 11:11:46",
    "text": "yeah, unfortunately I have some legacy portals still on ye olde drag-n-drop haha"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-05-17 11:12:21",
    "text": "although DM2 does make it a lot better to work with"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 11:20:35",
    "text": "This has been recommended before like you said by multiple people. I too would love this."
  },
  {
    "poster": {
      "poster_name": "Shawn Bristow",
      "poster_handle": "captshawn"
    },
    "time_stamp": "2018-05-17 11:27:04",
    "text": "The team chatted about this at lunch today. No timeline but we a forming a plan around this issue."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 14:08:09",
    "text": "idea, there should be a way to enable the conversations chat widget at the page level instead of requiring someone to paste in the code. (I’m fine with looking at code obviously, but seems kinda funny to require using the script tag when editing a page on HS)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-17 14:37:12",
    "edited": {
      "time_stamp": "2018-05-17 14:38:47"
    },
    "text": "bug: css columns in a custom module makes the page editor insane.(makes it think the height of the module is way higher than it is making the overlay for clicking to edit the module annoyingly cover modules below it) for clarity I’m talking the columns css property not traditional css grid columns. This kind: <https://css-tricks.com/guide-responsive-friendly-css-columns/>",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-05-22 07:40:24"
      },
      {
        "time_stamp": "2018-05-22 07:40:27"
      }
    ]
  }
]