[
  null,
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-05-10 09:26:15",
    "text": "Some form of Interface-based \"Last Updated\" and/or \"Date added\" indicator on HubDB Rows would be Suuuuuuper useful - it's frustrating to have to query the API to get this information when trying to perform quick audits on data entry / row updates"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2018-05-10 09:41:34",
    "edited": {
      "time_stamp": "2018-05-10 09:43:32"
    },
    "text": "I think the solution is two-fold if it’s physically possible to make the new menu a user preference essentially instead of whole portal, that’s a better way for people to transition. For example our company manages 50+ HS sites, it’d be great if we could opt ourselves in to these features that don’t dramatically affect functionality, without opting clients in.\n\n\nIf not:  I guess putting in the notification in some visually bold way something that indicates that everyone will be notified that you specifically made the change would be good.\n\nfrom an agency perspective we’re like - “sweet a new tool to make us more efficient. ” because we’re in HS every day, and know the tools like the back of our hands.\n\nThe client’s perspective is - “I’m in HubSpot maybe once a week. ”\n“everythings changing, every time I come in here things are in different places…”\n\nThus they are less likely to want to change their main nav over as that means re-learning what they already don’t feel they know well enough. but if they can wait just a little longer and choose to learn it at a different time they’re happier."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-10 14:30:54",
    "text": "UI Tweak the color picker displays the current color right where it says hex <https://spin.d.pr/remP3y+> might want to move that box somewhere else"
  },
  {
    "poster": {
      "poster_name": "Dillon Compton",
      "poster_handle": "dcompton"
    },
    "time_stamp": "2018-05-10 16:33:27",
    "text": "Thanks Jon. This is great feedback and super helpful. Let me take it back to the team and see what we can whip up to make it more clear, while we work through our options for enabling it at a user-level!"
  }
]