[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-29 06:58:54",
    "text": "repeatedly suggested feature. I remember in the past a HS staff member stating they were actively trying to figure out how they could do it(because smartcontent can get extremely complicated in custom modules, because do you handle smart content controls at the field level or the whole module? and things like that"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-05-29 11:21:54",
    "text": "<@U7SL518D6> I remember that convo. I still feel like it should be possible. And I have clients that want hyper flexibility and Smart content."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-05-29 12:17:34",
    "text": "Yea, I completely echo what you’re saying. I agree and wholly support the idea. Just letting you know it seemed atleast at the time someone there was actively thinking about how to solve the problem"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-05-29 15:13:25",
    "text": "Please please PLEASE, bring back site tree view. We do a lot of migrations from platforms like ektron, wordpress, and other CMS'. This is a main piece of alot of other CMS systems to be able to see your content in a structured manner. It's hard to explain to a client \"Oh hey you have like 500 pages? Yea sorry you're going to have to search for the page you need. What's that? No, you'll have to click into the page in order to see the slug so you can see where it's nested.\"",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-06-11 17:07:42"
      },
      {
        "time_stamp": "2018-06-11 17:08:08"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2018-05-29 23:54:09",
    "edited": {
      "time_stamp": "2018-05-29 23:54:19"
    },
    "text": "Add the ability to create a list in HubSpot List with a regex filter on phone (<@U25C65C3S>) :slightly_smiling_face:"
  },
  null
]