[
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-05-04 08:12:50",
    "text": "Hello everyone\nI would need to insert macros in the css of a theme that I am developing.\nI make a considerable use of Flexbox and therefore I didn't feel like writing every time: -webkit-box; display: -moz-box; display: -ms-flexbox; etc, so I created my style sheet _macros.css with the various macros inside, like this:\n{% macro displayFlex () -%}\n  display: -webkit-box;\n  display: -moz-box;\n  display: -ms-flexbox;\n  display: -webkit-flex;\n  display: flex;\n{% - endmacro%}\n\nThen I imported the _macros.css style sheet into my main.css using {% import './_macros.css'%} and so far so good but, when I insert the macro in other style sheets like this: {{displayFlex () }}, I get the error\nCould not resolve function 'displayFlex'\nwhich is obvious because the style sheet I am using is called in my main.css and the macro is not written in every specific style sheet I use;\nhowever, it doesn't stop me from saving and it works because the video display is perfect, as I wanted it.\nBut I don't want the error to come out and I ask you if there is a way to solve it.\nI hope I have been clear and I apologize for the long message\nThanks\n\nGiovanni"
  },
  {
    "poster": {
      "poster_name": "Avi Goldman",
      "poster_handle": "avigoldmankid"
    },
    "time_stamp": "2020-05-04 08:15:23",
    "edited": {
      "time_stamp": "2020-05-04 08:15:42"
    },
    "text": "I believe when you do the import you need to name it or import that specific variable. If you swap `{% import './_macros.css'%}` for `{% from './_macros.css' import displayFlex %}` I believe it should work",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-05-04 08:19:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-05-04 08:19:36",
    "text": "just try but unfortunately the error persists even if the result is ok"
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-05-04 08:23:28",
    "text": "ah ok, I have to insert it in the style sheet where I recall the macros ... sure"
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-05-04 08:24:07",
    "text": ":pray:"
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2020-05-04 13:58:10",
    "text": "Just seeing you posted here <@U22PJPGK0>. So the question was really involving if someone was logged into the HubSpot portal but was viewing their site publicly. For example, if I'm logged into HubSpot and I have the dev tools widget, i can get that spoke wheel icon to show as I navigate a client's site. But from the hubl code on that site, I don't think there's anyway to say \"am i logged into HubSpot right now\" so that I can just show some code only to that type of user (to allow for testing, etc). I got around it for now by using querystring parameters to toggle that display, but ideally I could utilize a variable in hubl to tell if I was just logged in so the client didn't have to change anything to see the items prior to us launching it."
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2020-05-04 13:59:07",
    "text": "If you'd like to see an example..\n<https://www.iga.com/find-a-store?locationLat=41.7735217&amp;locationLng=-88.02163340000001&amp;zipcode=60516&amp;showfeedback=true>\nYou'll notice the showfeedback=true. When that's enabled, you'll notice each result (in some cases) can display a leave feedback link to another page. But when that's not in the querystring, it doesn't render."
  },
  {
    "poster": {
      "poster_name": "Rob Schall",
      "poster_handle": "rschall"
    },
    "time_stamp": "2020-05-04 13:59:35",
    "text": "that allows our client to preview what the page \"will\" look like to the public after we launch (aka, remove the conditional)."
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2020-05-04 14:01:18",
    "edited": {
      "time_stamp": "2020-05-04 14:01:51"
    },
    "text": "Yeah, there isn’t a way to do this in HubL. The sprocket menu does this client-side."
  }
]