[
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 10:26:57",
    "text": "is there any documentation or Community forum posts on this developing functionality?"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 10:49:42",
    "text": "Anyone know of a way to access a HubDB table from a HubSpot workflow?  Think this could be useful for accessing variables in the table based on matching to a row based on a property value on the record in the workflow.  Similar could be achieved with if/then branches and explicit value assignments but less clean/scalable, and kind of a funky way to represent a \"table\" in the logic of the workflow itself.  I imagine there could be some way by calling a webhook (or similar) to an external system that then queries the table, but that creates a dependency outside of HubSpot",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-28 13:57:13"
      },
      {
        "time_stamp": "2021-01-28 15:09:27"
      },
      {
        "time_stamp": "2021-01-28 15:13:24"
      },
      {
        "time_stamp": "2021-01-28 15:16:05"
      },
      {
        "time_stamp": "2021-01-28 15:53:14"
      },
      {
        "time_stamp": "2021-01-28 15:53:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2021-01-28 13:57:13",
    "text": "What is the data source you are using in the HubDB table? Have you considered using a Custom Object?"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 15:09:27",
    "text": "I have considered this, but there are limitations with how a custom object can be referenced in a workflow, if for instance a net-new record is running through a workflow and doesn't have a relationship to a custom object record"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 15:13:24",
    "edited": {
      "time_stamp": "2021-01-28 15:14:01"
    },
    "text": "there are a number of use-cases I'm imagining, but in many of the cases, I'm imagining the HubBD table's data itself might still be manually managed or refreshed with imports.  Just wondering if this could possibly allow for any possible object/record to reference such a table without needing to have a prior relationship established (as referencing a custom object would require).  Last I checked, workflows allowed you to create new custom object records in association with the record running through a workflow, but not find and establish a connection to an already existing custom object record"
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 15:16:05",
    "text": "HubDB seems like it still retains a bias toward it's original use-case of dynamic web content but it seems like it would have  a lot of potential for more operational purposes."
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 15:53:14",
    "text": "<@U6W3H6YN8> Had you thought through a solution with Custom Objects like this?  Thinking through it a little more, it seems like I'd either need to have a custom object record representing something akin to a \"row\" of a HubDB table (probably more ideal) or alternatively a custom object record representing something more akin to the table with properties holding values of each \"row\" (this would of course, establish relatively smaller a \"max size\" of the table, and possibly require several such records).\n\nEither way, even assuming the \"requesting\" CRM record that wants to reference the \"table data\" recorded on such a custom object structure (say, a Deal running through a workflow) already has an object relationship to any of the necessary custom objects, I'm not seeing an easy way to dynamically find/filter to the appropriate custom object record (or field) representing the desired table row, based on a data value on that \"requesting\" Deal record."
  },
  {
    "poster": {
      "poster_name": "Chris Lukes",
      "poster_handle": "clukes"
    },
    "time_stamp": "2021-01-28 15:53:30",
    "text": "without some sort of external microservice I guess"
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2021-01-28 22:39:55",
    "text": "Hey Guys, Please do needful to me.\nI want to create a directory with a search bar and 0-9, A-Z filters. Is it doable in HubDb or any other alternative?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-01-29 13:57:13"
      }
    ]
  }
]