[
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2021-08-24 06:38:22",
    "text": "Does anyone know if it is possible to do a workflow based on a date property from the \"Marketing Events\" object? I'd like to send an email to subscribers X days before the scheduled event.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-24 07:20:55"
      },
      {
        "time_stamp": "2021-08-24 07:24:38"
      },
      {
        "time_stamp": "2021-08-24 07:25:27"
      },
      {
        "time_stamp": "2021-08-24 07:26:44"
      },
      {
        "time_stamp": "2021-08-24 07:38:52"
      },
      {
        "time_stamp": "2021-08-24 08:01:21"
      }
    ]
  },
  {
    "text": "Hey <@U01QUB1BU0P>, we currently don’t support workflows based on a date property for anything other than contact objects. In this case though, would an enrollment filter of “scheduled event date is X days from now” work for you? Here’s an example for enrolling when a deal’s close date is less than 7 days from now.",
    "time_stamp": "2021-08-24 07:20:55"
  },
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2021-08-24 07:24:38",
    "text": "I'm not sure if that would work or not. I dont have much experience with Deals. We have marketing events coming in via a zoom integration. So potentially we could make a custom deal pipeline. I was hoping just to send reminder emails to all registrants via a workflow"
  },
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2021-08-24 07:25:27",
    "text": "Would we need a custom deal pipeline for each event? Thats really what I'm trying to avoid for workflows. Generating a custom list of registrants"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-08-24 07:26:44",
    "text": "Ah sorry, I wasn’t suggesting using a deal workflow, that was just an example since I don’t have marketing events in my account. You could make a “marketing event”-based workflow perhaps? I’m not 100% sure if that’s an available workflow type though."
  },
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2021-08-24 07:38:52",
    "text": "unfortunately it is not"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-08-24 08:01:21",
    "text": "Then my only other potential workaround would be to create a contact-based workflow, and then check if the marketing event is available as one of the workflow triggers, with the enrollment criteria “scheduled event date is less than X days from now” (assuming the marketing event has a scheduled date property)"
  },
  {
    "poster": {
      "poster_name": "Mark Silverberg",
      "poster_handle": "mark.silverberg"
    },
    "time_stamp": "2021-08-24 08:33:30",
    "text": ":corgi-wave: Hi all. I'm a bit new to integrating with HubSpot but workflows (and the ability to call a webhook/custom code) looks like exactly what I need. I'm struggling to see how I might be able to get a workflow to trigger on object (in this case ticket) creation _and_ update (of any field). Is that possible?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-08-24 09:54:41"
      },
      {
        "time_stamp": "2021-08-24 09:58:10"
      },
      {
        "time_stamp": "2021-08-24 10:01:41"
      },
      {
        "time_stamp": "2021-08-24 10:22:29"
      },
      {
        "time_stamp": "2023-02-22 15:38:03"
      }
    ]
  },
  {
    "text": "hey mark - are you talking about enrollment criteria? if you’d like to enroll a ticket when it’s created &amp; a certain field value is set - the first screenshot.\n\nif you’d like to enroll a ticket when it’s created OR a certain field is filled - second screenshot.",
    "time_stamp": "2021-08-24 09:54:41"
  },
  {
    "poster": {
      "poster_name": "Mark Silverberg",
      "poster_handle": "mark.silverberg"
    },
    "time_stamp": "2021-08-24 09:58:10",
    "text": "Hey <@U022UCJ2X8W> - thanks for the reply. I will try again but last time I tried this, it did not re-enroll for any field change. :thinking_face:"
  },
  {
    "text": "Oh - odd. Did you have reenrollment on?",
    "time_stamp": "2021-08-24 10:01:41"
  },
  {
    "poster": {
      "poster_name": "Mark Silverberg",
      "poster_handle": "mark.silverberg"
    },
    "time_stamp": "2021-08-24 10:22:29",
    "text": "Ah, looks like Last Modified Time cannot be used as a re-enrollment trigger; using 'Ticket name' seems to work.\n\nI also noticed it doesnt run for every change, but if I make two changes pretty close to eachother, it'll batch those changes into a single workflow run, it appears"
  }
]