[
  {
    "poster": {
      "poster_name": "arati",
      "poster_handle": "desai"
    },
    "time_stamp": "2024-11-12 02:41:51",
    "text": "Hi guys, how and which are options important for the content editors to keep while developing the HubSpot project"
  },
  {
    "poster": {
      "poster_name": "KiriChili",
      "poster_handle": "kirishanth.rajaraj"
    },
    "time_stamp": "2024-11-12 06:23:15",
    "text": "Hey everyone, how do child themes work? If i change a CSS file in the parent theme will the child theme get that change aswell?\nIf first i change a CSS file in the child theme and then change the same CSS file in the parent theme with different changes, how will the changes be saved?",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-11-12 06:28:06"
      },
      {
        "time_stamp": "2024-11-12 06:28:17"
      },
      {
        "time_stamp": "2024-11-12 06:35:29"
      },
      {
        "time_stamp": "2024-11-12 06:44:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BaBu",
      "poster_handle": "babu522"
    },
    "time_stamp": "2024-11-12 06:28:06",
    "text": "Please create a child theme and move all folders, such as the CSS folder, from the parent theme to the child theme. This way, any necessary CSS changes can be made directly in the child theme without needing to edit the parent theme."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2024-11-12 06:28:17",
    "text": "Think of the child theme styles as additional styles if they are net new. But overrides if they have the same name in the parent theme."
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-11-12 06:35:29",
    "text": "Out of the box a child theme inherits everything from the parent theme, so if you update any file in the parent theme, the child theme gets the update too, if on the child theme you need to overwrite some modules/styles, just create that module/css with the same name and path and the child theme will get that module/style instead of the default one from the parent theme"
  },
  {
    "poster": {
      "poster_name": "KiriChili",
      "poster_handle": "kirishanth.rajaraj"
    },
    "time_stamp": "2024-11-12 06:44:00",
    "text": "Great thanks for the help."
  },
  {
    "text": "How do I take this global group file and include it in the newer HubSpot drag and drop templates. Is that possible?",
    "time_stamp": "2024-11-12 10:47:20",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-11-12 10:53:09"
      },
      {
        "time_stamp": "2024-11-12 15:53:07"
      },
      {
        "time_stamp": "2024-11-12 21:57:37"
      },
      {
        "time_stamp": "2024-11-13 07:32:17"
      },
      {
        "time_stamp": "2024-11-13 07:34:33"
      }
    ]
  },
  {
    "text": "This is the file I want to include. Is there a way to grab an embed code for this? I tried this and it doesn't seem to work:\n\n{% include_dnd_partial path=\"/generated_global_groups/30974354616.html\" %}",
    "time_stamp": "2024-11-12 10:53:09",
    "edited": {
      "time_stamp": "2024-11-12 10:56:41"
    }
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-11-12 15:53:07",
    "text": "Hey <@U071YF9HQF3>,\nI would try to copy the content of the file, create a new html file in your theme, paste the copied content into it and go from there.\n\nIf I might share my honest opinion:\nDon't mix things up. The old template elements were good and are still working good if you stay inside the old templates. The new themes can work with old elements, but I wouldn't mix them. You'll most likely will end up quite deep in a rabbit hole. Especially since the generated file - most likely - requires/relies on some files of the old template to work properly. Said this, you'll have to copy the CSS and maybe JS files to the new theme and it will become some sort of Frankensteins Monster right from the start. Don't recommend it.\nAlso - if I'm not completely off -  generated_global_groups elements will be deleted once you'll delete the original file in the Design Manager. Of course you don't have to delete the old files but in terms of portal cleanliness you should delete unused files at some point...\n\nTL;DR:\nI recommend to recreate everything from scratch in the new theme if possible"
  },
  {
    "poster": {
      "poster_name": "Reece Sim",
      "poster_handle": "reecesim2021"
    },
    "time_stamp": "2024-11-12 21:57:37",
    "text": "<@U071YF9HQF3> If you right click the template file in design manager there's an option to convert to hubl, which will create a new file in the updated format, but the HTML it generates is quite hard to read and refactor, if it's a simple addition, you should be able to find the right place for it and paste it in. Otherwise, rebuilding the template in HubL from scratch is the next best option"
  }
]