[
  {
    "poster": {
      "poster_name": "Deborah Wolleswinkel",
      "poster_handle": "deborah198"
    },
    "time_stamp": "2022-03-21 03:26:56",
    "text": "Hi Everyone!\n\nQuick question on something I hope one of you might now the answer to ... On our website , we have a \"request a demo\" HubSpot form. I am looking to make this form interactive on two aspects/properties:\n\n1. Marketplace revenue; when high, show meeting link of round robin directly\n2. Region; connect the right round robin of that region.\n\nI have tried using a two step form that saves the first answers as a separate submission; and then using an interactive CTA to lead the visitor to either the meetinglink or the home page. However, the storing of the data and adjusting the CTA takes more than 20 seconds which is too long for my visitors.\n\nAnyone who knows how I can embed the meetings tool based on the user's input? Or how I can make an interactive form like this?\n\nMany thanks!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-21 09:15:38"
      },
      {
        "time_stamp": "2022-03-22 05:08:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alexander Wazin",
      "poster_handle": "support432"
    },
    "time_stamp": "2022-03-21 06:58:44",
    "text": "ooohh, I just discovered there is a conversations API beta group in the forums, just stumbled upon it by random google searching, will post there as it's targeted, will let you guys know how it goes!"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-03-21 07:02:31",
    "text": "hey!  i will move that conversation over there for you!  was just about to look at it anyway"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-03-21 07:03:55",
    "edited": {
      "time_stamp": "2022-03-21 07:04:28"
    },
    "text": "and i think you will be happy with the beta :slightly_smiling_face:\nI <https://developers.HubSpot.com/docs/api/conversations/conversations#get-actors|think this> is what you are looking for"
  },
  {
    "poster": {
      "poster_name": "Alexander Wazin",
      "poster_handle": "support432"
    },
    "time_stamp": "2022-03-21 07:11:09",
    "text": "Got it, cheers Dennis!"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-21 09:15:38",
    "text": "Hey Deborah, I’ve build similar things a few times in the past and each time it’s a little bit different. Sometimes I’ve had the best luck adding a quick “interstitial” page or function as you seem to be using here, but in your case I think a combination of AJAX on the page and a serverless function would deliver the best possible UX for your users. The basic flow would be to listen for the fields in question (and/or using HubSpot’s smart content for IP location to automatically detect region) and once those vectors are known query the function to determine the right link or redirect address to present the user with the intended meeting module.\n\nIf you have any more questions here or need any assistance I’d be happy to talk further via DM."
  }
]