[
  {
    "poster": {
      "poster_name": "Christopher S. Penn",
      "poster_handle": "cspenn"
    },
    "time_stamp": "2020-01-28 08:39:55",
    "text": "Hi! I'm Christopher Penn, chief data scientist and terrible coder from <http://TrustInsights.ai|TrustInsights.ai>. Been using v1 API in R for over a year, jumped in here as I start to figure out v3 API. Nice to meet you all."
  },
  {
    "poster": {
      "poster_name": "Erik Hallgren",
      "poster_handle": "erik.hallgren"
    },
    "time_stamp": "2020-01-28 12:41:03",
    "edited": {
      "time_stamp": "2020-01-28 12:46:03"
    },
    "text": "Hi, Erik here reaching out as a newcomer! I am a marketing designer for Vivantio, a Boston based service management software company. My team and I are looking to take further advantage of our HubSpot account and build out our blog and landing pages using the HubSpot platform. We will be using it in conjunction with our main WordPress hosted website. I will be taking the lead on building out some customized modules and templates for our team and am looking forward to getting started learning some useful tips and tricks from the developer community. :male-technologist: :+1:"
  },
  {
    "poster": {
      "poster_name": "Brennen Carroll",
      "poster_handle": "brennen"
    },
    "time_stamp": "2020-01-28 13:20:43",
    "text": "Ayyo, just wanted to introduce myself as I think I will be posting in here more and more as time goes on. My name is Bren, I'm a Marketing Operations Associate at REC Philly, a Philadelphia startup that provides tools, resources and community to various different types of artists. Just like Erik above me, We will be using HubSpot for blog and LP, and use WP for our main site.\n\nMy job is split between normal marketing responsibilities (what I was hired for) and web design/IS (what was added on after my internship ended). I'm a quick learner so I don't mind taking on new challenges, and I had a bit of HTML experience from managing some sites at previous internships, but my current position is a lot more in depth.\n\nI am currently trying to tackle a problem with our blog layout page. Not sure the best channel to post that in, but I went ahead and popped it in the <#CDSFETF5X|help-the-community> channel. If anyone could help me with that, I would be very very very very grateful. Until then I'll be binge watching Hub Academy, but someone with some experience making custom blog listings in Hub would be super clutch."
  }
]