[
  {
    "poster": {
      "poster_name": "Christopher Chiha",
      "poster_handle": "christopher051"
    },
    "time_stamp": "2022-04-25 01:56:45",
    "text": "Hello,\nI want to add an \"\"If branch\" in my workflow that check if a date in side my deal in more than a week ago / more than a month ago.\nHow can i achieve this ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-25 05:44:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-04-25 05:44:51",
    "edited": {
      "time_stamp": "2022-04-25 05:45:11"
    },
    "text": "Hey Christopher, this should be relatively simple. Is this a deal-based workflow? Also, what date field do you want to check?"
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-04-25 05:47:05",
    "text": "We don’t publish or guarantee any enrollment rates, but you shouldn’t have any issues enrolling 20k contacts daily. I’d expect that most days they should all be enrolled within an hour of the scheduled time, if not faster"
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-04-25 05:51:39",
    "text": "I tried to do this in HubSpot, but there is no way to do it. However, if you use Zapier you can do this by adding a delay until the time of the activity and then doing the step you want. In your case, wait until date of meeting and then create a task"
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-04-25 05:52:08",
    "edited": {
      "time_stamp": "2022-04-25 05:52:19"
    },
    "text": "Zapier also allows to for example say ‘1 day and 6 hours after time of activity, create a task’"
  },
  {
    "poster": {
      "poster_name": "Shanley Rosero",
      "poster_handle": "shanley.rosero"
    },
    "time_stamp": "2022-04-25 13:00:34",
    "text": "Hi,\nHas anyone tried using custom coded workflow for cleaning up data and deduplication - or any process in this case. What I wanted to ask is how you would handle API timeouts in the custom coded workflow? Currently, when a large volume of records gets enrolled in a workflow (through import) they will be processed at the same time, when the workflow has a custom code with the HubSpot API inside it would likely cause a timeout."
  },
  {
    "poster": {
      "poster_name": "Darian Vretenar",
      "poster_handle": "darian.vretenar"
    },
    "time_stamp": "2022-04-25 14:13:40",
    "text": "Hi <@U02P3JPAV3Q> - there's a 20sec timeout and can use up to 128 mb of memory, everything above will cause an error."
  },
  {
    "poster": {
      "poster_name": "Shanley Rosero",
      "poster_handle": "shanley.rosero"
    },
    "time_stamp": "2022-04-25 14:26:35",
    "text": "<@U01ASFZL4UA> Thanks for the input, is there a way you were able to maximize this limit regardless of the volume of records enrolled in the workflow?"
  },
  {
    "poster": {
      "poster_name": "Darian Vretenar",
      "poster_handle": "darian.vretenar"
    },
    "time_stamp": "2022-04-25 14:28:54",
    "text": "It's not possible at this moment. But, to give you more specific answer - please DM, I need more details about the flow."
  }
]