[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 07:32:49",
    "text": "just sharing the stat because it’s interesting. We’re now at 53 users.\n\nIt appears Google Chrome updates extensions only when someone restarts the browser or under certain conditions(which makes sense web pages are a priority over extensions) anyhow \nIt’s interesting to see how the flow of updates gets to people. It can take  several days for someone to get a new version (likely because many people just leave computers on all the time and if they do they probably have google chrome open)\n<https://spin.d.pr/ydfEno+>\n\nAnyhow I’m excited to get the next big update out, just gotta find some time to squash a few bugs and test a little more. Some features coming - big improvements to the dark theme. Few more useful buttons/links, and support for spanish speaking users."
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-12 10:48:21",
    "text": "yeah.. that kind of people like me that hibernate the system too xD"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-12 10:49:24",
    "text": "we have a good growing number of devs using it :+1:"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-12 10:49:42",
    "text": "dark devs... :metal:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 11:26:14",
    "text": "haha, yea wish I  knew a way to track usage of the dark theme.\n\nEventually I’m going to add google analytics to it and tag each button, but I’m not sure how to track how many users of the dark theme there are. (click events likely wouldn’t be a good way to measure)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-12 17:26:14",
    "text": "Small patch released. Help button and revert to DM1 is moved and styling adjusted",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-07-13 10:22:50"
      },
      {
        "time_stamp": "2018-07-13 10:43:33"
      }
    ]
  }
]