[
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2020-07-06 08:27:10",
    "text": "Hi everyone! I’ve seen this asked a couple of times in the past, but haven’t seen any responses within the last 2 years. Is it possible to populate a choice field’s options with content from HubDB within a custom module?",
    "reply_count": 9,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-07-06 08:31:40"
      },
      {
        "time_stamp": "2020-07-06 08:33:37"
      },
      {
        "time_stamp": "2020-07-06 08:34:14"
      },
      {
        "time_stamp": "2020-07-06 08:38:13"
      },
      {
        "time_stamp": "2020-07-06 12:10:55"
      },
      {
        "time_stamp": "2020-07-06 12:15:26"
      },
      {
        "time_stamp": "2020-07-06 12:17:12"
      },
      {
        "time_stamp": "2020-07-06 12:17:12"
      },
      {
        "time_stamp": "2020-07-06 12:20:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-07-06 08:31:40",
    "text": "<@U2H3TT8F2> <@U7SL518D6> I know that we don't have direct mapping from hubdb to do this.. Have you seen how other achieve this?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-06 08:33:37",
    "text": "It’s not possible to directly do it. I have heard of someone using a work-around where they used fetched the HubDB data, and used that to generate field values for their module field. I don’t recall who did that nor is that a perfect solution."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-06 08:34:14",
    "text": "depending on the use-case a text field may solve for what you need."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-07-06 08:38:13",
    "edited": {
      "time_stamp": "2020-07-06 08:38:19"
    },
    "text": "Agreed, you _might_ be able to set a variable using the list functions like <https://developers.HubSpot.com/docs/cms/hubl/functions#append|append>, but one thing to be cautious of is if someone else were to go in and delete one of the values in the hubdb table, it could break functionality on pages where that value was set.\n\nTo Jon’s point, a text field may be the best option. If you can provide a use-case, we may be able to help provide better direction"
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2020-07-06 12:10:55",
    "text": "So the general idea is to give the content editor the ability to choose which items they want displayed.\nFor instance, HubDB may contain all case studies (page urls, images, etc). A single module instance would then give the content editor a drop down to choose which case study to use. This can be accomplished by adding the choice at the template level, however then you can’t have multiple instances of the module on the same page with different content."
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2020-07-06 12:15:26",
    "text": "Right now, the content editor can use a text field to input the case study’s id, but that doesn’t feel like the best experience."
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2020-07-06 12:17:12",
    "text": "Thanks <@U7SL518D6> and <@U2H3TT8F2>!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-06 12:17:12",
    "text": "You definitely CAN have modules on the page with different content.\n\nWhat we’re saying is since there currently isn’t a field for picking a HubDB row, you would use a text field to select an id, or a manually generated choice field. I suggest searching the idea forum for a HubDB row field idea and upvoting or creating your own entry to suggest it. The votes help us determine demand for new functionality and help us to improve focusing on the functionality that is truly useful."
  },
  {
    "poster": {
      "poster_name": "Reuben",
      "poster_handle": "reuben.levine"
    },
    "time_stamp": "2020-07-06 12:20:36",
    "text": "Right, so you’re saying to have a text field that allows the content editor to input an ID (for example), and then that ID can be used in the HubDB query to get the correct row information, right?\nThat’s how it’s currently set up, I was just hoping to automate it for the content editors.\nI’ll take a look through the idea forums. Thanks!"
  }
]