[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2023-02-10 05:22:52",
    "text": "That would be a fantastic improvement! Going to upvote this right away.\n\nFrom my experience, marketers don’t use native HubSpot CTA to their full potential because of styling routines. They might be afraid to do something wrong by applying styles manually each time + everything described in the idea submission.\n\nHope the HubSpot team will find time to improve that experience making it better than cloning existing CTA to apply the styles :crossed_fingers:"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2023-02-10 05:36:37",
    "text": "Agree with <@U3T21PDBK> on this. I’d vote for having a separate tab for settings.\n&gt; • Content – what a screen reader would read\n&gt; • Styles – visually changes\n&gt; • Settings – behavior / functionality\nThis makes total sense to me, at least as a theme creator. Sometimes I need a user to set numbers, for example, for a quantity of, say, slides or rows, etc., or for speed animation. For me, those are neither content nor style. A tab for “functionality/behavior” would significantly improve storing those functionality settings.\nFrom what I’ve seen working with marketers, they perceive content as text to fill in or images to upload. Everything that is neither styles (colors, sizes) nor text/image is confusing for them to be among what they perceive as “content”.\n<@U7SL518D6> hope you could consider our arguments here :wink:"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-02-10 05:44:35",
    "text": "I also agree with <@U3T21PDBK>, sometimes they do not fit in either of content or style. After all, there is a good reason why other page builders added it. Also, if there are  moments where the marketers things \"hmm is that content or style ( to determine whether to click on tab 1 or 2), those are moments of confusion that might be eliminated with the third tab. In addition to that, a settings tab would make each tab smaller on its own, making all of them much more tidy"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2023-02-10 05:49:25",
    "text": "Good <@U0429V78FDK> mentioned another issue concerning repeaters that needs to be addressed.\n\nHere’s an example. We have a custom module — a slider with numerous slides in it. Let’s say a marketer wants to style buttons separately for one slide — a green button, and another, blue one.\nThis means we will store styles for separate slides and the slide’s content in the Content tab since we can’t access styles for a single repeater from the Style tab. This pattern breaks all the consistency and expected placement for module settings.\n\n<@U7SL518D6> is this something could be improved or at least considered to be added to improvement roadmap?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-02-10 10:28:39",
    "text": "Regarding the settings tab, y'all have good arguments for it. I will raise them to the team. That's not a guarantee or commitment to a timeline, but i think the arguments here are persuasive.\n\n\nRegarding the repeaters: this is a known area of the experience that can be improved.\n\nI think the issue for repeaters is finding a solution that makes sense both for the developer and the content creator UX. Would love to hear folks thoughts on the repeater style field issue, though probably best to have in a separate thread to prevent confusion"
  }
]