[
  {
    "poster": {
      "poster_name": "Sam Sharples",
      "poster_handle": "sam.sharples"
    },
    "time_stamp": "2023-02-09 04:44:27",
    "text": "*Save custom CTA styles as named options*\n\nPlease upvote this :pray:  <https://community.HubSpot.com/t5/HubSpot-Ideas/Save-custom-CTA-styles-as-named-options/idi-p/350963>",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-02-09 12:34:41"
      },
      {
        "time_stamp": "2023-02-09 12:55:31"
      },
      {
        "time_stamp": "2023-02-10 05:22:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-02-09 11:41:16",
    "text": "Definitely keep sharing your thoughts here. This is a complicated thing.\n\nThe content vs style division we currently see can be thought of in a11y terms. If it visually changes something but does not impact meaning or content, then it goes in the style tab.\n\n&gt; Example: you have a card module - the field is a color field for determining the border of the card.\nIf it Impacts the content’s meaning then it’s content.\n&gt; Example: you have a module with 3 cards for a pricing page - the field determines which card gets labeled as the “Best value”, which results in an aria label, a border color difference and a CSS ::before/::after ribbon in the corner of the card that says “best value”.\nA Settings tab might be interesting but I’m not sure it would help you reason about where options were vs potentially make it more difficult to reason about."
  },
  {
    "text": "• Content – what a screen reader would read\n• Styles – visually changes\n• Settings – behavior / functionality\nTake the new default HubSpot image grid module, for instance. Currently, an entire group is dedicated to “settings”. That would be best suited in a settings or advanced tab. See webflow and elementor screenshots. Much older and much more mature page builders use it because some settings do not fit in styles or content",
    "time_stamp": "2023-02-09 11:52:07"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2023-02-09 12:34:41",
    "text": "Nice! upvoted!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-02-09 12:55:31",
    "text": "upvoted - one thing you might consider, it's possible to define custom styes in the theme and apply them to the CTAs (we use the Link (no style) CTA setting and all of the styles are applied by the theme)."
  }
]