[
  {
    "poster": {
      "poster_name": "Rob Butler",
      "poster_handle": "rob.butler"
    },
    "time_stamp": "2019-09-05 03:05:43",
    "text": "Hi all, hoping someone can help point me in the right direction.\nI'm trying to create a module that basically swaps out the editable areas given in an email template at the UI level when a user is creating an email, which of course updates what is displayed on the email itself (and each widget can be edited on a per email basis). The purpose would be so they can swap out the fields depending on what kind of email content they need to send while keeping it as one template.\nTo achieve this, I thought I could make a module to insert that asks the user to select the type of content (which I have done). I've created the field groups and also put booleans in for \"show intro\" for example, making it flexible enough to hide sections if not used. The trouble I am having is accessing the modules boolean value and using an if statement to use code x if true or code y if false.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-10 06:39:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "CalypsoNick",
      "poster_handle": "nick585"
    },
    "time_stamp": "2019-09-05 11:37:19",
    "text": "Can you not use Media queries inside the CSS of a module? only seams to work if I put them in my general css file ?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-05 11:40:49"
      },
      {
        "time_stamp": "2019-09-05 11:43:18"
      },
      {
        "time_stamp": "2019-09-05 11:43:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2019-09-05 11:40:49",
    "text": "You definitely can"
  },
  {
    "poster": {
      "poster_name": "CalypsoNick",
      "poster_handle": "nick585"
    },
    "time_stamp": "2019-09-05 11:43:18",
    "text": "ok thank god! super strange but it's not my original build I'm working in so I won't worry this time"
  },
  {
    "poster": {
      "poster_name": "CalypsoNick",
      "poster_handle": "nick585"
    },
    "time_stamp": "2019-09-05 11:43:40",
    "text": "thanks B"
  }
]