[
  {
    "poster": {
      "poster_name": "Stu Goymer",
      "poster_handle": "stu"
    },
    "time_stamp": "2019-09-26 03:16:54",
    "text": "Greetings everyone. I have a question about updating custom modules.  I've created many for a client that are all working fine. They have asked for some small edits and tweaks.  To my shock, they say that when a module is updated (in any way it seems) that all the content in existing pages is LOST!!!  (the content reverts to default content) Now surely that has to be a bug or screw up by me, otherwise how can dev's maintain modules?  I said I would ask you knowledable people here. *My question is: if you update a custom module, by changing code or adding a new field, will it reset all content in existing pages that contain the module?*  :fearful: and if that shouldn't happen what do you think the reason could be?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-09-26 03:27:03"
      },
      {
        "time_stamp": "2019-09-26 03:30:35"
      },
      {
        "time_stamp": "2019-09-26 03:31:47"
      },
      {
        "time_stamp": "2019-09-26 03:36:02"
      },
      {
        "time_stamp": "2019-09-26 03:57:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2019-09-26 03:27:03",
    "text": "I can think in two main reasons why it could been lost:\n- Slug of fields/groups changed. (like you wrapped your fields in a new group the slug will change and the content will be lost like `group_slug.field`\n- Remove the CM and add it back to the template or in the content editor. I believe the internal ID associated will change each time you do this and therefor the content is lost"
  },
  {
    "poster": {
      "poster_name": "David Duymelinck",
      "poster_handle": "david.duymelinck"
    },
    "time_stamp": "2019-09-26 03:30:35",
    "text": "Another reason is an error in the custom module that the module validation didn't catch."
  },
  {
    "poster": {
      "poster_name": "Stu Goymer",
      "poster_handle": "stu"
    },
    "time_stamp": "2019-09-26 03:31:47",
    "text": "Thanks for reply <@U7ADCU3BM>. So it shouldn't happen then.  So if I add a new field, (leaving the exiting intact) would that break the module? And if I make a change just to the CSS part, that should be OK?"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2019-09-26 03:36:02",
    "edited": {
      "time_stamp": "2019-09-26 03:58:37"
    },
    "text": "Yeah I think that should be fine.\nIf something breaks, I believe support should be able to revert to a prev status and maybe find the cause.\nTho, if you have issues with that portal, I suggest you do some extra tests with dummy pages and CMs before"
  },
  {
    "poster": {
      "poster_name": "Stu Goymer",
      "poster_handle": "stu"
    },
    "time_stamp": "2019-09-26 03:57:42",
    "text": ":+1: will do"
  },
  {
    "poster": {
      "poster_name": "Farooque Abdullah",
      "poster_handle": "farooqueab98"
    },
    "time_stamp": "2019-09-26 06:22:54",
    "edited": {
      "time_stamp": "2019-09-26 06:28:32"
    },
    "text": "Hello Folks, I have just created a form using raw HTMl in the form section .\nInitially, I am editing that form on CodePen using CSS-Class from this link   <https://designers.HubSpot.com/docs/cos/HubSpot-form-markup>.\nBut I Could not beautify it Properly as there is no any source where I could get the CSS in  organised manner.\nSo Could any one help me regarding this Problem.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-26 06:39:51"
      },
      {
        "time_stamp": "2019-09-26 07:24:04"
      },
      {
        "time_stamp": "2019-09-26 07:29:19"
      },
      {
        "time_stamp": "2019-09-26 07:58:21"
      },
      {
        "time_stamp": "2019-09-26 10:06:37"
      },
      {
        "time_stamp": "2019-09-29 09:52:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-26 06:39:51",
    "edited": {
      "time_stamp": "2019-09-26 07:18:44"
    },
    "text": "Could you elaborate on what you feel is not organized or clear on that page? Would love to know so we can improve it."
  },
  {
    "text": "Basically, This form will be outside from HubSpot Environment i.e  any other external environment (not on HubSpot ) And It Looks like  the Image which I have attached.",
    "time_stamp": "2019-09-26 07:24:04"
  },
  {
    "text": "And while copying the HTML file file from form I am only getting this type of Code.\nHow do I know which tags comes under which div or Class/ID.",
    "time_stamp": "2019-09-26 07:29:19"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-26 07:58:21",
    "text": "It should be nearly an identical html structure with the same class names and everything, as in that page. I am recreating the form from that page to test.\n\nregardless, you can add your own css class either using the embed code customizations or put a div around the embed code and style based on that div’s class or id"
  },
  {
    "poster": {
      "poster_name": "Farooque Abdullah",
      "poster_handle": "farooqueab98"
    },
    "time_stamp": "2019-09-26 10:06:37",
    "text": "Thanks for your Help."
  }
]