[
  {
    "poster": {
      "poster_name": "Justin Bevolo",
      "poster_handle": "jbevolo"
    },
    "time_stamp": "2023-09-29 08:47:34",
    "text": "Hey Christopher - I would suggest integrating with the v3 API for any new projects. Do you have an idea of which endpoints your application would end up needing? Maybe something like: create list, add objects to list, read objects?"
  },
  {
    "poster": {
      "poster_name": "Christopher Barnwell",
      "poster_handle": "christopher.barnwell"
    },
    "time_stamp": "2023-09-29 10:24:11",
    "text": "that sounds about right, some of our lists are quite dynamic (albeit not using dynamic lists since the update/management of said lists will be done on our side alongside creating the contacts prior to list creation)\n• create list (which i understand y'all will roll out in Q4 at some point)\n• add contacts to list\n• read list (preferably be able to see the different email campaigns a list is attached to and if this list is being used in other lists)\n• update list membership (i.e. cross reference our lists for deltas between which contacts are in a list) \n"
  },
  {
    "poster": {
      "poster_name": "Justin Bevolo",
      "poster_handle": "jbevolo"
    },
    "time_stamp": "2023-09-29 10:34:43",
    "text": "Awesome, sounds good.\n\n&gt; (preferably be able to see the different email campaigns a list is attached to and if this list is being used in other lists)\nThis is an interesting point and something we can look into. Thanks for the feedback!"
  },
  {
    "poster": {
      "poster_name": "Christopher Barnwell",
      "poster_handle": "christopher.barnwell"
    },
    "time_stamp": "2023-09-29 10:40:06",
    "edited": {
      "time_stamp": "2023-09-29 10:41:22"
    },
    "text": "cool, thanks, that data is very valuable to our customers since we provide analytics to our customers about how their tailored target audiences perform.\n<https://legacydocs.HubSpot.com/docs/methods/cms_email/get-the-details-for-a-marketing-email>\ncurrently, as I do my object mappings for the project, we found a way to sort of do this this via `mailingListsIncluded` and `allEmailCampaignIds` in legacy docs, which I understand is a separate set of endpoints than the contact lists API"
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Ali Khader",
      "poster_handle": "khader.a"
    },
    "time_stamp": "2023-09-30 00:32:20",
    "text": "Hi, will the upcoming v3 API have the ability to create lists and use associated objects as filters for it?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-01 20:43:39"
      }
    ]
  }
]