[
  {
    "text": "Yes, you have to manage a responsive screen in HubSpot.\nthis code paste into your json file",
    "time_stamp": "2023-11-30 03:54:04",
    "edited": {
      "time_stamp": "2023-11-30 03:55:21"
    }
  },
  {
    "text": "Hey, Any reason why the gtag codes I've added on the head HTML on one of the landing pages made on HubSpot not reflecting on the page itself?",
    "time_stamp": "2023-11-30 05:06:30",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-30 07:22:28"
      },
      {
        "time_stamp": "2023-11-30 23:06:23"
      },
      {
        "time_stamp": "2023-12-01 01:55:52"
      },
      {
        "time_stamp": "2023-12-01 04:59:46"
      },
      {
        "time_stamp": "2023-12-01 06:07:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-30 06:11:22",
    "text": "hmm nice so that adds another breakpoint that users can turn off display in the editor?"
  },
  {
    "text": "at the top, where it says “choose a domain to edit”, select the domain you are trying to apply this code to and see if you are overriding that independently.",
    "time_stamp": "2023-11-30 07:22:28"
  },
  {
    "poster": {
      "poster_name": "Mattis Rosenkranz",
      "poster_handle": "m.rosenkranz"
    },
    "time_stamp": "2023-11-30 08:38:14",
    "text": "Oh yeah I saw that. It adds the mobile breakpoint but for now doesn’t support any other ones. But thank you, adding a module with a repeater and drag and drop areas is a great idea. I didn’t think about dnd areas being possible in modules"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-30 08:49:57",
    "text": "that json looks like an array of objects, so if it is correct you can have more than one, then you would add a similar object in that json that reflects the other breakpoints you require "
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-11-30 18:28:05",
    "text": "<@U04SZGSQJF4> you might try editing the module in the editor to select the image again.\n\nWhen you add content in the code, it's a placeholder and when it's added to the page HubSpot views it as \"default\" content.\n\nI've noticed recently more than ever that more default content is hidden if untouched in the editor, this prevents placeholder content from unintentionally publishing to live pages.\n\nFrom your image module in the page editor, click \"replace\" to reselect the image from your HS files.\n\nIf that doesn't work, then you'll need to continue with Evelynn's suggestions to review the markup."
  },
  {
    "text": "Yes tried this, I am overriding it independently. Any other detail I need to check? Also, do I need to publish the page every time I add a code or it get autosaved?",
    "time_stamp": "2023-11-30 23:06:23"
  }
]