[
  {
    "poster": {
      "poster_name": "Danny Friz",
      "poster_handle": "danny.friz"
    },
    "time_stamp": "2023-11-08 06:15:36",
    "text": "Hello Community, I need your help and support. It turns out that we migrated the website previously hosted on AWS to HubSpot. Within this migration we do not correctly consider the redirects and we are presenting problems with 404 errors. It turns out that our website <https://mydomain.com/payments/id_dynamic>, had to rewrite with a 301 to <https://mydomain2.com> /id_dynamic.\n\nHow do I adjust the path and dynamic parameters in the domains/url-redirects functionality of the website?\n\nThank you very much in advance if you have had a similar experience and how you have resolved it.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-08 08:37:15"
      },
      {
        "time_stamp": "2023-11-08 08:46:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-11-08 08:37:15",
    "text": "Hey there! Redirecting dynamic URLs in HubSpot can be a bit tricky since HubSpot's standard URL redirects tool doesn't support direct regex out of the box. But don't worry, you still have some options.\nHere's what you can do:\n1. *HubL and HubDB approach*: If you have access to HubSpot CMS Hub Enterprise, then you can use a combination of HubL and HubDB to handle dynamic URL redirects. You would create a table in HubDB to store your old and new URL patterns and a serverless function or a dynamic page that checks this table and performs the redirect as needed with the appropriate status code.\n2. *External Service*: If the above approach doesn't work for you, and you're handling a significant number of dynamic redirects that are critical for SEO, you might consider using an external service or your DNS provider to write more complex redirection rules. Services like Cloudflare can handle regex-based redirection at the DNS level.\n3. *API-based Redirects*: With HubSpot's CMS APIs, you can create redirects programmatically. However, please note that HubSpot's Redirects API currently supports simple patterns. For dynamic patterns, you typically would still need to have some server-side logic to create individual redirects for each path.\nSince you're dealing with dynamic URL parameters, you'll likely need to handle each case programmatically or with server-side logic because each `/id_dynamic` needs to redirect to the equivalent `/id_dynamic` on the new domain.\nKeep in mind, if you're going to attempt the HubL and HubDB route, you'll need someone with development experience on the HubSpot platform.\nRemember to always test redirects in a staging environment if possible before deploying them live, to avoid any further issues with your live site."
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-11-08 08:46:21",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1699458274145639?thread_ts=1699449125.789379&amp;cid=C22PU4LV8>"
  },
  {
    "poster": {
      "poster_name": "Alonso De La Cruz",
      "poster_handle": "desarrolloweb2"
    },
    "time_stamp": "2023-11-08 12:30:22",
    "text": "Hello everyone, I need your help, I'm trying to make a custom module that is a navigation menu for my website. I added a menu field, but, currently, I don't know how to get the menu elements on my module to intereact with it. Also, I want to highlight my current on the menu, does anyone have some advice or documentatio to help me? Thank you so much in Advance!"
  },
  {
    "text": "Greetings to all! I've developed numerous modules for the HubSpot marketplace. After the initial module was published, I made some updates to it, and now I'm resubmitting it as version 2. However, I'm encountering an issue that says...",
    "time_stamp": "2023-11-08 23:00:18"
  }
]