[
  {
    "poster": {
      "poster_name": "Shannon Young",
      "poster_handle": "shannon.young"
    },
    "time_stamp": "2023-11-29 05:55:37",
    "text": "Does anybody know if AMP renders stuff that sits outside of `{{ content.post_body }}` in a template?"
  },
  {
    "text": "Hi all, im just doing some cleaning of a clients website and when doing an accessibility report of the website we get an issue around ARIA roles in the menu (See image).  Basically, the default HubSpot menu module automatically assigns these roles such as &lt;ul role=\"menu\"&gt; &lt;li role=none&gt; &lt;a role=menuitem&gt; etc.\n\nI've been trying to look into it a bit but i couldn't seem to fix the issue and remove the error in the accessibility report. So, my question is if HubSpot has something in the pipeline to fix the default menu module or if anyone has any ideas or experience with fixing this?",
    "time_stamp": "2023-11-29 06:17:58",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-29 08:11:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James H",
      "poster_handle": "jim834"
    },
    "time_stamp": "2023-11-29 08:11:29",
    "text": "If its the default menu module, you can replicate it in to your custom theme and then edit it how you want it to be"
  },
  {
    "poster": {
      "poster_name": "Mattis Rosenkranz",
      "poster_handle": "m.rosenkranz"
    },
    "time_stamp": "2023-11-29 11:10:39",
    "edited": {
      "time_stamp": "2023-11-29 11:11:23"
    },
    "text": "Hey, does anyone know if there are advanced settings for placing modules into columns in the website editor? From what I see it is only possible to have one breakpoint from desktop to mobile and to switch from all columns next to each other in desktop to all underneath in mobile. It would be very helpful to e.g. say 4 columns in desktop, 2 on tablet and one on mobile.\nHaving more breakpoints seems to be disabled in the theme.json",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-11-29 20:05:51"
      },
      {
        "time_stamp": "2023-11-30 03:54:04"
      },
      {
        "time_stamp": "2023-11-30 06:11:22"
      },
      {
        "time_stamp": "2023-11-30 08:38:14"
      },
      {
        "time_stamp": "2023-11-30 08:49:57"
      },
      {
        "time_stamp": "2023-12-01 02:27:44"
      },
      {
        "time_stamp": "2023-12-01 04:06:32"
      },
      {
        "time_stamp": "2024-03-25 12:06:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-11-29 20:05:51",
    "text": "when i do these i’ll create a custom module with a repeater(acting as the columns) so i have more control of the responsiveness of the elements\n\nto my knowledge that stuff isn’t there yet but i haven’t checked. we build a lot of custom modules still for this type of behavior because of that limitation "
  }
]