[
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2024-07-08 07:42:55",
    "text": "Hm, we have regularly running acceptance tests that use `getSecrets`  that are still building and working.\n\nAny chance you a custom version of typescript or typescript getting used in the build on our servers?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-07-08 07:59:28",
    "text": "Ah, `getSecret` is used at the “top” of a module. You’ll need to use `getSecret` inside of the React component. We do that so that you cannot accidentally “leak” secrets to client code in the browser unless you explicitly pass them as an island prop.\n\nI’ll add that to the documentation to make that more clear (and try to see if we can make a better error message when it is used that way)."
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2024-07-08 08:14:53",
    "text": "<https://github.com/HubSpot/cms-react/pull/72>"
  },
  {
    "poster": {
      "poster_name": "Jesse Maltese",
      "poster_handle": "jmaltese"
    },
    "time_stamp": "2024-07-08 09:51:04",
    "text": "Small oversight on my part in the type gen code for video. I’ll put up a fix to be released in the next version of hs-cms-dev-server. Sorry about that."
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2024-07-08 09:59:08",
    "text": "Sorry for the delay - just getting caught back up from our week of rest. To confirm, what specifically looks to be working differently for you over proxy? Testing my example it looks to be working as expected over proxy so just want to narrow down what you might be seeing on your end as I would imagine it should work the same way in production vs. in the proxy preview."
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2024-07-08 17:53:14",
    "text": "Great! Would this also include a VideoComponent? When logging the video field I could not get any video src, so I was wondering if this works like a Icon/RichtText component where you pass the fieldPath."
  }
]