[
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2024-07-10 07:59:52",
    "text": "Don - thank you for reporting the issue."
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2024-07-10 08:02:36",
    "text": "Traditionally issues are reported through support and follow an internal protocol before reaching eng. However, for this feature (CMS React) we have operated outside of that normal flow to attempt and reduce confusion and miss-communications around more technical issues.\n\nReporting the issue here is probably best (last week we were all out on a global week of rest). Though reporting issues here isn't subject to any formal tracking relative to support, fixes etc."
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2024-07-10 08:02:47",
    "text": "We will take a look at this specific issue."
  },
  {
    "poster": {
      "poster_name": "Don Denton",
      "poster_handle": "don.denton"
    },
    "time_stamp": "2024-07-10 08:10:04",
    "text": "Sounds good. I just want to make sure I am reporting things in the most useful place for your team.\n\nI’ll echo what my coworker, Stephen, <https://HubSpotdev.slack.com/archives/C04AY1H2204/p1719939777022889|said above>: Having access to this in beta has been a life-saver for us! Since the source for your build tools is (understandably) not open, the best way I know to contribute back is by reporting the edge cases you might not be aware of.\n\nI’ll continue to bring issues up here instead of GH going forward. (Assuming I actually run into anything.)\n\nThanks Byron!"
  },
  {
    "text": "hi Everyone, is there an issue with serving responsive images that come from blog templates? im using it as shown as below but it isn't serving responsive images.",
    "time_stamp": "2024-07-10 13:04:43",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-10 13:08:49"
      }
    ]
  },
  {
    "text": "Note: these images are coming from my blog post template that's using hubl. It works fine when i display the image inside hubl but not when I pass them into my react module.",
    "time_stamp": "2024-07-10 13:08:49",
    "edited": {
      "time_stamp": "2024-07-10 13:14:12"
    }
  }
]