[
  {
    "poster": {
      "poster_name": "Gagandeep Singh",
      "poster_handle": "gagan317"
    },
    "time_stamp": "2024-05-20 03:51:55",
    "edited": {
      "time_stamp": "2024-05-20 03:52:06"
    },
    "text": "Hi all, I am trying to create an integration between HubSpot, stripe, and our backend via which we send a quote to our customer from HubSpot and there are a few objects created on the Stripe side once payment is made - subscription, invoice, payment. And at our backend side based on created subscriptions, we assign different services to the customer. For this we are trying to use our own custom quote template and override the functionality of default payment button give by HubSpot. Instead, we are adding our own custom pay button. I am still facing issues while updating the payment status of the quote when payment is made via our custom pay button. Is there any way we can update the payment status of the quote via API or anything? Thanks in advance:slightly_smiling_face:"
  },
  {
    "time_stamp": "2024-05-20 08:00:30",
    "text": "Reminder: Did you know you can message <@U02162GK9SP|sprocky> at any time to get HubSpot development questions answered? It’s an experimental chat bot built to tackle developer questions. It won’t read your code, but can answer a lot of questions about building on the HubSpot platform."
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-20 11:18:20",
    "text": "does anyone know how to route delivery of a form submission to a specific user, and only that user? I’ve not successfully delivered a form to anyone other than the default recipient using notifications_override_email_addresses.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-20 16:08:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-05-20 16:08:14",
    "text": "You could just turn off the notification and then use a workflow to branch out to different recipients with internal email notifications. At least this is how I've done it before <@U06R7807H2L>"
  },
  {
    "poster": {
      "poster_name": "Makoy Cameña",
      "poster_handle": "marcneilc"
    },
    "time_stamp": "2024-05-20 19:19:27",
    "text": "Is there a code/function to push a notification when using private apps?"
  }
]