[
  {
    "poster": {
      "poster_name": "Berta Buxo",
      "poster_handle": "berta.buxo"
    },
    "time_stamp": "2024-05-15 04:01:24",
    "text": "Hello!!!!! can anyone help me determine if it's possible to create a script in HubSpot to determine which products to send via email?"
  },
  {
    "poster": {
      "poster_name": "Berta Buxo",
      "poster_handle": "berta.buxo"
    },
    "time_stamp": "2024-05-15 04:03:46",
    "text": "What I would like is to be able to send emails with products to my clients, but first, I'd like to match the tags of my products with the tags associated with the deal. This way, I can send personalized emails with products."
  },
  {
    "poster": {
      "poster_name": "Hamza Siddqui",
      "poster_handle": "hamza359"
    },
    "time_stamp": "2024-05-15 10:54:54",
    "text": "Hello guys, I am new here. I am creating an integration for HubSpot and I want to display a CRM Card. On my CRM Card I have an Iframe Action which loads my app in the iframe. The only problem is that my app seems to be unable to access the cookies I set, which leads to my authentication not working. Is there a way I can make this work? This seems like a normal use case for Iframe Actions.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-23 11:56:52"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-05-15 10:55:01"
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-15 11:07:27",
    "text": "Anyone know the best practices here?"
  },
  {
    "poster": {
      "poster_name": "Molly Webb",
      "poster_handle": "molly695"
    },
    "time_stamp": "2024-05-15 17:48:33",
    "text": "Is there any way to change/add to the modules that are available in the new CTA editor?"
  },
  {
    "poster": {
      "poster_name": "Jack Xiao",
      "poster_handle": "hong"
    },
    "time_stamp": "2024-05-15 19:51:29",
    "text": "Hi, we are using HS CMS to host our website. We plan to deploy HS 1st party cookie and like to track visitors' activity on the website, Hope someone can help clarify some questions:\n1. Is there a way to identify a visitor as a Contact in HS by building some login status on the website?\n2. If 1 is possible, how to collect the data captured by the cookie and save the data to the HS Contact record?\n3. If a visitor is brand new, no Contact matching, can we add an anonymous Contact with some unique identifier? If this is possible, is there a way to match an anonymous Contact record with a known Contact record after, say, the person logs in?  "
  },
  {
    "poster": {
      "poster_name": "SixStep Solutions",
      "poster_handle": "sixstepsolutions"
    },
    "time_stamp": "2024-05-15 23:56:39",
    "text": "Hi <@U03UQT4SGVC> , From HubSpot Social media tool you can schedule post for Instagram."
  }
]