[
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2024-05-27 01:39:18",
    "text": "Hello, A few days I asked something about the HubSpot api with hubdb. So lets get more in detail to get some better answers :slightly_smiling_face:\n\nI am looking to create a HubSpot website that has a integration with a API this api shows cars for example. is it possible to load the cars from the the cars api to the HubSpot hubdb api so the cars are in my hubdb? or wouldn't this be the best approach because their already is a car api?\n\nAnd my second question is where in my code should this happen?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-27 01:45:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bent Becker",
      "poster_handle": "bent"
    },
    "time_stamp": "2024-05-27 01:45:50",
    "text": "Or should I create a private app for this?"
  },
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2024-05-27 02:31:11",
    "text": "Hello! :wave:\nIs there a way to pause/play HubSpot hosted video (HubSpot player) with Javascript? Not HTML video tag. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Jeroen Olthof",
      "poster_handle": "jeroen"
    },
    "time_stamp": "2024-05-27 03:28:55",
    "text": "I am just curious. If I want to send a random mailing. In this case, we want to send a customer satisfaction mailing to all our customers. Is it possible to do this without creating fields for the questions on the contact entity?"
  },
  {
    "poster": {
      "poster_name": "Tuğba Akçay",
      "poster_handle": "tugba.akcay"
    },
    "time_stamp": "2024-05-27 04:43:29",
    "text": "Hello, when I download the quotes file, I want it to have a page number in pdf, I tried to do it with the page command in css, but it didn't work. Can you help me?"
  },
  {
    "poster": {
      "poster_name": "Zoho",
      "poster_handle": "zohodeveloper280"
    },
    "time_stamp": "2024-05-27 06:10:30",
    "text": "Hello Team\nCan I create the invoice using API?"
  },
  {
    "poster": {
      "poster_name": "Gagandeep Singh",
      "poster_handle": "gagan317"
    },
    "time_stamp": "2024-05-27 06:13:41",
    "text": "Hi guys, we have set up a webhook to synchronize products from HubSpot to our backend system so that we can assign services to our customers based on that once payment is made. For that to work it is important that our product in our backend system is linked with HubSpot products. To link them, we are storing a unique ID from our backend on the HubSpot product as a new custom property. Is there any way that we can add a validation so that if a product has a property entry in it says - the \"imagine-backend-id\" property, only then it can be used while creating quotes? I would like to hide them or throw an error while creating quotes until they have some value in that property. Thank you."
  },
  {
    "poster": {
      "poster_name": "James Brownlee",
      "poster_handle": "james150"
    },
    "time_stamp": "2024-05-27 07:53:52",
    "text": "Hello, hoping someone can help?  I have a public app created, everything is fine until my response is displayed in HubSpot, for all the string values, I get invalid property displayed for the value.\n\nAny ideas what I am missing? \n\nYou would have though a string is a string\nI realised that a currency field requires a currency code, and that displays correctly. Just strings are not."
  },
  {
    "poster": {
      "poster_name": "Conor Linehan",
      "poster_handle": "cplinehan"
    },
    "time_stamp": "2024-05-27 08:39:26",
    "text": "Hey Fabian :wave: I’m an engineer on the CTA team do you have a link to the page causing the issue?"
  },
  {
    "poster": {
      "poster_name": "Silvana Alvarez",
      "poster_handle": "silvana"
    },
    "time_stamp": "2024-05-27 08:53:15",
    "text": "Would anyone have any ideas of tips on the best way to edit an application listed in the marketplace and test it before publishing?\nI have an app in the marketplace and I would like to edit it. Before editing and submitting it for review by the HubSpot team, I would like to test it internally with several people. Does anyone have any advice on how to do this? I'm thinking of creating a private app to test and then editing the published application listed in the marketplace."
  },
  {
    "poster": {
      "poster_name": "Andrea Larrauri",
      "poster_handle": "andrealarrauri"
    },
    "time_stamp": "2024-05-27 12:56:09",
    "text": "Hello everyone. I ran a report in Google Search Console and noticed that most of my articles are not indexed in google due to a \"no index\" tag in the code that I don't find configured in any of the HubSpot settings. I opened a ticket and they told me to join the slack so you can show me how to delete the tag from the page"
  },
  {
    "poster": {
      "poster_name": "Brennan Davis",
      "poster_handle": "brennan761"
    },
    "time_stamp": "2024-05-27 21:22:02",
    "edited": {
      "time_stamp": "2024-05-27 21:22:26"
    },
    "text": "Anyone around right now? I am working with a CMS module that has a linked GraphQL file that has 2 separately named queries on it. How might I tell the module which Named query to use based on a criteria? I.e. If this variable exists, use Query1 otherwise, use Query2. Using something like this currently:\n`{% set post_collection = module.data_query.data.BLOG.post_collection %}`\nHowever, it doesn't know which query I'd like to use."
  }
]