[
  {
    "text": "Hi!\n\nI'm having trouble with sending an email through a connected email domain. According to the domain setup on HubSpot, the domain looks just fine but when we do send an email, the spf becomes “unaligned\" the outbound IP doesn't seem to be included in this pic? The recipients are external addresses.",
    "time_stamp": "2024-05-07 06:11:24",
    "edited": {
      "time_stamp": "2024-05-07 06:13:53"
    }
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-05-07 09:00:04",
    "edited": {
      "time_stamp": "2024-05-07 09:00:08"
    }
  },
  {
    "text": "Hey all, I am trying to find a better way to accomplish putting \"Shipping\" on a quote instead of choosing the \"One-time fee\" option and then typing in \"Shipping\" every time. If it is possible to either 1. Add a Shipping option to the drop-down and then when choosing, it fills in the text \"Shipping\" for me or 2. Have \"shipping\" always there at 0 cost so a user can update it with the appropriate amount. Does anyone have any thoughts? Check screenshot for reference.",
    "time_stamp": "2024-05-07 10:11:17"
  },
  {
    "poster": {
      "poster_name": "Felipe Vogel",
      "poster_handle": "felipe908"
    },
    "time_stamp": "2024-05-07 11:44:01",
    "text": "Hi everyone! I have a question regarding *QUOTES - I appreciate your help in advance!*\n\nMy client is looking to have a functionality where at the time of *quote creation from a deal record*, that the system *uses conditional logic*, and takes a specific property into account where if property = x then the quote should display X language, but if property = Y, then the quote should populateY language.\n\nThis is more of a MSA (Master Services Agreement) instance where if the company might have signed one and they do not want to re send, but whenever they have not, they would like this to populate.\n\nAny tips/ideas?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-05-10 00:44:09"
      }
    ]
  }
]