[
  {
    "poster": {
      "poster_name": "Preet Patel",
      "poster_handle": "pp225622"
    },
    "time_stamp": "2024-05-21 01:16:59",
    "text": "Hi Team, I am new to HubSpot and I wanted to know if it is feasible for my upcoming project.\nI am building a portal for doctors and patients on Webflow. I need to satisfy the following requirements:\n+ Online Consultation between Doctor and Patient\n+ Online Chat between Doctor and Patient\n+ Online Booking System\n+ Online Surveys\nI am not sure if Webflow and HubSpot will allow to transfer data and help me achieve this requirements :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Iaroslav Levytskyi",
      "poster_handle": "iaroslav_levytskyi"
    },
    "time_stamp": "2024-05-21 04:31:38",
    "text": "Hi Team! I have a question about SMTP speed (<http://smtp.hubapi.com|smtp.hubapi.com>)\nI keep finding information about SMTP API rate limits [here](<https://community.HubSpot.com/t5/Releases-and-Updates/New-API-Limits-Coming-Soon/ba-p/418081?_ga=2.83360086.1354136686.1716281890-463225924.1714473004&amp;_gl=1*e07hm*_ga*NDYzMjI1OTI0LjE3MTQ0NzMwMDQ.*_ga_LXTM6CQ0XK*MTcxNjI4MjQyMy41LjEuMTcxNjI4Mzc5NS40OC4wLjA.>), but if I am sending emails via SMTP, without using the API, what limits are there in the Marketing Enterprise package? What is the hourly sending rate and queue? Can someone clarify?"
  },
  {
    "poster": {
      "poster_name": "Debashis Roy",
      "poster_handle": "roy444"
    },
    "time_stamp": "2024-05-21 05:08:50",
    "text": "Hi Team,\n\nI have a simple question. I am confused a little bit. I have a company lookup code that is hosted on the Amazon server. The function of the app when the company is created and modified, it will look into the external server for more information about the company and populate the data to the HubSpot. The external server has a limitation of API calling for the same IP address.\nSo my question is from where will be the GET method called? From inside the HubSpot app developer account or Client HubSpot account? or where is the app code hosting (AWS server)?"
  },
  {
    "poster": {
      "poster_name": "Iaroslav Levytskyi",
      "poster_handle": "iaroslav_levytskyi"
    },
    "time_stamp": "2024-05-21 07:14:10",
    "text": "We have a registration on our website where users fill in their details, including their email. After registration, we expect HubSpot to send a confirmation email.\nTo answer your question, the GET method will be called from our application code hosted on the AWS server. When a company is created or modified, our AWS server will make the GET request to the external server to fetch additional information about the company and then populate the data into HubSpot.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-29 02:54:07"
      },
      {
        "time_stamp": "2024-05-29 02:55:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Iaroslav Levytskyi",
      "poster_handle": "iaroslav_levytskyi"
    },
    "time_stamp": "2024-05-21 07:36:52",
    "text": "<@U074BD7358D>"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-05-21 09:00:06",
    "edited": {
      "time_stamp": "2024-05-21 09:00:12"
    }
  },
  {
    "text": "Hold up, wait a minute. Is this really happening?!?",
    "time_stamp": "2024-05-21 11:23:45"
  },
  {
    "poster": {
      "poster_name": "Cappy Popp",
      "poster_handle": "cappy.popp"
    },
    "time_stamp": "2024-05-21 14:58:37",
    "edited": {
      "time_stamp": "2024-05-21 15:00:45"
    },
    "text": "where do changes made to Theme Settings in the Design Manager UI end up in the file system?\nAs a test, I changed the primary color of a theme (not a child theme, regular theme). I’d expect that change to be reflected in the fields.json file, but that file still shows the original value for the primary color - so where does the filesystem get updated? This relates to using local development: what happens if someone edits the Theme settings in the Design Manager UI? How do developers working locally get these changes if they’re not propagated to the fields.json file (and therefore available via a fetch command)?"
  },
  {
    "poster": {
      "poster_name": "Daniel Kesher",
      "poster_handle": "dan166"
    },
    "time_stamp": "2024-05-21 15:55:17",
    "text": "Do HubSpot staff participate here? It's been a few days since I asked my question <https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1716147905823219>",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-21 19:05:53"
      },
      {
        "time_stamp": "2024-05-23 06:28:02"
      },
      {
        "time_stamp": "2024-05-23 09:15:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-05-21 19:05:53",
    "edited": {
      "time_stamp": "2024-05-21 19:06:22"
    },
    "text": "Hi Daniel, this is a space to ask questions to and build connections with your developer peers also building on HubSpot. It isn’t a HubSpot support space, so no, there aren’t HubSpot staffers answering questions in here. "
  }
]