[
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2024-05-04 06:58:42",
    "text": "Hi developers,\n\nI'm trying to develop a specific functionality on HubSpot and I would appreciate some feedback or ideas. \nI want to create a preview of an article where only the first paragraphs are shown and then on scroll a popup shows up where the user has to subscribe in order to continue reading. \n\nOne way is to hide the content with css/js but once the content is rendered from the backend, there will alwayys be ways for people to find it (by viewing page source or opening the developer tools)\n\nThats why. I'm thinking of truncating the article on the template level, so it does not render at all, then using the pages api, fetch the content and replace it entirely once the form is submitted.\n\nI will track the subscription status on localstorage and then let the user see all the articles based on that.\n\nThe only problem with this is that even after someone subscribes, they will make 2 requests each time to see an article.\n\nIs there a way to save a variable on the 'backend' where i add the conditional logic of what to render on the template level using hubl?\n\nHope it made sense how i explained it.",
    "reply_count": 10,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-04 07:13:20"
      },
      {
        "time_stamp": "2024-05-06 05:37:52"
      },
      {
        "time_stamp": "2024-05-06 05:40:05"
      },
      {
        "time_stamp": "2024-05-06 05:50:16"
      },
      {
        "time_stamp": "2024-05-06 06:04:42"
      },
      {
        "time_stamp": "2024-05-06 06:11:04"
      },
      {
        "time_stamp": "2024-05-06 06:14:15"
      },
      {
        "time_stamp": "2024-05-06 06:15:53"
      },
      {
        "time_stamp": "2024-05-06 06:18:43"
      },
      {
        "time_stamp": "2024-05-06 06:26:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2024-05-04 07:13:20",
    "text": "I've found <https://developers.HubSpot.com/docs/cms/hubl/variables#variables-available-in-all-templates|this> but I can't figure out how the HubSpot stores this, and how reliable it is"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-05-04 13:46:44",
    "text": "Hi <@U071W692K27>\n<https://academy.HubSpot.com/courses/marketing?page=1#topics=web_development;products=HubSpot_cms,integrations;contentTypes=course;certsOnly=false;|HubSpot Academy> has great certifications both on CMS and integrations specifically for developers. Highly recommended!"
  }
]