[
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2024-01-09 02:49:25",
    "edited": {
      "time_stamp": "2024-01-09 02:50:02"
    },
    "text": "Is there a way to place the HubSpotutk cookie without actully showing the display banner, asking here as its a react project so no HubL functions available",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-09 07:15:25"
      },
      {
        "time_stamp": "2024-01-09 07:19:42"
      },
      {
        "time_stamp": "2024-01-09 07:20:50"
      },
      {
        "time_stamp": "2024-01-09 07:27:08"
      },
      {
        "time_stamp": "2024-01-09 07:35:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2024-01-09 07:15:25",
    "text": "Could you give more context? I don’t necessarily see how having HS analytics code on a page (what I assume you mean by placing the cookie) directly forces the cookie banner.\n\n(And I assume this is more of a technical question than a legal question?)"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2024-01-09 07:19:42",
    "edited": {
      "time_stamp": "2024-01-09 07:19:50"
    },
    "text": "Yea, by my understanding in order to get the cookie placed on the browser I need to enable the consent banner in the settings as this is a HubSpot generated cookie, I can't just whip one out myself right?"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2024-01-09 07:20:50",
    "text": "This is a HubSpot hosted site and the issue is I'd like to get the HubSpotutk to pass to an API call but the client already has some adroll cookies and having 2 cookie banners just doesnt look good"
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2024-01-09 07:27:08",
    "text": "I’m definitely not the expert for HubSpot cookie stuff (and especially any legal/regulation stuff), but I believe you are able to configure which domains and paths show the HS cookie banner. And if you/a client use a different cookie banner, it is entirely possible to not show the HubSpot cookie banner and configure that cookie banner to manage the HS cookie (with JS API calls like those in <https://developers.HubSpot.com/docs/api/events/cookie-banner> if needed)"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2024-01-09 07:35:33",
    "text": "Thanks, I'll have a look at this!"
  },
  {
    "poster": {
      "poster_name": "Daniel Mahadi",
      "poster_handle": "daniel.mahadi"
    },
    "time_stamp": "2024-01-09 21:49:39",
    "text": "Hi everyone,\nWe are using HubSpot CMS extensively , we have created many modules with hubl most of the module is showing the static content and little to no interaction feature at all. These modules are widely use in our pages easily in thousands.\n\nAnd recently we need to add more interaction function, like filtering, sorting and interaction between modules.\n\nWe learnt that HubSpot has a ReactJS CMS framework support and we are wondering if anybody here has any advice on better transitioning process from the traditional hubl to ReactJS CMS framework in HubSpot",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-01-10 07:07:06"
      }
    ]
  }
]