[
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2022-03-25 05:46:46",
    "text": "You can, and you won't lose any content on a page. The data is stored under the \"name\". \n\nIf you change that, you'd clear out existing content."
  },
  {
    "poster": {
      "poster_name": "Ana",
      "poster_handle": "aparadis"
    },
    "time_stamp": "2022-03-25 07:29:12",
    "text": "<@UATE4ATHP> Awesome thank you. Duplicate names are allowed, correct? I could have two fields named \"copy\", but with different \"id\"s and be fine?\n\nAlso, the content still exists even after I change the name, right? So if I messed up and changed the name, could I change the name back, and get my content back?"
  },
  {
    "text": "Duplicate names are not allowed on the same level. They can have the same name, if they are in a group.\n\nAnd yes, the content is stored in the page data, under the original name, so yeah if you did change it and then change it back. It'll work again",
    "time_stamp": "2022-03-25 07:33:13"
  },
  {
    "text": "Hey, I was crossposting, but here's what HubSpot did to my fields.json, so if you omit id the name is used for id. Below is how it came back. Not sure how the ID is used internally seeing as how it's a UUID when you construct a module in the editor.",
    "time_stamp": "2022-03-25 07:38:05"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2022-03-25 07:41:00",
    "edited": {
      "time_stamp": "2022-03-25 07:41:04"
    },
    "text": "Weird. I've never had it give an ID like that. It's always a UUID\n\nmaybe its smart enough to know it should be Boolean because you used it in the controlling_field"
  },
  {
    "poster": {
      "poster_name": "Ville Pekkarinen",
      "poster_handle": "ville"
    },
    "time_stamp": "2022-03-25 07:45:12",
    "text": "I just called it boolean because it was a boolean for this test, maybe it's a bit ambiguous :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Ville Pekkarinen",
      "poster_handle": "ville"
    },
    "time_stamp": "2022-03-25 07:46:22",
    "text": "I like to keep the local development fields.json as lean and tidy as possible and HubSpot can do what HubSpot must do"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2022-03-25 08:18:29",
    "text": "same ^"
  }
]