[
  {
    "poster": {
      "poster_name": "Michael Kuntze",
      "poster_handle": "michael.kuntze"
    },
    "time_stamp": "2025-01-09 06:48:15",
    "text": "Hello. Is there a way to trigger a reload of the HubSpot editor iframe? i want to reload the editor as soon as a module is cloned. when i use window.location.reload() i got the the errors \"It looks like the preview iframe unexpected redirected to another URL\"  and \"Uncaught Error: Cannot have two HTML5 backends at the same time.\" Are there any HubSpot methods to use instead? Thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Joao Pinto",
      "poster_handle": "a19836"
    },
    "time_stamp": "2025-01-09 09:26:05",
    "text": "Hello,\n\nI'm a new user at HubSpot and would like to execute a javascript function in my website, but this javascript function should be triggered after HubSpot detect my visitor details. The idea is HubSpot to detect (through client IP) the company data or person data correspondent to the lead that is currently visiting my website, but to get this info on realtime, this is, on page-load, at the same time that the lead is visiting my website? The idea is your javascript detect my lead through IP and trigger a javascript function passing to my function the person and company data.\nI already added the HubSpot tracking code in my site, but don't know what should be the next steps.\nCan someone help me please and provide a javascript example?\n\nThanks,\nJP"
  },
  {
    "poster": {
      "poster_name": "Steven Sabogal",
      "poster_handle": "haroldsabogal48"
    },
    "time_stamp": "2025-01-09 09:59:28",
    "edited": {
      "time_stamp": "2025-01-09 10:00:35"
    },
    "text": "Hello,\nI hope you are doing very well.\nDoes anyone know how I can implement code that executes at a specific time? I was researching, and this can be done using a Node.js package called `cron`. I was looking into it, and in the `serverless.json` file, the following configuration is made:\n```{\n  \"appFunctions\": {\n    \"get-data\": {\n      \"file\": \"get-data.js\",\n      \"secrets\": []\n    }\n  },\n  \"schedules\": [\n    {\n      \"function\": \"get-data\",\n      \"cron\": \"0 12 * * *\"\n    }\n  ]\n}```\nWhat I’m not sure about is whether this will work and if the infrastructure that HubSpot has will allow for it.\nI would appreciate it if someone could help me with this question.\nThank you.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-09 12:10:19"
      },
      {
        "time_stamp": "2025-01-21 15:21:38"
      },
      {
        "time_stamp": "2025-01-21 15:21:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-01-09 12:10:19",
    "text": "I use the node-cron package in my node apps which work great but I have not tried in serverless functions - I would be interested if this works"
  }
]