[
  {
    "poster": {
      "poster_name": "Kyle Murray",
      "poster_handle": "kmurray"
    },
    "time_stamp": "2020-09-01 07:44:15",
    "text": "Hi there. This is my first time posting in this slack community, so if this is in the wrong channel, please let me know and I will address it in the correct one.\n\nI’m working with a client that has several products already built in HubSpot webpages (over 40).  They just asked if we could add SKUs and Barcodes to each product.  Their hope is that users will be able to search the SKU/Barcode in a search engine and it direct them to their site and even use the default search functionality on their site to search the same thing and be directed to a page.\n\nThe problem I’m tasked with is what is the best way to do this.  I’m thinking of using the HubDB to enter the products with their SKUs, Barcodes and the product url, then create a custom module that will compare the url a user is on to the url listed in one of the columns then display the SKUs. In theory it sounds like it would work, but I am not sure about the practical side or if there is a better option out there to do this. Or do I just enter all the information on those pages.\n\nAny thoughts or feedback is appreciated. Thank you in advance!",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-09-01 07:49:01"
      },
      {
        "time_stamp": "2020-09-01 07:52:08"
      },
      {
        "time_stamp": "2020-09-01 07:55:43"
      },
      {
        "time_stamp": "2020-09-01 08:37:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-09-01 07:49:01",
    "text": "Did u try HubDb dynamic pages? May be along with that you have multi-select column (or foreign id column) to link SKUs and barcodes for each product."
  },
  {
    "poster": {
      "poster_name": "Kyle Murray",
      "poster_handle": "kmurray"
    },
    "time_stamp": "2020-09-01 07:52:08",
    "text": "The difficulty becomes, the pages are already built with multiple items and it would take too much time to redesign the pages to have everything under the HubDB area.\n\nCurrent pages include several images and pdf documents plus additional CTAs and design elements"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-09-01 07:55:43",
    "text": "ok, if you want to achieve this with limited changes, then the approach you described should work."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-09-01 08:37:36",
    "edited": {
      "time_stamp": "2020-09-01 08:38:00"
    },
    "text": "I’d suggest that you are going to continue to build a less than ideal situation that will only continue to not be as good as just migrating the content to hubdb and doing it in a more dynamic way… and in the end you’ll replace it with hubdb before it is all said and done"
  },
  {
    "poster": {
      "poster_name": "Jake Stringfellow",
      "poster_handle": "jstringfellow"
    },
    "time_stamp": "2020-09-01 12:01:34",
    "text": "Posted this in <#C2YHAHB6K|api> as well, but looking for any help here:\n\nI'm using Zapier to update HubDB based on a form, but I'm having trouble passing a select (option) value. The name comes through in Zapier but the ID is unknown. The first for id 35 works fine because I'm setting it manually, but for id 2, I don't know what to put for the id.\n\n``` \"35\": {\n  \"id\": 1,\n  \"name\": \"Unclaimed\",\n  \"type\": \"option\"\n},\n\"2\": {\n  \"id\": ?,\n  \"name\": \"{{97809012__Category}}\",\n  \"type\": \"option\"\n},```\n",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-09-01 13:26:59"
      },
      {
        "time_stamp": "2020-09-01 14:20:16"
      },
      {
        "time_stamp": "2020-09-01 16:33:07"
      },
      {
        "time_stamp": "2020-09-02 06:40:08"
      },
      {
        "time_stamp": "2020-09-02 06:44:58"
      },
      {
        "time_stamp": "2020-09-02 07:15:54"
      },
      {
        "time_stamp": "2020-09-02 12:15:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-09-01 13:26:59",
    "text": "Did u omit the `id`  field and try with just name and type fields in the input?"
  },
  {
    "poster": {
      "poster_name": "Jake Stringfellow",
      "poster_handle": "jstringfellow"
    },
    "time_stamp": "2020-09-01 14:20:16",
    "text": "Yes, I did try that, but it triggered an error"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-09-01 16:33:07",
    "text": "<@U504BHZ6K> I remember you had some solution. Do u recall?"
  }
]