[
  {
    "poster": {
      "poster_name": "Matt Louden",
      "poster_handle": "matt562"
    },
    "time_stamp": "2023-05-05 17:20:37",
    "edited": {
      "time_stamp": "2023-05-12 09:35:49"
    },
    "text": "Hello all! I thought I would post this here before posting it on Indeed and LinkedIn. Reach out to me if you are interested. Thanks.\n\n*HIVE Strategy*, a Diamond HubSpot Solutions Partner, is seeking a creative and self-driven Senior Web Developer to support our team in building and executing client web and HubSpot projects. This 100% remote position requires experience in web design and development, technical consulting, asset creation, web development testing, email development, and client training. The successful candidate will work with experienced development, marketing, and HubSpot experts in a collaborative and client-facing role. This full-time position is open only to US residents, with working hours from 9am-6pm Mon-Thu and 8am-4pm Fri in your timezone.\n\n*Qualifications*\n• This is a perfect opportunity for a front-end web developer with deep familiarity with HubSpot's platform\n• Minimum 5 years of front-end web development experience\n• Minimum 2 years of experience developing in HubSpot CMS\n• Must hold or be willing to get the HubSpot CMS for Developers Certification \n• High proficiency in HTML, CSS, and JavaScript (NodeJS and jQuery)\n• Proficiency in HubL and HubDB\n• Proficiency working with Git, Terminal, and VS Code\n• Excellent communication skills, both written and verbal\n• Ability to to develop strong relationships with both clients and teammates in a mostly remote setting\n• A knack for project management and a respect for the importance of meeting deadlines\n• A passion for creating things and bringing ideas to life\n• Experience building API integrations (preferred but not required)\n• Design skills with wireframes, mockups, etc using Figma, Adobe XD, or Photoshop (preferred but not required)\n• Proficiency in WordPress (preferred but not required)\n• Previous agency experience (preferred but not required)\n*Responsibilities*\nAs a key player in our ambitious, entrepreneurial-minded team, you'll have the opportunity to contribute to one of the fastest-growing CMS platforms in the marketplace and play a vital role in its continued growth.\n• Develop high-quality  code for website themes, templates and modules for the HubSpot CMS\n• Integrate CMS and CRM Data with languages such as HubL, HubDB, PHP and GraphQL\n• Optimize code for SEO, Performance, and Accessibility\n• Establish internal code libraries, repositories, and SOPs to improve operational efficiency\n• Occasionally meet with clients to review theme functionality and to discuss project requirements\n• Showcase your work and ideas publicly via blog posts, case studies, or other forms of media\n*Benefits*\n• Unlimited PTO\n• Health reimbursement\n• 401k + employer match\n• Maternity / Paternity leave\n*Salary*\n$80,000 and up (negotiable and depending on experience)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-07 21:16:56"
      }
    ]
  }
]