[
  {
    "poster": {
      "poster_name": "Meredith Scroggin",
      "poster_handle": "mscroggin"
    },
    "time_stamp": "2023-05-12 12:44:49",
    "text": "*Quick simple adjustment needed for customized quote template -* \n\nHi - we have a default quote template in HubSpot that I need some help editing and applying a child theme to include CSS for a PRINTED PDF page break (NOT just the screen). I am stuck on how to implement the CSS and ensure it's connected appropriately within HubSpot. We are using the Flow theme, which I believe is a HubSpot default.\n\nThese links have been helpful but styling/HubSpot CMS is not my strength -\n\n<https://community.HubSpot.com/t5/CMS-Development/Quote-Custom-template-break-page/m-p/414054>\n<https://css-tricks.com/almanac/properties/p/page-break/>\n\nI'm looking for a fairly quick turnaround on this, given that it's just one section at the end that needs a page break - we would love to be able to use it for quotes on Monday. Budget is ~$50 - feel free to send me a message and we can work through a Fiverr gig or another appropriate avenue.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-12 12:51:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marcelo Eduardo Da Ros Arana",
      "poster_handle": "marcelo.daros"
    },
    "time_stamp": "2023-05-12 12:49:28",
    "text": "Hi everyone! Greetings from :flag-pe:\n\nI want to offer my services as a HubSpot developer :nerd_face:\nI have also specializations in User Experience and Digital Marketing\nI have led teams too, and got to help my clients to accomplish goals such as winning webs awards or getting a better SEO score..\nAdditional stacks: React, Laravel, Wordpress, Git, PHP, Javascript\n\nFeel free to DM me :muscle: I'm ready for new challenges"
  },
  {
    "poster": {
      "poster_name": "Tejas Panchal",
      "poster_handle": "tejpanchal93"
    },
    "time_stamp": "2023-05-12 12:51:43",
    "text": "<@U04JMKA1D0A>  Sent you DM"
  }
]