[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-29 08:26:11",
    "text": "I have a weird idea but this could be pretty useful for something I’m making - in custom modules a field for picking a repeated field. Example:\n\nSay you have a repeatable text field called fruit with the values:\n• Apple\n• Banana\n• Watermelon\n\nI want a field that looks like a choice field, that is auto populated with the values.\n\n\nHere is an example use-case scenario. I’m going to be building an insurance calculator tool but it uses branching logic. I want to have a repeater group for the questions essentially and have the user select what question comes up next within each question group, or whether it should calculate a score at that time."
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-08-29 08:27:34",
    "text": "Really feeling the need for being able to copy custom modules, or even HubSpot modules and their content into another page. For example, I am adding a signup CTA module (not a simple HubSpot CTA, but one that has custom code) throughout our web site, and I’m having to manually recreate the exact same one everywhere. Due to the deadline (ie. launch at Inbound :slightly_smiling_face: :slightly_smiling_face: ) I’m going to just add it to the template above the footer so that it appears on every page … although, we don’t want that forever.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-08-29 12:22:27"
      },
      {
        "time_stamp": "2018-08-31 08:59:54"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2018-08-29 08:28:38"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-29 08:29:28",
    "text": "Parag - here’s a work around for ya. If you’re using a drag n drop template - create a new template, drop the custom module into the template, convert to global module, then edit globals, set everything like you want it to be on every page, then just add the global module to any page you want that CTA"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-08-29 08:30:51",
    "text": "Can I do that for an existing coded template that has a bunch of existing pages built off it?"
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-29 09:12:09",
    "edited": {
      "time_stamp": "2018-08-29 09:12:42"
    },
    "text": "well in that case parag here’s what I’d do. create a drag n drop template(with nothing in it) add that custom module, make it global etc, set the global values then you can now add it to your coded templates - it will show up on the left finder panel"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-29 09:12:24",
    "text": "or add it directly to your pages that would work too"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-08-29 10:09:01",
    "text": "got it, thanks!"
  },
  {
    "poster": {
      "poster_name": "jim mikecz",
      "poster_handle": "jim.m"
    },
    "time_stamp": "2018-08-29 12:22:27",
    "text": "I totally agree here. Ocassionally I have a module built out on the page level that either needs to be transferred somewhere else or duplicated for another page…but is also used for other purposes so a template level change would not be appropriate."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-29 15:27:28",
    "text": "Allow us to see source for the subscription modules like we can when we try to edit modules on other things. The subscription page modules are very bland and also I think those templates need to be worked on in general as alot of css is added to the header of the page that makes it hard to overwrite with using your normal css settings"
  },
  null
]