[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-14 08:50:15",
    "edited": {
      "time_stamp": "2018-08-14 08:53:04"
    },
    "text": "would be nice if in Custom modules there was either an “information panel” “field” basically a rich text field that us developers can add some information explaining the module or a certain functionality. It would be nice to be able to place these in different places like in groups or between fields.\n\nExample of a use-case scenario. Say a module pulls from a HubDB, it’d be great to be able to link the marketer to the HubDB, so they get how to edit it.\n\nOr say you’re doing a store locator, it’d be great to be able to explain how to get latitude and longitude for a location or something.\n\nThe help pins are great for simpler modules, but once you get to more complicated ones, those alone don’t solve your problems.\n\nI could even understand if you guys imposed a limit on these new “info panel” fields as obviously if you have a ton of them, you’re probably failing in your field organization/naming and help tips, and should resolve that first."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-14 08:54:59",
    "text": "That would be amazing. A documentation section! Would be great for modules on the marketplace too."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-14 09:07:42",
    "text": "Sorry for all the added emoji's, its something i really agree with :slightly_smiling_face:"
  },
  {
    "text": "",
    "time_stamp": "2018-08-14 09:59:55"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2018-08-14 10:00:07",
    "text": "Does that not work for what you are trying to do?"
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2018-08-14 10:02:40",
    "text": "It kind of works, but it's pretty easy for the content editor to miss and you can't put links or text formatting in there."
  },
  {
    "poster": {
      "poster_name": "Ian McNair",
      "poster_handle": "ianrmcnair"
    },
    "time_stamp": "2018-08-14 10:03:31",
    "text": "For long explanations it's pretty awkward. Plus, sometimes you want instructions for the overall module, and not just for an individual field."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2018-08-14 10:05:41",
    "text": "makes sense"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-14 10:08:25",
    "text": "basically the info panel idea is in-addition to those help text areas.\n\nThe Help Text is awesome for most situations, but when you start having more complex modules, or they pull data from different places, it’d be nice to have an easy way to communicate to the marketers without having to stick a paragraph in the help text."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-14 12:21:10",
    "text": "Just because Inbound is coming up and it’s often like Christmas for us and marketers. :musical_note: All I want for inbound is Emmet in my editor. :musical_score: \n\n_Intentionally not rhyming because copyright and laziness_"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-08-14 12:23:40",
    "text": "hahahaha"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-08-14 12:23:43",
    "text": "love this."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-08-14 12:24:51",
    "text": ":musical_score: Emmet roasting on an open fire. Better autofill nipping at your nose. :musical_note:"
  }
]