[
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-13 09:56:58",
    "text": "It would be nice to be able to add flexible columns to our Custom Modules. I know its not supported, but, if we are going to have a \"Page Builder\" beta where its similar to the email one, we could really build these ourselves by simply adding those flexible columns into a CM. I would say best way would be to limit it to just using one flexible column per CM. So this way you can't go off the rails crazy with it but it would allow us to be able to build different layout pieces.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-08-13 10:09:45"
      },
      {
        "time_stamp": "2018-08-13 11:25:34"
      },
      {
        "time_stamp": "2018-08-13 11:26:50"
      },
      {
        "time_stamp": "2018-08-13 11:30:10"
      },
      {
        "time_stamp": "2018-08-13 11:31:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-13 10:09:45",
    "text": "I think a lot of deep thought would have to be put into this as it would introduce some possible problems. I also kinda think limiting to 1 flex column inside a module would kinda defeat the purpose of it. \n\nIt could also create a situation where companies start filling the marketplace with “wrapper modules” that their modules will only work in side of. So if say you want a module to do something you would need to have their wrapper module, and if you had their wrapper module, other modules you had wouldn’t look good inside of it."
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-08-13 11:25:34",
    "text": "from my limited experience, CM’s allow vertical customization of the web site. however,  outside of hacks like using the repeater, there is not a good way to do horizontal customizations."
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-08-13 11:26:50",
    "text": "is that what you are looking for <@U2H3TT8F2>? because if that is the case, then maybe there’s a different solution without allowing flex columns inside the modules"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-13 11:30:10",
    "text": "I just used a simple dropdown with choosing a \"Layout\" and then using an if statement i either did:\n```\n&lt;div class=\"span4\"&gt;&lt;/div&gt;\n&lt;div class=\"span8\"&gt;&lt;/div&gt;\n```\nor the flip of it. Then in each section is a repeater that is a select for choosing 3 different types of modules"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-13 11:31:01",
    "text": "just letting us put a flexible column in there would be awesome because then we can essentially create a page builder"
  }
]