[
  null,
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-06 11:34:45",
    "text": "It would be nice if you didn’t need admin status to modify HubDB tables. Also it’s strange that as an admin (but not a super admin) I can give another user admin privileges but cannot give them permission to write on HubDB.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-08-06 11:47:28"
      },
      {
        "time_stamp": "2018-08-06 12:25:20"
      },
      {
        "time_stamp": "2018-08-06 12:27:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-06 11:47:28",
    "text": "over-all I feel the permissions in general need to be better explained what all they control.  Also some sort of permission groups/roles would be a great idea. Like have a few default ones for like developer, marketer, sales etc. \nThat way people adding others  can more easily identify the common permissions needed and quickly add them for people by just using like a role to do so. obviously because people don’t always fit neatly into those categories  the need for custom permission options is still completely necessessary"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-06 12:25:20",
    "text": "Agreed"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-06 12:27:23",
    "text": "Oh and I don’t know if it’s been adjusted now but previously when you did run into a situation where you clicked  a button or something and didn’t have a permission it didn’t properly explain ” hey you don’t have this permission: [permission name]”\n\nI haven’t run into that lately though myself, lately our team has gotten a little lazy with setting permissions on me - giving me basically everything."
  },
  null,
  null
]