[
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-06-03 03:18:39",
    "edited": {
      "time_stamp": "2021-06-03 03:18:43"
    },
    "text": "Nope and no ETA on when that will happen.\n\nI build a custom solution for my customers that allows you to choose the number of modules for an email then choose which custom modules will fill those slots. It’s not quite drag and drop but it does give more control and allows you to build a real custom HTML template"
  },
  {
    "poster": {
      "poster_name": "Amber Wojcek",
      "poster_handle": "amber113"
    },
    "time_stamp": "2021-06-03 06:18:19",
    "text": "Ugh, that’s incredibly frustrating. Thanks for the intel!"
  },
  {
    "poster": {
      "poster_name": "Amber Wojcek",
      "poster_handle": "amber113"
    },
    "time_stamp": "2021-06-03 06:18:32",
    "text": "Bummer. Definitely need this for a client (or many)."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-06-03 06:26:41",
    "text": "A repeater with different section styles is probably the only way I know how to do this."
  },
  {
    "poster": {
      "poster_name": "Sebastian Schlapkohl",
      "poster_handle": "sebastian.schlapkohl"
    },
    "time_stamp": "2021-06-03 07:10:43",
    "text": "Concerning my issue from yesterday (since no revelations happened yet):\n\nI tried Outlook 2016 in a completely different environment of a different company and I'm still getting zero images (all marked as broken).\n\nSo somehow, the 2016 client seems to have a real problem with either our images or images from the HubSpot email image pipeline in general.\n\nIs there really no one experiencing this as well at the moment?"
  },
  {
    "poster": {
      "poster_name": "Anthony Noel",
      "poster_handle": "mail160"
    },
    "time_stamp": "2021-06-03 22:29:42",
    "text": "Hello everyone,\n\nHow do you go about sharing the online version of a HubSpot email on social channels? My template is built using the classic HTML editor, and I have OG tags in the head of my header module.\n\nWhat I’m seeing is that HubSpot wraps my newsletter file in another set of head and body tags, and LinkedIn, Facebook etc don’t seem to be able to see my OG image tag in particular. Their scrapers find the title and the url, but not the preview image.\n\nAside from hosting the HTML somewhere else entirely, is there a simple thing that I’m missing? Like a global setting in the app somewhere?"
  }
]