[
  {
    "poster": {
      "poster_name": "Tycho",
      "poster_handle": "tycho"
    },
    "time_stamp": "2022-03-09 06:08:27",
    "text": "Hey folks. I am trying to integrate HubSpot in our SaaS product (Angular), using the Node.js SDK. Is there a way to control the chat widget through the HubSpot client that is created ? All I can find is documentation on how to control the widget through the window object using the default copy/paste tracking script implementation.\nSomething simple as showing or hiding the chat widget dynamically/programatically using the Node SDK seems to be impossible.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-09 06:20:00"
      },
      {
        "time_stamp": "2022-03-09 06:33:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2022-03-09 06:20:00",
    "text": "You don't need the Node SDK to to that, take a look here <https://developers.HubSpot.com/docs/api/conversation/chat-widget-sdk>"
  },
  {
    "poster": {
      "poster_name": "Tycho",
      "poster_handle": "tycho"
    },
    "time_stamp": "2022-03-09 06:33:06",
    "text": "Thanks for the reply! We intend to make more integrations which will be using the Node client. For now, we want to load, show or hide the chat widget based on some changing parameters in our ng application (and also use visitor identification).\n\nIt does not make sense to have a HubSpot client using the Node.js SDK inside of our application, and also having to include some copy/paste script in our HTML file and then calling methods directly on the window object.\n\nHaving some sort of abstract API with typescript support is definitely preferable. But maybe I am overestimating the possibilities that the official node integration offers."
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 08:02:55",
    "text": "Is there a way to search deals by multiple property names or do you have to run a seperate search per each property?"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 08:09:09",
    "text": "Right now i'm using\n```$filter_order_id = new \\HubSpot\\Client\\Crm\\Deals\\Model\\Filter();\n$filter_order_id -&gt; setOperator('EQ') -&gt; setPropertyName('order_id') -&gt;setValue($order_id);```\n but I want to be able to search by several property names"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 08:41:30",
    "text": "So it would ideally be search deal EQ order_id = $1 &amp; $product_id = $2"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 10:17:53",
    "text": "Also how do you expose added custom properties in the HubSpot Deals API?"
  },
  {
    "poster": {
      "poster_name": "Jim Johnson",
      "poster_handle": "jim.johnson"
    },
    "time_stamp": "2022-03-09 10:27:14",
    "text": "Hey everyone. We have an existing external system that houses staff members and their details, and exposes them in a json feed. I would like to build an import process to pull this content into HubDB on a regular basis. I'm thinking this could be a process that runs nightly, but manually kicking off the process would work too.  Once imported, I envision a module that would allow editors to curate staff lists for display on a HubSpot CMS page, so existing rows would need to be updated in HubDB, not deleted and re-added on each import. Has anyone done this type of thing?  I'm relatively new to HubSpot development and want to make sure this is the right approach. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 10:36:42",
    "text": "How do you associate a deal with a Contact via the API? The documentation isn't clear",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-09 10:47:51"
      },
      {
        "time_stamp": "2022-03-09 13:40:26"
      },
      {
        "time_stamp": "2022-03-09 13:45:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Saranraj Santhanam",
      "poster_handle": "saranraj.santhanam"
    },
    "time_stamp": "2022-03-09 10:47:51",
    "text": "You can use the Association IDs"
  },
  {
    "poster": {
      "poster_name": "Nicolas",
      "poster_handle": "nicolaslira"
    },
    "time_stamp": "2022-03-09 11:48:59",
    "text": "Hi everyone! I was wondering how can I convert the API response to JSON object using Python when working with <https://developers.HubSpot.com/docs/api/cms/hubdb|HubDB API>?\n\nIt seems that the HubDB API follows a completely different pattern compared to CMS Pages API for example (which can be easily converted to json using json() or json.dump). When I try the built-in functions and modules of Python3 it returns an error that the API response is actually a custom object -&gt; AttributeError: 'CollectionResponseWithTotalHubDbTableV3ForwardPagi' object has no attribute 'json'\n\nIt's not clear inside the main doc how to proceed. Please help me and thank you in advance."
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 13:40:26",
    "text": "Sweet thanks"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 13:44:09",
    "text": "You most likely need to serialize it. Does Python have a json_decode type method?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-09 14:34:08"
      },
      {
        "time_stamp": "2022-03-11 19:47:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-09 13:45:23",
    "text": "Is there no way to do this with the HubSpot api PHP library? Rather use that than a curl"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-09 13:52:00",
    "text": "is there an API related to the sitemap? I'm trying to query for all pages that are children of a page"
  },
  {
    "poster": {
      "poster_name": "Nicolas",
      "poster_handle": "nicolaslira"
    },
    "time_stamp": "2022-03-09 14:34:08",
    "text": "Thank you, I will try that. I can see that the object is in JSON format but python does not understand it as JSON."
  },
  {
    "poster": {
      "poster_name": "Bodil Elbrink",
      "poster_handle": "bodil"
    },
    "time_stamp": "2022-03-09 23:50:41",
    "text": "Hey everyone! I was wondering if someone can help me.\nI am creating a POST request to send notes from Pipedrive into HubSpot notes. I have a dataframe with 76981 rows which are mapped to match the HubSpot properties required for the engagements post request. The problem I am running into is the limit set by HubSpot. We are on the enterprise package which has a limit of 150 per 10 sec. Does anyone have any tips or a piece of python code with which I can send batches of 150?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-10 07:51:37"
      }
    ]
  }
]