[
  {
    "poster": {
      "poster_name": "Manan Ahuja",
      "poster_handle": "manan"
    },
    "time_stamp": "2022-03-11 02:31:12",
    "edited": {
      "time_stamp": "2022-03-11 02:32:09"
    },
    "text": "I think that can be done by making a workflow for sending notifications based on some pre-determined conditions that can be set on the drop down selected when the form is submitted.\nAnd if you have the required field data flowing inside HubSpot, then Single-send API won't be need either."
  },
  {
    "poster": {
      "poster_name": "Christian Mangold",
      "poster_handle": "cm"
    },
    "time_stamp": "2022-03-11 04:54:14",
    "text": "Hi all, I’m creating an app to use webhooks, but I’m getting an error with the redirect_url. I provide in my server an endpoint to that, but it’s throwing an 404 error there. Somebody has like an example or something on how to do this?"
  },
  {
    "poster": {
      "poster_name": "Dave Elmer",
      "poster_handle": "delmer"
    },
    "time_stamp": "2022-03-11 06:22:14",
    "text": "Thanks, gentlemen. I pivoted to HubSpot workflows and nearly accomplished all of my requirements, except one: displaying the form submission data inside the body of the internal email notification. Barring a solution for that, I may double back to Richard's handy multi-step approach."
  },
  {
    "poster": {
      "poster_name": "Dave Elmer",
      "poster_handle": "delmer"
    },
    "time_stamp": "2022-03-11 07:22:57",
    "text": "Thanks, Manan! I did in fact pivot to using HubSpot workflows and nearly accomplished all of my requirements, except one: displaying the form submission data inside the body of the internal email notification as the last step of the workflow. What do you mean by \"data flowing inside HubSpot\" and how do I accomplish that? Thanks again..."
  },
  {
    "poster": {
      "poster_name": "Ibrahim Elsanosi",
      "poster_handle": "ibrahimsabat"
    },
    "time_stamp": "2022-03-11 09:57:11",
    "text": "Thank you Thomas. I think there is a way to do GET call  and attach custom properties that you want o fetch- it is here\n```hubSpot\n    -&gt;crm()\n    -&gt;contacts()\n    -&gt;basicApi()\n    -&gt;getById($id,$properties);```\n$id = contact-id and $properties = list of custom property names (as an array of string ) that you want to return. It works for me."
  },
  {
    "poster": {
      "poster_name": "Kathryn St. John",
      "poster_handle": "kathryn.stjohn"
    },
    "time_stamp": "2022-03-11 11:47:58",
    "edited": {
      "time_stamp": "2022-03-11 11:49:24"
    },
    "text": "*Shout out to any that can help with authentication layers!* I am building a B2B customer portal (our own Angular project) and would like to give our clients access. These clients are stored n HubSpot managed by our Marketing, Sales and Customer Success teams.  We need an authentication layer for our customer portal and wondering what HubSpot authentication related services are available? Can HubSpot provide ways to give contacts access to our customer portal? Inviting them to set a login and password and having a relationship to their records in HubSpot?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-13 01:11:03"
      },
      {
        "time_stamp": "2022-03-13 09:50:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mauricio Murillo",
      "poster_handle": "mmurillo"
    },
    "time_stamp": "2022-03-11 13:00:45",
    "text": "Hi everyone, We have a meeting link on a landing page, and we have partners driving traffic to it for meeting conversions. To capture their referral, we are using a cookie, that then needs to update a different app with an API call from HubSpot.\n\nThis is different from a onformsubmit event, but I'm sure where to find it. Is there an Meeting booked event I can listen for? TIA"
  },
  {
    "poster": {
      "poster_name": "Jennifer S",
      "poster_handle": "jennifer.shen"
    },
    "time_stamp": "2022-03-11 13:54:40",
    "text": "Hi! Is there an API to export raw date from form submissions? Thank you!"
  },
  {
    "poster": {
      "poster_name": "Manan Ahuja",
      "poster_handle": "manan"
    },
    "time_stamp": "2022-03-11 14:01:53",
    "edited": {
      "time_stamp": "2022-03-11 14:20:51"
    },
    "text": "I suppose that can be done by designing a custom email template.\n1. Create a new email template and choose 'Automated'.\n2. Insert the personalization tokens (fields from the respective form). And set the default value as blank or whatever you want.\n3. When you're done just choose the from, and make sure to mark this email as \"Marketing Information\".\n4. Review &amp; Publish.\n5. Now inside the workflow, choose \"Send internal marketing email\". I noticed that this lets you send a custom email to pre-defined email addresses. In a way it lets you make your own notification email.\n6. Choose the email you just created and saved as \"Automated\".\n7. You can enter some email addresses too while configuring it here. \n8. Turn on workflow and you're done!\nBy \"data flowing inside HubSpot\", I mean the data a user enters in a form coming into HubSpot's CRM."
  },
  {
    "poster": {
      "poster_name": "Manan Ahuja",
      "poster_handle": "manan"
    },
    "time_stamp": "2022-03-11 14:29:06",
    "edited": {
      "time_stamp": "2022-03-11 15:05:42"
    },
    "text": "Also, your stages for the workflow would be\n1. Form Submission on any page ---&gt; [The form you want info from]\n2. If/then ---&gt; Contact properties ---&gt; [The field you want to evaluate from] ---&gt; is any of [choose the dropdown value based on which you want to trigger]\n3. None met ---&gt; Finish\n4. If met ---&gt; Send internal marketing email"
  },
  {
    "poster": {
      "poster_name": "Nicolas",
      "poster_handle": "nicolaslira"
    },
    "time_stamp": "2022-03-11 19:47:33",
    "text": "Found something better, not to JSON but to a native Python dictionary using the built-in function “vars” to convert Python Objects into dictionaries.\n\n`decode_obj_dict = vars(api_response)`"
  }
]