[
  {
    "poster": {
      "poster_name": "Vishnu Kurup",
      "poster_handle": "vishnu.kurup"
    },
    "time_stamp": "2022-03-01 03:23:06",
    "text": "Hi all, do any one have idea how to use HubSpot-api-python package to fetch custom objects data. I followed the HubSpot documentation (<https://developers.HubSpot.com/docs/api/crm/crm-custom-objects> Search method \"POST*`/crm/v3/objects/{objectType}/search`*\" ) but not able to import PublicObjectSearchRequest from from HubSpot.crm package."
  },
  {
    "poster": {
      "poster_name": "Walter Gueler",
      "poster_handle": "wgueler"
    },
    "time_stamp": "2022-03-01 03:52:02",
    "text": "Did anybody else get issues with oauth authentication the past 3hours? (it's working now)"
  },
  {
    "poster": {
      "poster_name": "Mukesh Sharma",
      "poster_handle": "mukesh.sharma"
    },
    "time_stamp": "2022-03-01 06:11:18",
    "text": "Hello everyone :wave:\nI'm new to using `HubSpot` api.\nRight now I'm facing this issue of OAuth in node.\n\nUsing this method\n```HubSpotClient.oauth.tokensApi.createToken(\n      AUTHORIZATION_CODE,\n      AUTH_CODE,\n      REDIRECT_URI,\n      CLIENT_ID,\n      CLIENT_SECRET\n    );```\nThe issue here is I don't understand where do I get `AUTH_CODE`  from\nCan anyone help me.\nThanks"
  },
  {
    "poster": {
      "poster_name": "Aash",
      "poster_handle": "aashray"
    },
    "time_stamp": "2022-03-01 10:18:23",
    "text": "Hey all, I am trying to push data to a database from HubSpot using webhooks. i have my subscription set to a contact property change. The webhook posts to a lambda function (aws serverless function) via a api gateway. The webhooks pay load is logged to my database and the lambda function returns a 201 response but on the HubSpot side it is logged as a 502 response. Because of the 502 response, the app triggers the webhook again which is causing duplicatwes in mydatabase.\nAny suggestions on what I should respond to the webhook with?"
  },
  {
    "poster": {
      "poster_name": "Matthew Rush",
      "poster_handle": "matthew.rush"
    },
    "time_stamp": "2022-03-01 15:33:32",
    "edited": {
      "time_stamp": "2022-03-01 15:34:09"
    },
    "text": "Just joined and have a question regarding the API.\n\nWe have a web application and a HubSpot website.  Our marketing team would like to manage a page within the application that will share general information from a page on the HubSpot site.  Is it possible to create an app within HubSpot to get the information from a page (or content?) and display it within the app? Does this sound like something the API can do?"
  },
  {
    "text": "Hi, Can anyone please help me in updating a contact by email address?",
    "time_stamp": "2022-03-01 22:19:36",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-02 08:06:55"
      },
      {
        "time_stamp": "2022-03-02 10:00:05"
      },
      {
        "time_stamp": "2022-03-02 10:03:10"
      }
    ]
  }
]