[
  {
    "poster": {
      "poster_name": "Ziga Milek",
      "poster_handle": "ziga.milek"
    },
    "time_stamp": "2022-03-28 02:51:30",
    "edited": {
      "time_stamp": "2022-03-28 02:51:54"
    },
    "text": "Hi, does anybody know if it's possible to get (via API) the traffic source for each website visit of the HubSpot contacts?"
  },
  {
    "poster": {
      "poster_name": "Ryan Beckett",
      "poster_handle": "rbeckett"
    },
    "time_stamp": "2022-03-28 03:03:30",
    "text": "Just a bump on this"
  },
  {
    "poster": {
      "poster_name": "Pedro Paulo Tavares Junior",
      "poster_handle": "pedro.tavares.sf"
    },
    "time_stamp": "2022-03-28 04:22:39",
    "edited": {
      "time_stamp": "2022-03-28 04:23:50"
    },
    "text": "Hey guys. I need to start an API development on salesforce, will be used to find the latest email campaign that was sent to an account (company) and find out with contacts from that account had received it.\nIn those contacts i need to filter some more information about engagement.\n\nCan some one help me with a starting point?\nI'm reading the documentation, but any help will be appreciated.\n\nThanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-29 03:54:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Pedro Paulo Tavares Junior",
      "poster_handle": "pedro.tavares.sf"
    },
    "time_stamp": "2022-03-28 06:36:38",
    "text": "In short, I need an API call that brings the latest marketing email sent to all contacts of a company, and the level of engagement it have from the contacts"
  },
  {
    "poster": {
      "poster_name": "Filip Persson",
      "poster_handle": "filip.tillberg.persso"
    },
    "time_stamp": "2022-03-28 08:11:33",
    "text": "Hello! We are using the API forms and it works great, but since we switched from using the embedded forms to the API we are no longer getting the email from HubSpot when a form has been submitted. Does anyone know if there is a way to get this email when using API forms? In the settings you can easily turn this on for embedded forms - but with the API this setting doesn’t do anything.. thankful for any help!"
  },
  {
    "text": "That's not in the list of available scopes, so I'm not sure how to do that:",
    "time_stamp": "2022-03-28 08:27:03"
  },
  {
    "poster": {
      "poster_name": "Matt Shwery",
      "poster_handle": "matt119"
    },
    "time_stamp": "2022-03-28 09:27:20",
    "text": "Hey friends. I have what I thought would be a simple question(s) but the docs leave a lot of ambiguity:\n1. What’s an example of using the search api’s `IN` or `NOT_IN` operators? I tried and received cryptic invalid JSON responses (despite using the HubSpot ruby api client to form the request)\n2. What’s the recommended way to *find matching companies by multiple domains*? I used the search api, and it _seems_ like you have to use a `filterGroup` for every single domain. ",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-04-28 18:32:49"
      },
      {
        "time_stamp": "2022-04-28 19:35:56"
      },
      {
        "time_stamp": "2022-04-28 20:02:51"
      },
      {
        "time_stamp": "2022-04-29 09:23:56"
      },
      {
        "time_stamp": "2022-04-29 09:47:11"
      },
      {
        "time_stamp": "2022-12-06 08:11:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Bowler",
      "poster_handle": "luke733"
    },
    "time_stamp": "2022-03-28 09:48:34",
    "text": "Apologies for posting a basic question. I’m looking for API documentation for using HubSpot as a SSO app for logging in to a third-party WCMS. Not being a developer myself, I’m struggling to find the relevant info. Can anyone be as kind as to point me towards it?"
  },
  {
    "poster": {
      "poster_name": "Robert Marinho",
      "poster_handle": "robert275"
    },
    "time_stamp": "2022-03-28 10:07:33",
    "edited": {
      "time_stamp": "2022-03-28 10:13:23"
    },
    "text": "Hello everyone,\nI’m using serverless functions to handle subscription preference through API and I’m getting INVALID_AUTHENTICATION when I use the `process.env.APIKEY`:\n\n`{`\n  `\"status\": \"error\",`\n  `\"message\": \"Authentication credentials not found. This API supports both API Key and OAuth 2.0 authentication and you can find more details at <https://developers.HubSpot.com/docs/methods/auth/oauth-overview>\",`\n  `\"correlationId\": \"f57def42-1da4-461b-a4a5-a950c12afa66\",`\n  `\"category\": \"INVALID_AUTHENTICATION\"`\n`}`\n\n\nOtherwise, It works If I just copy/paste the api key provided on the settings panel (Which I think is not the ideal solution).\nThe `process.env.APIKEY` also woks for other api endpoints like `/cms/v3/hubdb/`  but not with the subscriptions endpoints particularly.\nAnyone else having this issue? Am I missing some API key scope configuration?\n\nThanks,"
  },
  {
    "poster": {
      "poster_name": "Lynn Batson",
      "poster_handle": "lynn.batson"
    },
    "time_stamp": "2022-03-28 16:50:51",
    "text": "Hey all, the online documentation <https://legacydocs.HubSpot.com/docs/methods/email/email_events_overview> doesn't appear to match exactly the reality of what we get in responses (e.g., location is returning more properties than listed in the documentation--added zip and lat-long, no BOUNCE events received at all--seems *very* unlikely we had no bounces, etc.). I'm not sure if there are more differences between the documentation and actual responses that we just haven't encountered yet. Is there an updated version of the API documentation someone could share with me that they are fairly certain is complete and accurate?"
  }
]