[
  {
    "poster": {
      "poster_name": "Georgiana Costache",
      "poster_handle": "georgiana.costache"
    },
    "time_stamp": "2022-03-08 05:27:44",
    "text": "hi there"
  },
  {
    "poster": {
      "poster_name": "Georgiana Costache",
      "poster_handle": "georgiana.costache"
    },
    "time_stamp": "2022-03-08 05:28:00",
    "text": "is there anyone specialised in custom events listeners for HubSpot and gtm?"
  },
  {
    "poster": {
      "poster_name": "Léo Duquenois",
      "poster_handle": "leo599"
    },
    "time_stamp": "2022-03-08 07:00:12",
    "text": "Hi!\nDoes anyone know if there is any way to count the number of paid owners using the API ? Thanks you :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Benjamin Nieß",
      "poster_handle": "b.niess"
    },
    "time_stamp": "2022-03-08 07:55:01",
    "text": "Hello Team,\nwe developed a software and now we want to create with the API automatically invoices in HubSpot with the existing customers in HubSpot.\nIs that possible with the api?\nAfter that we want to send all invoices with api request automatically via email to the customer.\nAfter that we want to debit invoices automatically by direct debit.\nIs that possible with the api and how ?"
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2022-03-08 08:02:19",
    "text": "Hi all, when properties are created via the API, what user is set for \"Created by\" ?\nI had a client ask this, but it shows the name of a specific user. I would have expected \"Integration\" or some \"API user\" or something.\n\nOur app use OAUTH, not the api key method"
  },
  {
    "poster": {
      "poster_name": "Darian Vretenar",
      "poster_handle": "darian.vretenar"
    },
    "time_stamp": "2022-03-08 08:57:21",
    "text": "Hi all! Question: Do you know from which IP range HubSpot sends requets (custom script)?"
  },
  {
    "poster": {
      "poster_name": "Artis Miezītis",
      "poster_handle": "artis"
    },
    "time_stamp": "2022-03-09 00:41:18",
    "text": "Hi!\nIs there any chance to pass cookie, or other identification to php API so after i create contacts thru server side, HubSpot can recognize the client journey which he made in client side!\nFor now everything i sent thru php api - have no link to client side data.\nCan find any clue, is this possible or not.\nI`m using this php client: <https://github.com/HubSpot/HubSpot-php>"
  }
]