[
  {
    "poster": {
      "poster_name": "Artem Dikmarov",
      "poster_handle": "dikmarov"
    },
    "time_stamp": "2022-03-21 02:49:18",
    "text": "Hello, everyone!\n\nWho has written automated tests (e2e) with HubSpot?\n\nWe are currently experiencing a problem that HubSpot asks for a code from the mail when trying to Login.\n\nIs there any way around this?"
  },
  {
    "poster": {
      "poster_name": "Kelly Vetter",
      "poster_handle": "kelly791"
    },
    "time_stamp": "2022-03-21 05:47:28",
    "text": "Has anyone used the HubSpot API with Power BI? We're running into an issue where the API is pulling back incorrect info into Power BI based on what's in HubSpot (i.e. deal stages for a specific deal record in a Power BI report are not matching what's in HubSpot)? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Keith Baldwin",
      "poster_handle": "keith306"
    },
    "time_stamp": "2022-03-21 10:10:47",
    "edited": {
      "time_stamp": "2022-03-21 10:12:09"
    },
    "text": "Hello,\nMy client wants to access outside news through an external api.\nCan this be done through a web module in the Professional account?\nOr does this require creating a web app and needing the Enterprise account?\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Matt Swanson",
      "poster_handle": "matt353"
    },
    "time_stamp": "2022-03-21 13:05:35",
    "text": "For CRM Cards, results require an `objectId` property -- is this actually used for anything on HubSpots end? Caching? Our integration data uses GUIDs for everything and `objectId` will only accept integers.\n\nWill bad things happen if we use random integers? Could it just be the index of the result in the `results` array?"
  },
  {
    "text": "Hi, I am wondering if anyone can help me with the Call Engagements. I try to put the call history record back to HubSpot with associated contact, everything besides call outcome was able to update. I am wondering if anyone knows why the call outcome was not able to show in HubSpot? If I pull up the contact information, the outcome is able to show in hs_status in the JSON file. But just not show in HubSpot property. I really appreciate it if someone can help.",
    "time_stamp": "2022-03-21 13:33:26"
  },
  {
    "poster": {
      "poster_name": "Matthew Rush",
      "poster_handle": "matthew.rush"
    },
    "time_stamp": "2022-03-21 14:56:03",
    "text": "I have a private app set up and the scope set to Content.  I have a page with a bunch of cards with data inside those cards.  How do I use the API to retrieve that data?  I am using a custom module on a landing page."
  },
  {
    "poster": {
      "poster_name": "Dave Elmer",
      "poster_handle": "delmer"
    },
    "time_stamp": "2022-03-21 15:11:56",
    "text": "I appreciate the details, Manan. Thank you!"
  }
]