[
  {
    "poster": {
      "poster_name": "Pedro Paulo Tavares Junior",
      "poster_handle": "pedro.tavares.sf"
    },
    "time_stamp": "2022-03-30 02:14:45",
    "text": "I have to create a service call that fetch the engagement information from contacts based on the company\n\nCan someone help-me?"
  },
  {
    "poster": {
      "poster_name": "Sagi Yagen",
      "poster_handle": "syagen"
    },
    "time_stamp": "2022-03-30 02:49:39",
    "text": "Hi Guys, is there an API for ‘Export’ events? I’m trying to retrieve those logs for entire users’ activities of ‘Export’ to monitor suspicious activities.  I know that there is an option of getting your export event to your mailbox (as email notification) but it’s only for your actions and not for all users."
  },
  {
    "poster": {
      "poster_name": "Jordan Dobrev",
      "poster_handle": "dobrev.jordan"
    },
    "time_stamp": "2022-03-30 05:17:10",
    "text": "hey guys, has anybody used the landing pages feature?\n\nI have the following situation.\n• We are using HubSpot to create landing pages\n• We embed those pages with &lt;iframe /&gt; in our website\n• We need to get the metadata for these pages like title/image to optimize content sharing (so it shows nicely in linkedin etc)\n• Is it possible to use the HubSpot API to get our page's metadata and present that metadata as well?\n"
  },
  {
    "poster": {
      "poster_name": "Sena McCarthy",
      "poster_handle": "sena"
    },
    "time_stamp": "2022-03-30 16:31:34",
    "text": "Hello HubSpot Gurus - I am using <http://Tray.io|Tray.io> to pull in data from our data warehouse &amp; add to to custom properties in the Marketing Events object. All of our events are currently Zoom webinars  &amp; the Tray workflow uses the GET marketing event endpoint and passes our HubSpot account id &amp; the external event id (currently I am passing the Zoom webinar id for this) but I am getting an error code that says \"Not found. Looks like this has been removed.\" but I can see the event is in HubSpot. So my question is, is it right to use the Zoom Webinar ID as the external event id for this endpoint call?"
  },
  {
    "poster": {
      "poster_name": "Yosef Sigaud",
      "poster_handle": "yosef.sigaud"
    },
    "time_stamp": "2022-03-30 19:38:45",
    "text": "we are doing the api to bubble - so we need to use json - any idea how to fix that in this case?"
  },
  {
    "poster": {
      "poster_name": "Riziq Maulana",
      "poster_handle": "riziq.maulana"
    },
    "time_stamp": "2022-03-30 22:21:56",
    "text": "Hi all!  I wanna update contact properties using API, but the response is 400. I have try it in my developer account before and it's work. But when i create in other account (not developer), the result is &lt;Response [400]&gt;.\nAnyone know how to solve it?  Thanks in advance."
  }
]