[
  {
    "poster": {
      "poster_name": "Luke O'Neill",
      "poster_handle": "luke.oneill"
    },
    "time_stamp": "2023-10-18 02:25:11",
    "text": "Good morning HubSpot Devs.\n\nI have been directed here from your support team and I am hoping you could assist us at DrDoctor. My data team are in the process of gathering data from HubSpot, to enable us to generate effective and repetitive reporting, using PowerBI, on various elements of our business activities.\n\nThe data team are trying to gather as much information from HubSpot as possible but are struggling with understanding the relationships between all the tables within.\n\nWhat they require, is an Entity Relationship Diagram (ERD), showing the relationships between all tables. From this, we are looking for the ID column properties, to assist us in designing an affective schema for our data ingestion and reporting solution. I am hoping that your technical expertise can help us to understand the relations between objects.\n\nI was passed this info: <https://legacydocs.HubSpot.com/docs/crm-integration-guide/overview> but after sharing with the team, this is too high level. Happy to set up a call to discuss more if that would help?\n\nThanks in advance :slightly_smiling_face:",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-18 02:32:08"
      },
      {
        "time_stamp": "2023-10-18 02:42:16"
      },
      {
        "time_stamp": "2023-10-18 06:31:43"
      },
      {
        "time_stamp": "2024-02-27 20:16:00"
      },
      {
        "time_stamp": "2024-02-27 20:19:34"
      },
      {
        "time_stamp": "2024-02-27 20:25:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2023-10-18 02:32:08",
    "text": "hi <@U061KC385RB> this understanding the crm could help team - <https://developers.HubSpot.com/docs/api/crm/understanding-the-crm>"
  },
  {
    "poster": {
      "poster_name": "Kyle Schuller",
      "poster_handle": "kschuller"
    },
    "time_stamp": "2023-10-18 02:33:14",
    "text": "Hello all! Not sure if this is the right channel to ask in… HubSpot forms in a HubSpot page/landing page inject some JavaScript. This DRAMATICALLY decreases page speed insights (between 20 and 30 points on mobile performance). I want to add a form in a global modal overlay, but then all my pages get a huge performance hit and my rankings start to plummet!\n\nIs there a way to mitigate this?"
  },
  {
    "poster": {
      "poster_name": "Luke O'Neill",
      "poster_handle": "luke.oneill"
    },
    "time_stamp": "2023-10-18 02:42:16",
    "text": "That's awesome! Thank you so much . I will pass this back to them and see if this is enough to get them moving"
  },
  {
    "poster": {
      "poster_name": "Alvin Raminger",
      "poster_handle": "alvin.raminger"
    },
    "time_stamp": "2023-10-18 03:52:32",
    "text": "Hello dear HubSpot Devs,\n\nHubForms seem to be quite popular. And I got a bit of a Form related question myself:\nIf RAW-HTML (Professional/Enterprise-Package) is noting that no styling is applied – so it should be up to CMS (or the domain you have the form included in) have the control over those Forms. True, this goes not for javascript functionality and I partly also understand stylings for particular elements like (date or captcha).\nBut why are there styles added for error-state, for spacing on boolean elements and so on. Shouldn’t those get to be skipped completely – and not added inline using generated classes?\n\nThis is without doubt creating unreasonable effort and page-load increase in an aim to use the Forms according to the CI of a page/website.\nThe expectation is that if RAW-HTML is checked, NO styling (unless specifically defined which ones can be there) should be included in the page with the script.\nOr is there some setting (in general Settings), which needs to be checked to have those removed?\nDidn’t find any hint on that – not while looking, nor within the documentation?\n\nFor me the Therm ‘RAW HTML’ for that matter is therefore kind of misleading – and highlight further clarification on that one."
  },
  {
    "poster": {
      "poster_name": "Mikey Wade",
      "poster_handle": "mikey136"
    },
    "time_stamp": "2023-10-18 04:06:28",
    "text": "Hi Everyone,\n\nI am using a hubdb table for team members. I am looking to be able to link other areas of content to each row in this table. Does anyone know if it is possible to specify other hubdb table rows or blog posts to be linked to a team member in a hubdb row?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-18 08:05:19"
      },
      {
        "time_stamp": "2023-10-18 08:17:38"
      },
      {
        "time_stamp": "2024-06-12 06:08:09"
      },
      {
        "time_stamp": "2024-06-12 08:47:33"
      },
      {
        "time_stamp": "2024-06-12 08:48:00"
      },
      {
        "time_stamp": "2024-06-12 09:10:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke O'Neill",
      "poster_handle": "luke.oneill"
    },
    "time_stamp": "2023-10-18 06:31:43",
    "text": "Hello again. The team have seen this before, and it doesn't give them the info they are after. Could I set up a call with my devs to see if we can find a solution for them? The work has been paused for now, so immediate resolution needed here"
  },
  {
    "poster": {
      "poster_name": "Chris Bartlett",
      "poster_handle": "chris.bartlett"
    },
    "time_stamp": "2023-10-18 06:58:25",
    "text": "Hi all!\nI am pretty new to HubSpot and taking over an existing integration in our system.  We currently have our project set up to add companies and contacts to HubSpot using the node package.  This is fired off from a queue so it is not happening in real time.  Some of these users that create companies/contacts come from another site with the same domain but different sub domain so the HubSpot utk cookie follows them.  Our main problem is that we want to link these users cookie to the company/contact that gets created.\n\nTo do this we have been told to submit a form since this is the only endpoint that accepts the utk cookie.  I cannot seem to find the endpoint or a wrapping function in the HubSpot node package, do we just have to do a raw http request to the endpoint?  Or is there another way that others have found to connect the two?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-18 08:03:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2023-10-18 08:03:18",
    "text": "I’d def join <#C2YHAHB6K|api>\nAlso FWIW, i never use the HubSpot package (i always use raw http requests and many others do the same since the node package has terrible documentation)"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2023-10-18 08:05:19",
    "text": "For blogs, I’ve add a col in hubdb with the author slug and connected them in templates via hubl\n\nfor other hubdb tables/table rows you can use a foreign id column type"
  },
  {
    "poster": {
      "poster_name": "Mikey Wade",
      "poster_handle": "mikey136"
    },
    "time_stamp": "2023-10-18 08:17:38",
    "text": "Thanks so much John, I will take a look into this, sounds like a good solution :+1:"
  },
  {
    "poster": {
      "poster_name": "Akshat Gupta",
      "poster_handle": "akshat"
    },
    "time_stamp": "2023-10-18 09:16:45",
    "text": "Hi team,\n\nHas anyone integrated AWS Glue with HubSpot before? I am not able to find a JDBC URI by HubSpot for connecting with the ETL service. "
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-10-18 10:55:03"
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2023-10-18 14:09:20",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-19 08:23:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alejandro Rivera",
      "poster_handle": "arivera655"
    },
    "time_stamp": "2023-10-18 16:39:14",
    "text": "Hi everyone, someone have an information about the SSL type of HubSpot? EV or OV?"
  },
  {
    "poster": {
      "poster_name": "Yan Digilov",
      "poster_handle": "yan222"
    },
    "time_stamp": "2023-10-18 21:31:26",
    "text": "Does anyone know if there is a way to customize the HubSpot chatbox icon color/size?"
  }
]