[
  {
    "poster": {
      "poster_name": "Witold",
      "poster_handle": "witold.rosendaal"
    },
    "time_stamp": "2023-10-12 04:48:12",
    "text": "Hello!\n\n*Situation*\nFor an enterprise client we are creating many workflows with custom code for stuff that happens within HubSpot. Also, we create a custom integration with node.js outside HubSpot with their ERP. We host this code elsewhere.\n\n*Challenge*\nI am thinking of moving the custom code that is in workflows outside of HubSpot because:\n\n1. We lose overview of which code is where. If something goes wrong, where to start..?\n2. We don’t have version control within HubSpot\n3. We have no error monitoring possibilities on this custom code\nIt is part of the core process and very important for Dhomus, so the above things don’t feel robust enough and dangerous…\n\nHowever, moving this away from HubSpot also has disadvantages like:\n1. Not that easy to adjust or add stuff\n2. Only people software developers can access it\n3. Might be slower because it is outside of HubSpot\n4. The process of creating this is slower. Also because we have to work more and more via the sandbox if we do this.\n*Advice needed*\nWhat is the opinion of experts here? Any advice would be much appreciated.",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-12 07:30:34"
      },
      {
        "time_stamp": "2023-10-12 11:56:01"
      },
      {
        "time_stamp": "2023-10-12 11:57:07"
      },
      {
        "time_stamp": "2023-10-12 11:58:22"
      },
      {
        "time_stamp": "2023-10-12 14:19:46"
      },
      {
        "time_stamp": "2023-10-13 05:46:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-10-12 07:30:34",
    "text": "I’d really recommend you playing around with Retool Workflows for the issues you’re describing - I have a discount code somewhere as well, DM me if you want it"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-10-12 09:49:32",
    "text": "Please post this in <#CBNDYJJAZ|jobs>"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-10-12 09:50:54",
    "text": "As per my DM, please avoid channel spamming with the same question <https://developers.HubSpot.com/slack/code-of-conduct#channel-and-user-spamming>"
  },
  {
    "poster": {
      "poster_name": "Witold",
      "poster_handle": "witold.rosendaal"
    },
    "time_stamp": "2023-10-12 11:56:01",
    "text": "I know Retool quite well actually. However, I don’t think a third place to store code is the solution."
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-10-12 11:57:07",
    "text": "if i were in your shoes (without knowing your setup), i’d most likely switch the custom code over to retool, and business critical HubSpot workflows over to retool as well, as the error logging etc is just that great"
  },
  {
    "poster": {
      "poster_name": "Witold",
      "poster_handle": "witold.rosendaal"
    },
    "time_stamp": "2023-10-12 11:58:22",
    "text": "Yeah we store that on another platform already. So then Retool would be a third place.\n\nNevertherless thanks for thinking along."
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-10-12 14:19:46",
    "edited": {
      "time_stamp": "2023-10-12 14:20:12"
    },
    "text": "It’s an interesting consideration - while I’m not sure I have a definitive opinion leaning in either direction, I have 2 comments related to your first set of bullets:\n\n1. While “version control” might be a strong word to use, you do have the ability to view previous revisions of a given workflow/coded action via the “Changes” tab. \n2. Error handling via outputFields might be a viable solution depending on your use case. Whether it be by stamping enrolled records with error related data, or sending out automated emails with the same. \nMy biggest gripe with coded actions is related to the run time restriction, in combination with the API rate limits we must work within (particularly when bulk enrollment is involved).\n\nIf either of those pose a threat to the processes you’ve built, the decision would be deemed an easy one for me."
  },
  {
    "poster": {
      "poster_name": "Michael Wells",
      "poster_handle": "iam"
    },
    "time_stamp": "2023-10-12 14:45:02",
    "text": "Hello,\nI'm trying to create a section template, but i want the ability to give that section additional settings. for example a toggle that will change out a class. i can't seem to find any documentation on this. Could someone please point me in the right direction?"
  },
  {
    "poster": {
      "poster_name": "Rajbir Sandhu",
      "poster_handle": "sandhurajbir75"
    },
    "time_stamp": "2023-10-12 15:07:29",
    "text": "Hi everyone,\n\nActually I was trying to do CMS membership social login but when I implemented all steps. It just refreshes the page instead of logging me in. If anyone is able to help me on this that would be very helpful.\n<https://developers.HubSpot.com/docs/cms/guides/membership/social>"
  },
  {
    "poster": {
      "poster_name": "Angelic Sanoy",
      "poster_handle": "info.samthing"
    },
    "time_stamp": "2023-10-12 23:12:55",
    "text": "Hi All, I followed this tutorial but only links, titles, metas and injections are migrated <https://app.HubSpot.com/site-importer/43756405/content-import/dashboard>\n\nIs it true that you can't migrate the content in bulk for landing pages and website pages? Do you need to manually copy paste it?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-13 02:14:02"
      },
      {
        "time_stamp": "2023-10-13 02:14:37"
      }
    ]
  }
]