[
  {
    "poster": {
      "poster_name": "Jass Negi",
      "poster_handle": "jeetunegi04"
    },
    "time_stamp": "2023-10-13 02:14:02",
    "text": "yes"
  },
  {
    "poster": {
      "poster_name": "Angelic Sanoy",
      "poster_handle": "info.samthing"
    },
    "time_stamp": "2023-10-13 02:14:37",
    "text": "That's a bummer :disappointed:"
  },
  {
    "text": "hello everyone, is there any possibility so send and alert box like HubSpot if anything happend through the private app i create to the user?\n\nlike this:",
    "time_stamp": "2023-10-13 05:08:57"
  },
  {
    "poster": {
      "poster_name": "Riki Lawson",
      "poster_handle": "riki.lawson"
    },
    "time_stamp": "2023-10-13 05:42:55",
    "text": "Hi, I need to set up an integration between two HubSpot portals.\n\nObjective: When a deal is won in the secondary portal (Sale Hub), the contact &amp; company needs to get copied over onto the primary portal (Enterprise).\n\nI was thinking if sending a webhook to Zapier OR could it go directly to the primary portal and then add the records via workflow?\n\nWhat if the contact or company already exists?\n\nCan anyone please give me some advice on how to send record data from one HubSpot portal to another HubSpot portal.\n\nThanks in advance."
  },
  {
    "poster": {
      "poster_name": "Witold",
      "poster_handle": "witold.rosendaal"
    },
    "time_stamp": "2023-10-13 05:46:03",
    "text": "Hi Niko, Thanks a lot for you elaborate response. I will take this into account"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-10-13 12:05:01",
    "edited": {
      "time_stamp": "2023-10-13 12:05:06"
    }
  }
]