[
  {
    "text": "Hey everyone,  Could someone please help me understand what might be causing this error and how I can resolve it? Has anyone encountered this issue before? Any guidance on the steps I should take would be greatly appreciated. Thanks!",
    "time_stamp": "2023-10-25 05:37:30",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-25 15:00:03"
      }
    ]
  },
  {
    "text": "Is there a way to set the Featured image option in blog posts to ON as default?\n\nI have done an import WP CSV file and the featured images are imported to HS but all posts have the featured image set to OFF. I dont wanna manually go tho each post to update this option.",
    "time_stamp": "2023-10-25 07:44:24"
  },
  {
    "poster": {
      "poster_name": "espinasse thomas",
      "poster_handle": "thomas.espinasse"
    },
    "time_stamp": "2023-10-25 08:02:07",
    "text": "Hey everyone, i'm new to HubSpot and i would like to know if i could create my own model for a Quote, because my company only have 3 default model and it's doesn't match with the requirements of our customer, so i would like to create my own model to fit perfectly the customer  desire but can't find a proper tutorial. Thanks"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-10-25 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-25 12:12:46",
    "text": "Thanks again, looking forward to checking it out tomorrow!"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2023-10-25 12:12:56",
    "text": "Sure :+1:"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-25 12:13:51",
    "text": "Feel free to reach out if you need anything :+1:"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2023-10-25 12:14:06",
    "text": "Yup"
  },
  {
    "text": "Can anyone please advise as to why no one can update or publish a blog post? The users are all super-admins, so it's not a permissions issue.",
    "time_stamp": "2023-10-25 12:15:33",
    "edited": {
      "time_stamp": "2023-10-25 12:15:49"
    }
  },
  {
    "text": "I want to remove our logo from the unsubscribe link from our email marketing campaigns. Is that possible?",
    "time_stamp": "2023-10-25 12:55:03",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-25 15:05:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-25 15:00:03",
    "text": "It sounds like the module in question is using <https://developers.HubSpot.com/docs/cms/building-blocks/module-theme-fields-overview#inherited-fields|field inheritance>, and looking for theme fields that aren’t present in the parent theme.\n\nEither, make sure your theme has fields of the id and type specified, or adjust the module’s fields to get rid of the inheritance. You’ll probably have to make those adjustments directly in the module’s fields.json file — I’m not sure you can manage field inheritance via Design Tools."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-25 15:05:08",
    "text": "You’ll have to update the markup of your Subscription Preferences template for that. On portals which have an active theme, that’s typically going to be in `/[Your Active Theme]/tempaltes/system/subscription-preferences.html`.\n\nIf you don’t have an active theme, you can check your system page settings to see what the active template is, and modify that. You may have to create a new one, if you’re currently using a HubSpot default template of some sort."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-25 18:12:41",
    "text": "Just a hypothetical — what options are there for embedding a HubSpot form on a site that doesn’t allow `unsafe-inline` in its CSP? Are you stuck using a nonce? Would you be entirely out of luck in a scenario where you could control the page markup, but didn’t have direct control over your request headers?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-05-24 16:48:09"
      },
      {
        "time_stamp": "2024-05-24 17:37:50"
      },
      {
        "time_stamp": "2024-05-24 17:41:57"
      },
      {
        "time_stamp": "2024-06-07 18:09:43"
      }
    ]
  }
]