[
  {
    "poster": {
      "poster_name": "M_ Hamza",
      "poster_handle": "hamzay449"
    },
    "time_stamp": "2023-10-17 04:46:24",
    "text": "Hi, Can we integrate amazon connect with third party CRM and HubSpot can be used for masking domain and adding scripts in third crm through HubSpot?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2023-10-17 08:56:09",
    "text": "Sounds good, if it continues happening, please feel free to reach out to me and I will check in on it with some people internally! Thank you Daniel!"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2023-10-17 09:00:07",
    "edited": {
      "time_stamp": "2023-10-17 09:00:11"
    }
  },
  {
    "poster": {
      "poster_name": "David Harding",
      "poster_handle": "david.harding"
    },
    "time_stamp": "2023-10-17 13:14:26",
    "text": "Hi all - New here, looking forward to learning and extending my HS knowledge, particularly on disentangling templates. However right now I do have a current problem with iframe content not loading *intermittently*, and I see an attribute `data-hs-blocked=\"true\"` on the iframe when it hasn’t loaded. Can anyone point me to information so I can diagnose and fix this? Didn’t see much in help.HubSpot, community.HubSpot, developers.HubSpot so far. TIA",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-19 15:36:15"
      },
      {
        "time_stamp": "2023-10-20 15:26:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2023-10-17 14:07:57",
    "text": "Hey all,\nOne of the key metrics to an ICP definition is GMV (Gross Merchandise Value). Do you know of any source where we could get this datapoint for accounts?"
  },
  {
    "poster": {
      "poster_name": "Nathan Vogele",
      "poster_handle": "nathan148"
    },
    "time_stamp": "2023-10-17 14:14:29",
    "edited": {
      "time_stamp": "2023-10-17 14:14:39"
    },
    "text": "Hi Everyone, does anyone know if there is a way to turn off the FWD functionality on subject lines for email to ticket creation?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-17 15:35:36"
      },
      {
        "time_stamp": "2023-10-17 17:24:10"
      },
      {
        "time_stamp": "2023-10-17 17:24:54"
      },
      {
        "time_stamp": "2023-10-17 17:32:14"
      }
    ]
  },
  {
    "text": "Is this in a conversations inbox? You can go to settings &gt; inbox &amp; helpdesk &gt; inboxes &gt; edit &gt;automation",
    "time_stamp": "2023-10-17 15:35:36"
  },
  {
    "text": "Yes, but that's not the issue.  I want to create support tickets from the email, the trick is I'd also like to assign them to the person CC'd on the email. I've got code to do it, but the conversation inside of HubSpot is missing the CC.  This works as long as the subject line doesn't include a Forwarded Forward:",
    "time_stamp": "2023-10-17 17:24:10"
  },
  {
    "poster": {
      "poster_name": "Nathan Vogele",
      "poster_handle": "nathan148"
    },
    "time_stamp": "2023-10-17 17:24:54",
    "text": "Screenshot on the left is the HubSpot view, screenshot on the right is the original gmail.\n\nYou can see the original gmail contains the CC but HubSpot seems to throw that part away when it creates the conversation."
  },
  {
    "poster": {
      "poster_name": "Nathan Vogele",
      "poster_handle": "nathan148"
    },
    "time_stamp": "2023-10-17 17:32:14",
    "text": "From an old support article, I've seen that HubSpot has a special rule to handle emails that come in with the subject line fwd: which ignores the original sender details when it creates the ticket, this is fine and expected behavior, but when you have a Fwd' in the subject line, there seems to be some behind the curtain code that's messing with what email is actually stored in conversations."
  },
  {
    "poster": {
      "poster_name": "Kevin Wong",
      "poster_handle": "kevin143"
    },
    "time_stamp": "2023-10-17 21:21:21",
    "edited": {
      "time_stamp": "2023-10-17 21:25:36"
    },
    "text": "Not sure where I can find the answer for this issue.\nI am working on the HubSpot Oauth integrations for our customers. We had created our OAuth App for 9 months (local, beta, staging and production) and they worked perfectly so far.\n\nBut today, when we did a Oauth login to our HubSpot account, we get this error message:\n```Couldn't complete the connection\nThe redirect_uri doesn't match the client registered redirect_uri. Please contact the app developer.```\n• We did not change any configuration/settings\n• We just get this problem in beta, the other environments are working good. (They are also in same HubSpot Developer account)\nAnyone knows who should I contract in HubSpot to resolve this problem?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-17 21:27:06"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2023-10-17 21:27:06"
  }
]