[
  {
    "poster": {
      "poster_name": "Ronald M.",
      "poster_handle": "info549"
    },
    "time_stamp": "2023-10-26 08:45:41",
    "text": "Hello. Why my website might receive the error \"Page not found\"? All was alright and suddenly it started to crash."
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-26 09:07:08",
    "text": "Hey Jaydip, just checking in to see how everything is going."
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-26 09:24:40",
    "text": "Is there any chance we can make the items hover to open on Desktop vs. on click?"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2023-10-26 09:25:55",
    "text": "Yes, I will make it.\n\nCan I ask some more time?\n\nI have to make my day off early today so can do final improvements by tomorrow morning. Is this ok or it’s urgent for today?"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-26 09:35:00",
    "text": "Ya that's no problem. I just need to done by EoD Friday."
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2023-10-26 09:35:32",
    "text": "Great! Will keep you posted:)"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-26 09:36:06",
    "text": "Thanks!"
  },
  {
    "text": "Hi all! I’m having an issue where the custom css and styles defined in the HubSpot settings and on actual form editor is not being applied to forms once they are placed on a landing page. The styles are visible when editing the form in the form editor but as soon as the form it added to a landing page the form appears to have no css applied to it. Here is an image of what a form looks like in the editor and once it is added to a landing page. There is a custom theme that is being used so I assume there is something wrong with the codebase just not exactly sure where the issue would be present. Any guidance here would be greatly appreciated.",
    "time_stamp": "2023-10-26 10:04:52",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-26 11:18:57"
      },
      {
        "time_stamp": "2023-10-26 11:32:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-26 11:18:57",
    "text": "1. Check that you have “Set as raw HTML” disabled in the form’s style options.\n2. Form styling is only for external embeds. When embedding a form in a HubSpot CMS web page or landing page, the styling is inherited from your theme instead. I don’t believe there’s a way to prevent or override this behavior."
  },
  {
    "poster": {
      "poster_name": "Grady Coyle",
      "poster_handle": "grady324"
    },
    "time_stamp": "2023-10-26 11:32:17",
    "text": "<@U04AQA0QM8E> Thanks for your response Evelynn. “Set as raw HTML” is disabled. To your second point, if I use a rich-text module and use the form’s embed code, the styling renders properly. The error where the form is not rendering the CSS only happens when selecting the form through the HubSpot default form module."
  },
  {
    "poster": {
      "poster_name": "Hema",
      "poster_handle": "hemachandra.ayodhya"
    },
    "time_stamp": "2023-10-26 14:07:38",
    "text": "Hi there , we are trying to export and download a HubSpot custom report using REST API , want to check if any one of you have tried it and it worked ?"
  }
]