[
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2023-10-02 02:50:46",
    "edited": {
      "time_stamp": "2023-10-02 02:52:10"
    },
    "text": "Hii, in Hubl there is a way to call your language by using `{{content.language}}` But is there also a way to call what languages the page is available in. I want to built a dynamic language switcher as we will have some pages in many languages while others only will be english and dutch.\n\nAnd if its not possible, is there then a way to validate that the page is available in x language, lets say Portuguese. and if not send the user to the homepage of the repective language"
  },
  {
    "poster": {
      "poster_name": "Colton Watson",
      "poster_handle": "cwatson"
    },
    "time_stamp": "2023-10-02 08:05:46",
    "text": "Those who use HS for SaaS, do you create a new `Deal` for each month/year reneweal for a single account? Or is there a better way to manage that?"
  },
  {
    "poster": {
      "poster_name": "Luca Bartoli",
      "poster_handle": "bartoli"
    },
    "time_stamp": "2023-10-02 08:10:36",
    "edited": {
      "time_stamp": "2023-10-02 08:10:52"
    },
    "text": "Please, someone tell Anthony Nardi to check that piece of code, understand what it does and decide if he wants to move it inside Js instead of the window global... he knows :grin:"
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-10-02 10:49:04",
    "text": "when you say, “on both columns”, are you saying neither of them are working, or that you just can’t get both working at the same time?\n\nI don’t know if you’re using a hubdb specific function to make the query, but I’ve had to use the following format when using some of the other search functions, like crm_associations:\n\n```{% set query = query ~ \"&amp;question__icontains__eq=\"~request.query_dict.search|urlencode ~ \"&amp;answer__icontains__eq=\"~request.query_dict.search|urlencode %}```\nPerhaps you’ll get better results with that.\n\nI’m only now realizing as I’m about to send this message that you asked this question 5 days ago and have likely figured it out by now."
  },
  {
    "poster": {
      "poster_name": "Chris Connors",
      "poster_handle": "cconnors"
    },
    "time_stamp": "2023-10-02 10:59:38",
    "text": "Hi <@U05K4BWFNLD> Could you create a new message for this? The teams that own these API have changed since 2020 and I think you'd be more likely to get the correct team by posting in <#C2YHAHB6K|api>. From reading the context here, this also appears to be unrelated from the original message."
  },
  {
    "text": "Hello everyone,  I’m currently running into an issue regarding a custom template I’m building within HubSpot. The issue is specifically occurring when using the drag and drop editor. After creating a new landing page and choosing my custom template to be applied to the page I’m running into an issue with the editor where if I drag one of the layout options on to the page for example the “2” layout the “Drop modules here” sections stack vertically instead of horizontally (See attached picture). I’m not exactly sure what’s going wrong here as the rest of the template seems to be functioning as it should. Any insight regarding this issue would be much appreciated, thanks!",
    "time_stamp": "2023-10-02 11:39:57",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-02 12:22:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-02 12:22:32",
    "text": "If I had to take a guess, this would imply there’s something up with your dnd grid styling. HubSpot doesn’t provide opinionated dnd grid styling within the builder itself — it’s something you define on a per-theme basis.\n\nIn the standard CMS Theme Boilerplate, this styling can be found in <https://github.com/HubSpot/cms-theme-boilerplate/blob/main/src/css/objects/_layout.css|objects/_layout.css> — albeit, rolled up into a for loop. _(you may also find <https://github.com/HubSpot/cms-theme-boilerplate/blob/main/src/css/objects/_containers-dnd.css|objects/_containers-dnd.css> useful)_\n\nI would expect to see the behavior you’re experiencing in one of two situations:\n1. You haven’t included dnd grid column styling.\n2. You have a custom dnd grid implementation with an off-by-one error, which is creating a total width greater than 100% and triggering a layout wrap."
  },
  {
    "poster": {
      "poster_name": "Jean-Christophe Charlier",
      "poster_handle": "jccharlier"
    },
    "time_stamp": "2023-10-02 15:47:40",
    "text": "Is it possible to call new PopUp CTA by button and *Populate some fields* by *passing* *params* (like in url ?option=premium) ?\nMy button code\n`&lt;button id=\"cta_button\" class=\"hs-cta-trigger-button hs-cta-trigger-button-137486979758 go26732895 ?*option=premium*\"&gt;Demandez un devis&lt;/button&gt;`"
  }
]