[
  {
    "poster": {
      "poster_name": "Kevin Meier (NWM)",
      "poster_handle": "kmi"
    },
    "time_stamp": "2023-10-23 03:14:07",
    "text": "Not really sure where to go with this since I am new to HubSpot and new to developing something for it. I don't want to make it too unique so I'll try to make it more of a broad question for general understanding. I have to develop a little application in HubSpot CMS that takes user inputs, does some (third party) API calls after receiving the input and if everything is fine, a form shall be filled and ultimately a deal (via HubSpot API) as well as a PDF file for direct download should be created.\nFor this, should I make a little JavaScript application for the frontend alongside a little webservice that handles the input and creates a deal via HubSpot API as well as the PDF and embed this application into a \"module\"? Or is there a better or more direct approach to it?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-24 09:21:50"
      }
    ]
  },
  {
    "text": "Anyone any idea how to force styles onto `iframe` CTA Popups?",
    "time_stamp": "2023-10-23 03:48:55",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-10-23 11:00:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Manoj Sharma",
      "poster_handle": "softengg.manoj"
    },
    "time_stamp": "2023-10-23 06:18:23",
    "text": "Hi! Is there any possibility that we can declare a custom thank you page redirect along with the selected form using Gutenberg in wp-admin?\nI know that we can define a custom redirect for a single form in HubSpot dashboard but what if I need a custom thank you page for single form used in multiple pages.\nI want the form on homepage to redirect to abc page and same form on contact us page to redirect to xyzzy page."
  },
  {
    "poster": {
      "poster_name": "Shashank",
      "poster_handle": "shashank.chutke"
    },
    "time_stamp": "2023-10-23 07:40:54",
    "text": "Hello team, I want to subscribe to message events form visitors on my HubSpot live chat integrated into my website. How can I do that?"
  },
  {
    "text": "Hi! does anyone know if I need any extra configuration to be able to access the create products endpoint? whenever I try to create a product, the api tells me that I don't have access to the ecommerce scope, but I do.",
    "time_stamp": "2023-10-23 10:41:11"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-10-23 11:00:12",
    "text": "Cascade Layers might be a solution <@U05NNKRAF35>, depending on which browsers you would need to support."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-10-23 21:40:05",
    "edited": {
      "time_stamp": "2023-10-23 21:40:15"
    },
    "text": "It doesn't impact the CRM cards built by CRM extensions APIs for public apps in Marketplace today."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-10-23 21:40:52",
    "text": "You should be fetching data using HubSpot's API using a serverless function."
  }
]