[
  {
    "poster": {
      "poster_name": "Vladimir Hernández",
      "poster_handle": "vladimir"
    },
    "time_stamp": "2019-07-01 09:19:54",
    "text": "Hey everyone. I have a question. Is there a way to know where is located a broken link? I have another site doing an audit for my webpage and it says that I have some issues with broken links but I can't find where I am calling this particular url."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-01 09:20:52",
    "text": "I would use a tool like screaming frog or SEMrush to do a site audit and pull that information"
  },
  {
    "poster": {
      "poster_name": "Vladimir Hernández",
      "poster_handle": "vladimir"
    },
    "time_stamp": "2019-07-01 09:21:57",
    "text": "I'm using SEMrush actually and it gives me the url that is broken but it doesn't really tell me where this URL is being called"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-01 09:24:51",
    "text": "What is the page it's saying has the broken link and what is the link that is reported as broken (you can DM that info if you dont want to share publically). I found best way to do it is load the page and go into inspector then do a find for the link"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-01 09:26:07",
    "text": "in the issues tab, there should be the ability to filter to just the BroKen Links, in that list, the \"Page URL\" is the URL that has the broken link and the \"Link URL\" is the broken link"
  },
  {
    "text": "",
    "time_stamp": "2019-07-01 09:28:02"
  },
  {
    "poster": {
      "poster_name": "Vladimir Hernández",
      "poster_handle": "vladimir"
    },
    "time_stamp": "2019-07-01 09:32:37",
    "text": "Yeah, that's exactly what I'm looking right now but the thing is that the page itself is the one that gave me trouble."
  }
]