[
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2022-06-29 08:29:49",
    "text": "I believe React is often overkill and diminishes the one thing most websites aim to maximize, their SEO. React is best for highly reactive single page applications, utilizing the virtual DOM to manage user interactions and changing state efficiently. It isn't as strong when it comes to static page generation, where content changes slowly over time, the exception being tools like Remix or NextJS. However, HubSpot has several tools to help collect and organize metrics and inbound requests, including forms, CTAs, drag-and-drop modules, custom templates, local development via the CLI + Webpack plugins, user data metrics and dashboards. Blog posts and listings are built with templates that are fully customizable, as well. I develop my sites with TypeScript and a few small libraries, while leveraging as much of HubSpot's tooling to minimize the work I have to do maintaining the code. If you're set on using React for parts of your site, you may want to consider Preact's smaller footprint."
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-06-29 09:42:11",
    "text": "Cool, thanks for your reply :slightly_smiling_face: So how are you actually developing HubSpot websites? You are saying you are using JS frameworks like Remix and Nextjs for that? Or are you just building the websites with those frameworks and sourcing it with the HubSpot API’s?\n\nI actually now finished a boilerplate for local development and included Tailwind CSS in it while watching and uploading files back to HS, so the dev experience is slightly improved now. But I still do prefer a JS framework like a Next or Gatsby if thats possible. I am curious about your approach and maybe I could hire you for some time to help us get started?"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-06-29 10:34:26",
    "text": "Oeps, never mind! Read it more carefully now and I assume you are using the HS CLI and use typescript when building your website locally."
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2022-06-29 11:02:30",
    "text": "I enjoy the benefits of an all-in-one solution for the backend and information aspects of websites, though I come from a background using full-stack frameworks to manage all parts myself - sounds like you do, too. The most difficult part with standard HS development is relying on HS to display your code updates. This can be mitigated by moving to things like web components and building those in a highly reactive way before connecting them to the HubSpot layer.\n\nI'm happy to talk about how I can help - shoot me a DM and we can chat!"
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2022-06-29 13:09:26",
    "edited": {
      "time_stamp": "2022-07-11 16:08:24"
    },
    "text": "*Private Beta Invite: Extend HubSpot's UI with Developer Tools*\nHello! I work with HubSpot as a product manager, and currently looking into use cases for UI Extensibility for HubSpot portals.\n\nWe are looking to invite Enterprise customers and partners for the upcoming private beta (July 14). This beta enables developers to extend HubSpot's UI for their business use cases, on multiple extension points - beginning with the CRM records page right side panel and a new middle panel tab. Developers can create new CRM cards and card apps with UI components, deploy and host them on the HubSpot platform using serverless functions. These tools involve using a new developer home, development sandboxes, developer projects, private apps, and a growing library of components.\n\nIf you are interested in participating in this beta, please fill out this form, or message me: <https://forms.gle/5KMV1UUkDHRY58Wv6>. If you cannot participate in the beta but still want to chat about it, that's great too!\n\nThank you!"
  }
]