[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-01 02:54:31",
    "text": "Hi, is there a respository with useful HubSpot Code snippets?",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-01 03:26:15"
      },
      {
        "time_stamp": "2019-03-01 03:27:05"
      },
      {
        "time_stamp": "2019-03-01 03:27:11"
      },
      {
        "time_stamp": "2019-03-01 03:32:49"
      },
      {
        "time_stamp": "2019-03-01 03:34:19"
      },
      {
        "time_stamp": "2019-03-01 03:34:27"
      },
      {
        "time_stamp": "2019-03-01 03:42:32"
      },
      {
        "time_stamp": "2019-03-01 03:48:25"
      },
      {
        "time_stamp": "2019-03-01 04:01:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-01 03:26:15",
    "text": "You could steal parts of <https://github.com/TheWebTech/CrankShaft>\n\nI’ve also got this bad boy: <https://spin.d.pr/9a4ueK>\n\nwhich may someday get rolled directly into crankshaft"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-01 03:27:05",
    "text": "cool thanks a lot. How is crankshaft progressing?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-01 03:27:11",
    "text": "i am looking forward to it"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-01 03:32:49",
    "text": "It’s currently in the same state it was in before basically. A lot of brainstorming has gone into it, but on the actual execution/build out we’re not currently moving as fast as I’d like. The main reason development isn’t moving faster is kinda my fault. What the project needs is someone to play project manager, creating some tasks with a little bit of guidance behind them, so people understand how they can contribute.\n\nUnfortunately my attention is split in several areas, and while I’m happy to help out on the project and help guide it, it’s hard for me to find time to  sit down and write out clear issues for people to work off of to get things started.\n\nOnce we get to a certain point with the framework(such as having our own grid method fully set up. then the rest of the development will come a lot easier because for most of us, the grid is the main important thing everything else is extra"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-01 03:34:19",
    "text": "basically I want to find someone who’s interested in helping lead that project. it doesn’t mean they have to do the majority of the dev work on it or anything, just means they’d need to help with guiding others in how they can help contribute to it.\n\nWe have a lot of people who have voiced they want to help, they just don’t currently know the best way to do it"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-01 03:34:27",
    "text": "thanks for the detailed info and your work for the HubSpot community!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-01 03:42:32",
    "text": "no problem I’m excited for that framework. I have one I built for my company that we use for our client sites and it’s been immensely helpful, and makes building out sites on HubSpot really fast, but I can’t open source that framework itself.\n\nThe framework I have internally is based heavily on the HubSpot  boilerplate which is now years old, but with crankshaft I want to completely re-think how things are done to take advantage of all of HubSpot specific technology we can take advantage of, from how includes work to imports, to how files are combined. all of it, to make a development experience that’s fast and enjoyable."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-01 03:48:25",
    "text": "oh also related to your request for code snippets:\n<https://github.com/williamspiro/HubL-Language-Extension>\n\nIf you use VSCode this extension has shortcuts for generating common hubl snippets, and hubl vars, functions, filters and tags"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-01 04:01:58",
    "text": "thanks"
  }
]