[
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 01:34:35",
    "text": "Hello <@UFBNA9K9A> again. I fixed my problem with your help. where dropdown menu only slides when I click it by jquery,but there is one last problem left, I think navigation menu by default when dropdown is slided and mouse is out it disappears automatically, and I want to stay there until user clicks again to toggle back. there is no mouseout function or any other kind. any idea? thanks in adnvace"
  },
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 05:46:29",
    "edited": {
      "time_stamp": "2019-03-14 04:25:32"
    },
    "text": "I have navbar Menu and on hover, it dropdowns menus, also when i leave mouse it disappears as it should. I made with Jquery onclick dropdown, but  since (Menu) is module I can't access exactly div elements so how can I stick(freeze) until user toggle backs not by mouseout and cannot be clickable to outside the dropdown menu either. Jquery CSS any ideas?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-13 05:47:14"
      },
      {
        "time_stamp": "2019-03-13 07:53:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 05:47:14",
    "edited": {
      "time_stamp": "2019-03-13 05:47:22"
    },
    "text": "You can See example here on FURNITURE\n<https://info.thecontractchair.co.uk/blog?__hstc=98094784.70f19840120925eca9cb6046578e1d4d.1547816129289.1552464650072.1552468587719.40&amp;__hssc=98094784.64.1552468587719&amp;__hsfp=316438210>\n\nwhen mouse is out it dissapears"
  },
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 07:53:05",
    "text": "Despite all :hover removed from CSS . menu still dropdowns on hover"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-03-13 08:13:00",
    "text": "I have to admit I’m a little stumped on this one. I’m gonna come back to this one later with a clear head, hopefully someone can help you from your other post in <#CBA9UA4EN|javascript>  in the meantime"
  },
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 08:52:54",
    "text": "<@UFBNA9K9A> Thank you for your response Yea no need to hurry, meanwhile I'll update you I removed all :hover from CSS  to see the results and still it dropdown-s li elements by hover i think module has it hover by default not sure. thank again no need to hurry I'll get notification tomorrow"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2019-03-13 09:02:48",
    "text": "<@UGJ3XBBGF> I don’t think it is controlled with the hover pseudo, I think that JS is adding a class to the parent container and the styles are attached to that. It’s possible that it’s just adding the styles inline on those elements.\n\nIf you want to override this you’ll have to overwrite the class styles or if they’re inline, use a lot of gross !importants. You may have an easier time just adding the menu into a custom module so you don’t have to detune it."
  },
  {
    "poster": {
      "poster_name": "Nick Dgebuadze",
      "poster_handle": "nika"
    },
    "time_stamp": "2019-03-13 09:33:36",
    "text": "<@U26DA9CQ0> Thank you for response, I checked in but there is no any JS script that adds any style or class or anything to menu. as for adding the menu unfortunately I can't do that its already written project and  I am only modifying. its display : grid  in CSS and with hover or without it it still dropsDown with hover"
  }
]