[
  {
    "poster": {
      "poster_name": "Mitesh Koshiya",
      "poster_handle": "miteshkoshiya5854"
    },
    "time_stamp": "2023-08-18 04:43:36",
    "text": "Hi\nIs email is required for creation of contact in hUbspot?\n[4:13 PM] What if we don't have email"
  },
  {
    "poster": {
      "poster_name": "Mitesh Koshiya",
      "poster_handle": "miteshkoshiya5854"
    },
    "time_stamp": "2023-08-18 04:43:52",
    "text": "using API."
  },
  {
    "poster": {
      "poster_name": "Jatin Sharma",
      "poster_handle": "jatin.sharma"
    },
    "time_stamp": "2023-08-18 04:59:19",
    "text": "hi all,\nhow can i convert automated email to single send api"
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2023-08-18 05:14:11",
    "text": ""
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-08-18 07:30:09",
    "text": "Who’s the PM or Developer PM over Marketing Events and Campaigns?"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-08-18 11:05:47",
    "edited": {
      "time_stamp": "2023-08-18 11:05:49"
    }
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-08-18 14:12:22",
    "edited": {
      "time_stamp": "2023-08-18 14:14:27"
    },
    "text": "I have been noticing issues with Cloudflare CDN not updating cached versions of pages recently... Probably 4-5 occasions on different pages (not just a blog listing, but I have seen it happen in this scenario as well), I have updated within the page editor, clicked update, and experienced same as you <@U044VLH18R2>: live page different from preview, and live URL with ?nocache added as URL parameter displays correctly.\n\nBecause HubSpot serves up a non-cached URL correctly, and live URL incorrectly, it's making me think there is some issue lately with HubSpot's connection to Cloudflare CDN.\n\nAfter waiting 6-12hr, the live page magically updates, with no other action on my side within HubSpot. :thinking_face: :face_with_raised_eyebrow:\n\nI also found the workaround of spinning up a new page with same template work to display changes. But then I got tired of doing that to resolve the display issues, as it resulted in so many extra steps when managing a lot of edits"
  }
]