[
  {
    "poster": {
      "poster_name": "Matt",
      "poster_handle": "mtunney"
    },
    "time_stamp": "2023-08-21 03:28:36",
    "text": "Hi All,\n\nHas anyone done anything to capture an unique id per contact/visitor that can also tie in to user data in google analytics?\nIs this even acceptable practice given GDPR requirements.\n\nI’m thinking the easiest value to capture might be a users google analytics ID"
  },
  {
    "text": "Hi! A newbie here who would appreciate some guidance. I'm aware that the Drag and drop template is outdated, but need to help a client update an existing page template built as a \"Drag and drop template\".\n\n*Question:* Is it possible to add a block with custom HTML to the \"Drag and drop template\" nowadays? I can see that the client have som Module Groups with Custom HTML blocks (see print screen), but it seems like it's not possible to add a new custom code block to a Module Group - can anyone confirm? Or is it possible somehow?",
    "time_stamp": "2023-08-21 06:04:56",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-29 15:29:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-08-21 08:56:28",
    "text": "<@U03AKL6Q1B2> Yes, it’s a real one. This is it: <http://nwwineco.com|nwwineco.com>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-21 09:30:56",
    "text": "<@U01U201MTQF> interesting, and are you using a real email, or similar to the screenshot something like \"username@\" - the server can detect globally bounced emails, so I would start there if you haven't already"
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-08-21 09:33:04",
    "text": "It was an actual email. I realized this when a user reached out letting me know that they cannot submit the form. I’ll dm you the email since I cannot publish it here."
  },
  {
    "poster": {
      "poster_name": "Adrian Mattoon",
      "poster_handle": "adrianmattoon"
    },
    "time_stamp": "2023-08-21 11:39:59",
    "edited": {
      "time_stamp": "2023-08-21 11:40:17"
    },
    "text": "Hi Everyone. I need some help. I am a total newbie to HubSpot developing and I have been reading through all the developer documentation. I want to create a panel or custom card on the activities view on individual companies that show the growth and renewal pipelines and filter them by date. But I cannot seem to figure out how to pull the pipeline data"
  },
  {
    "poster": {
      "poster_name": "Casey Iannone (HubSpot PM)",
      "poster_handle": "ciannone"
    },
    "time_stamp": "2023-08-21 11:56:54",
    "edited": {
      "time_stamp": "2023-08-21 12:09:09"
    },
    "text": "Hello :wave:\n\nI'm a PM in HubSpot's developer product group and want to chat with a handful of devs regarding their overall workflow/\"dev-ops\" process. Focused mainly on HubSpot integration/customization work and would like to learn about the stack and tools you use, why you use them, and how they impact (_perceived or measured_) your productivity as a HubSpot developer.\n\nIf you're up for a ~30-minute chat, be it async or <https://meetings.HubSpot.com/casey-iannone|zoom>, feel free to shoot me a dm or drop a line in the :thread:"
  },
  {
    "poster": {
      "poster_name": "Jacki Tamez",
      "poster_handle": "jackitamez"
    },
    "time_stamp": "2023-08-21 12:20:30",
    "text": "Hey guys! I made a little site and then checked it out on mobile and the menu button is not showing up! I could really use some help in seeing what is up because we all know most people access things from their photos. <http://hillshall.com|hillshall.com>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-22 07:53:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Hank Groman",
      "poster_handle": "hank"
    },
    "time_stamp": "2023-08-22 00:30:21",
    "text": "Hi Thomas, did you find a home for those tickets?"
  }
]