[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-09-16 07:23:46",
    "text": "I recently ran into a site breaking bug related to prerendering and global modules. It was a mess to figure out. But it’s all solved now. Unrelated but also related"
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2021-09-16 08:34:11",
    "text": "When we were building a theme for the marketplace we found global partials didn't work correctly for the blog listing template and HubSpot recommended to us to just utilize a beta feature where when on the listing page you can click the sprocket and \"Edit Page\" to edit the listing.\n\nWe had a user though who bought our theme and did not have this feature and thus was unable to edit the listing page. We directed them to HubSpot support to get the feature added but they came back to us saying HubSpot support wasn't able to help. Is HubSpot support not aware of the feature??",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-16 09:16:31"
      },
      {
        "time_stamp": "2021-09-16 09:20:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-09-16 09:16:31",
    "text": "Hi Alyssa, I’m sorry about this. Do you have the customers portal ID? I can ungate them for this now. Also, do you have the support ticket ID? I can look into that as well."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-09-16 09:20:14",
    "text": "You can DM me the above info as well :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-09-16 12:41:04",
    "text": "I didn't think it was related to this but I did have issues with global modules being out of date. I ended up resetting them but for a moment I was stuck with an out of date version."
  }
]