[
  {
    "poster": {
      "poster_name": "Gustavo Graeff",
      "poster_handle": "gustavo.graeff"
    },
    "time_stamp": "2024-09-27 04:20:27",
    "text": "<@U048C858Y94> any news here?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-09-27 09:47:14",
    "text": "Hey Gustavo,\n\nI’ve experienced the need to refresh to see changes. But on my end the issue was always related to including `no_wrapper=\"True\"` on a custom module. You seem to be using `export_to_template_context=true` to extend your access to fields in a non-custom module? I’ve never used that before. And after reading the documentation on it nothing is jumping out at me as an issue.\n\nSorry!"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-09-27 11:09:12",
    "text": "I’m digging into this some more. I don’t have an answer yet. But I was wondering if new modules appeared on the left as soon as you add them via your “Email Module Selector” module, or do you need to hit the HubSpot refresh link, or reload the entire page first?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-09-27 11:17:22",
    "text": "And likewise for deleting modules. Looks like they stick around until you reload the entire page?"
  },
  {
    "poster": {
      "poster_name": "Gustavo Graeff",
      "poster_handle": "gustavo.graeff"
    },
    "time_stamp": "2024-09-27 14:18:15",
    "text": "Exactly!"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-09-27 15:14:32",
    "text": "Yeah, I just drafted up my own bare bones version of what you’re doing and I’m seeing all of the same issues. Not sure if any of these are fixable with this approach."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2024-09-27 15:16:27",
    "text": "I solve the drag-and-drop approach by just using repeatable blocks within just one module. Instead of allowing the user to add multiple modules at the top level via that for loop, I just use repeatable blocks at the second level.\n\nHaven’t had any issues. Aside from losing the ability to click on each section on the right to open it on the left. Which is a bummer. But it’s an acceptable tradeoff for me."
  }
]