[
  {
    "poster": {
      "poster_name": "Martin Hlavacka",
      "poster_handle": "mhl"
    },
    "time_stamp": "2022-04-20 05:01:19",
    "text": "Hi guys, I have a client who needs to migrate about 193 pages spread across 12 domains from one HS account to another one. Is there any plugin I could use for that? I did quite some research and spoke to HS support, too - as of now, it seems like there is only heavy manual migration approach available, where I will have to manually migrate both content and all the linked media files. That will, however, take me crazy amount of hours and cost a rocket. Have you experienced similar situation, maybe? Have you managed to solve it somehow?"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2022-04-20 09:34:09",
    "text": "Is there any way to handle a GDPR re opt-in from the API?\nI can opt-out within the API, or swap around individual subscriptions. But can't get someone re-enroled after it was opt-out.\nIs there any best practice when trying to keep sync different platforms? (oneTrust in my case)"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2022-04-20 10:28:01",
    "text": ":sparkles:*Hello HubSpot Developers!*:sparkles:\n\nSome of you may have received an email requesting your feedback through our Developer NPS. It is now open and we'd REALLY appreciate your time - it'll take you 5-10 minutes to fill out.\n\n:sprocket-dance:*<https://www.surveymonkey.com/r/devnps2022>*:sprocket-dance:\n\nWe read and analyze every single response and share the outcomes across the company. We'll be closing this survey soon, so please take the time to provide your valuable feedback right away!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-22 09:13:18"
      }
    ]
  },
  {
    "text": "Hi Everyone. I used the country coding mentioned here <https://community.HubSpot.com/t5/9881-Operations-Hub/Code-to-standardize-state-region/td-p/410068> in workflows custom code but it did not give me the out put. Can you guide me here please.",
    "time_stamp": "2022-04-20 11:08:09"
  },
  {
    "poster": {
      "poster_name": "Caitlin Siegrist",
      "poster_handle": "csiegrist"
    },
    "time_stamp": "2022-04-20 14:26:10",
    "text": ":wave::skin-tone-2: Hi everyone! It's Caitlin from HubSpot's Platform Ecosystem Team popping in to let you know we're launching another App Accelerator program in mid-May with a focus on the CRM &amp; Sales Hub. If you're interested to learn more about the program, fill out <https://www.HubSpot.com/partners/app/accelerator|this form> to get added to the kickoff meeting invite. I hope to see lots of you there!"
  }
]