[
  {
    "poster": {
      "poster_name": "jai",
      "poster_handle": "jai"
    },
    "time_stamp": "2022-04-18 05:02:48",
    "text": "How to integrate partytown in HubSpot for site speed optimization?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-18 07:59:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-04-18 07:59:58",
    "text": "I’ve never heard of this library and therefore doubt there’s a built-in integration, but I’d suggest looking at their getting started page: <https://partytown.builder.io/getting-started>\n\nNote, built-in HubSpot scripts will not be able to be manually edited (such as the analytics, form, or CTA scripts), and even if they could, changing the load order of those assets is not recommended and could have adverse effects in terms of both analytics and on-page UX."
  },
  {
    "poster": {
      "poster_name": "Nishant Agrawal",
      "poster_handle": "nish"
    },
    "time_stamp": "2022-04-18 13:04:05",
    "text": "Hey guys! Does anyone know if it's normal for all refresh tokens for all users to become invalid once you update the App Listing description?"
  },
  {
    "poster": {
      "poster_name": "Dylan Kapustka",
      "poster_handle": "dylan.kapustka"
    },
    "time_stamp": "2022-04-18 15:36:57",
    "text": "Hi All,\n\nI was just wondering if anyone has experience with designing a website using Webflow and converting it to HubL syntax styling, or if something like that has been done! Thanks. "
  },
  {
    "poster": {
      "poster_name": "Spencer Knisely",
      "poster_handle": "spencer680"
    },
    "time_stamp": "2022-04-18 17:41:22",
    "text": "Has anyone seen a solution that would allow reporting on nested company structures? I have a client that looks at their business in 4 tiers. A, B, C and D level companies. D companies are all owned by C companies. C companies are all owned by Bs. Bs owned by As.\n\nWhat they want is to be able to do revenue and forecast reporting at any level and have the report display the totals for all companies nested below.\n\nAny ideas?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-18 17:55:31"
      },
      {
        "time_stamp": "2022-04-19 06:15:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Patrick Allmond",
      "poster_handle": "patrick484"
    },
    "time_stamp": "2022-04-18 17:55:31",
    "text": "This may be overkill, but I bet you could run these companies on 4 different HubSpot accounts. Then look at Databox for reporting. I am pretty certain you could do this because you can define custom metrics from different data sources (i.e. different HS accounts). Get a free DB account and start playing with it. Their live chat support is great."
  }
]