[
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-04-06 08:23:49",
    "text": "Hey Jon, happy to help where I can here, I’ve done some similar stuff in the past.\n\nWith blog listing pages now having the ability to use the DND editor, I would use that as the “pillar page” rather than building an additional landing/website page for it (as long as that works for your content editing team). The listing page does NOT need to include a standard post listing MODULE, and instead can use something like a custom module or even manual-entry DND content to display the “front page” of posts you want to feature. I do usually revert to a standard listing view (card or list, etc…) for subsequent pagination of the post feed beyond page 1. This also gives you the built-in features of the blog so they are available for use, such as pagination, categories, etc… all available directly in the blog without having to use an additional HubL function to manually bring that data in.\n\nYou *can* publish pages below the blog root, however, note that some URLs will be automatically generated by the blog (in this case, literally page-2, page-3, etc… for pagination of further listing page views), so those slugs should be avoided to prevent errors.\n\nThis is a bit of a big question, so I’m happy to connect in DMs or jump on a quick call to discuss."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-04-06 09:34:23",
    "text": "I have a filed on a form that uploads a file, (file property in HubSpot) I then copy this file to a custom object which is attached to another contact (again a file field) I then send an email to the other contact so they can download the file, however the file is private by default, is there anyway I can automatically make the file public or allow the other contact to download it through association?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-04-06 09:35:11",
    "text": "Also adding the file link to an email replaces all the &amp; with &amp which means the link doesn’t work in the email even if you are logged in"
  },
  {
    "text": "Hi;\nI am trying to remove featured posts when visitor clicks on pagination.\nHas anyone done it before? We have a template like the screenshot for the blog listing page. Two listing module: one for featured posts one for others.",
    "time_stamp": "2022-04-06 09:43:23",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-06 13:26:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-04-06 13:26:46",
    "text": "I’d move to a coded template for more flexibility."
  }
]