[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2022-04-04 02:45:45",
    "text": "Привіт <@U032BTG5EG6>\nHappy to see more fellow Ukrainians considering HubSpot. As someone with some Shopify experience back in the days, I’d say that from dev perspective HubSpot is much more better :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "N Ahmed",
      "poster_handle": "nahmed"
    },
    "time_stamp": "2022-04-04 03:33:06",
    "text": "Hi guys, I've integrated a third-party calling solution with HubSpot using the `Calling Extensions SDK`. Integration works fine and the users are can make outbound calls to contacts. Now we have the requirement of embedding the HubSpot in our CMS. When we embed the HubSpot in Iframe outbound calling stops working. We can see our calling widget has sent the `initialized` event to HubSpot on page load. When the user clicks on the dial call button from the contact details page, we do not receive the message from HubSpot in `onDialNumbe` function."
  },
  {
    "poster": {
      "poster_name": "N Ahmed",
      "poster_handle": "nahmed"
    },
    "time_stamp": "2022-04-04 03:34:48",
    "edited": {
      "time_stamp": "2022-04-04 03:35:21"
    },
    "text": "I've also noticed the following error message in  browser logs when HubSpot is embedded in an iframe `[Report Only] Refused to frame '&lt;URL&gt;' because an ancestor violates the following Content Security Policy directive: \"frame-ancestors 'self' <http://app.HubSpot.com|app.HubSpot.com>.`"
  },
  {
    "poster": {
      "poster_name": "N Ahmed",
      "poster_handle": "nahmed"
    },
    "time_stamp": "2022-04-04 03:35:11",
    "text": "might be this error is causing the problem"
  },
  {
    "poster": {
      "poster_name": "Barry Grennan",
      "poster_handle": "barry"
    },
    "time_stamp": "2022-04-04 06:50:09",
    "text": "This is a strange one to me!\nA client asked for a local module to be changed to global. So I went into it's meta.json and changed `\"global\" : false,` to `\"global\" : true,`.\nThat was fine, the module was global now and could be edited.\nThe client then changed their mind, so I flipped it back. The local content they'd previously entered shows back up but now when you go to edit it says \"The creator of this template prevented editing this module in the content editors.\"\nThe only thing changed was the  `\"global\"` value"
  }
]