[
  {
    "poster": {
      "poster_name": "Tom Wright",
      "poster_handle": "tom210"
    },
    "time_stamp": "2021-04-28 01:49:30",
    "text": "Hi everyone! I'm trying to change the background colour of an embedded meetings link (iframe) inside a landing page. Is there a way to target it to change the background without changing the settings within HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Gray Rhino",
      "poster_handle": "saeed"
    },
    "time_stamp": "2021-04-28 02:44:17",
    "text": "Fixed"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2021-04-28 06:10:50",
    "text": "wow this is huge. thanks so much! i'm going to dig into that hubl variables page now"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2021-04-28 06:22:55",
    "text": "<@U7V9DQ31P> another thing I notice in your example is that your page contains no HubSpot CTAs which I think is helping to. Thanks again for sending"
  },
  {
    "text": "Hi everyone,\nI'm trying to add an external form to our HubSpot website. I'm using an html module to implement the iframe script that was provided to me by the developers/creators of the form. Then I got an error saying \"*https*’s server IP address could not be found.\"\n\nDo you have any ideas how I can fix this issue?\n\nThank you!",
    "time_stamp": "2021-04-28 06:27:04",
    "edited": {
      "time_stamp": "2021-04-28 06:27:23"
    }
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2021-04-28 06:54:35",
    "text": "No forms either"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2021-04-28 06:55:21",
    "text": "I’m back to being obsessed with improving my core web vitals.  I’m so close, but so far away."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 06:57:50",
    "text": "Do note, core web vitals is still only one of thousands of ranking factors that Google looks at.\n\nDanny Sullivan at Google:\n&gt; _“First of all, it remains one of many things._\n&gt; _Secondly, it’s always the case that we’re going to try to return the best content based on this basket or bucket of things._\n&gt; _So, maybe you don’t have the best page experience… But if you’re still the most relevant content, that is going to you know overall on various things we’re looking at._\n&gt; _I think it’s not a case of start being all super concerned. And understand that we want to make sure that this is coming in a moderated fashion…_\n&gt; _But over time what will happen is, as more and more content is coming up in page experience and if you’re in a situation where things are all relatively equal, the things that are more page experience and oriented are likely to start doing better._\n&gt; _So it’s not… I don’t think freak out but do pay attention to it, do understand that it’s a new thing that you need to keep in mind._\n&gt; _That’s why we’re highlighting it.”_"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 07:05:17",
    "edited": {
      "time_stamp": "2021-04-28 07:11:02"
    },
    "text": "With web page performance you are always going to have to make trade offs.\n\nFor example if all you cared about was speed, you’d be delivering web safe fonts on a white background HTML only  web page with minimal images. No JavaScript and minimal CSS.\n\nFor most businesses there’s value in branding. There’s value in analyzing your marketing strategies because it in turn results in higher sales.\n\nIf you have a form on your site that is accounting for 50+% of your sales/leads. Are you going to cut that form out just to improve page speed? No that’d be ridiculous.\n\nFocus on what makes your flywheel spin. Site speed is one of thousands of factors that affect customers experience with your company.\n\nFocus on reducing friction for yourself and consider comparing to competitors to see how things will really shake out overall.\n\nIf your page speed is on average better than your competitor, it’s probably more valuable to focus on other aspects of your flywheel, because you’re not likely to see a drastic difference in the core web vitals update."
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2021-04-28 07:48:17",
    "text": "Yes good positioning Jon."
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2021-04-28 07:51:56",
    "text": "While we're on this fun thread though I do have one other question... When I run PageSpeed Insights I can see massive swings in page score (sometimes 30+ points) without any changes in code/content. I assume this is due to network conditions and the initial server response time but I'm wondering if others have experienced similar and if there are any patterns."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 07:55:46",
    "text": "Yes generally speaking it’s a result of the network connection. There’s a lot of different factors at play. Basically the score is calculated by a weighted percentage of actual measurements on the page, and not any of the recommendations google puts out at the bottom of the report.\n\nSo things like your own computer’s cpu usage, memory, cpu speed, gpu speed(if the page utilizes gpu), your network conditions, browser extensions, the network conditions of all of the nodes between you and the server, etc, all of that have an affect on the measurements. Most of it is usually minimal but it does fluctuate.\n\nAdditionally the lighthouse API and google page speed insights frequently return differing results."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 07:57:37",
    "edited": {
      "time_stamp": "2021-04-28 07:58:24"
    },
    "text": "In other words, you could follow every one of Google’s recommendations, but your router, or ISP could have a little hiccup in the chain and boom your score tanks for no good reason.\n\nThis is why you should look at multiple tools, and look at lab data vs real world data"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 07:59:19",
    "text": "We have a little more context into this here:\n<https://developers.HubSpot.com/docs/cms/guides/speed#performance-testing>"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2021-04-28 08:14:34",
    "text": "Agreed with Jon.  The reality of using the lighthouse API means that I can swing my numbers quite a bit.  Opening in an incognito window on the fastest network I have access to vs regular browsing can mean the difference between passing or failing core vitals"
  },
  {
    "poster": {
      "poster_name": "manjiri sonar",
      "poster_handle": "manjiri.sonar"
    },
    "time_stamp": "2021-04-28 09:32:15",
    "text": "Hi I am trying to fetch HubSpot newsletter on our wordpress site frontend.\nCan anyone suggest me how to do that?\n \nI have tried below api\n<https://api.hubapi.com/marketing-emails/v1/emails?hapikey=XXXX&amp;limit=2>\n \nBut where I cant find parameter where I get whole email content. Can anyone help me here?\nAlso is there any other api for fetching newsletter?",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-28 09:33:27"
      },
      {
        "time_stamp": "2021-04-28 09:35:41"
      },
      {
        "time_stamp": "2021-04-28 09:45:16"
      },
      {
        "time_stamp": "2021-04-28 09:45:32"
      },
      {
        "time_stamp": "2021-04-28 12:31:38"
      },
      {
        "time_stamp": "2021-04-28 12:31:49"
      },
      {
        "time_stamp": "2021-04-28 16:07:52"
      },
      {
        "time_stamp": "2021-04-29 09:21:00"
      },
      {
        "time_stamp": "2021-04-29 09:21:20"
      },
      {
        "time_stamp": "2021-04-29 09:21:54"
      },
      {
        "time_stamp": "2021-04-29 09:22:08"
      },
      {
        "time_stamp": "2021-04-30 03:33:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-04-28 09:33:27",
    "text": "You should not do a call out from your front end to HubSpot Apis using your hapikey as this would expose your key on your website"
  },
  {
    "poster": {
      "poster_name": "manjiri sonar",
      "poster_handle": "manjiri.sonar"
    },
    "time_stamp": "2021-04-28 09:35:41",
    "text": "how to get newsletters on frontend? any idea?"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2021-04-28 09:44:43",
    "text": "Thanks again guys... Didn't realize your own network even came into play... I thought the score was determined between Google servers and HubSpot servers"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-04-28 09:45:16",
    "text": "You could get the RSS Feed XML of your HubSpot blog and pull it from there"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-04-28 09:45:32",
    "text": "<https://knowledge.HubSpot.com/cos-blog/where-can-i-find-my-HubSpot-blog-rss-feed-url>"
  },
  {
    "poster": {
      "poster_name": "Cory Kelley",
      "poster_handle": "cory319"
    },
    "time_stamp": "2021-04-28 09:56:05",
    "text": "Hi all, this may not be the best thread and has maybe been answered already, in that case, if someone could link to the thread that'd be amazing. I'm working on a hero section for a client and currently we just have a dnd section with a background image, but they would like the option to also put a gif in the form of a video tag with an mp4. Is there a way I can add some sort of functionality that will let them choose whether they'd like an image or video so that I can achieve this? I want the video to span the width of the page as the background image (cover) does."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 10:30:00",
    "text": "It unfortunately completely depends Chris. for example if you use the API, it’s Googles servers doing all the testing - but it seems to be different servers than Google Page Speed. If you use google page speed insights it’s google’s servers doing the testing. If you use lighthouse in your browser it’s all done locally on your computer.\n\nRegardless even with Google Page Speed and the API those measurements will still be different every time for the same exact reasons, it’s just a different computer doing the test.\n\nFor a more full picture of your site’s performance you should really look at multiple tools, both lab and real world and consider even running tests multiple times and averaging the results."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 10:30:40",
    "text": "is there an efficient way to create a template from a page that has been modified/created/edited in the website editor?",
    "reply_count": 18,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-28 11:21:30"
      },
      {
        "time_stamp": "2021-04-28 11:37:00"
      },
      {
        "time_stamp": "2021-04-28 11:37:25"
      },
      {
        "time_stamp": "2021-04-28 11:37:41"
      },
      {
        "time_stamp": "2021-04-28 11:38:05"
      },
      {
        "time_stamp": "2021-04-28 11:38:38"
      },
      {
        "time_stamp": "2021-04-28 11:43:05"
      },
      {
        "time_stamp": "2021-04-28 11:43:40"
      },
      {
        "time_stamp": "2021-04-28 12:12:57"
      },
      {
        "time_stamp": "2021-04-28 12:14:08"
      },
      {
        "time_stamp": "2021-04-28 12:14:36"
      },
      {
        "time_stamp": "2021-04-28 12:14:46"
      },
      {
        "time_stamp": "2021-04-28 12:43:45"
      },
      {
        "time_stamp": "2021-04-28 12:44:46"
      },
      {
        "time_stamp": "2021-04-28 16:43:56"
      },
      {
        "time_stamp": "2021-04-28 16:45:02"
      },
      {
        "time_stamp": "2021-04-28 16:45:07"
      },
      {
        "time_stamp": "2021-04-28 17:17:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 10:31:17",
    "text": "For example, someone uses a simple page template and adds new content, modules, etc."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 10:31:33",
    "text": "and then I want to create a new \"selectable\" template from that page"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 10:35:41",
    "edited": {
      "time_stamp": "2021-04-28 10:41:36"
    },
    "text": "The other thing that none of these tests will do which is honestly a huge deal - they don’t test at all your site’s overall performance. They are testing 1 page.\n\nSo for example, if you have one monolithic CSS file and a monolithic JS file, you wont see recommendations for “reduce http requests” but you’re being really inefficient on delivering assets. Besides the point that reducing http requests isn’t really that big of a deal in the age of HTTP2, I mean don’t go crazy and have a million separate files but thinking in terms of modules is brilliant.\n\nInstead if you split your files. say group your CSS for your header and footer modules to be 1 require_css’d file or linked css file. You now have the performance benefit that the code that is used on every single page gets cached separately from your content modules.\n\nBy keeping your css in your content modules you gain a huge benefit. You’re only loading code that’s actually needed to render the current page. If the user ever encounters the module again, that css/js is loaded from cache. Making subsequent page loads drastically faster.\n\nAdditionally if you have monolithic css/js you have an additional problem in that any time you make an update, you are invalidating the cache for all of your CSS or JS. Meaning the browser has to refetch a large file instead of just the bytes of data that you actually updated."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 10:38:02",
    "text": "So if you take that modular and grouped approach to your css/JS your subsequent page loads will be drastically faster because the browser is only fetching the data it doesn’t already have, often it’s a matter of a few kb. Making fetching it really fast."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-28 10:39:56",
    "text": "This additionally can be a huge huge deal to someone who is on a bad cell network. I mean think about it this way. if you’ve got a spotty signal, do you want your phone to download a ton of code that’s not needed for the current page, or do you just want to download what’s needed in that moment so you can get something done?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 11:21:30",
    "text": "in essence, a clone?"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 11:37:00",
    "text": "yea, a clone, but I need to pick it after clicking \"create\""
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 11:37:25",
    "text": "I need it to be a template that can be re-used multiple times"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 11:37:41",
    "text": "a duplicate/clone is pretty close but the path to tracking it down and modifying it isn't quite right"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 11:38:05",
    "text": "can you make the default content what is on that page and then offer it as a template?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 11:38:38",
    "text": "default content of the modules on the page rather"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 11:43:05",
    "text": "btw, and unrelated, was hoping you would ask some questions for the next podcast on site speed :slightly_smiling_face:\n<https://community.HubSpot.com/t5/CMS-Development/The-next-HubSpot-Community-Developer-Podcast-Site-speed-and/m-p/429095#M22560>"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 11:43:40",
    "text": "i feel it is appropriate considering you own one of the best threads on the community :wink:"
  },
  {
    "poster": {
      "poster_name": "Isaac Levy",
      "poster_handle": "isaac"
    },
    "time_stamp": "2021-04-28 11:47:02",
    "text": "is there a specific channel for the gmail extension?  It seems like tracking isn't working properly – I get a notification that my email is opened straight away, even though I have 20s of undo send, so the email hasn't even gone out!   Maybe extension could check undo send setting and ignore opens before email is sent?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-04-28 16:13:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Isaac Levy",
      "poster_handle": "isaac"
    },
    "time_stamp": "2021-04-28 11:47:46",
    "text": "I looked on the forum and found some similar complains"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 12:12:57",
    "text": "Yea, definitely. Didn't realize you guys had a podcast. I really need to revisit/update that post..."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 12:14:08",
    "text": "I could set the default module content to what is on those new pages but the layout is updated, more modules are added, etc."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 12:14:36",
    "text": "We use this \"kitchen sink\" landing page on our team and all kinds of pages can be built from it"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 12:14:46",
    "text": "I'm hoping to convert those built pages to a template (without doing it manually)"
  },
  {
    "poster": {
      "poster_name": "manjiri sonar",
      "poster_handle": "manjiri.sonar"
    },
    "time_stamp": "2021-04-28 12:31:38",
    "text": "Thank you Joe"
  },
  {
    "poster": {
      "poster_name": "manjiri sonar",
      "poster_handle": "manjiri.sonar"
    },
    "time_stamp": "2021-04-28 12:31:49",
    "text": "but Is it work for newsletter?"
  },
  {
    "time_stamp": "2021-04-28 12:43:45",
    "text": "up the creek without a paddle"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 12:44:46",
    "text": "just started the podcast.  4th episode.  let me know what you think:<https://www.youtube.com/playlist?list=PLTGNq2fWP3b1_XrfMA9UTg6vzd36QvBQi>"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2021-04-28 16:07:52",
    "text": "By newsletter, do you mean an email you create yourself and send to your contacts? Not a blog newsletter? If so no"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-04-28 16:13:00",
    "text": "Hey Issac, I would report this to support in app on this particular extension."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 16:43:56",
    "text": "crap, I thought I had more time. I was going to try to jam unrelated questions in anyway so it was probably for the best"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 16:45:02",
    "text": "or is the 5th episode about speed"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-04-28 16:45:07",
    "text": "so there’s still time"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2021-04-28 17:17:22",
    "text": "Ha!!!.  You have through tomorrow :wink:"
  }
]