[
  {
    "text": "Hi,\n\nIs it possible to select add a field that enables the users to select a blog post -&gt; when we use this blog field we only see this option, but are not able to select a specific blog post.",
    "time_stamp": "2021-04-13 03:39:36",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-04-15 01:38:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Japo Mendoza",
      "poster_handle": "japo.mendoza"
    },
    "time_stamp": "2021-04-13 05:26:11",
    "edited": {
      "time_stamp": "2021-04-13 05:27:28"
    },
    "text": "Question regaerding system pages.(search page which uses html/coded template)\n how long does it take for the changes on the header menu (global module for menu items) take effect?"
  },
  {
    "poster": {
      "poster_name": "Mo Tanveer",
      "poster_handle": "mtanveer"
    },
    "time_stamp": "2021-04-13 09:03:15",
    "edited": {
      "time_stamp": "2021-04-13 09:06:21"
    },
    "text": "Hey! I'm looking for a rockstar technical person who can help us w/ our site performance-- its atrocious-- and most of my team is conviced HubSpot is the problem\nand they want to move to wordpress-- would love to speak with a few people and see if there's a fit to work together. Domain is <http://returnlogic.com|returnlogic.com> -- I know there are few things I can fix like image sizes and resource loading-- but would really prefer an expert opinion on this.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-04-13 13:02:00"
      },
      {
        "time_stamp": "2021-04-14 03:32:47"
      },
      {
        "time_stamp": "2021-04-14 11:11:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-04-13 13:02:00",
    "text": "Hey Mo, HubSpot itself is not the problem here; rather the issue is how the site was originally built. We run into this very often as a long-time HubSpot partner agency; the way pages _were_ built on HubSpot in years past was not the most performant. HubSpot as a CMS and as a delivery platform is actually incredibly impressive (check out <https://youtu.be/VpArzDy5ny4?t=14670|this session> from the developer meetup a couple years ago for more info), but to fully take advantage of it you'll want coded assets ideally developed using the CMS boilerplate to get more aggressive pagespeed numbers.\n\nFurther, comparing HS directly to WP comes with some issues, as you're comparing an open-source application with a premium Software as a Service platform. WordPress is not inherently faster or slower than HS CMS (at least as far as we know, again, since you can't install the two side-by-side on the same hardware and compare), and there are PLENTY of slow-moving, unoptimized and vulnerable websites built on WordPress. When you compare options for a delivery platform, for example HS vs WP Engine, that's a bit more fair. Both use CDNs, both offer great security features, etc... but neither will make up for poorly written or outdated theme code.\n\nHopefully that may help with getting some more buy-in on HubSpot."
  }
]