[
  {
    "poster": {
      "poster_name": "Velko Savov",
      "poster_handle": "velkosavovi"
    },
    "time_stamp": "2021-04-22 01:08:02",
    "edited": {
      "time_stamp": "2021-04-22 01:09:13"
    },
    "text": "Thank you Bradley! It works like a charm!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-04-22 01:30:49",
    "text": "hmm an “auto-generate menu”- Button does not seem practical for everyday use, however, i do think it would be a cool tool when creating a web project for the first time ( like an initial launch)."
  },
  {
    "poster": {
      "poster_name": "Florian Görig",
      "poster_handle": "florian.goerig554"
    },
    "time_stamp": "2021-04-22 02:38:19",
    "text": "Hey everyone. I'm looking for a consolidated list of all industry field values of the company object. perferably in german",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-04-22 08:00:31"
      }
    ]
  },
  {
    "text": "Guys, I'm trying to map a \"Number of Users\" contact field to my Gravity Forms, but for some reasons the field option doesn't show up in GF's setup list. Would you happen to know why?",
    "time_stamp": "2021-04-22 06:02:41"
  },
  {
    "text": "Can't help you with the German part, but here's the list of internal value to displayed values in English.  If you want to replicate this for German, I basically got this by going to the property in settings, change the \"10 per page\" setting to \"Show all\", them dump the HTML page source and extract the values!!! Fun times.",
    "time_stamp": "2021-04-22 08:00:31"
  },
  {
    "text": "is something going on with the CMS template selector? we’ve been trying to change templates of a few pages and have never had issues doing that before, but right now we get this:",
    "time_stamp": "2021-04-22 10:55:56"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2021-04-22 10:56:22",
    "text": "i’m a superadmin and have tried to change numerous pages to different templates, same result every time"
  }
]