[
  {
    "poster": {
      "poster_name": "Amit Rai",
      "poster_handle": "amit"
    },
    "time_stamp": "2020-09-23 12:15:50",
    "text": "Hi, I’m creating a new theme and wondering what are the responsive options I can utilise with theme development? For example, If I have two columns, both of span6, on mobile, how can I:\n\n1. Hide certain columns\n2. Change the ordering of how the columns are presented. For example, if I have a row with is text and image. On smaller screens, the image column will sit underneath the text. What if I want to order it so image is first?\nIs the above only achievable via css? If so, I think that will be quite messy because, looking at the docs, a class can only be applied to a dnd_area. I don’t want to be targeting HubSpot generated classes to change flex ordering on mobile. What are my options?",
    "reply_count": 7,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-09-23 13:15:37"
      },
      {
        "time_stamp": "2020-09-23 13:29:05"
      },
      {
        "time_stamp": "2020-09-23 13:32:53"
      },
      {
        "time_stamp": "2020-09-24 02:03:56"
      },
      {
        "time_stamp": "2020-09-24 02:38:32"
      },
      {
        "time_stamp": "2020-09-24 06:43:45"
      },
      {
        "time_stamp": "2020-09-24 07:24:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-09-23 13:15:37",
    "text": "Hi <@UGLB3KRLH>! I can’t speak to some of the more technical aspects of this, but I’m the PM for some of the content editors, and we’re currently running a beta for developers who want to add mobile responsive editing options to their themed templates. The beta currently allows you to adjust margin and padding, as well as visibility of modules. Would you be interested in joining the beta?"
  },
  {
    "poster": {
      "poster_name": "Amit Rai",
      "poster_handle": "amit"
    },
    "time_stamp": "2020-09-23 13:29:05",
    "text": "Hi <@U8THBCFC4> - This beta will allow me to hide and show modules / columns based on device widths?"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2020-09-23 13:32:53",
    "text": "You can hide modules, but not columns (yet). The main thing holding us up from allowing hiding other layout fragments (sections / columns / rows) is some coming up with some UI in the editor so a marketer can hide / unhide things."
  }
]