[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2020-09-08 09:03:21",
    "text": "Since there are a few answers here I’ll add you can use `|count` as well"
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-09-08 11:50:14",
    "text": "Hi everyone! I have two questions for all you HubSpot theme experts.\n1. Is it possible to change default values of module fields when placing that module in a html template inside a drag and drop area?\n2. Has anyone got display conditional fields to work in the main fields.json for the main theme / design settings?"
  },
  {
    "poster": {
      "poster_name": "Brad Angelcyk",
      "poster_handle": "brad965"
    },
    "time_stamp": "2020-09-08 20:00:14",
    "edited": {
      "time_stamp": "2020-09-08 20:08:05"
    },
    "text": "hey all, is it possible to set a value on a contact within a hubl CMS template?  I tried this with no luck: `{% set contact.custom_prop = \"testing\" %}` .  I set a value manually on the HubSpot contact already to test fetching data but I can’t figure out how to update it."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2020-09-08 20:16:10",
    "text": "Not sure you can use a dot syntax here"
  },
  {
    "poster": {
      "poster_name": "Brad Angelcyk",
      "poster_handle": "brad965"
    },
    "time_stamp": "2020-09-08 20:25:27",
    "text": "hm, okay.  so I have an initial HubSpot form that creates the contact.  then the page it posts to has a _much_ longer form (implemented within the template, not a HS lead capture form) that does some calculations and needs to store the results in the contact properties.  what would be the intended way to update the contact with the data made post-calculation?  I’ve confirmed that I can get the data out of the contact if I set it manually within the HubSpot console but I can’t find a way to set it."
  },
  {
    "poster": {
      "poster_name": "Brad Angelcyk",
      "poster_handle": "brad965"
    },
    "time_stamp": "2020-09-08 20:38:37",
    "text": "I could implement it using the update_contact endpoint but I don’t want to have an API key viewable in the client side javascript."
  }
]