[
  {
    "text": "Hello! Long time listener, first time caller... And please be kind, because I'm very junior with my developer knowledge.  On some of these template modules, you can update the rich text in the \"edit page\" section without having to go into the global template editor. I see that there's a pencil with a line through it (purple arrow). And not on some other areas (coral arrow). Is there a way to change this? Is there a best practice? I didn't build this. I'm just tinkering and trying to modify/edit/understand",
    "time_stamp": "2024-08-23 09:24:54",
    "edited": {
      "time_stamp": "2024-08-23 09:44:08"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-23 11:03:39"
      },
      {
        "time_stamp": "2024-08-23 11:58:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-08-23 11:03:39",
    "text": "Hey <@U06RFSER0Q4>, to be honest - it's been quite a while since I've seen those templates since they're still working but aren't supported for several years(I think the support was sunsetted around 2021). But this doesn't mean they don't work anymore. You can use them but maybe consider to update to themes.\n\nAs for the purple strike-through pen - this means that the module can't be edited by content editors. If you like to change this, select the module you'd like to change, scroll to the very bottom of the right sidebar and disable the \"Prevent editing in content editors\" option.\n\nIf something should go not as planed - don't worry: You have a revision option in the \"Actions Menu\"(top of the left sidebar) which let's you jump back and forth between every saved version. So my recommendation is: Save the template before applying changes"
  },
  {
    "poster": {
      "poster_name": "Carly Schultz",
      "poster_handle": "carly837"
    },
    "time_stamp": "2024-08-23 11:58:09",
    "text": "Thank you!! This is very good information!\n\nMy boss actually came in and helped me with this specific request just a few minutes ago."
  }
]