[
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2019-11-10 13:54:37",
    "text": "<@U25C65C3S> this was REALLY helpful. The Piloxing functionality is very similar to what I'm building, thank you. - I was looking for a payments solutions and it seems like DepositFix (which was mentioned in the post) will be a good solutions for handling membership payments - has DepositFix been a good solution for you in Production? Additionally, as <@U22PJPGK0> pointed out, users can't self register with the Membership-Content feature (aka: sign up for an \"account\") - did you guys solve for that? My current plan is to build a signup form with a Firebase backend (node.js) enabling users to create an account then use HubSpot's API to create a CRM record for the new Account - any thoughts? Man we're really at the bleeding edge here haha"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2019-11-10 19:14:40",
    "text": "I’m not personally familiar with fire base but you can have users submit a HubSpot signup form and that would add them to a active list. \n\nFrom there adding to that list would invite them to confirm membership. \n\nYou can see the flow on <http://sprockettalk.com|sprockettalk.com> (another membership site)"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2019-11-10 19:15:20",
    "text": "Technically they self register, but they have to confirm their password manually at this point (hopeful for other ways to automate this further in the future)"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2019-11-10 19:16:24",
    "text": "A key piece of automation that you can use to remind them to confirm their account is to create an active list in HubSpot where the “registered at” field is known. This will allow for you to see all confirmed users."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2019-11-10 19:16:44",
    "text": "<@UFL9XN2DQ> :point_up::skin-tone-4: "
  }
]