[
  {
    "poster": {
      "poster_name": "Asela Priyanga",
      "poster_handle": "asaonline1"
    },
    "time_stamp": "2022-03-29 03:13:35",
    "text": "Hi I am Asela from sri lanka. i need to subscribe to webhook for the product. but in webhook, there  are only deals , contacts and etc. can someone please help me to get product data when change happence.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-29 07:06:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-03-29 07:06:41",
    "text": "can you give us more details?"
  },
  {
    "poster": {
      "poster_name": "Elijah Gastin",
      "poster_handle": "elijah.gastin"
    },
    "time_stamp": "2022-03-29 10:14:21",
    "edited": {
      "time_stamp": "2022-03-29 10:15:21"
    },
    "text": "Hey, I'm doing a bit of company record cleaning with over 10k records. I already have a handful of records in mind that I am deleting. Could someone suggest some keywords for the company name that would be obvious garbage data? i.e. None, N/a, Na, I am not a company, A or any crude words. I'm having trouble thinking of great keywords.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-29 15:11:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Eng",
      "poster_handle": "jason358"
    },
    "time_stamp": "2022-03-29 15:11:52",
    "edited": {
      "time_stamp": "2022-03-29 15:13:24"
    },
    "text": "I'm in the dance business. I create a filter for 'does not contain exactly': studio, dance. And another filter for 'does contain exactly': inc, marketing, agency... or whatever else I commonly get as spam.\n\nYou can also expand your list to show 100 at a time and click the 'select all' box. Then scroll through and uncheck those that you know aren't junk. Followed by 'delete all'. It's about 100 pages you'd have to skim through but not too bad.\n\nAnother idea is to filter for emails if you notice a pattern you can filter for there.\n\nFor some reason I also get a lot of junk Companies that have people's names. Possibly from old imports I've done - not sure. But I purged all the Companies that have First/Last Names...those were easy to bulk delete"
  }
]