[
  {
    "poster": {
      "poster_name": "Hammad Ahmad",
      "poster_handle": "hammad"
    },
    "time_stamp": "2022-03-23 03:44:48",
    "text": "Hey there, I hope you guys are doing great. I am working for a client which is an ecommerce business. I want to import Deals in HubSpot with Line Items. This import is still in Beta version and I've searched online for resources how can I import multiple line items and associate them with a Deal but unfortunately I found nothing. Can you share any resources or maybe a sample sheet or any idea how can I achieve that. I am struck here. Any help will be of great value. Thanks in advance.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-13 11:59:18"
      },
      {
        "time_stamp": "2022-04-13 11:59:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Conner Novicki",
      "poster_handle": "conner.novicki"
    },
    "time_stamp": "2022-03-23 08:53:08",
    "text": "Great answer, thank you!"
  },
  {
    "poster": {
      "poster_name": "Jon Fulk",
      "poster_handle": "jonfulk"
    },
    "time_stamp": "2022-03-23 09:48:51",
    "text": "Anyone else notice there are a lot of questions here but not a lot of answers?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-23 10:32:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-23 10:23:20",
    "text": "Hey Max, unfortunately there is no HS to HS native migration flow for CMS data. Project folders (themes and otherwise) are moved from portal to portal easily enough via the CLI, but migrating pages and other objects either has to be done via API or, unfortunately, manually. Other objects like CTAs and drag-and-drop emails will need to be entirely recreated manually. It’s not an ideal process by any means, but is possible. In my previous agency experience, it was a significant enough amount of work that it necessitated a dedicated project scope and fee outside of our standard retainer."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-23 10:32:05",
    "text": "FWIW, this workspace started as a CMS-only community and app developers got added in later, so there aren’t quite as many experts on that side actively answering questions in here as a result. I try and answer what I can, but I do run my own business too and don’t always have time for follow-ups and debugging session. Ultimately, we need more day-to-day devs willing to step in and help people out.\n\nMaybe make a post in the idea forum and/or <#C26E7JT8V|ideas> for a formal rewards program for answers in the Slack?"
  },
  {
    "poster": {
      "poster_name": "Samantha Burnett",
      "poster_handle": "samantha585"
    },
    "time_stamp": "2022-03-23 10:40:06",
    "text": "I already posted in another channel but wanted to try out some other ones:\n\nI'm trying to do some math operations on a value from fields.json but for some reason the |float filter is acting differently on the Edit Page view and the actual live page. For example, if I do {% set exampleVariable = '1.414'|float %} (but the 1.414 is coming from a choice option in the fields.json) then say, .h1 { font-size: {{ exampleVariable }}rem; } it results in 1414.0rem in the editor (which I found by using the inspect tool) but correctly parses to 1.414rem on the live page in the inspect tool. On the other hand, if I set the variable to 1,414 it converts to 1.414 in the editor but then 1,414 in the live page. Is this a bug or am I missing something?"
  },
  {
    "text": "Hello. I'm a developer from Ukraine. \nThe war is still going and people are still dying. \n\nUnexpectedly, one of the most deficit things is tourniquet.\nIt is a tight band used to completely stop the blood flow to a wound.\n<https://en.wikipedia.org/wiki/Tourniquet|https://en.wikipedia.org/wiki/Tourniquet>\n\nFriends of mine managed to set up non-profit production on a local furniture fabric. \nWe can produce <tel:500 - 1000|500 - 1000> items per day. Price of one item is around $3.\n\nIf someone wants to donate directly for things that literally save lives please DM me. Any currency accepted.\nOr PayPal — <mailto:hello@hulo.dev|hello@hulo.dev>\n\nThanks a lot.\nPlease delete if not allowed",
    "time_stamp": "2022-03-23 14:20:19",
    "edited": {
      "time_stamp": "2022-03-24 15:14:05"
    }
  },
  {
    "poster": {
      "poster_name": "Max Allen",
      "poster_handle": "mallen"
    },
    "time_stamp": "2022-03-23 21:04:17",
    "text": "Hey Mark, thanks a bunch for the info - much appreciated."
  }
]