[
  {
    "poster": {
      "poster_name": "Rob Maybery",
      "poster_handle": "rob902"
    },
    "time_stamp": "2022-03-10 07:27:26",
    "text": "Hi Guys, have any of you got any experience of using the Trujay wizard to migrate data from pipedrive to HubSpot? I have a fairly large amount of records to bring over to HubSpot, just wondering if there are any things to \"watch out for\" or if its a fairly painless process? Thanks in advance and apologies if this is in the incorrect Channel! Thanks, Rob"
  },
  {
    "poster": {
      "poster_name": "Jim Johnson",
      "poster_handle": "jim.johnson"
    },
    "time_stamp": "2022-03-10 09:09:19",
    "text": "Hey everyone. Has anyone created an import process to pull content into HUBDB? I'm relatively new to HubSpot development and want to make sure this is the right approach. We have an existing external system that houses staff members and their details, and exposes them in a json feed. I would like to build an import process to pull this content into HubDB on a regular basis. I'm thinking this could be a process that runs nightly, but manually kicking off the process would work too. Once imported, I envision a module that would allow editors to curate staff lists for display on a HubSpot CMS page, so existing rows would need to be updated in HubDB, not deleted and re-added on each import. Has anyone done this type of thing? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-10 11:08:40",
    "text": "Is there still a limit of 10 custom objects? I'm getting close..."
  },
  {
    "text": "one day will be very helpful for us to see the portal name in this emails… :slightly_smiling_face:",
    "time_stamp": "2022-03-10 12:42:42"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas558"
    },
    "time_stamp": "2022-03-10 13:50:23",
    "text": "Hello, i'm trying to figure out how to send a time stamp correctly to a datepicker property. I've done some research on here but can't really find a answer.\n\nHere's what I got:\n$time = 1632182399;\n\nI had did some research and found a contributor had suggested this solution: <https://community.HubSpot.com/t5/APIs-Integrations/Update-Custom-Date-Picker-in-Deals-through-the-AP><https://community.HubSpot.com/t5/APIs-Integrations/Update-Custom-Date-Picker-in-Deals-through-the-API/m-p/229499|...>\nBut this doesn't actually work and I don't know why.\n```\nfunction get_time_for_HubSpot($time){\n    $date = new DateTime();\n    $date-&gt;setTimestamp($time);\n    return gmdate('Y-m-d H:i:s', strtotime($date-&gt;format('Y-m-d H:i:s')));\n}\n\n // Time Stamps\n    $starttime = strval($booking_object-&gt;start);\n\n    $endtime = strval($booking_object-&gt;end);\n\n    $starttime = get_time_for_HubSpot($starttime);\n    $endtime = get_time_for_HubSpot($endtime);```\nWhich produces:\n$starttime = 2021-09-13 00:00:00\n$endtime = 2021-09-13 23:59:59\n\nSo I think i'm just missing a final step or something. ANy help would be greatly appreciated\n\nThanks for any help."
  },
  {
    "poster": {
      "poster_name": "Divyesh Bhalala",
      "poster_handle": "dbhalala92"
    },
    "time_stamp": "2022-03-11 00:36:56",
    "text": "Hello,\n\nI have a custom form API for the HubSpot But I am not able to pass the UTM data in the form is there anything that I miss\n\nThanks in Advance"
  }
]