[
  {
    "poster": {
      "poster_name": "Georgiana Costache",
      "poster_handle": "georgiana.costache"
    },
    "time_stamp": "2022-03-08 01:20:57",
    "text": "hey guys, anyone good with GTM and custom event listeners for it?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-08 13:16:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gerben van Amstel",
      "poster_handle": "gerben"
    },
    "time_stamp": "2022-03-08 05:02:25",
    "text": "Hi all, I have a question in regards to loading the chat script outside of our custom cookie consent, our current flow has cookie consent run GTM which has the HubSpot script on allowing cookies, but we would like to run the chat part outside of this separately without tracking - has anyone done this successfully? I see some support threads about this but none have been updated in awhile"
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2022-03-08 05:29:59",
    "text": "Hi. Is there a way to pass an argument to the url of the unsubscription link we give in our marketing emails? I want to indicate which subscription type the mail is part of. For exemple, I send an email with a subscription type B. I want to be able to say (for example) on the page: \"the mail you click in is part of subscription B\". Is it possible?"
  },
  {
    "poster": {
      "poster_name": "prime fex",
      "poster_handle": "primefextrading"
    },
    "time_stamp": "2022-03-08 09:33:30",
    "text": ":wave: Hi everyone! its possible to connect HubSpot with api app"
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-03-08 13:16:24",
    "text": "It depends on the complexity, but I’ve done some work in the past around it"
  },
  {
    "poster": {
      "poster_name": "Fabian Glaw",
      "poster_handle": "fabian643"
    },
    "time_stamp": "2022-03-08 21:09:17",
    "edited": {
      "time_stamp": "2022-03-08 21:09:30"
    },
    "text": "Hey folks, my client requested to either delete the blog author pages or set them on noindex for the crawlers so they are not indexed by search engines. Any ideas how to do that?\nThank you for your help"
  }
]