[
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2022-03-14 01:53:30",
    "text": "Hi. You can do it with dnd_area (<https://developers.HubSpot.com/docs/cms/hubl/tags/dnd-areas#drag-and-drop-area-code-dnd-area-code->)\n```{% dnd_area \"unique_name\", class=\"main\" %}\n\n{% end_dnd_area %}```\n"
  },
  {
    "poster": {
      "poster_name": "Mohammed Sidhpura",
      "poster_handle": "sidhpuram.oappsit"
    },
    "time_stamp": "2022-03-14 06:29:47",
    "text": "How to move cms website from HS sandbox account to production",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-14 06:31:31"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2022-03-14 06:31:31"
  },
  {
    "text": "When I view a form, the styling is great. However, when I add a form to a custom module, there isn't any form styling applied. Which is mostly fine. However, I'm having trouble with the checkbox. It has a default value of True, but when you try to check/uncheck, neither the value or the visual changes. It just stays an empty box. How do I fix this?",
    "time_stamp": "2022-03-14 07:35:09",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-14 09:40:33"
      }
    ]
  },
  {
    "text": "Hey guys not sure if this is the right channel to ask, if not please redirect me to the right one. We are looking to make a custom action on a contact to open a pop up modal and send a whatsapp message. How can this be done on the API? Here is an example on how another app add a \"button\" below the contact that trigger the modal.",
    "time_stamp": "2022-03-14 09:27:08",
    "edited": {
      "time_stamp": "2022-03-14 09:27:35"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-14 12:45:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-03-14 09:40:33",
    "text": "From what it appears, your image with the styling has styles that are overriding the default HubSpot styles because in the second image, there is the default HubSpot styling. If you want no styling at all you would click the “set as raw html form” option on the form screen.\n\nThe odd thing for me is the checkbox. Are you using the GDPR preferences in HubSpot or is this a custom property that you are masking as permission?  The reason I ask is that if you drop in a GDPR opt in box from HubSpot, I believe that should always been unchecked so it doesn’t make sense to see what you are seeing unless there is a script on the page making this change.  Could we see a sample of that page online to see what is going on with the code in case it is the HubSpot gdpr checkbox."
  },
  {
    "poster": {
      "poster_name": "Guy Bowden",
      "poster_handle": "guy614"
    },
    "time_stamp": "2022-03-14 10:49:14",
    "text": "Hey - looking for some info re: CRM cards - specifically how to secure the Data-Fetch URL - or rather how to validate the request from HS is real and not coming from some other source. Happy to ask in a channel if there is one (couldn’t find one)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-14 11:02:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Guy Bowden",
      "poster_handle": "guy614"
    },
    "time_stamp": "2022-03-14 11:02:42",
    "text": "<https://developers.HubSpot.com/docs/api/webhooks/validating-requests>"
  },
  {
    "text": "Hey Henry, there is no API or SDK for this specific functionality. In the case of this other What'sApp tool - the developer created a Chrome Extension that injects that button into the HubSpot UI, it's not an official or supported approach and could break at any time if the HubSpot UI changed.\n\nThe way to mimic something like that would be to use Custom CRM Card extensions which allow a button and iframe action to launch. <https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards>\n\nHere's a sample gif showing some similar functionality",
    "time_stamp": "2022-03-14 12:45:20",
    "edited": {
      "time_stamp": "2022-03-14 12:45:52"
    }
  }
]