[
  {
    "poster": {
      "poster_name": "Marco Suing",
      "poster_handle": "marco378"
    },
    "time_stamp": "2022-03-21 02:50:51",
    "text": "Anyone have experience integrating the Facebook Conversion API with Zapier? What exactly do I have to pay attention to?"
  },
  {
    "poster": {
      "poster_name": "Ervin Isljami",
      "poster_handle": "ervinisljami"
    },
    "time_stamp": "2022-03-21 03:07:54",
    "edited": {
      "time_stamp": "2022-03-21 04:49:07"
    },
    "text": ":wave: Hi everyone! Glad to be here. I have a question if anyone can help. I've created an app using my dev account. And created a test user. When my test user is installing the app, after the first prompt the second one redirects too fast and I cannot catch it. Nonetheless, I have that app listed in my connected apps on the Test user.\nWhen I try to create workflow I do not see that app in the list and cannot find it. I've created custom action for my app using postman, and I got 201 response. So that part should be fine. But I still cannot see my app in the workflow. Can anyone help with this issue?"
  },
  {
    "poster": {
      "poster_name": "Eugenio Bacallao",
      "poster_handle": "ebacallao"
    },
    "time_stamp": "2022-03-21 05:13:32",
    "text": "Hi everyone!"
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2022-03-21 07:36:57",
    "text": "HubSpot takes care of http to https redirects for you, and there’s also a non www to www redirect in HubSpot now too"
  },
  {
    "poster": {
      "poster_name": "Matthew Rush",
      "poster_handle": "matthew.rush"
    },
    "time_stamp": "2022-03-21 14:43:43",
    "edited": {
      "time_stamp": "2022-03-21 14:44:00"
    },
    "text": "Is your scope using \"content\" under the legacy portion?\n\nFrom HubSpot Private App\nContent\nThis includes sites, landing pages, CTA, email, blog, campaigns."
  },
  {
    "poster": {
      "poster_name": "Matthew Rush",
      "poster_handle": "matthew.rush"
    },
    "time_stamp": "2022-03-21 15:50:55",
    "text": "What api endpoint did you use to fetch that page? The docs are quite vague with how to do that."
  }
]