[
  {
    "poster": {
      "poster_name": "Jess",
      "poster_handle": "jessica230"
    },
    "time_stamp": "2023-02-08 07:48:50",
    "text": "Hi all! I was curious if there is a way to manage url redirects on the search bar based on keywords? My client has their products on Shopify and the other pages of their website is hosted on HubSpot. I know there's no cross platform compatibility between the two with searchbar functionality but, say if someone types the product name - based on keyword, can I create a redirect to the Shopify url? Can't seem to find a doc or post anywhere on that..\n\nie. 'iPhone' &gt; redirect to iPhone products on Shopify url"
  },
  {
    "poster": {
      "poster_name": "Sadiya Parveen",
      "poster_handle": "sadiyap174"
    },
    "time_stamp": "2023-02-08 11:44:05",
    "text": "Hi does anyone know like what will be the redirect URL in app creation in HubSpot.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-08 13:27:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-08 13:27:56",
    "text": "That's the url for your auth server\nYou can build out an auth server using nodejs\n<https://github.com/HubSpot/oauth-quickstart-nodejs>"
  },
  {
    "poster": {
      "poster_name": "Heidi",
      "poster_handle": "heidi.mair"
    },
    "time_stamp": "2023-02-08 19:46:34",
    "text": "Hi, we had a custom-coded style sheet created in relation to the global menu that displays at the top of every one of the pages in our website.\n\nUnfortunately the HubSpot team have detected a code conflict in the style sheet that’s preventing the drop-down menus from appearing when you hover over each of the main menu items.\n\nWould anyone be able to assist with how this coded style sheet could be fixed so that the drop-down menu functionality is able to work for our main nav menu?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-08 21:51:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-02-08 21:51:10",
    "text": "We worked this out over DM"
  }
]