[
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-06-13 03:06:34",
    "text": "```I have looked at the associated template and I don't see which CSS file it is linking to. It doesn't seem to be there. I'll send you the code:&lt;!--\n  templateType: \"page\"\n  label: \"Homepage\"\n  screenshotPath: \"../../images/template-previews/homepage.jpg\"\n  isAvailableForNewContent: true\n--&gt;\n{% extends \"../layouts/base.html\" %}\n\n{% block body %}\n\n{% dnd_area 'dnd_area_banner' label='Home Blocks', class=\"homepage\" %}\n\n   {# Hero Banner #}\n   {% include_dnd_partial path='../../sections/homeBlockHero.html' %}\n\n   {# Stats Block #}\n   {% include_dnd_partial path='../../sections/homeBlockStats.html' %}\n\n{% end_dnd_area %}\n\n\n{% dnd_area 'dnd_area_main' label=' Main Content' %}\n\n   {# Card Block Section #}\n   {% include_dnd_partial path='../../sections/cardBlockBrands.html' \n      context={\n         'background_color': 'dark',\n       }\n   %}\n\n   {# Card Scroll Section #}\n   {% include_dnd_partial path='../../sections/cardScroll.html'\n     context={\n       'variant': 'connector',\n       'background_color': 'light',\n       'image': \"{'width': 400, 'height': 500, 'src': '../images/placeholders/400x500.png', 'alt': 'Alt text.'}\", \n     }\n   %}\n\n   {# Featurette Section #}\n   {% include_dnd_partial path='../../sections/featurette.html'\n     context={\n       'variant': 'quote',\n       'background_color': 'gray',\n     }\n   %}\n\n{% end_dnd_area %}\n\n{% dnd_area 'dnd_area_form' label='Lead Gen' %}\n\n   {# Callout Bar Section #}\n   {% include_dnd_partial path='../../sections/calloutBar.html'\n     context={\n       'variant': 'withlogo',\n     }\n   %}\n\n   {# Contact Form Section #}\n   {% include_dnd_partial path='../../sections/contactForm.html' %}\n\n{% end_dnd_area %}\n\n\n{% endblock body %}```"
  },
  {
    "poster": {
      "poster_name": "Zori Manzanares",
      "poster_handle": "zoraida.manzanares"
    },
    "time_stamp": "2024-06-13 03:07:53",
    "text": "I have a feeling that it is taking it from somewhere else where the CSS is specified, but I just started with HubSpot and I'm not yet familiar with the structure. Seeing this, could we find where that CSS is?"
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2024-06-13 12:11:36",
    "text": "Hi <@U045GJFQQ20> did you ever solve this? We’re seeing this issue on our end."
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2024-06-13 13:09:36",
    "text": "Hi. Is anyone else having their modules not showing up on Firefox with their new privacy/tracking settings?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-06-13 14:48:29"
      },
      {
        "time_stamp": "2024-06-13 15:31:03"
      },
      {
        "time_stamp": "2024-06-13 17:11:09"
      },
      {
        "time_stamp": "2024-06-14 04:07:11"
      },
      {
        "time_stamp": "2024-06-14 10:18:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2024-06-13 14:48:29",
    "edited": {
      "time_stamp": "2024-06-13 14:48:48"
    },
    "text": "Full-time Firefox user, and I haven’t seen this issue — do you mean that modules aren’t rendering to the page?\n\nSince modules are rendered to the page as markup, the only way you should see this happen is if your module is dependent on an external resource (script, iframe) that’s being privacy-blocked.\n\nOr, are you using any kind of smart content/personalization to control the display of those modules? Could FF’s anti-fingerprinting methods be spoofing something that your display conditions are dependent on?"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-06-13 15:00:22",
    "text": "Hey Anton - congrats on level 300 LOL! Want to get to 1000? :D\n\nI wanted to touch base with you about something.  I think we briefly discussed this on a call with Dennis a while back. We're launching our first-ever Developer Mentorship program this summer and we'd LOVE for you to be an inaugural mentor in the program.  The inaugural program will launch at the end of July  and wrap up at the end of October. Here's a little more info:\n\n• *Recognition:* You’ll be featured in our dev community campaigns and get a cool badge that you can use in the Community and on <http://Connect.com|Connect.com>  once you get through the first cohort,  and you'll get a certificate and exclusive swag.\n• *Exclusive Perks:* Special benefits just for the first group of mentors  - you'll be setting the tone for what we're hoping will become an ongoing offering for the developer community, \n• *Community Impact:* Help us support diverse and underrepresented groups in tech, and help lower the barriers to entry to develop on HubSpot. We've been at <https://www.renderatl.com/|RenderATL> this week promoting the program, and we already have 70 underrepresented developers that have expressed interested in being mentees!\n*What We're asking:* \n• *A couple - several of hours a month for 3 months:* Mentor 1-5 developers for this 3-month introductory cohort. They'll each expect a minimum of one hour of 1:1 virtual time with you per month. \n• *Set mutual goals:* Mentees will be paired with you based on the goals skillsets you think you can best help with. Here's <https://docs.google.com/spreadsheets/d/1f3EDXFThQUKk9E5-Xw446riNP2h6_lqNCNdyiBLVvuQ/edit?usp=sharing|a peek> at those goals and skillsets. \n• *Engage:* Be available via email/Slack, set response time expectations that work for you.\n• *Involvement:* Join our private community on <http://Connect.com|Connect.com> and attend events (mentor checkins, as well as a kickoff and closing event with the full cohort). \n*Extra Perks:*\n• *Mentor’s Mentor:* Monthly one hour chats with Chris Riley from our Dev Advocacy team.\n• *Promotion:* Be featured as a community leader.\n• *Certification &amp; Opportunities:* Ongoing promo and features at HubSpot events.\n• *INBOUND:* There may also be some extra special INBOUND opportunities as a part of this program, we're working on figuring out exactly what those are - but at the very least, we'd want to touch base with you at INBOUND over a lovely dinner about how it's all going, if you'll be there. \nWe’re using the <https://www.togetherplatform.com/|Together Mentorship Platform> to keep things like matching, goal setting and tracking, scheduling and more smooth and easy.\n\nI'm reaching out this week to the first 5 or so folks that I think would be best suited to this, and you're one of them.\n\nHope you’re interested! Let me know if want to learn more! Very happy to hop on a call and discuss. I can also email all this to you if you'd like! And of course, we completely understand if you're already maxed out with HubSpot community programming. You do so much for us as it is! Either way, we'd love to hear back either way by the middle of next week so we can move on to the next batch of mentor candidates, if need be :)"
  },
  {
    "text": "Thank you for your response! That may be the issue. It is a carousel linked to dynamic content in a HubDB (same carousel on multiple pages, but you can choose what content is shown based on tags).\n\nThe bigger issue is that CTAs just simply aren’t showing up on the site in Firefox. Attached are the screenshots so you can see the difference (Chrome on left, Firefox on right). This is the sample page in question. <https://4615657.hs-sites.com/coatings/parylene-coating>\n\nThe first screenshot shows the missing CTAs, the second shows the missing carousel module.\n\nSince you’re a fulltime Firefox issue, have you seen issues of CTAs being blocked due to default privacy settings? Thanks in advance!",
    "time_stamp": "2024-06-13 15:31:03",
    "edited": {
      "time_stamp": "2024-06-13 15:31:27"
    }
  },
  {
    "text": "It looks like all of your markup is still there in Firefox. If you inspect that block, the elements are all on the page, the slider just isn’t initializing correctly.\n\nThey _are_ invisible if I have uBlock Origin turned on, but they look just fine once I turn it off. (see attached screenshot) I do get a CORS error when uBlock is turned on, which is definitely an oddity, but I’m not sure it’s the source of your problem.\n\nMy guess is that when content is blocked, you’re hitting an exception somewhere in your JS that is causing Slick’s initialization to fail.",
    "time_stamp": "2024-06-13 17:11:09"
  }
]