[
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2024-11-02 07:18:47",
    "text": "<@U05UCGQ14PK> If we're talking public apps, the settings screen only allows up to 6 cards, a limit which I reached fairly quickly. Also, you can only really work with iFrames for a reasonable experience, e.g. opening a Stripe billing portal.\n\nI did implement a few dropdowns and toggles but I'm planning to replace them with a single iFrame with all settings in one view to prevent those limitations.\n\nI think the lack of flexibility in the interface (you can only have horizontal cards with either toggles, dropdowns, or buttons) is what makes it a bit weird."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-11-02 09:29:44",
    "edited": {
      "time_stamp": "2024-11-02 09:30:45"
    },
    "text": "<@U01NMMDTERZ> I had a member of my IT team remote into my local machine while I tested and they made changes to the firewall to attempt to unblock the url <@U04HLBUT9QC> provided earlier in this thread that the App Cards are served from (`<http://HubSpot-extensions.com/>`).  I am not sure what exactly they had to change in the firewall to correct it but I can ask for details."
  },
  {
    "poster": {
      "poster_name": "Pete Nicholls (HubDo)",
      "poster_handle": "pete970"
    },
    "time_stamp": "2024-11-02 11:54:05",
    "text": "<@U05UCGQ14PK> I agree with <@U044BTK3EGP> - toggles dropdowns and buttons are too limiting. \nTo allow the client to set any details such as entering “next quote number” or the name of custom price lists, we always have to create a secure endpoint to open in an iframe.\nWe also cannot show which settings are global, versus those specific to the selected user on the user dropdown.\nOur apps “only run inside HubSpot” so we need more controls inside the portal.\nThat’s why <@U04JUUACH6E> is moving our settings to CRM cards where we can render React UI components.\nWe’re hoping the settings screens gets React UI components, so we can build any settings required."
  },
  {
    "poster": {
      "poster_name": "Mitchell Dodell",
      "poster_handle": "mdodell"
    },
    "time_stamp": "2024-11-02 11:58:42",
    "text": "cc’ing <@U03FJQPSC0Y> <@U056ZR8LVJQ> regarding this feedback. Thanks for the details folx! \n\nThe Settings Builder was built before React extensions existed, so definitely heard that is the preferred development method given the higher levels of customization you can achieve. "
  }
]