[
  {
    "poster": {
      "poster_name": "Aviv Kasuto",
      "poster_handle": "aviv211"
    },
    "time_stamp": "2024-11-20 03:09:57",
    "edited": {
      "time_stamp": "2024-11-20 03:10:04"
    },
    "text": "Hi, regarding the *chart* components, is there currently an option to format numbers? For instance, to display them as currency with separators?"
  },
  {
    "text": "I have been working on getting some CI/CD tooling for GitLab in our UI Extensions project. This `gitlab-ci.yml` might be helpful for others using GitLab for CI/CD. I still have a few things to add, but it could make a good boilerplate.\n\nThe primary benefit is that it has allowed us to use a single repository with multiple Projects/Apps for the different environments we need (Local, QA, Production). It uses GitLabs CI/CD variables and environments, as well as `jq` to change out JSON values just before the project is built and deployed to HubSpot.\n\nHope it helps someone :sunglasses:",
    "time_stamp": "2024-11-20 08:03:53",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-27 00:16:47"
      },
      {
        "time_stamp": "2024-11-27 01:37:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-11-20 10:54:18",
    "edited": {
      "time_stamp": "2024-11-20 10:54:27"
    },
    "text": "Hi Jasper, today, it's not possible to manage layout of custom objects through code, but I will discuss your problem with the right team."
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2024-11-20 16:33:10",
    "text": "<@UV46D6DDY> you can display docx files with iFrames in modals."
  },
  {
    "poster": {
      "poster_name": "Arrigo Lupori",
      "poster_handle": "arrigo.lupori270"
    },
    "time_stamp": "2024-11-20 23:16:24",
    "text": "This is something we are interested in too, bring able to place cards automatically in the Overview tab or a new tab in the middle pane would increase adoption. Also for sidebars."
  }
]