[
  {
    "text": "Hi <@UJJ239SC9> <@U04EFF323TL>, I'm trying to create an HTML Email Template to query a Hubdb table using Contact properties but I'm blocked.\nI found this thread and I think it can be related to my need, so I hope you can help me!.\nIf I hardcode the hubdb table query using the same values I have in the contact properties, it works. But when I set the filter using the contact properties, it doesn't work...\nHere is a screenshot to give you an idea, but please let me know anything I can share to clarify. Thanks a lot!",
    "time_stamp": "2025-02-10 15:20:14"
  },
  {
    "poster": {
      "poster_name": "Luke Belgeri",
      "poster_handle": "lukebelgeri"
    },
    "time_stamp": "2025-02-10 15:33:28",
    "text": "<@U08C61E1WVC>\nI have no idea if this will help, as I have no idea why it worked for me, but passing in the following at the top of the email template made it magically convert the variables in the string interpolation:\n```&lt;!--\n  templateType: email\n  isAvailableForNewContent: true\n  isEnabledForEmailV3Rendering: true\n--&gt;```\nIt's been months since I worked on what I had mentioned, so I'm struggling to remember if there was anything else, but I'll look momentarily and let you know if I see anything."
  },
  {
    "poster": {
      "poster_name": "Luke Belgeri",
      "poster_handle": "lukebelgeri"
    },
    "time_stamp": "2025-02-10 15:34:16",
    "text": "I imagine the \"isEnabledForEmailV3Rendering\" key is the main factor."
  },
  {
    "poster": {
      "poster_name": "Luke Belgeri",
      "poster_handle": "lukebelgeri"
    },
    "time_stamp": "2025-02-10 15:35:10",
    "text": "<https://developers.HubSpot.com/docs/guides/cms/content/data-driven-content/emails-with-programmable-content>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2025-02-10 15:38:07",
    "text": "The HubSpot email system processes these programmable emails differently and they go through 2 rounds of rendering, pulling in ‘content variables’ and then ‘CRM data variables’. The original version of the render engine only did one round of processing (hence the HubDB ‘content’ function working, but not with the Contact variable. \n\nAs the above doc shows, it’s a toggle to enable if you’re making a module, or a tag to add if it’s a coded template "
  },
  {
    "poster": {
      "poster_name": "Santiago Moran",
      "poster_handle": "santiago434"
    },
    "time_stamp": "2025-02-10 16:37:57",
    "text": "Thank you both!!!\nI'm not a developer and I'm doing my first steps on this stuff and was really blocked, now I think I have a very solid starting point. Thanks again, and I'll let you know how it goes!"
  },
  {
    "poster": {
      "poster_name": "Santiago Moran",
      "poster_handle": "santiago434"
    },
    "time_stamp": "2025-02-10 17:10:00",
    "text": "<@U04EFF323TL> <@UJJ239SC9> it's working!\nThanks a lot, after reading the documentation + the tips, I figured out this stuff. I'm really happy, thank you very much guys!!!"
  }
]