[
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-09-24 08:33:26",
    "text": "If you're having issues with the HS cookie banner, here's a new channel to discuss: <https://HubSpotdev.slack.com/archives/C07NCTHHQJK>"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-09-24 08:43:22",
    "text": "<@UAYBXDG4U> I bet the answer is no but just in case I wanted to ping again—does the new video component support vimeo embeds? I'm having a hell of a time dealing with cookies here to be GDPR compliant"
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2024-09-24 10:36:54",
    "text": ":wave: - Hello Everyone -\n\nLet me introduce <@U070RKDPNB1> who is leading an new research effort around the Developer Experience here at HubSpot. The developers in this channel represent a specific cohort we would like to hear more from. If you would like to participate and we haven't reached out to you directly, please feel free to contact Stephanie with your information.\n\nThank you in advance for any time your offer to us in this capacity, your input is greatly appreciated!"
  },
  {
    "poster": {
      "poster_name": "Stephanie Serrano",
      "poster_handle": "sserrano"
    },
    "time_stamp": "2024-09-24 10:49:51",
    "text": "Thank you, Byron! We are running 60-minute sessions to understand how developers use HubSpot, what are things that are working or can improve. We'd love to learn from you to improve our developer experience!\nWe'd like to know more about you and how you use our product. This will be a virtual meeting where we'll talk about your experience with HubSpot and other website builders or content management systems. We can ask to see your screen to understand how you work with HubSpot code and UI. We can also add you to a test account if you're more comfortable sharing that way.\n\nYou can go ahead and <https://meetings.HubSpot.com/stephanie751|book time with us here>. Thanks again!"
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2024-09-24 10:54:09",
    "text": "Pretty sure the new video component in progress will _not_ support vimeo or youtube (at least to start/foreable future?)"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-09-24 10:56:50",
    "text": "<@UCY83QS6Q> that’s fine. I think I figured it out… It might be cool to have a HS cookies hook but I’m essentially building my own"
  }
]