[
  {
    "poster": {
      "poster_name": "Stefano Chiala",
      "poster_handle": "stefano599"
    },
    "time_stamp": "2024-09-09 06:03:09",
    "text": "Hi I would like to use hub db dynamic pages in a react island.\nLet's say the island is server side fetching a list of items from a hub db table. An item comes with the page_path for its single page.\nWhat is the best practice for this setup? I guess I still want to create a template but would love not to use HubL, if possible.\nHere is the <https://developers.HubSpot.com/docs/cms/guides/dynamic-pages/hubdb|docs> I found of this topic, which I know how to set up in case of a non-react-project, so I wonder if there is some other good practice I might want to adopt.\n\nI would like ideally the single page to receive the item object, and not to fetch it again. The item object can be passed via the parent page, as the listing has already all the information previously fetched via graphql.\nCan someone point me to a good direction? :slightly_smiling_face:\n\nThank you!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-09 06:17:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefano Chiala",
      "poster_handle": "stefano599"
    },
    "time_stamp": "2024-09-09 06:17:29",
    "text": "My need to 'use hub db dynamic pages' is only for SEO purposes. If I can get good SEO done via any other way, then I am also up to go that way. For these reasons I believe React Router is not a good way to go."
  },
  {
    "poster": {
      "poster_name": "Duncan Beaton",
      "poster_handle": "duncan.beaton"
    },
    "time_stamp": "2024-09-09 07:25:54",
    "text": "&gt; For proxying use cases, a build must be ran first, local edits won’t be reflected without a new build\nWould be handy to include this in the docs :+1:"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-09-09 10:41:05",
    "text": "+1 to add a feature that shows us where modules are being used (I keep running into this use case)"
  },
  {
    "poster": {
      "poster_name": "Jeff W",
      "poster_handle": "jwaterfall"
    },
    "time_stamp": "2024-09-09 18:06:00",
    "text": "Hey, is it possible to pass props to an island `Wrapper` component? e.g.\n```&lt;Island\n  module={MyComponent}\n  hydrateOn=\"visible\"\n  Wrapper={MyWrapper(someProps)}\n  {...fieldValues}\n/&gt;```\nI'm looking to pass style field values to set a simple theme provider context on the wrapper component"
  }
]