[
  {
    "text": "of course <@UJAPS2K4N>.\nUsing HubSpot default rich text module, we can edit the text in the page itself ( screenshot below ), but if we use that default rich-text module within a custom module, it’s only possible to edit on the left side bar",
    "time_stamp": "2024-05-23 02:06:33"
  },
  {
    "poster": {
      "poster_name": "Josh Severson",
      "poster_handle": "josh.severson"
    },
    "time_stamp": "2024-05-23 10:40:59",
    "edited": {
      "time_stamp": "2024-05-23 10:41:40"
    },
    "text": "Hi, we're hosting a HubSpot form on a HubSpot landing page. On May 21 @ 6pm ET we stopped receiving form submissions and page visits on the Contact record. There is some custom design on the landing page.\n\nAfter chatting with HubSpot Support, it seems to be an issue with the Submit button. What next steps can we take to solve this?"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-05-23 16:12:33",
    "text": "Ahh - I see. Thank you for clearification!\n\nSo - you're not the first person who would like to do this. :slightly_smiling_face: I've seen quite a few such \"requests\" over the last couple of years(including myself). Unfortunately nothing happend since then.\nFrom a technical perspective I'd say the rich-text module and the rich-text function (in a module) are handled slightly different by HubSpot. What I would assume is that there is at least one non-public option which tells HubSpot that it's a custom or a default module and how it should be handled.\nFor instance: You have the whole new AI generation option in the rich-text module but it's missing in a custom module.\nAnother fact: Before themes were a thing there was a \"HTML\" module which could be downloaded from the marketplace for free. It was basically the same default rich-text module but was printing out HTML code. Was a great thing to add custom HTML code to the page. Once themes were released and the marketplace rebooted it disappeared.\nMy recomendation on this: Bring your idea to the <https://community.HubSpot.com/t5/HubSpot-Ideas/idb-p/HubSpot_Ideas|HubSpot ideas area> of the community. I'm sure there are a lot of people who would \"upvote\" it"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-05-23 22:59:35",
    "text": "Hi <@UCDEM8T63>\nI had a performance issue with Splide on one of my HubSpot clients. They added a default HubSpot slider module, which impacted the speed. So I made them a custom Swiper module instead. Swiper is really performant and frequently updated, literally the last update was on May 11"
  }
]