[
  {
    "poster": {
      "poster_name": "Sean Wiklund",
      "poster_handle": "sean.wiklund"
    },
    "time_stamp": "2024-05-30 04:34:58",
    "edited": {
      "time_stamp": "2024-05-30 04:55:23"
    },
    "text": "Hi,\n\nWe, as a HubSpot customer, are experiencing an issue with styling. The reason why I post here, is because I was asked by the HubSpot technical support to address this topic here, thus - it's not a support request but rather trouble-shooting or something in between.\n\n*Background*\nWe're using the Act3 theme, bought in HubSpot Marketplace for both our website and blogs. Theme is developed by Neambo.\n\n*The issue*\nWhen we mark text as bold with a \"B\" in for example a \"Rich text\" module *on the website*, the text get `<strong>` formatting. But, doing the same *in our blog*, the formatting gets the `<bold>` formatting - but it shouldn't. It should be strong.\n\nThe difference when tying Test of text, marking text and press \"B\" for bold on:\n\nWebsite: `<p>Test of <strong>text</strong>.</p>`\nBlog: `<p>Test of <span style=\"font-weight: bold;\">text</span>.</p>`\n\nFor SEO purposes, `<strong>` is better than `<bold>` and thus, that would be better. That should if I'm not mistaken, be the default styling/formatting for everything \"bold\", but that might be something not everyone agree on.\n\n*In limbo as customer/user*\nNeambo says:\n\n\"Hi Sean,\n\nThat looks like an inconsistency in HubSpot. It seems that using the B button in a sidebar Rich Text field (the one I tested) creates a <strong> tag, while using it in an inline Rich Text field, like the blog content field, creates a <span> tag with an inline style for bold font :slightly_frowning_face:.\n\nUnfortunately, we can't fix this from our end. It's not a theme thing. It's a HubSpot system tool, so only HubSpot can control it\"\n\n*Testing please?*\nIs there anyway someone can test this, maybe with HubSpots default modules as well as with one or several themes to see if there's actually a theme-related issue or something else? As an end user/customer, I'd not like to go into the source code every time we need to bold something in blog texts.\n\nHelp. :smile:\n\nPS/EDIT: If this is a sub-optimal or even wrong Slack channel, please direct me to the right one.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-30 06:05:51"
      },
      {
        "time_stamp": "2024-05-30 06:30:42"
      },
      {
        "time_stamp": "2024-05-30 06:32:49"
      },
      {
        "time_stamp": "2024-05-30 06:33:09"
      },
      {
        "time_stamp": "2024-05-30 06:34:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tara Flavin",
      "poster_handle": "tara.flavin"
    },
    "time_stamp": "2024-05-30 06:03:26",
    "text": "Yeah it's a repeater group. Currently am using regex to parse it. But it's super annoying that there isn't just a HubL filter to convert an object to json. Extra complicated as putting it in a data attribute means it comes into JavaScript as a string, so now we have a string to convert to an object to convert to json. Sounds like it should be a super simple thing to do so I was sure I must be missing something."
  },
  {
    "poster": {
      "poster_name": "Tara Flavin",
      "poster_handle": "tara.flavin"
    },
    "time_stamp": "2024-05-30 06:05:02",
    "text": "Also, it seems that escapeurl filter deletes urls??? <https://developers.HubSpot.com/docs/cms/hubl/filters#escape-url> Why would we want to do that? I don't understand a lot of these filters. I want to escape the single quote character in a url field so that it doesn't end the data attribute, so I'm using escapejs and escape_json together but now I have a bunch of \\\\x27 in my output and idk how to convert those back to useful characters lol."
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-05-30 06:05:51",
    "text": "You can't control these things in a theme, this is a HubSpot issue"
  },
  {
    "poster": {
      "poster_name": "Sean Wiklund",
      "poster_handle": "sean.wiklund"
    },
    "time_stamp": "2024-05-30 06:30:42",
    "text": "Good thing to get that verified by a second person, thank you! :slightly_smiling_face:\n\nSo, how do I take this further to get this fixed in a future feature update/fix? Who need to be inform and where?\n\nI got the feeling that it wasn't enough to just report this as a user to the HubSpot Support team. :confused:"
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-05-30 06:32:49",
    "text": "It's always like that with HubSpot support sadly, you'll need to loop back to them in hope that the ticket will be escalated to a more qualified person"
  },
  {
    "poster": {
      "poster_name": "Sean Wiklund",
      "poster_handle": "sean.wiklund"
    },
    "time_stamp": "2024-05-30 06:33:09",
    "text": ":disappointed:"
  },
  {
    "poster": {
      "poster_name": "Sean Wiklund",
      "poster_handle": "sean.wiklund"
    },
    "time_stamp": "2024-05-30 06:34:12",
    "text": "Alright. Thanks Federico. I'll do that. :spock-hand::skin-tone-3:"
  },
  {
    "poster": {
      "poster_name": "Will Buckley",
      "poster_handle": "will.buckley"
    },
    "time_stamp": "2024-05-30 08:33:44",
    "text": "Hi all, hope you are having a good day. I was wondering if this is the right place to get some advice/help with a recurring couple of bugs I'm having on my website. Been directed here by HubSpot support!\n\n• My hero video module is adding in \"ghost padding\" of 30px above even when the padding is set to 0, the attached screenshot below is a previous fix we had inputted into the back end to fix it but the problem has returned\n• Image modules often reject images - the image loads in and is uploaded cleanly but it doesnt display, it just displays a blank box. A bit stuck with this one as I have tried multiple images and sometimes it self rights itself after a few days but this obviously is a bit of a worry when building new pages and also if it should happen in the live environment\nWould be great to open a dialogue with someone on any ideas you have - am new to this slack community so sorry if I have put this forward in the wrong place.",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-05-30 08:39:25"
      },
      {
        "time_stamp": "2024-05-30 10:10:07"
      },
      {
        "time_stamp": "2024-05-30 20:34:55"
      },
      {
        "time_stamp": "2024-06-03 07:29:07"
      },
      {
        "time_stamp": "2024-06-03 18:59:32"
      },
      {
        "time_stamp": "2024-06-03 19:00:07"
      }
    ]
  },
  {
    "text": "",
    "time_stamp": "2024-05-30 08:39:25"
  },
  {
    "poster": {
      "poster_name": "Alex Zappa",
      "poster_handle": "reatlat"
    },
    "time_stamp": "2024-05-30 09:46:53",
    "text": "<@U06GU32ANDV> would you please share `module.json` file? Want to replicate your case in my environment, or what exactly output you have from `{{ <http://module.my|module.my>_group }}` please hide any personal data if you have it there :slightly_smiling_face:"
  },
  {
    "text": "I'm not set up for local development at the moment, but it's a really simple repeater group of two text fields. No limits set on repeater. module.columns looks like this where Name is partner and Input Type is checkbox, for one group. [{colname=partner, input_type=checkbox}] So I have a regex set up to change that into [{\"colname\":\"partner\", \"input_type\":\"checkbox\"}] If there were more it would look like [{colname=partner, input_type=checkbox}, {colname=somethingelse, input_type=select}]",
    "time_stamp": "2024-05-30 10:05:40"
  },
  {
    "poster": {
      "poster_name": "Tara Flavin",
      "poster_handle": "tara.flavin"
    },
    "time_stamp": "2024-05-30 10:10:07",
    "text": "You might be able to find the cause of the ghost padding by using the browser inspect tool, if you're familiar with that. It'll show you any calculated padding, margin or border and tell you where it's coming from. If nothing shows up there then it could be a problem caused by something a bit more complex, couldn't say without looking through the code myself but definitely an annoying one haha!"
  },
  {
    "poster": {
      "poster_name": "Alex Zappa",
      "poster_handle": "reatlat"
    },
    "time_stamp": "2024-05-30 10:18:46",
    "text": "ohh I see, will back soon with idea, meantime you can always clone JSON of module by using UI <https://cs.zappa.dev/wrdwW9lQ>"
  },
  {
    "poster": {
      "poster_name": "Alex Zappa",
      "poster_handle": "reatlat"
    },
    "time_stamp": "2024-05-30 14:30:27",
    "text": "Hey <@U06GU32ANDV> would you please take a look to my solution?\n<https://github.com/freshjuice-dev/HubSpot-sandbox/blob/main/HubSpot/HubSpot_slack_community/CFPRTEGTX.module/module.html>\nand preview link is here <http://45442241.hs-sites.com/cfprtegtx>"
  },
  {
    "poster": {
      "poster_name": "Alex Zappa",
      "poster_handle": "reatlat"
    },
    "time_stamp": "2024-05-30 18:57:35",
    "text": "```&lt;script&gt;\n    const newObject = [\n        {% for item in module.field_group %}\n        {\n            \"col_name\": \"{{ item.col_name }}\",\n            \"input_type\": \"{{ item.input_type }}\"\n        }{% if not loop.last %},{% endif %}\n        {% endfor %}\n    ];\n\n    console.log(\"🍹 newObject\", newObject);\n&lt;/script&gt;```"
  },
  {
    "poster": {
      "poster_name": "Alex Zappa",
      "poster_handle": "reatlat"
    },
    "time_stamp": "2024-05-30 20:34:55",
    "text": ":100:  agreed with <@U06GU32ANDV> its hard to say without seeing the actual code, and if <@U075PL026ER> looking to help her, it will be nice to share at least website link and point where is the issue happened"
  }
]