[
  {
    "poster": {
      "poster_name": "Tammy Amaral",
      "poster_handle": "tammy.amaral"
    },
    "time_stamp": "2024-05-01 08:53:35",
    "text": "Hoping someone can shed some light on this one. I recently added a couple of custom modules to our site. All those new modules utilize bootstrap. Everything was working fine up until Friday when I noticed one module wasn't displaying as it should. I saw that it wasn't calling the bootstrap css. When I went to fix that, my breadcrumb module broke and didn't display properly. It, for some reason, is being pulled in to the same container that the new modules sit in. No matter what I try, I can get it to sit outside of it. Here is one of those pages as an example:\n<https://www.ecoonline.com/case-study/tesco>\n\nSince there is the count up module, which utilizes bootstrap, the breadcrumb module is forced left. Any insight as to why that is would be greatly appreciated!\n\nThanks,\n\nTammy"
  },
  {
    "poster": {
      "poster_name": "Gabe Gallatin",
      "poster_handle": "gabe413"
    },
    "time_stamp": "2024-05-01 16:38:53",
    "text": "Hey all, I'm trying to use a custom object \"New Listings\" to dynamically display 3 new home listings that I have my external IDX of homes updating/rotating every 5 days. I'm running into a wall on how to use the custom object's internal value from HubSpot in the html + HubL code of the module so that it updates the references for images, links, ect. on the landing page automatically when the displayed fields are updated via mapping workflows that are currently successfully pulling the custom behavior event data points onto the custom object \"New Listings\". I alternatively have tried to reference this landing page using a dummy contact card in the hopes that personalization tokens would work but to no avail. Any insights on how to get a custom object's fields to display on a landing page would be greatly appreciated. Always happy to provide more info as needed.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-05-05 08:17:35"
      },
      {
        "time_stamp": "2024-05-06 09:56:13"
      },
      {
        "time_stamp": "2024-05-08 15:21:32"
      },
      {
        "time_stamp": "2024-05-09 07:42:15"
      }
    ]
  }
]