[
  {
    "poster": {
      "poster_name": "Derik Savage",
      "poster_handle": "derik"
    },
    "time_stamp": "2023-02-27 05:56:37",
    "text": "Good morning, HubSpot Devs. I posted this in <#C22PU4LV8|general>, but figured it might be more appropriate here.\n\nMy team has been building websites on CMS for a couple of years now using themes from the marketplace. None of us are developers, so we just use what’s available with the themes we purchase.\n\nThe problem we’re running into is that we’re starting from scratch with each new client. Choosing / purchasing a theme, working with new modules, designing everything around the capabilities and limitations of that theme, etc. It can take quite a bit of time.\n\nIn order to streamline our process, what we’d like to do is have a few themes designed that are already fully customized to our needs that we can own and re-use for multiple clients.\n\nOur clients are in a very transactional business, so they’re not very concerned about their websites being unique. Think of it like choosing a floor-plan for an apartment. We want them to be able to choose one of 4-5 options, and only have our team add their messaging, colors, logo to a theme that already has everything else ready to go.\n\nI can even see this starting with one or two “base” themes that share the same set of modules, but have different default settings/templates based on the designs we create. If this sounds like something you’d be interested in working on, please feel free to reply here or send me a DM. Thanks!",
    "reply_count": 7,
    "reply_users_count": 6,
    "replies": [
      {
        "time_stamp": "2023-02-27 06:18:49"
      },
      {
        "time_stamp": "2023-02-27 09:45:55"
      },
      {
        "time_stamp": "2023-02-28 04:39:29"
      },
      {
        "time_stamp": "2023-02-28 04:54:16"
      },
      {
        "time_stamp": "2023-02-28 05:20:28"
      },
      {
        "time_stamp": "2023-02-28 21:24:42"
      },
      {
        "time_stamp": "2023-03-04 05:20:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2023-02-27 06:18:49",
    "text": "DM sent!"
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2023-02-27 09:45:55",
    "edited": {
      "time_stamp": "2023-02-27 09:58:46"
    },
    "text": "What themes have you used previously?\nThere’s tons of multi purpose themes out there but I’d just stick to one or two and master it.\n\nIf you’ve got the capital investment, creating your own can be a wise move. Just make sure it’s up to a standard of what’s currently on the market."
  }
]