[
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-07-07 04:35:34",
    "text": "Hi We are using the CRM search API\n<https://developers.HubSpot.com/docs/api/crm/search>\nIs there a limit on the number of filters in a filter group? we seem to have an issue if we try to add more than 3",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-07 04:57:29"
      },
      {
        "time_stamp": "2021-07-07 07:49:09"
      },
      {
        "time_stamp": "2021-07-15 10:54:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2021-07-07 04:57:29",
    "text": "I came across the 3 limit in the past too, I assume that must be the limit"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-07-07 05:17:40",
    "text": "Hi guys, new to HubSpot here\nI have a table car and a child table car-parts(this table contains a list of car parts for a particular car). as our database grow over time, it become difficult to link the tables manually. My question is: when we create new car is it possible to link the car parts from the child table associated with the new car automatically ? the name of the car and the name of the car pars are the same. that is how we know witch car part is associated with the particular car. any ideas on how to implement this???\nThanks!",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:56:06"
      },
      {
        "time_stamp": "2021-07-15 11:05:57"
      },
      {
        "time_stamp": "2021-07-15 12:06:46"
      },
      {
        "time_stamp": "2021-07-15 12:07:12"
      },
      {
        "time_stamp": "2021-07-15 12:22:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Francisco Amaral",
      "poster_handle": "francisco00amaral"
    },
    "time_stamp": "2021-07-07 05:58:13",
    "text": "Hi, I'm trying to update a batch of properties in a company. It used to work fine, but today it's returning an error saying resource not found? What could be the problem?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:56:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-07-07 07:49:09",
    "text": "Usually they are very good at telling us about limits"
  },
  {
    "poster": {
      "poster_name": "Rodney Lewis",
      "poster_handle": "lewis.rodneyl"
    },
    "time_stamp": "2021-07-07 12:48:16",
    "text": "Is anyone available to chat about the forms api? I'm attempting to display my newsletter form in the nav and also within the page body. I've assigned unique \"formInstanceId's\" and even attempted to use unique formId's by cloning my original form. I can't be the only one here who's attempted this. Any help would be greatly appreciated. Cheers!!"
  },
  {
    "poster": {
      "poster_name": "Kyle Combs",
      "poster_handle": "kyle477"
    },
    "time_stamp": "2021-07-07 17:35:54",
    "text": "Is anyone working well with the Beta Marketing Events API yet? We want to start using the Marketing Events APIs to connect our current public events to HubSpot in order to track which of our clients attend which events. As I’m trying to get set up with this API, I’m seeing quite a bit of difference in how we must interact with it. In the <https://developers.HubSpot.com/docs/api/marketing/marketing-events|Market Events API Docs>, it states that you must create a Developer Account and Create an application definition for your “App”. When I go to do this, I am prompted with this page asking what I would like to do:\n\nWhat is it saying an App is is not what we are looking for. We really just want to create Marketing Events the same way we create Contacts and Deals using our API key, but when I try to do so, I am told that this key is not valid for these endpoints. It furthermore talks about the App needed to go through OAuth authorization with the user before they can use the app, but this will not be a user-facing app. It will just be an integration with our current custom-built event management GUI that we use in-house. When we create events, we would like it to create a Marketing Event record in HubSpot for this event. Then when one of our clients RSVPs or signs into one of these events on our site we would like to link this Contact to this Marketing Event associated with our event.\n\nAlso, if we DO need to go this route of creating an App separate from the current HubSpot integration we’ve been building out over the past few months, it mentions that we need to have an API set up in our app where HubSpot can fetch event details as needed. In productions I can see how this would work, but how would this work in development when your site can’t send a request to my localhost, etc.\n\nAre we misinterpreting what Marketing Events are? Am I misinterpreting how to create and interact with them? Just a bit lost in this portion of the HubSpot integration, and would really love a chat with someone or some more direction on how I should be setting up this integration with the current one we’ve been building out these past few months.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:57:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joshua Archer",
      "poster_handle": "josh033"
    },
    "time_stamp": "2021-07-07 18:35:09",
    "edited": {
      "time_stamp": "2021-07-07 18:36:38"
    },
    "text": "Has anyone used the form submissions api?\n\nThe older api endpoint `<https://api.hsforms.com/submissions/v3/integration/submit/:portalId/:formId>`  doesn’t seem to be accepting requests, and can’t find any docs with the newer API for form submissions (<https://developers.HubSpot.com/docs/api/marketing/forms>)",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-08 02:07:08"
      },
      {
        "time_stamp": "2021-07-08 02:07:16"
      },
      {
        "time_stamp": "2021-07-15 10:58:30"
      },
      {
        "time_stamp": "2021-07-15 10:58:40"
      }
    ]
  }
]