[
  {
    "poster": {
      "poster_name": "Roman Mozolevskij",
      "poster_handle": "roman.mozolevskij"
    },
    "time_stamp": "2021-07-21 01:36:34",
    "text": "Hi all!\nCould someone help me resolve an issue that occurred for me recently. While trying to fetch automation workflows `<https://api.hubapi.com/automation/v3/workflows/{workflow_id}?stats=true>`\nstarted to get this kind of error\n```{\n    \"status\": \"error\",\n    \"message\": \"Unable to process JSON\",\n    \"correlationId\": \"32b5ecef-f1ac-4bc7-91bc-254dcb17307f\"\n}```\nThe interesting part that there is a bunch of workflows that are being fetched but only one is failing. If anyone has any ideas, please share. Thank you :bow:",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-21 02:44:21"
      },
      {
        "time_stamp": "2021-07-21 02:46:09"
      },
      {
        "time_stamp": "2021-07-21 07:00:39"
      },
      {
        "time_stamp": "2021-07-21 07:02:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2021-07-21 02:44:21",
    "text": "If you've got other workflows working it probably isn't this but i've ran into this in the past: workflows have a different ID to that shown in the url bar of the workflow page you need to use one of the worflow api's to get the proper worflow id"
  },
  {
    "poster": {
      "poster_name": "Roman Mozolevskij",
      "poster_handle": "roman.mozolevskij"
    },
    "time_stamp": "2021-07-21 02:46:09",
    "text": "yeah, we are using the workflows api to fetch all the workflows id's associated with the account. and for some reason only on this particular one it breaks."
  },
  {
    "poster": {
      "poster_name": "Rudolf Zundel",
      "poster_handle": "rudolf.zundel"
    },
    "time_stamp": "2021-07-21 03:51:45",
    "text": "Hi all! I am working on syncing properties of ~3000 contacts in HubSpot daily from our database. I’m wondering if anyone have experience with this use case as I saw the API has 150 requests/10 sec and a limit of 10 contact updates per batch request. Can this be somehow increased or am I missing something here (another API endpoint, or another method of syncing data probably)?",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-21 10:32:40"
      },
      {
        "time_stamp": "2021-07-21 17:33:02"
      },
      {
        "time_stamp": "2021-07-21 17:34:41"
      },
      {
        "time_stamp": "2021-07-21 17:36:06"
      },
      {
        "time_stamp": "2021-07-22 01:16:42"
      },
      {
        "time_stamp": "2021-07-22 01:19:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2021-07-21 07:00:39",
    "text": "Hey <@U022EMLASFP>, I took a look through our logs based on the correlation ID you reported. I’m not sure how the workflow got in this state, but it looks like the workflow you’re trying to fetch has a “create record” action that is setting the HubSpot owner ID of the created record two times, to different values. I think that if you remove one of those, you should be able to successfully fetch the workflow. I’ll follow up with the team to see why we allowed this to happen, because I would have expected this to cause a validation error when trying to save."
  },
  {
    "poster": {
      "poster_name": "Roman Mozolevskij",
      "poster_handle": "roman.mozolevskij"
    },
    "time_stamp": "2021-07-21 07:02:11",
    "text": "<@U0157R7AQ84> Thank you for your reply! This helps a lot!"
  },
  {
    "poster": {
      "poster_name": "Francisco Amaral",
      "poster_handle": "francisco00amaral"
    },
    "time_stamp": "2021-07-21 07:08:31",
    "edited": {
      "time_stamp": "2021-07-21 07:13:38"
    },
    "text": "Hi I was wondering if there is any option through API to clear properties values,\nThank you.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-21 10:35:56"
      },
      {
        "time_stamp": "2021-07-23 17:17:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Phillip Brockman",
      "poster_handle": "pbrockman"
    },
    "time_stamp": "2021-07-21 08:33:42",
    "text": "Greetings! I am currently using Zapier to run a POST request to a 3rd party server whenever a specific form is submitted. I am looking into using the HubSpot API for the same functionality.\n\nThe problem I’m running into is that I only know how to use the API to make requests from my client. How do I get HubSpot to send a request to my client when a specific form is submitted?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-23 17:18:53"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nate McAree",
      "poster_handle": "natem"
    },
    "time_stamp": "2021-07-21 10:32:40",
    "text": "Hey, I was interested in this and looked up the idea I had for a solution. I thought of using threading for increased performance, but HubSpot said (as of 2018) \"Running multiple threads wouldn't get you around the HubSpot speed limits. Since we are going to track the speed limits by the token and key and not by an individual thread. You would be prone to receiving 429s on different threads depending on which one broke the speed limit which would probably make things more confusing and not speed up the overall process.\""
  },
  {
    "poster": {
      "poster_name": "Nate McAree",
      "poster_handle": "natem"
    },
    "time_stamp": "2021-07-21 10:35:56",
    "text": "My understanding to HubSpot properties, is that there is no real way to \"clear\" or delete an entry other than replacing it with a blank string. I could be wrong, but you may be able to update contact property to an empty string?"
  },
  {
    "poster": {
      "poster_name": "Lucas Dantas Gama Ayres",
      "poster_handle": "lucas187"
    },
    "time_stamp": "2021-07-21 13:09:03",
    "text": "Hello everyone, everything good? I am in need of help and would like to know if anyone can help me. I need to get status changes for a specific deal from time to time (webhook). I found only this API (<https://legacydocs.HubSpot.com/docs/methods/deals/get_deals_modified>), but it returns changes from all Deals.. and has no webhook option either.",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-21 17:39:09"
      },
      {
        "time_stamp": "2021-07-22 06:21:01"
      },
      {
        "time_stamp": "2021-07-22 07:18:04"
      },
      {
        "time_stamp": "2021-07-22 08:14:51"
      },
      {
        "time_stamp": "2021-07-22 08:36:07"
      },
      {
        "time_stamp": "2021-07-22 08:37:20"
      },
      {
        "time_stamp": "2021-07-22 09:40:30"
      },
      {
        "time_stamp": "2021-07-23 17:20:14"
      },
      {
        "time_stamp": "2021-07-27 08:35:14"
      },
      {
        "time_stamp": "2021-08-10 11:01:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2021-07-21 17:33:02",
    "text": "Hey Rudolf, what’s the issue with the burst limits and batch size for your use case? \n\n3000 contacts and a batch size of 10 is 300 requests to make updates. Even if you only averaged 1 call/ second that’s 5 minutes for the entire job. If you could make requests at the batch limit that’s 20 seconds for the entire job."
  },
  {
    "poster": {
      "poster_name": "Justin Song",
      "poster_handle": "justin816"
    },
    "time_stamp": "2021-07-21 17:33:14",
    "text": "Hello - I was wondering if any of the APIs allow a functionality as described: imagine a user lands on a page where the URL string is unique to them. Suppose that URL was stored already in a field within their HS contact record..They then click a button on the page to submit some information.\n\nCould a script be placed on a page like this that uses an HS API to edit their contact record fields - with the mechanism of knowing which contact record to update based on the URL of the page they are on (which is also unique and only in their HS contact record data)? Which APIs would I use in this instance?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-21 18:18:40"
      },
      {
        "time_stamp": "2021-07-22 07:55:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2021-07-21 17:34:41",
    "text": "Each account has at minimum 500,000 total api calls per day. Your job should be well within that total call limit"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2021-07-21 17:36:06",
    "text": "However, if you did want to try to do this in a single call, there is a Contact import endpoint where you upload a CSV or Excel file programmatically. That supports up to 250,000 rows per file. <https://developers.HubSpot.com/docs/api/crm/imports|https://developers.HubSpot.com/docs/api/crm/imports>"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2021-07-21 17:39:09",
    "text": "There is a webhooks api that supports deal property updates. This must be done from a developer app (using oAuth authentication). <https://developers.HubSpot.com/docs/api/webhooks|https://developers.HubSpot.com/docs/api/webhooks>"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2021-07-21 18:18:40",
    "text": "This seems like kind of a quirky use case, but in theory the new Contact API endpoints support passing a non-HubSpot contact ID. Usual warnings against not using your API key directly on the client side apply, but perhaps you could pass that special ID/slug as a hidden form field to your own backend or Zapier.\n\n<https://developers.HubSpot.com/docs/api/crm/contacts>"
  }
]