[
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-07-02 08:02:45",
    "edited": {
      "time_stamp": "2021-07-02 08:15:46"
    },
    "text": "Is it possible to send an email with the SMTP API or do I need an npm package like nodemailer?\n\nI am trying to send an email with the SMTP API from a custom code action, but I think this is quite hard to achieve without something like ‘nodemailer’",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:49:20"
      }
    ]
  },
  {
    "text": "Hi all! Does someone have tried to send a form from a CMS? for example, i have tried this in postman and works, but not in my VTEX CMS",
    "time_stamp": "2021-07-02 09:19:11"
  },
  {
    "text": "",
    "time_stamp": "2021-07-02 10:19:09"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-07-02 10:20:18",
    "text": "Trying to use oauth — running through this not sure what is going on here"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2021-07-02 10:24:21",
    "text": "I’m guessing i have my app settings messed up"
  },
  {
    "text": "I'm trying to decide which is best for our use case of sending events into HubSpot from our product and website related to our customers – *Custom Behavioral Events* (who's v3 API is still in beta development) - or - *Timeline Events* via a custom app/integration.\n\nThese could be things like `Started a trial` or `Completed guided onboarding` or `Requested a demo`.\n\nEither way, we'd want to be able to segment based off of these events and add folks to Active Lists, and we'd want to be able to use the completion of an event as a trigger for a Workflow. Timeline Events can do both of the latter, but is a bit more cumbersome to setup. Custom Behavioral Events don't appear to do either – they can't be used for enrollment into an Active List, nor can they be used as a trigger to enter a Workflow. They _can_ be used as a delay inside a workflow, but that's it.\n\nCan anyone from HubSpot speak to these limitations of Custom Behavioral Events, and whether or not they will be addressed in the future, and potential timeline?\n\nAnyone else have similar experiences? I'd love to know what route you tool.\n\nThanks all!",
    "time_stamp": "2021-07-02 12:09:02",
    "edited": {
      "time_stamp": "2021-07-05 14:15:11"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:50:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "David Passman",
      "poster_handle": "dpassman"
    },
    "time_stamp": "2021-07-02 14:00:16",
    "text": "does anyone know if there's a way via API to clone a dashboard from one HubSpot account to another?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-07-15 10:50:53"
      }
    ]
  }
]