[
  {
    "poster": {
      "poster_name": "Naveen kumar",
      "poster_handle": "naveenkumar16613"
    },
    "time_stamp": "2024-04-28 04:57:35",
    "text": "Hi,\n\nI am a Software Developer at <https://www.aurionpro.com/|Aurionpro>.with  I am a graduate of Computer Science and Engineering.\nWbjee Rank-4820\n5-star rating on HackerRank\n\nPlease refer to my profile\nSkills:\nJava DSA, Opps, Hibernate, SpringBoot HTML, CSS, JS AngularJS Jasper Report. Developer Tools:\nEclipse, Visual Studio, My-SQL, SQL-Yog, I-report Frameworks: SpringBoot, Hibernate, Struts, microservices architecture, CI-CD and Design Pattern.\n\nI have a deep understanding of Low-level design great learning from Scaler.\nJava Trained from IIT Bombay.\nMy cv is attached\n<https://drive.google.com/file/d/1Uwj4sc5sfxURZuAszgzyoGMYxzvYgQsT/view?usp=sharing>\n\nMy Github :\n\n<https://github.com/Naveen2334>\nMy LeetcodeProfile:\n<https://leetcode.com/naveenkumar16613/>\nMy coding skills :\n<https://docs.google.com/document/d/1Oq1iNbsnOlb6REdMf3hmr_iiYJsIcnbxTZPCfGFxLKI/edit?usp=sharing>\nMy Portfolio :\n<https://jolly-florentine-b3032b.netlify.app/>\nMy Linkedin :\n<https://www.linkedin.com/in/naveen-kumar-softwaredeveloper/>\n\n\nI appreciate your attention and look forward to the possibility of joining your team and contributing to the Organization's success.\n\nThank you for your time and consideration.\n\nThanks &amp; Regard\nNaveen Kumar\n<mailto:naveenkumar16613@gmail.com|naveenkumar16613@gmail.com>\n9038132689"
  },
  {
    "poster": {
      "poster_name": "Erielle Bancolita",
      "poster_handle": "shinyrose0304"
    },
    "time_stamp": "2024-04-28 09:36:39",
    "text": "Greetings all.\nMy name is Erielle who is a professional web and mobile full stack developer with more than 7 years of experience.\n\nThis is my portfolio link.\n<https://erielle-bancolita-portfolio.vercel.app>\n\nIf you need any help from developers you can contact me easily and I am here to make your ideas to reality.\n\nI can work full time for you and your project in any time zone.\n\nHere are some projects of my work as a front end developer.\n <https://backstage.global/>\n<https://arronax.io/>\n<https://game7.io/>\n\nMy current area of focus is in the React/React Native, Vue, Angular, Node.js, Python, Tailwind CSS, MUI, where I actively engage in developing and designing immersive user-friendly and responsive applications. I am passionate about delivering high-quality work within specified timelines and maintaining clear communication throughout the project lifecycle.\n\nCollaborate closely with the team, including a designer and technical lead, to refine and improve the application’s features. I have good experience of maintaining a clean codebase which is paramount for scalability and maintainability.\n\n Moreover, I will actively take part in codebase reviews to catch potential bugs and improve code quality but also fosters a culture of knowledge sharing and continuous learning within the team.\n\n Furthermore, My familiarity with version control systems like Git and understanding branching strategies can facilitate smooth collaboration and code integration within the team. Hope to work with you.\n\nThanks and looking forward to your response.\nKind Regards,\nErielle"
  }
]