[
  {
    "text": "We use custom modules and we add CTA through a field of “type: CTA”.  These modules are configured by non developers. Here is a screenshot of such a CTA\n\n• it’s text says “droit des affaires”\n• we do not use HubSpot defaut style (its the “Link(No Style)”\n• we do give them custom CSS classes, non of these classes contain image background or content :thinking_face: \n• we don’t given them “Custom CSS”\nThe screenshot says “width 120,656px, height 50px”. The figures come from the custom css classes\n\nIn the code, the CTA is added this way (and not through dnd)\n```{% if module.cta %} {{ cta(module.cta) }} {% endfor %}```",
    "time_stamp": "2021-12-29 08:28:19",
    "edited": {
      "time_stamp": "2021-12-29 08:49:55"
    }
  },
  {
    "poster": {
      "poster_name": "Julie Guo",
      "poster_handle": "julie-externe"
    },
    "time_stamp": "2021-12-29 08:44:17",
    "text": "Hello <@U010ZU6TRD0>, you’ve been kind enough to help me once, I figure I’ll bother you once more :see_no_evil:\nAny idea or experience to share ? Thank you anyway in advance :pray:"
  },
  {
    "text": "Here is where some of your problems are coming from.",
    "time_stamp": "2021-12-29 10:21:40"
  },
  {
    "text": "",
    "time_stamp": "2021-12-29 10:21:51"
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2021-12-29 10:22:59",
    "text": "These CTA's are referencing an image as you can see in the 2nd image under src. Just pull your site into a code editor such as visual code and search for one of the images you should easily find out what is going on."
  },
  {
    "text": "Thank you for the screenshots <@UTQQ4TXCH>\n\nWe have no idea why HubSpot transforms our CTA to image and those images are added by our code or configuration :see_no_evil:.\n\nI found the images in”network” sheet but on a fully loaded page I can’t see my CTAs referring to image :thinking_face: :point_down:\n\nBy the way do you use HubSpot CTA on your website? If you do not have the same issue, would you mind sharing how you set up yours? :pray:",
    "time_stamp": "2021-12-29 10:53:14"
  },
  {
    "text": "I tested a CTA and it does it to ours also. Sorry I didn't realize it functioned that way. I probably didn't notice because I don't use a lot of CTAs I use buttons. Only time I use the CTAs is LP, thank you pages, etc. Here is an example of a button",
    "time_stamp": "2021-12-29 11:58:49",
    "edited": {
      "time_stamp": "2021-12-29 12:05:48"
    }
  },
  {
    "text": "",
    "time_stamp": "2021-12-29 12:01:05"
  }
]