[
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2020-08-06 01:07:02",
    "text": "to make development much easier and it will not take much time to upload it to design manager :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2020-08-06 01:08:38",
    "text": "Yeah uploading is fast. But still I have to go online to check the preview. It's not convenient."
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2020-08-06 02:12:28",
    "text": "Yup, but i think HubSpot is also aware of this :wink:"
  },
  {
    "poster": {
      "poster_name": "Clarke Bishop",
      "poster_handle": "cbishop"
    },
    "time_stamp": "2020-08-06 07:06:17",
    "text": "I am looking into configureWebpack &amp; chainWebpack.\n\nOne cool feature of the Vue CLI I found is:\n`vue inspect --mode production &gt; wp-prod.js`\n\nThis will run through the vue tooling and generate a complete webpack config object, then output it to wp-prod.js!\n\nIf you don’t use --mode production, it will default to development.\n\nAlso, here’s a good video on Vue CLI and webpack, <https://www.youtube.com/watch?v=ldXj9wtwyZ4&amp;t=456s>\n\nThe first 10 minutes is kind of slow, but then it really takes off."
  },
  {
    "poster": {
      "poster_name": "Clarke Bishop",
      "poster_handle": "cbishop"
    },
    "time_stamp": "2020-08-06 09:06:54",
    "text": "<@UQ4ED6QFM> you probably already know this, but …\n\n`npm run serve`\n\nDoes not work with the cms-vue-boilerplate code.\n\nI cloned the repo and ran *npm run serve*, and expected the app to be available at localhost:8080. There were no errors, just no output."
  },
  {
    "poster": {
      "poster_name": "Mike Talley",
      "poster_handle": "mtalley"
    },
    "time_stamp": "2020-08-06 09:08:08",
    "text": "thanks for the heads up Clarke, I will take a look and fix that in the boilerplate"
  },
  {
    "poster": {
      "poster_name": "Clarke Bishop",
      "poster_handle": "cbishop"
    },
    "time_stamp": "2020-08-06 09:09:04",
    "text": "---------------\nMore feedback on cms-vue-boilerplate.\n\nIn real-world apps, you often need vue plugins like Vuex, Vue-Router, or Vuetify.\n\nThese plugins now depend on the Vue CLI for ease of use and auto-configuration. Without vue-cli, I think this may be headed for configuration hell!"
  },
  {
    "poster": {
      "poster_name": "Mike Talley",
      "poster_handle": "mtalley"
    },
    "time_stamp": "2020-08-06 09:16:48",
    "text": "I see what you mean Clarke -- let me put some thought into this. I could potentially configure this project as a template for use with `vue init` -- going to do some research on doing things this way"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-08-06 11:34:14",
    "text": "Hey there Ankit. It’s true to preview and test the content you do need to view in in a HubSpot account. We recommend using a CMS Sandbox account for this.\n\nThe HubSpot platform undergoes thousands of updates per day, meaning it would be difficult for you as a developer to ensure you are always using the latest version. ensuring what you saw locally matched what would be in the browser. In-addition the HubSpot platform is very integrated amongst all of the tools. The CRM for example interacts with the CMS and can be used for functionality like Memberships. Serverless functions alone on the CMS can interact with almost every HubSpot product.\n\nRather than simulate everything and risk inconsistency between the local experience and the web, we’re working on making it easy to build locally but test in the real constantly up-to-date HubSpot environments"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-08-06 11:49:40",
    "text": "<https://developers.HubSpot.com/docs/cms/guides/creating-an-efficient-development-workflow>"
  }
]