[
  {
    "poster": {
      "poster_name": "Gideon B",
      "poster_handle": "gbelete"
    },
    "time_stamp": "2023-04-25 20:46:12",
    "text": "Hi all -\n\nI was looking to understand if it is possible to apply unique styles to fields within a field group i.e., currently I have a `background field`  and a repeater function that duplicates the element (a card element) thus applying the background image to each card that is created. If I also wanted to enable editors to apply a unique `background` to each card created by the repeater function, how would I do that?\n\nSo far I have added `{{ loop.index }}`  to `&lt;div class=\"card\"&gt;&lt;/div&gt;` that the `background` is applied so that each iteration of the element has a unique `classname` - all of which is wrapped in the following loop created by enabling the repeater `{% for item in module.card %}` .\n\nAt this point I am unsure how to enable an editor (using the HS UI) could apply a different background image to each card they create using the repeater. It does not look like I can create a repeater on a style field group so I am a bit stumped. I have attempted to wrap my css in my `require css` within `module.html` with the repeater `for loop` but am not having any success - it could be that I am doing it incorrectly.\n\nAny assistance or direction on if this is possible would be greatly appreciated.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-04-26 00:07:30"
      },
      {
        "time_stamp": "2023-04-26 06:44:22"
      },
      {
        "time_stamp": "2023-04-27 00:34:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-04-26 00:07:30",
    "text": "I think you could just add the background-image as an inline style directly. So that in your repeated group you will include an image field and render its source into the style attribute of the &lt;div class=\"card\" style=\"background:url({add image src here});background-repeat:no-repeat;background-position:center;\"&gt;\n\nOr if that doesnt sit right with you, you can always include the image inside the card, make its position absolute, z-index: -1 and then make sure the card div has position relative."
  }
]