[
  {
    "poster": {
      "poster_name": "Gregg Andrews",
      "poster_handle": "gregg"
    },
    "time_stamp": "2023-07-24 05:55:32",
    "text": "<@UJL4N3WN8> Thanks for your input. It gives me good information about how things work and best practices that I can provide to those who are requesting this addition to the templates."
  },
  {
    "poster": {
      "poster_name": "Shane Janssens",
      "poster_handle": "sjanssens"
    },
    "time_stamp": "2023-07-24 08:03:39",
    "text": "Hi All, On August 4th we are introducing new limits on the use of CRM tokens in Programmable email (for new and existing emails).\nWhen you use CRM tokens in these type of emails, you'll be able to send them with the following limits:\nup to 100,000 recipients and make one CRM call\nor 50,000 recipients and make two CRM calls\nor 25,000 recipients and make three CRM calls\nor 12,500 recipients and make four CRM calls\nor 6,250 recipients and make a max of five CRM calls\nSending an email that meets or exceeds these limits will delay or cancel it.\n\nPlease note that:\nYou can't clone and send programmable emails at the same time as this is an account limit.\nA/B testing isn't available for these emails.",
    "reply_count": 9,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-08-02 19:28:06"
      },
      {
        "time_stamp": "2023-09-01 07:43:57"
      },
      {
        "time_stamp": "2023-09-01 07:50:05"
      },
      {
        "time_stamp": "2023-09-01 07:51:59"
      },
      {
        "time_stamp": "2023-09-01 07:53:36"
      },
      {
        "time_stamp": "2023-09-01 07:59:04"
      },
      {
        "time_stamp": "2023-09-01 08:20:15"
      },
      {
        "time_stamp": "2023-09-01 09:01:01"
      },
      {
        "time_stamp": "2023-09-01 13:17:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bashir",
      "poster_handle": "ayo_idan"
    },
    "time_stamp": "2023-07-24 10:59:40",
    "text": "Try adding extra_classes=“some_class_name” to the custom module. Can’t remember if this works in email templates. "
  },
  {
    "poster": {
      "poster_name": "Richard Owens",
      "poster_handle": "rich151"
    },
    "time_stamp": "2023-07-24 23:27:29",
    "text": "Has anyone else had a number of programmable emails break? A lot of my emails are now unable to send due to template missing and the styling is not longer present specifically for background images."
  }
]