[
  {
    "poster": {
      "poster_name": "Simon Taylor",
      "poster_handle": "simon.t"
    },
    "time_stamp": "2018-07-11 03:29:06",
    "text": "We're looking for a HubSpot/Wordpress developer to join our team in Birmingham. See <https://cognition.bamboohr.co.uk/jobs/view.php?id=46> for more info."
  },
  null,
  {
    "poster": {
      "poster_name": "elevine",
      "poster_handle": "elevine"
    },
    "time_stamp": "2018-07-11 09:24:26",
    "text": "Random question for the <#C22PJ878V|random> channel. As Designers/Developers, what, if any, individual goals do you have set for you by your organization? I would love to hear what other HS partners have going on. Feel free to DM me if you would like!",
    "reply_count": 17,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2018-07-11 09:26:04"
      },
      {
        "time_stamp": "2018-07-11 09:27:03"
      },
      {
        "time_stamp": "2018-07-11 09:41:53"
      },
      {
        "time_stamp": "2018-07-11 09:45:08"
      },
      {
        "time_stamp": "2018-07-11 09:45:50"
      },
      {
        "time_stamp": "2018-07-11 09:48:16"
      },
      {
        "time_stamp": "2018-07-11 09:50:53"
      },
      {
        "time_stamp": "2018-07-11 09:52:01"
      },
      {
        "time_stamp": "2018-07-11 09:54:47"
      },
      {
        "time_stamp": "2018-07-11 09:56:09"
      },
      {
        "time_stamp": "2018-07-11 09:57:44"
      },
      {
        "time_stamp": "2018-07-11 09:58:24"
      },
      {
        "time_stamp": "2018-07-11 09:58:45"
      },
      {
        "time_stamp": "2018-07-11 10:00:35"
      },
      {
        "time_stamp": "2018-07-11 10:02:20"
      },
      {
        "time_stamp": "2018-07-11 10:13:54"
      },
      {
        "time_stamp": "2018-07-11 10:15:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-07-11 09:26:04",
    "text": "We’ve been moving more towards the idea of % reduction in future effort to create repeat campaigns"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-07-11 09:27:03",
    "text": "But there’s nothing concrete about the numbers yet (and it would be really hard as each client gets a fairly unique treatment)… But we want that to change to be more template-ized and modular"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 09:41:53",
    "edited": {
      "time_stamp": "2018-07-11 09:43:25"
    },
    "text": "I don’t know if I’d consider it an individual goal really but most of the work of this goal falls on me anyways - We have an internal goal to create a large library of custom modules that basically solves every common need we run into, and develop them so that we can use them in any project we work on.\n\nWe’re on our way to that goal but we have like 100 more module concepts we want to build out.\n\nThe point of this being that we’d be able to reduce website build costs/dev time/testing time drastically by focusing only on the site specific styling for the modules."
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-07-11 09:45:08",
    "text": "^^^^^ This is literally EXACTLY what we are working on in this moment"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-07-11 09:45:50",
    "text": "Except we are starting with the process of selling modular components / designs based on them and adding them to the “Library” as the need arises."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 09:48:16",
    "text": "Yea kinda what our plan is though the order of things is flipped, I think we’re going to build the library first make sure we feel the modules are working good for us after some site build outs, we’ll drop our most useful ones in the marketplace.\n\nwe so far haven’t submitted anything to the marketplace, though we do have a few modules we’ve been using for years now that people would probably like."
  },
  {
    "poster": {
      "poster_name": "Ryan Noon",
      "poster_handle": "ryan.noon"
    },
    "time_stamp": "2018-07-11 09:50:53",
    "text": "This is pretty much what we're striving to do at our agency. Are you guys using any particular tool/software/library for your collection of modules?"
  },
  {
    "poster": {
      "poster_name": "elevine",
      "poster_handle": "elevine"
    },
    "time_stamp": "2018-07-11 09:52:01",
    "text": "We have something close to this as well. Pretty cool to see we are all coming up with similar solutions."
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 09:54:47",
    "text": "<@U9MAWTESW> We use HubSpot for all of it. We have a process for storing our modules for re-use. We have a template framework in a private bitbucket repo, and the older modules are also stored in there as well. We haven’t felt the need with Design Manager 2 as much to maintain the new modules in the repo, but may do it as a precaution"
  },
  {
    "poster": {
      "poster_name": "Ryan Noon",
      "poster_handle": "ryan.noon"
    },
    "time_stamp": "2018-07-11 09:56:09",
    "text": "<@U7SL518D6> Ah sweet, was thinking of setting up a git repo myself for this, thanks for the tip :thumbsup:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 09:57:44",
    "text": "After seeing how the HS dev community has been kinda banding together, I am starting to think it might be a good idea to revive this repo <https://github.com/HubSpot/cos-boilerplate>"
  },
  {
    "poster": {
      "poster_name": "elevine",
      "poster_handle": "elevine"
    },
    "time_stamp": "2018-07-11 09:58:24",
    "text": "My initial question was meant to be more around goals that individuals are consistently tracking twords. For example, we are tracked based on utilization rate in a month. Does anyone have something similar?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 09:58:45",
    "text": "internally we keep our framework private because we feel it gives us a pretty good competitive advantage. There are benefits to everyone collectively improving the boilerplate though."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 10:00:35",
    "text": "<@U26BPJGS0> I’ve found utilization rate while it’s good to make sure employees are paying for themselves by balancing a higher utilization rate, it’s not the right indicator across the board for setting goals I’ve found"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-11 10:02:20",
    "text": "For example: Say you have an employee that ends up spending a lot of time building up the kind of library of modules we’re talking about, and times are a little slow regarding the quantity of available billable work for that person.\n\nSuddenly this utilization rate causes upper level people to punish the person who in the long term is going to possibly cause the company to have the greatest profits"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-07-11 10:13:54",
    "text": "Our compensation is tied directly to our martial prowess. If an intern can best you in hand to hand combat then they take your job and you are banished to the wasteland where you’ll have to survive by developing websites for roving bands of inbound marauders."
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-07-11 10:15:05",
    "text": "You don’t want to know what a BoFu CTA looks like for those guys."
  },
  null,
  null
]