[
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-05-13 04:53:18",
    "text": "<@UKHNRHVC7> I think you did actually explain that to me before. I frankly spaced it.  I'll give that direction to customers as the reach out.  I'm not sure on the date they edited last.\n\nThanks for handling it in that portal. I appreciate it.\n\nI hope you don't mind these reports.  I'm SUPER EXCITED for child-themes and what it means for customers so I'm trying to smooth it out as much as possible for them."
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-05-13 04:55:36",
    "text": "<@U022FJKR4CQ> Great question... I've been trying to crack this \"custom font nut\" for a long time.  Theme files don't except file uploads currently (to my knowledge) so your approach is a pretty good one."
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-05-13 07:09:37",
    "text": "No problem! I'm sorry for the continued customer reports, but I'm so glad you're excited about child themes! We really appreciate all of the feedback and bug reports you've passed on!"
  },
  {
    "text": "Is anyone else experiencing a THEME \"INSTALL UPDATE\" BUG?  This was working the other day without issue but this morning it's throwing a non-descript error message. :thinking_face:",
    "time_stamp": "2021-05-13 09:18:11",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-13 10:06:07"
      },
      {
        "time_stamp": "2021-05-20 05:12:43"
      },
      {
        "time_stamp": "2021-05-20 08:29:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-05-13 10:06:07",
    "text": "Hey Kevin, can you DM the portal ID for this and I can pass this internally to see whats happening."
  }
]