[
  {
    "poster": {
      "poster_name": "marieke westerterp",
      "poster_handle": "marieke"
    },
    "time_stamp": "2021-05-12 04:16:19",
    "edited": {
      "time_stamp": "2021-05-12 04:17:00"
    },
    "text": "Hi all!\nIs there a way to change the json of a module in the designmanager? That would be great!"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-05-12 08:19:16",
    "text": "<@UKHNRHVC7> just curious if you were able to find anything on this bug?  The customer reached out to me and is getting close to abandoning the child theme as it's a blocker for her."
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-05-12 09:02:44",
    "text": "Hey Kevin- sorry for the delay here, I was OOO yesterday. We've just pushed a fix for this issue. Let me know if you continue to see any issues here"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-05-12 10:04:58",
    "text": "<@UKHNRHVC7> awesome!  I'll check it out."
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-05-12 12:06:38",
    "text": "<@UKHNRHVC7> <@U016CP4G7T7> Just a heads up that I'm still gettin reports of this CHILD-THEME BUG regarding the theme settings getting pulled over to live previews.  Customer's HubID: 19584090\n\n<https://www.loom.com/share/43c8c46e9e0342109f4e28ae070c0b23>",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-12 15:03:48"
      },
      {
        "time_stamp": "2021-05-12 15:04:46"
      },
      {
        "time_stamp": "2021-05-13 04:53:18"
      },
      {
        "time_stamp": "2021-05-13 07:09:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-05-12 15:03:48",
    "text": "Hey Kevin - sorry for not giving more detail on the original bug fix. This is the same root cause as the last bug, but something I forgot to mention with it: pulling in the fix does require all of the CSS to be re-minified and uploaded to our CDN. This can be triggered by modifying the file, or I just did it for this portal (I used the call to action button color to check for success, if there's more files I need to republish let me know). The CTA is now showing up as the correct color"
  },
  {
    "poster": {
      "poster_name": "Mitchell Katz",
      "poster_handle": "mkatz"
    },
    "time_stamp": "2021-05-12 15:04:46",
    "text": "We _should_ be re-minifying whenever the theme settings change though - do you know if either you or the customer edited them since May 4 when we pushed that bug fix? I'm guessing we missed a spot"
  },
  {
    "poster": {
      "poster_name": "erin wiggers",
      "poster_handle": "erin245"
    },
    "time_stamp": "2021-05-12 16:14:06",
    "text": "hi yall! I am new to this Slack channel and I have a question about using custom fonts in a basic theme. My client has provided files which I have turned into @font-faces and uploaded to the theme/portal. My problem now is that I don't know how to add these custom fonts as options in the theming dashboard dropdowns, so I can't override the default fonts like I want to. Is there documentation or a recommended way to use custom fonts in a custom theme? I would appreciate any help or points in the right direction! Thank you in advance",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-05-12 17:17:17"
      },
      {
        "time_stamp": "2021-05-13 04:55:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "erin wiggers",
      "poster_handle": "erin245"
    },
    "time_stamp": "2021-05-12 17:17:17",
    "text": "UPDATE: solved my own problem by adding the font families as the defaults in the theme.json file but if anyone knows of a better way feel free to chime in"
  }
]