[
  {
    "poster": {
      "poster_name": "Alejandro Vieira",
      "poster_handle": "avieirabaa"
    },
    "time_stamp": "2023-08-17 06:01:35",
    "text": "Hello everybody, How are you?\n\nCurrently in our website We have Free trial redirect that will send our users into a form in an auth0 website. After the user either logs in/signs up, then they are redirected to another website that communicates with our main website as they have the same root domain.\n\nOur problem is that HubSpot recognizes this lead as an Offline source due to being first introduced through the API instead of Direct traffic.\n\nCould we communicate the HubSpotutk cookie in the auth0 API?\n\nI would greatly appreciate any insights you could provide!"
  },
  {
    "text": "Hi there!\n\nWe are a HubSpot partner that implements all HS hubs and sometimes builds integrations between applications as well.\nWe are reconsidering the programming language we use to build integrations.\n\n*THE QUESTION*: What programming language should we choose for building integrations between applications to be future-proof?\n\nSome background information:\n• We build websites in HubSpot CMS and WordPress. More and more HubSpot CMS though, and less WordPress.\n• We currently build integrations in Golang. It is a decent language, but not used much. That’s why we are reconsidering. \n• We don’t build custom software applications.\n• We implement all modules of HubSpot.\nOf course, it is smart to choose a language which:\n• is suitable to create integrations with\n• easy to adopt for front-end developers as well to increase employability.\n• is close to development languages we use in HubSpot CMS and Wordpress.\nI am curious to the opinion of this community! Thanks a lot.\n\nPS One more thing, I saw on this link that HubSpot created libraries for Python, PHP, Node.js and Ruby. That must mean HubSpot is closely involved in these languages, and it would be wise to choose between those languages, right? <https://developers.HubSpot.com/docs/api/client-libraries>",
    "time_stamp": "2023-08-17 06:12:21",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-17 07:48:41"
      },
      {
        "time_stamp": "2023-08-17 08:51:05"
      },
      {
        "time_stamp": "2023-08-17 15:18:47"
      },
      {
        "time_stamp": "2023-08-21 07:05:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-08-17 07:48:41",
    "text": "I would say its almost irrelevant which language you are using, as the HubSpot API can easily be implemented in any of the popular languages.\n\nLooking at the provided HubSpot clients, I see a lot of people struggling with the documentation or missing methods.\n\nI was part of integration projects with PHP, node.js, Ruby and even Elixir and integrating the HubSpot API was similarly challenging in all of them. (Actually not completely true, there was a bit more work needed in Elixir).\n\nI would recommend you go with a language where you can easily find developers. Most common would be PHP and nodejs.\n\nBut there is nothing wrong with doing it in golang."
  },
  {
    "poster": {
      "poster_name": "Niko Dixon",
      "poster_handle": "niko209"
    },
    "time_stamp": "2023-08-17 08:51:05",
    "text": "Node is the most widely used, and the best documented based on my experience. JS based tools across the board seem to be the direction HubSpot is aiming toward, broadly. For both CMS and CRM side dev."
  },
  {
    "text": "[x-HubSpot-signature] - Hey everyone, how can I make a middleware for HubSpot signature V2?\nI follow the documentation, but it is not working. Did I do something wrong?",
    "time_stamp": "2023-08-17 11:29:41"
  },
  {
    "poster": {
      "poster_name": "Witold",
      "poster_handle": "witold.rosendaal"
    },
    "time_stamp": "2023-08-17 15:18:47",
    "text": "Thanks guys. \n\n<@U04UF7BNBK4> I understand but I think it is relevant to look at the other criteria I listed\n\nThanks <@U039PUBV59N> "
  },
  {
    "poster": {
      "poster_name": "Patrick Keo",
      "poster_handle": "patrick362"
    },
    "time_stamp": "2023-08-17 23:18:49",
    "text": "hi everyone, we're developing an integration to pull through from a training platform into the CRM. We can setup a list based on if they have registered for a training course which will populate fine. My question is just around smart rules for this list for the website (CMS Enterprise). If they have never converted on the website, but they registered on the training platform, so their details are all in the CRM from the integration, will this smart rule trigger? I suspect not because the relevant cookies wouldn't be there yet since they haven't filled out a form?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-22 15:21:04"
      }
    ]
  }
]