[
  {
    "poster": {
      "poster_name": "Jay Forbes",
      "poster_handle": "jay458"
    },
    "time_stamp": "2021-07-19 09:28:32",
    "text": "My team is in the process of establishing a development workflow. We plan to use Sandbox sites for feature development and QA and then we'll deploy to the live site.\n\nWhen setting up a new sandbox site, it's there a preferred method for importing content (pages, blog posts, etc.) from the live site? I don't see any native tools for syncing between CMS sites w/in HubSpot."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-07-19 10:03:30",
    "text": "<@U025VPJHG9Z> I use \"content staging\" in the production site to actually check content before going live. I use the sandbox for general template testing and setup only."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2021-07-19 10:03:50",
    "text": "I'd be interested to know if others do it differently"
  },
  {
    "poster": {
      "poster_name": "Jay Forbes",
      "poster_handle": "jay458"
    },
    "time_stamp": "2021-07-19 10:33:55",
    "text": "There are import option for Pages and Blog Posts but they seem very limited."
  },
  {
    "time_stamp": "2021-07-19 12:00:14",
    "edited": {
      "time_stamp": "2021-07-19 12:00:48"
    },
    "text": "Reminder: Are you a developer new to HubSpot, looking to get started building on CMS Hub? Check out our <https://developers.HubSpot.com/docs/cms/guides/getting-started|quick start guide> to get a quick taste. When you’re ready to learn more head on over to our <https://developers.HubSpot.com/docs/cms/guides|tutorials and guides> to learn by doing. When you’ve got a chance, we recommend looping back and reading the <https://developers.HubSpot.com/docs/cms/key-concepts|Key Concepts> of the CMS. It explains how all of the pieces of the CMS fit together. Welcome to HubSpot development, there’s never been a better time to be HubSpot developer!"
  },
  {
    "poster": {
      "poster_name": "George Karakitsios",
      "poster_handle": "gkarakitsios"
    },
    "time_stamp": "2021-07-19 12:54:40",
    "text": "Hello everyone, i am George and i am here to learn and share knowledge about HubSpot. I have knowledge of HTML CSS JS JQUERY and REACT JS. Thank you :slightly_smiling_face:"
  }
]