[
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2025-01-07 10:08:37",
    "text": "Thank you <@U048C858Y94> !\n\nCould you please also tell me if once we create the custom template via code, can we convert it drag and drop and use it across different types of email on HubSpot?\n\n Because it wouldn’t be worth the time if we can’t use the same custom template for different email styles by converting it to drag n drop email. (As a different email might have different format image or background color etc)"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-07 10:12:51",
    "edited": {
      "time_stamp": "2025-01-07 10:13:46"
    },
    "text": "I have no experience converting custom templates to drag-and-drop templates.\n\nAnd I believe it is very unlikely that these things you’re seeking to fix will still be fixed if you _do_ convert it."
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2025-01-07 10:29:07",
    "text": "<@U048C858Y94> Hey, Thank you!\n Could you please confirm or tell me who could confirm this as we need 100% confirmation that both the issues could be fixed- ‘Full-width on mobile version’ and ‘dark mode gmail app’  if we create a custom template with a developer. As this would require a lot of effort and time.\n\nThank you so much!"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-07 10:30:10",
    "text": "My understanding is that there is absolutely no way for you to use custom CSS in the &lt;head&gt; of a drag-and-drop email. And both of the issues you are facing require that in order to be fixed."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-07 10:30:33",
    "text": "And custom template &gt; to &gt; drag-and-drop is not a workaround that I believe is available."
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-07 10:30:51",
    "text": "Beyond me and Courtney you can try the HubSpot community forums or their official support channel."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-07 10:34:43",
    "text": "There are a couple of options for custom coding that would make it more flexible to use in the UI:\n\n<https://www.courtneyfantinato.com/custom-HubSpot-email-template/|https://www.courtneyfantinato.com/custom-HubSpot-email-template/>\n\n<https://emailancer.com/blog/build-a-user-arrangeable-email-using-custom-html-modules-in-HubSpot|https://emailancer.com/blog/build-a-user-arrangeable-email-using-custom-html-modules-in-HubSpot>\n\nCustom coding would allow full control of how the image displays so it doesn’t have extra padding added by HubSpot on the sides on mobile. But dark mode is not 100% controllable across all inbox providers even if custom coded. See: <https://www.litmus.com/blog/the-ultimate-guide-to-dark-mode-for-email-marketers|https://www.litmus.com/blog/the-ultimate-guide-to-dark-mode-for-email-marketers>"
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2025-01-07 10:48:44",
    "text": "<@U048C858Y94> <@UKGV272KS> Thank you so much for the info and for sharing these blogs.\n\nMy question is, if we create the custom coded template to fix the ‘full-width issue on mobile version’,\nwill we also be able to convert this ‘custom coded template’ to ‘drag and drop emails’ or will it be just one template that can’t be changed in any other design and we will have to create a custom template for every new type of emails in that case?"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-07 10:51:18",
    "text": "Have you explored all of the HubSpot settings etc. to make sure that you can’t remove the space on either side of the image? Because if that’s all you really want to have control of and the drag and drop is fine for your needs otherwise, I wouldn’t bother with going custom just for that single thing. I personally didn’t even notice it, which was why I commented on the UI space of the inbox provider itself."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-07 10:54:05",
    "text": "Additionally coding for email is not the same as web development so unless you have someone who knows email dev to do the work, custom coding one will be even more challenging."
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2025-01-07 11:16:58",
    "text": "<@UKGV272KS> Yes I have checked all the settings on HubSpot but there was no way to fix this even if we did the custom module for our images in the drag and drop. I even reached out to the support team and they told us, it can’t be fixed on the drag and drop template. \n\nAnd yes, we have an internal developer who could work on email development but since it requires effort and time we want to make sure that the issue would be fixed with 100% confirmation. \nSo could you please confirm,\nwill the custom coded email template be convertible to drag and drop template later so we can use it later for changes in other emails ?\n \nThank you! "
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-07 11:19:55",
    "text": "Did you read the blogs I shared above? Those are the only options I am aware of that allows you to create a custom email that is \"drag and drop\" though may not function 100% the same how HubSpot's editor is. You have to essentially build the template to work using HubL, you can't \"convert\" static code to drag and drop."
  },
  {
    "poster": {
      "poster_name": "Uttu",
      "poster_handle": "utkarshita"
    },
    "time_stamp": "2025-01-07 11:32:33",
    "edited": {
      "time_stamp": "2025-01-07 11:48:29"
    },
    "text": "<@UKGV272KS>  Yes I just read it!\n\nSo as I understand- \n1. It’s not the same integration for custom coded template like it’s for drag and drop editor? In order to create an email which is custom coded, we’ll need to edit it block by block , correct?\n2. Currently we can’t change the custom coded template  which is built using HubL to a drag and drop template on HubSpot marketing emails, correct?\nThank you! \n\n"
  }
]