[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-01-03 03:04:34",
    "text": "Hi everyone! I think I already know the answer to my question (which is 'no') but does anyone have any ideas on how to use one email template that pulls different information in based on 5 contact properties? My use case is as follows:\nWe send 'reminder' emails for documents and information which is outstanding. This is generally 5 things, and there could be any number of things from those outstanding items (just 1, or all 5) outstanding.\n\nWe want to format it nicely in an email to the contact, and our last CRM had the abilty to insert functions into an email template (if/then) which allows us to pull in specific wording IF property1=true... and so on.. and pull nothing for a specific property if it was false.\n\nfor example, there may be a document they need to return. Instead of just saying document returned: yes/no in the template, i'd like to amend the wording if it is yes so there is a bullet point saying 'XYZ document - still awaiting return (link to sign)'\n\nSidenote: it needs to go as a 1-to-1 email instead of marketing.\n\nAny ideas welcome, as we're currently having to send out a variety of different templates based on what specifics are outstanding, which is very time consuming at volume",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-03 08:06:59"
      },
      {
        "time_stamp": "2025-01-03 08:24:02"
      },
      {
        "time_stamp": "2025-01-03 08:28:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-03 08:06:59",
    "text": "I believe this would be possible with a custom template built in design manager using HubL (which has if/then) for an email going out of Marketing Hub. But if you're talking 1:1 as in the emails out of Sales Hub, I don't believe those emails can use the templates in the design manager. And with those emails you're limited to the personalization tokens. Is there a specific reason why you can't send from Marketing Hub?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-01-03 08:24:02",
    "text": "Thanks Courtney!\n\nWe ideally don't want to send them via marketing as they are not technically marketing emails, they contain important information which we don't want to get caught in spam and we want to have a clear record of the email history on the contact, which isn't the case for marketing as we can't see what version of the email was sent for auditing.\n\nI'll go back to the drawing board, and have a think if there is another way for us to do this potentially without using marketing emails."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2025-01-03 08:28:04",
    "text": "The transactional email add-on may be an option, but otherwise I'm not sure. Good luck and let us know if you find a way!"
  }
]