[
  {
    "poster": {
      "poster_name": "Andrew Dunbar",
      "poster_handle": "andrew127"
    },
    "time_stamp": "2025-01-22 05:03:44",
    "text": "Hello! Quick question for a client that uses HubSpot to send Marketing Emails. The majority of their recipients use outlook and when receiving the email, they receive EXTERNAL in front of our subject line and the email is flagged. The email sending domain used in the email has been verified through DMARC, DKIM and SPF. Is there any other way that we can have these emails not be marked as external and flagged?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-22 05:12:13"
      },
      {
        "time_stamp": "2025-01-22 05:16:50"
      },
      {
        "time_stamp": "2025-01-22 05:36:53"
      },
      {
        "time_stamp": "2025-01-22 05:51:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-22 05:12:13",
    "text": "No.\n\nThe behavior you are describing is entirely handled on the clients side. It’s a security measure managed by the recipients IT/mail administrators. DMARC, DKIM, and SPF aren’t relevant to this. They are simply flagging all emails that come from outside of their organization so that their users are aware and avoid replying with sensitive information.\n\nThe best you could do is reach out to each individual company and ask to have your emails be added to an allowlist that ignores their security measures. But unless your organization has some sort of deep contractual relationship with these recipients, no one is going to help you out."
  },
  {
    "poster": {
      "poster_name": "Andrew Dunbar",
      "poster_handle": "andrew127"
    },
    "time_stamp": "2025-01-22 05:16:50",
    "text": "<@U048C858Y94> Thank you for that insight! So the majority of the recipients are actual employees of their company. They just use HubSpot for a more robust builder for better looking emails along with metrics. So they are sending from a @abc.com to mainly @abc.com emails. So could I potentially have their IT department allow emails from HubSpot to not be external? Would this be done through gathering HubSpot's IP or how could I go about this?"
  },
  {
    "poster": {
      "poster_name": "James Kupczak",
      "poster_handle": "jimmykup"
    },
    "time_stamp": "2025-01-22 05:36:53",
    "text": "Oh, internal? That should be way easier then.\n\nYeah, I would provide a contact within their IT department with the details about HubSpot. The domain the emails are sent from as well as the IP address(es). It _should_ be easy for them to make an exception for your mail.\n\nThat said, if your mail uses HubSpot tracking links and HubSpot open tracking pixels, you might still get pushback because even though it’s from the company, it’s still a third party that you’d be sharing information with. Really depends on how strict their IT team is."
  },
  {
    "poster": {
      "poster_name": "Andrew Dunbar",
      "poster_handle": "andrew127"
    },
    "time_stamp": "2025-01-22 05:51:20",
    "text": "That makes sense, I really appreciate your help! Have a great day"
  }
]