[
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-04-19 12:09:22",
    "text": "Another DND email note for the product team: our marketing teams LOVE DND everything, but are also really in need of global groups within emails, specifically for footers. We have some clients with paragraphs long legal text in their email footers and need to be able to edit that text from a single place, and oftentimes their CANSPAM information is intertwined within that section, so even a custom module would not work in order to make the email compatible for sending."
  },
  {
    "poster": {
      "poster_name": "Ralph van den Broeck",
      "poster_handle": "ralph"
    },
    "time_stamp": "2021-04-19 15:04:27",
    "text": "An agency let us know that custom modules cannot work together in a template with the in-built HubSpot modules because the combination would cause render issues when the email is sent with the drag &amp; drop editor. They say that all modules including a simple text block need to be custom developed. I find this odd, what is the experience of the community?",
    "reply_count": 6,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2021-04-19 15:26:20"
      },
      {
        "time_stamp": "2021-04-19 15:28:03"
      },
      {
        "time_stamp": "2021-04-19 16:43:01"
      },
      {
        "time_stamp": "2021-04-19 19:23:28"
      },
      {
        "time_stamp": "2021-04-19 20:10:32"
      },
      {
        "time_stamp": "2021-04-19 20:12:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2021-04-19 15:26:20",
    "text": "I've been using a combination of default and custom modules in dnd emails with no issue. :thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Ralph van den Broeck",
      "poster_handle": "ralph"
    },
    "time_stamp": "2021-04-19 15:28:03",
    "edited": {
      "time_stamp": "2021-04-19 15:28:10"
    },
    "text": "That's what I thought! Thanks Alyssa"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-04-19 16:43:01",
    "text": "The issue is that you have no control over CSS in the head section, media queries or dark mode as Gmail will strip any CSS (not inline) in the body of the email."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-04-19 19:23:28",
    "text": "While there is no technical reason one can not use custom modules and default modules together in the DND email tool, there are limitations with custom modules in drag-and-drop emails. For example there is no way to include responsive CSS at either the module or template level. What you're probably running into is it's a nuanced answer to a simple question, and so the agency in question is defaulting to saying no.\n\nFor us, we recommend using the DND email tool for basic marketing emails: something you could build in MailChimp for example but with added HubSpot bonuses like personalization tokens and workflow automation triggers. However, if the layout is especially custom or relies on structured data from a blog or other HubSpot tool, we typically build a coded template instead."
  },
  {
    "poster": {
      "poster_name": "Ralph van den Broeck",
      "poster_handle": "ralph"
    },
    "time_stamp": "2021-04-19 20:10:32",
    "text": "That's very helpful, thanks <@U26BLKGE4> &amp; <@UJL4N3WN8>"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2021-04-19 20:12:49",
    "text": "I don’t know why HubSpot can’t simply allow you to populate a list of modules, then choose which modules you want to go in which order.\n\nThey could knock this up in a day. But they assume that people can’t code and it will break."
  }
]