[
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-03-22 09:57:38",
    "text": "I'm surprised no one has jumped on the Modules Marketplace yet with their own free modules :wink: Gotta make sure you're up there before they make the public announcement"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-03-22 09:58:05",
    "text": "Wouldn't be too difficult to stand out against all the orange (do I hear a blue background anyone?)"
  },
  {
    "poster": {
      "poster_name": "Michael Grubbs",
      "poster_handle": "mgrubbs"
    },
    "time_stamp": "2018-03-22 09:58:42",
    "text": "Haven't tried but is there the intention to allow for paid modules (same as with a page / template pack?) - will they be able to be included in packs as well ?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-22 10:01:38",
    "text": "My question is on the ability to use HubDb with the custom modules. I know you can't submit templates that make use of HubDB but it seems like things like event listing modules, and company directory modules would be awesome if you could tie it to HubDb (granted you can do listings with reapter fields if needed)."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-22 10:01:58",
    "text": "Did they release the module submission requirements yet?"
  },
  {
    "poster": {
      "poster_name": "Josh Ames",
      "poster_handle": "josh.ames"
    },
    "time_stamp": "2018-03-22 10:19:12",
    "text": "<@U2H3TT8F2> Seems like they should allow things powered by HubDB and then those customers who don't have access to HubDB should just either not see those items in the marketplace or maybe they are greyed out or something since they don't meet the requirements."
  },
  null
]