[
  {
    "text": "Hello HubSpot developers! I really need your help on this.\nDoes anyone know where I can find the files for the standard quote templates?\nIn the default-theme I cloned you only have the basic one, but I cant seem to find \"Standard: modern\". Anyone know where I should look for these? I am implementing some small changes, and hope I wont have to replicate the entire template to do so :confused: :pray:",
    "time_stamp": "2021-04-13 01:21:46",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-04-13 15:22:00"
      },
      {
        "time_stamp": "2021-04-13 15:22:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stian Strand",
      "poster_handle": "stian.strand"
    },
    "time_stamp": "2021-04-13 01:25:18",
    "text": "Hi Linda! In my experience, this should happen immediately. It may however seem like a delay sometime as catching prevents a fresh reload, depending on what the document is. I might be wrong.\n\nFor development, I would look in to <#CLJJXGTC0|local-development> if delay is an issue. Might make some processes easier for you :slightly_smiling_face: Hope this helped!"
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-04-13 11:37:19",
    "text": "Hey just doing a little research and wanting your guys feedback. \n\nWhat are the pros and cons of developing as website using the drag and drop editor against using the localised boilerplate? \n\nWhich in your option is the better way to create a website? "
  },
  {
    "poster": {
      "poster_name": "Ethan Kopit",
      "poster_handle": "ekopit"
    },
    "time_stamp": "2021-04-13 15:22:00",
    "text": "Hey <@U01SGRJT2MC> we’re actually going to be releasing a customizable version of that template (hopefully) this week"
  },
  {
    "poster": {
      "poster_name": "Ethan Kopit",
      "poster_handle": "ekopit"
    },
    "time_stamp": "2021-04-13 15:22:12",
    "text": "It will also be module-based which opens up lots of valuable new features"
  }
]