[
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 05:52:11",
    "text": "Hi all, I wanted to keep you posted on the actions we're taking on our side regarding this CTA issue. We've contacted `<mailto:easylist.subscription@gmail.com|easylist.subscription@gmail.com>` again which is the only email address I could find for EasyList, still no word. I've tried a couple replies on our forum thread with EasyList but they're being deleted by their forum admins because they consider them to be 'bumps' on the forum post which are against their rules."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 05:52:51",
    "text": "Separately, I was able to find contact information for the team at <http://eyeo.com|eyeo.com> who own Adblock Plus. I've asked them for advice on solutions and any other suggestions they have. We're hoping they can manually whitelist CTAs as a short term fix while we wait for EasyList to do something."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 05:54:48",
    "text": "We're continuing to try and find solutions on our end, we've identified some potential temporary workarounds for COS-hosted websites, but they're a little brittle and potentially risky so we're trying to find more long term, stable solutions. Thanks everyone for helping out in the github issues and forums so far, we appreciate it!"
  },
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2018-01-04 05:56:02",
    "text": "On my own, i’m triying to create a script detecting Adblock and replace CTA with a simple Link. Thanks <@U24DCSJBE>"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 07:47:51",
    "text": "If you find something that works, please do share <@U3TR96G84>, one of the brittle solutions we identified was similar to this idea so any additional examples you have are definitely helpful"
  },
  null,
  {
    "poster": {
      "poster_name": "Roberto pacheco",
      "poster_handle": "roberto"
    },
    "time_stamp": "2018-01-04 09:42:08",
    "text": "hi, im having this issue: im sending emails with the {{owner.meetings_link}} token and that works last month and now is just broken. Somebody know if something change there or is just my problem?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-01-04 10:38:11",
    "text": "Does anyone know who the PM at HubSpot is for the Shopify Bridge Connector thats in dev?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-01-04 10:40:23"
      },
      {
        "time_stamp": "2018-01-04 10:41:20"
      },
      {
        "time_stamp": "2018-01-04 10:42:10"
      },
      {
        "time_stamp": "2018-01-04 10:46:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-01-04 10:40:23",
    "text": "Hey AJ. I'm not the PMM on that, but I can likely help. Looking for something in particular?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-01-04 10:41:20",
    "text": "We have a client thats wanting to use shopify for their ecommerce and we wanted to try and get them into the limited beta. They are one of our top clients here that we do web dev for"
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-01-04 10:42:10",
    "text": "Got it. Just shoot me an email with the details and I'll connect you with the team. <mailto:jvocell@HubSpot.com|jvocell@HubSpot.com>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-01-04 10:46:50",
    "edited": {
      "time_stamp": "2018-01-04 10:46:55"
    },
    "text": "sent. Thanks Jeffrey"
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 10:56:17",
    "text": "we were doing the same as <@U3TR96G84> but it would take forever to roll something like that out so we are sitting tight for the most part. <@U24DCSJBE> something that might help is instead of posting the generic adblock like in the status message is using the 2 support links so people post on those and they get bumped naturally. The way to report false positives in ABP doesnt even exist for chrome users and I wonder if it does for firefox still"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 11:00:33",
    "text": "I think I'm misunderstanding, do you have an example of the support links you're referring to <@U25EHAP7G>?"
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 12:01:49",
    "text": "<@U24DCSJBE> the links they have at <http://status.HubSpot.com|status.HubSpot.com>"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 12:21:01",
    "text": "Gotcha, I know the ones in question, that was me that posted the update on <http://status.HubSpot.com|status.HubSpot.com>, I think I'm just missing something obvious, apologies <@U25EHAP7G>, but what do you mean by `the generic adblock like in the status message`?"
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 12:32:58",
    "text": "<@U24DCSJBE> so this article - <https://adblockplus.org/en/getting_started#false-positives> - i dont think its up to date. It's only for FF and in chrome I can't report anything. \n\nIf you read through this article - <https://help.getadblock.com/support/solutions/articles/6000067137> you eventually get what you need to report to the right spot but if you just posted the direct link to these two spots <http://forums.lanik.us/viewtopic.php?f=64&amp;t=39514&amp;sid=79913bee060d651e7204623df66db55d>\n<https://github.com/easylist/easylist/issues/817> \n\nand let people know comment here that may help escalate the issue. I don't know how willing people are to look through the article and try and figure out where to post a complaint."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 12:46:32",
    "text": "Understood, gotcha. The Firefox instructions are still active, at least from what I can tell, so they should still work. We're a little hesitant to send the cavalry directly to <http://forums.lanik.us> as we've already had several of our own messages and other customer messages deleted from the forum for violating their rules (they have really aggressive rules against 'bumping' posts). The situation we're in at the moment is a tricky one, since EasyList are a 3rd party, they have no affiliation with Adblock or Adblock Plus, they somewhat operate under their own set of rules, and report to nobody so our power over them is zero. By sending masses of customers directly to them we're worried that we'll dig ourselves into an even deeper hole, perhaps them even going as far as to block other HubSpot resources like Forms and Messages."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 12:50:38",
    "text": "We're coming at it from a slightly different angle right now, we recently tweeted directly at Adblock and Adblock Plus in an effort to have them take action on their site along the lines of what uBlock Origin did by whitelisting HubSpot CTAs."
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 13:33:43",
    "text": "got it totally understand thats for the update"
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 13:33:47",
    "text": "thanks"
  },
  {
    "poster": {
      "poster_name": "gwahhab",
      "poster_handle": "gwahhab"
    },
    "time_stamp": "2018-01-04 13:41:54",
    "text": "^ <@U24DCSJBE>"
  },
  {
    "poster": {
      "poster_name": "Jeff White",
      "poster_handle": "brightwhite"
    },
    "time_stamp": "2018-01-04 14:12:22",
    "text": "We used FF to report the incorrect blocking on a bunch of our client sites as well. Hopefully someone is listening. \n\nOn another note: is anyone at HubSpot working on a technical solution to replace this form of CTA model so that this kind of thing can’t ever happen again (even if EasyList does fix it, we can’t have our client sites being prone to this).",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-01-04 14:15:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-01-04 14:15:25",
    "text": "yes, would be awesome to have a server side/hubl powered CTA and forms that don't require javascript"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 14:43:23",
    "text": "We've been thinking about this for a long time, trying to identify best-case solutions that help protect against this type of issue. The current top runner for this will work well on COS-hosted web pages, that is to load all HubSpot assets on customer's websites through the customer's own domain name, meaning <http://js.hsforms.net/v2.js|js.hsforms.net/v2.js> would become something like <http://www.customerdomain.com/hsfjs/v2.js|www.customerdomain.com/hsfjs/v2.js>. That means everything becomes a first-party request on the page, much better overall"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-01-04 14:43:56",
    "text": "This doesn't really work for externally embedded assets though, so we're still designing solutions there. Any thoughts anyone has would be amazing."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-01-04 15:37:06",
    "text": "I think that's awesome <@U24DCSJBE>"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-01-04 15:37:49",
    "text": "one thing i noticed is that we have a custom/default domain set for the CTA's tracking links, I could see that also being on the same domain also no?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-01-05 04:09:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-01-04 20:01:31",
    "text": "I think just not having them blocked on your own website would be a great start!"
  },
  null
]