[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-09-13 06:15:33",
    "text": "you may need to add `|default(\"some value\")` to it. Try changing the module on the page and see if it outputs anything"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-09-13 06:31:20",
    "edited": {
      "time_stamp": "2021-09-13 06:43:16"
    },
    "text": "Unfortunately not, because I can’t even define `blog_recent_posts` here without it leaking the contents of `blog_recent_posts('default', 200)|tojson` all over the page because the json isn’t being escaped properly on HubSpot’s end, I believe."
  },
  {
    "poster": {
      "poster_name": "Jack Smith",
      "poster_handle": "jasmith"
    },
    "time_stamp": "2021-09-13 08:15:28",
    "text": "Could you maybe post here what it outputs when retrieving one recent post?"
  },
  {
    "poster": {
      "poster_name": "Arun Saldana",
      "poster_handle": "arunf.saldana"
    },
    "time_stamp": "2021-09-13 08:38:46",
    "text": "Hello, we are facing issue with the HubDB data.\n1. We have a table in HubDB and it has the Order field (number type) where user can update the field to show the record in a sorted order.\n2. Fetching the data in orderBy clause eg: - hubdb_table_rows('pricing_details',\"active=true&amp;orderBy=order\")\n3. When previewing the webpage any changes made in HubDB are getting reflected when page refreshes.\n4. But when the page is publish any changes made in HubDB are not getting reflected even page refreshes. Any update or new row added to HubDB doesn't appear on the page.\nAnyone faced such kind of issue and have the solution for it.\n\nThanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-09-15 11:26:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Steve Kanter",
      "poster_handle": "steve.kanter"
    },
    "time_stamp": "2021-09-13 10:01:57",
    "text": "does anybody know if it’s possible to execute a search on HUB using hubl only? I know there’s the `search_results.module` that HUB ships, but it basically uses AJAX to find the search results based on the URL. is it possible to do this with HUBL so that we don’t have to write a ton of JS to display our results and can re-use other HUBL components?"
  },
  {
    "poster": {
      "poster_name": "Brian H",
      "poster_handle": "brian617"
    },
    "time_stamp": "2021-09-13 14:30:30",
    "text": "I was able to get export_to_template_context to work with a custom module. I was confused partially because I did not realize that it removes the module from the front end. I reworked my modules and everything seems ok now. Thanks again"
  }
]