[
  {
    "poster": {
      "poster_name": "Caspar Green",
      "poster_handle": "cg"
    },
    "time_stamp": "2019-02-19 07:24:50",
    "text": "Hi all, I’m new to HS and have a couple questions regarding HS best practices:\n1) When starting from a pre-made template/theme — pulled in from the marketplace — and then customizing, are those templates, css/js files, modules, etc the sort of thing that will be updated and overwritten (and thus should be cloned and modifications made to the copy) or are they as-is, and can/should be modified directly?\n2) Does HS have some form of staging and version control? If I start messing with files and need to go back, is there a rollback function somewhere?\nPlease and thank you!",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-02-19 07:32:27"
      },
      {
        "time_stamp": "2019-02-19 07:50:28"
      },
      {
        "time_stamp": "2019-02-19 20:07:45"
      },
      {
        "time_stamp": "2019-02-19 20:08:25"
      },
      {
        "time_stamp": "2019-02-20 08:14:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-19 07:32:27",
    "text": "1. great question, I would clone them. but no. currently they do not auto update. HS plans to have a system like that eventually but doesn’t have it yet, The marketplace is still kinda in it’s infancy.\n2. they have content staging, it allows you to assign new templates, build out new pages update existing ones, without making them live. It’s not traditional Dev staging. Clone your file and work in content staging if you are planning to make changes that you don’t want to show up live just yet.\nAs far as rollback functionality all files in the design manager have a revision history and you can go through it by edit and see each change, as well as revert to past states of any file. I believe all the way back to the creation of the file. I have files I’ve that have like 30 pages of revisions and their dates go back to like 2013ish"
  },
  {
    "poster": {
      "poster_name": "Caspar Green",
      "poster_handle": "cg"
    },
    "time_stamp": "2019-02-19 07:50:28",
    "text": "Thank you!"
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2019-02-19 16:56:43",
    "text": "Hi! Was just wondering if you can all share how you organize your design manager files section (folders etc)? What can you suggest on organizing, especially for someone who isn't a web developer/designer? I know this was linked in the knowledge base area but was just thinking if it's more HubSpot centric. Thank you!",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-02-19 17:30:21"
      },
      {
        "time_stamp": "2019-02-19 19:14:12"
      },
      {
        "time_stamp": "2019-02-19 20:01:44"
      },
      {
        "time_stamp": "2019-02-19 20:12:18"
      },
      {
        "time_stamp": "2019-02-20 16:05:05"
      },
      {
        "time_stamp": "2019-02-21 07:06:42"
      },
      {
        "time_stamp": "2019-02-24 17:09:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-19 17:30:21",
    "edited": {
      "time_stamp": "2019-02-19 17:31:52"
    },
    "text": "This is the structure I use. I iterate a little bit on it every other project or so.  <https://spin.d.pr/bHni6t+>\nSorry about the pixelated out bits, had to redact some client related stuff"
  },
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2019-02-19 19:14:12",
    "text": "it's ok to redact client related stuff, thanks for this! btw, is this just your own account or are there several ppl also accessing this?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-19 20:01:44",
    "edited": {
      "time_stamp": "2019-02-19 20:03:03"
    },
    "text": "I’m generally the lead dev on all the HubSpot projects I do, there are 2 other devs that get in there and build modules, templates, coded files etc. and we all follow this same folder structure for the most part.\n\nWe aren’t crazy strict with the subfolders  because they don’t become that necessary until you start having a lot of files.\n\nThis is just the structure we’ve found works best for us, it’s kind of a hybrid of traditional front end dev and HubSpot’s DM1 forced folder structure enhanced"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-19 20:07:45",
    "edited": {
      "time_stamp": "2019-02-19 20:07:50"
    },
    "text": "Thanks Jon!\n\n<@UG240LYBX> - check this out :slightly_smiling_face: <https://knowledge.HubSpot.com/articles/kcs_article/cms-general/redesign-and-relaunch-your-site-with-content-staging>\n\nWe're actively exploring what a v2 staging environment might look like. Still really early, but the ball is rolling."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-19 20:08:25",
    "text": "and <https://knowledge.HubSpot.com/articles/kcs_article/cos-pages-editor/can-i-roll-back-the-changes-i-made-to-my-landing-page>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-19 20:12:18",
    "text": "Thanks Jon!\n\n<@UFCK510Q6> - You may also find these helpful...\n\nCheck out the \"How to Create a UI That Marketers Won’t F*Up\" video from last Developer Day: <https://designers.HubSpot.com/blog/developer-day-2018-videos>\n\nMy other suggestion ... set a standard naming convention and folder structure and get EVERYONE 100% on board and understanding of it.\n\nJust like any system, it can turn into a mess quickly if people don't organize. :stuck_out_tongue:"
  }
]