[
  {
    "poster": {
      "poster_name": "Karis",
      "poster_handle": "karis.hizon"
    },
    "time_stamp": "2019-02-03 16:21:00",
    "text": "hi guys, just wanna ask, what's the difference between using a landing page template and a website template? is it literally just a base template and has nothing to do with conversion? like in wordpress/squarespace or do i have to be careful in using those templates and only just use them for what it's actual purpose? like landing templates to landing page only etc? it is not possible for me to interchange the use of them?\n\nmy job is to actually make landing pages with the intent to increase conversion. but tbh, im not well informed in that area bc my general work before is just making websites base on client needs, conversion was the least of my problems. i have a limited idea on it but i'd rather get more info if that's okay to ask! :hugging_face:\n\nwould definitely love it if anyone could redirect me to any links, lessons or articles that involves conversion in HubSpot because right now my head is just going ???? everytime i think about it.\n\nthanks! :relaxed:",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-02-03 20:21:19"
      },
      {
        "time_stamp": "2019-02-03 20:26:27"
      },
      {
        "time_stamp": "2019-02-04 17:23:54"
      },
      {
        "time_stamp": "2019-02-04 17:26:22"
      },
      {
        "time_stamp": "2019-02-04 17:27:50"
      },
      {
        "time_stamp": "2019-02-04 20:08:27"
      },
      {
        "time_stamp": "2019-02-04 20:10:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-03 20:21:19",
    "text": "I think the best resource for you would be the inbound marketing course in HubSpot academy.\n\nIn short though to answer your question, at the technical level in HS the templates can be used interchangeably, most of the time though you don’t want to do that.\n\nA landing page typically doesn’t have a full header menu and footer menu. The page is designed around providing access to information in exchange for the person filling out a form. The goal being that once you have some information on the person you can determine what persona they fit into and then you can target your marketing to that person based on that persona."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-03 20:26:27",
    "text": "the difference is that a landing page uses science to encourage the person to fill out the form"
  }
]