[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-02-03 01:13:11",
    "edited": {
      "time_stamp": "2021-02-03 04:14:04"
    },
    "text": "I’ve created a multi-language blog with posts, I have a custom module on my homepage which pulls through 3 most recent posts.\n\nHow do I get the translated posts? Currently always show the English version no matter what language I select from the language toggle. Do I need to use content.translated_content? How does this work for posts?"
  },
  {
    "poster": {
      "poster_name": "Tom Mitchell",
      "poster_handle": "tom.mitchell"
    },
    "time_stamp": "2021-02-03 08:17:44",
    "edited": {
      "time_stamp": "2021-02-03 08:17:56"
    },
    "text": "Hi again <@UQWGKUEN7> - hope you don't mind me picking your brains again here but is there anyway of creating unique arrays that *can* be accessed separately after the loop has run?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-02-03 08:59:57",
    "text": "Hey Tom,\n\nI am not certain that there is a good way to go about doing this. Ive been playing with it a bit this morning and not finding any good solutions using just hubl. My initial thought was that you might be able to create a dict outisde of the for loop and add key value pairs with each iteration of the loop. However, the update function isnt as robust as it needs to be to make this happen."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-02-03 09:00:10",
    "text": "What are you looking to do with the separate arrays?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-02-03 09:00:35",
    "text": "You might be able to convert it into js arrays/objects and it might be easier to work with in using script?"
  },
  {
    "poster": {
      "poster_name": "Tom Mitchell",
      "poster_handle": "tom.mitchell"
    },
    "time_stamp": "2021-02-03 09:01:49",
    "text": "thanks BJ - so I'm looking to create a dropdown menu of 'branches', when a branch is selected then I'm looking to generate a chart (using ApexCharts) of the data that corresponds to that branch"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-02-03 09:08:13",
    "text": "oh - you should be able to do that using the original method we mentioned"
  },
  {
    "poster": {
      "poster_name": "Matthew Scheppmann",
      "poster_handle": "matthew360"
    },
    "time_stamp": "2021-02-03 22:12:06",
    "text": "For e*mail templates* is it possible to use crm_association() for custom objects?  I want to create a dynamic email that will display associated custom objects for that contact in a loop.  I just can't seem to get it working.  I have it working fine on a website page, however. Any insight?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-02-04 00:31:56"
      },
      {
        "time_stamp": "2021-02-04 02:21:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2021-02-04 00:31:56",
    "text": "I really need this option as well!"
  }
]