[
  {
    "text": "Hello everybody, my client is getting confused about the settings in the richtext area. For example is the font size for h1 in the theme set to 45px. When an h1 is edited in a richtext editor the font size is displayed at 32px. Is there any way to manipulate that?\nThank you for your help!",
    "time_stamp": "2022-06-17 03:37:16"
  },
  {
    "poster": {
      "poster_name": "Nadège",
      "poster_handle": "n.hotellier"
    },
    "time_stamp": "2022-06-17 05:39:28",
    "text": "Hello everyone,\n\nI have questions about a HubSpot form :\n• Can we have a field which options are filled dynamically on a HubSpot form while the user is filling the form?\n• Can we have a webhook on a field in HubSpot form while the user is filling it ?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-17 06:05:23"
      },
      {
        "time_stamp": "2022-06-17 06:16:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-06-17 06:05:23",
    "text": "You can auto fill fields with matching url parameters. Not sure about the webhook. Would that just send a request on change to capture data without for submission?"
  },
  {
    "poster": {
      "poster_name": "Nadège",
      "poster_handle": "n.hotellier"
    },
    "time_stamp": "2022-06-17 06:16:35",
    "text": "The idea is to be able to call an external API with a parameter (just filled on the form) and be able to return the result in a drop down dynamically for our operator before the form submission because we need the operator to select a value in the dynamic data returned. No sure this is possible"
  },
  {
    "poster": {
      "poster_name": "Renan Nogueira",
      "poster_handle": "renan.nogueira"
    },
    "time_stamp": "2022-06-17 11:13:24",
    "text": "How can I get all properties of the tickets api without specifying it? <https://legacydocs.HubSpot.com/docs/methods/tickets/get-all-tickets>"
  }
]