[
  {
    "poster": {
      "poster_name": "Teun Rutten",
      "poster_handle": "teun"
    },
    "time_stamp": "2022-06-21 01:04:05",
    "text": "<https://www.cloudflarestatus.com/|https://www.cloudflarestatus.com/>\n\nCloudflare is having issues"
  },
  {
    "poster": {
      "poster_name": "Rodrigo",
      "poster_handle": "rodrigo.castro"
    },
    "time_stamp": "2022-06-21 01:07:22",
    "text": "yep, it seems like it… HubSpot is down"
  },
  {
    "poster": {
      "poster_name": "Michael Niemeijer",
      "poster_handle": "michael915"
    },
    "time_stamp": "2022-06-21 01:08:28",
    "text": "yes, internal server error here also"
  },
  {
    "poster": {
      "poster_name": "Michael Niemeijer",
      "poster_handle": "michael915"
    },
    "time_stamp": "2022-06-21 01:12:36",
    "text": "oh! we’re back online again"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-06-21 11:30:41",
    "text": "For knowing when content in HubDB is published, we do not support any sort of webhooks to notify you/an API of the update, so you would need to poll the table over some sort of time interval. If the email send is daily, it could just be once per day.\n\nI think you can use the single send API <https://developers.HubSpot.com/docs/api/marketing/transactional-emails#single-send-api> to send emails via the API.\n\nKeeping track of who has gotten what email is a little tough, but if you only send the email once per day, send it to the contacts on the appropriate list, and if you never send it again, you will not send the same email twice.\n\nI think you would need to store which rows of the table the email has been sent out for. Perhaps this could be a boolean field of the table, and when your daily job checks for new content, it will look for rows that do not have the checkbox set to true.\n\nWould this help accomplish your goal?"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-06-21 11:35:11",
    "text": "I also wonder if you could somehow use a workflow to send the emails, where:\n1. The workflow runs every so often\n2. It checks if there are new HubDB rows\n3. If there is none, end the workflow \n4. If there is some, send an email. The email will send only rows that have not had the boolean tracking a send checked\n5. The workflow will then check the boolean so those rows do not get sent again?  "
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2022-06-21 13:11:49",
    "text": "Hey everyone! GDPR question... for the Cookies tab, I have the option to select a business unit and setup cookie options per BU. However, on the Consent Options tab, all of the text setup for default content has no option to specify per BU. I know these items can be changed at the page/form level, but what if I want two sets of default content where depending on the BU / domain of the page I'm building, it uses the appropriate default GDPR content?? Is that possible and I'm just not seeing it?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-08-17 07:19:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luis Lozano",
      "poster_handle": "luis287"
    },
    "time_stamp": "2022-06-21 18:08:06",
    "text": "Hello everyone, which channel would be the right one to ask about navigation? I want to create a new menu and add it to my template and giving to it custom styles.\nThanks"
  }
]