[
  {
    "poster": {
      "poster_name": "Jack Lyons",
      "poster_handle": "jack.lyons"
    },
    "time_stamp": "2022-06-09 08:04:34",
    "text": "Hi Everyone. I sorry If I've posted this in the wrong channel (been directed here by HubSpot support). Pretty much we have HubSpot integrated with our website via an API. So far all the contacts synced are coming through as from 'offline sources' and we want to change that. I've been told that both this article has the answer as I need to \"use the trackPageView or trackEvent JavaScript functions after the identify function to pass a hutk cookie to the new contact record\" however as I am not a developer by trade I am a little lost. I've tried to action it myself (after reading articles within the HubSpot forum) and wrote the following string of code:\n\n`&lt;script&gt;`\n `var _hsq = window._hsq = window._hsq || [];`\n`_hsq.push([\"identify\",{`\n    `email: getParameterByName(\"email\")`\n`}]);`\n  `_hsq.push(['setPath', '/box-selection/order']);`\n  `_hsq.push(['trackPageView']);`\n`&lt;/script&gt;`\n\nHowever, after running some tests, this doesn't seem to work. If anyone could let me know where I went wrong that would be amazing.\n\nThanks,",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-06-12 20:24:48"
      },
      {
        "time_stamp": "2022-06-13 02:02:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Max Slabyak",
      "poster_handle": "max.slabyak"
    },
    "time_stamp": "2022-06-09 08:46:25",
    "text": "<@U02NJACH5QS> thanks again for replying. Spoke with support, and that article is a tad outdated. Turns out the crawler is *`HubSpot Crawler` not `HubSpotContentSearcBot`*"
  },
  {
    "poster": {
      "poster_name": "Kevin Ordener",
      "poster_handle": "k.ordener.dev"
    },
    "time_stamp": "2022-06-09 12:36:32",
    "text": "Anyone else having issues with HubSpot servers? server site shows everything is good but we've been having a lot of bugs that point to issues on the server side of things..."
  },
  {
    "poster": {
      "poster_name": "Kamila Ribeiro de Moura",
      "poster_handle": "kamila"
    },
    "time_stamp": "2022-06-09 13:10:55",
    "text": "Hi guys, I'm having trouble adjusting the performance of HubSpot sites, could you tell me some content? Or even a kind of mentorship to better understand the HubSpot system."
  }
]