[
  {
    "poster": {
      "poster_name": "Jay Oram",
      "poster_handle": "jay.oram"
    },
    "time_stamp": "2022-03-28 09:37:09",
    "text": "Just chatting to clients and they would like to have the drag n drop capability for email. Looking through old threads it was mentioned Q1 2022 possibly - I am sure I have also seen a note it is likely 2023. But is there an official comment from HubSpot that I can share?\n\nPossibly an update to say it is on the roadmap but there isn't a timeline etc?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-03-28 09:44:54"
      },
      {
        "time_stamp": "2022-03-28 09:45:18"
      },
      {
        "time_stamp": "2022-03-28 12:54:08"
      },
      {
        "time_stamp": "2022-03-28 14:59:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-28 09:44:54",
    "text": "Hey Jay, drag-and-drop emails have been pretty reliable for at least a year now; I’ve built them in production for a while. The good news is marketers love them and they are really resilient in terms of cross-client compatibility. The bad news is the developer options are very limited, BUT this limitation also encourages simpler email designs which usually work better anyway."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-28 09:45:18",
    "text": "In terms of when the tool will be out of beta, I’m not sure honestly"
  },
  {
    "poster": {
      "poster_name": "Jay Oram",
      "poster_handle": "jay.oram"
    },
    "time_stamp": "2022-03-28 12:54:08",
    "text": "Apologies should have mentioned I was hoping to integrate custom coded templates with the drag n drop functionality and use the most up to date code if possible. When would that be available?"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2022-03-28 14:59:05",
    "edited": {
      "time_stamp": "2022-03-28 14:59:47"
    },
    "text": "If something is in beta can you at least share the features you’re hoping to run with? For example -\n\n• Create a master layout and use it to extend layout templates?\n• Restrict drag and drop blocks to certain layouts?\n• Identify the blocks that can be dragged into the template?\n• Remove all the cruft code that is created in most drag and drop template editors at the point of send?"
  }
]