[
  {
    "poster": {
      "poster_name": "Stef Dijkstra",
      "poster_handle": "stef.d"
    },
    "time_stamp": "2023-12-20 08:28:47",
    "text": "Hello everyone, our company wants to offer the HubSpot CMS development service. We have a number of (front-end) developers and we would like to hire someone to give us training in HubSpot development. This must be done at very short notice, the job will of course be paid for.\n\nWe are in operation in Nederland Borne, we would like to receive someone on location for the first weeks of January.\n\nDo you know someone or are you that person, would you like to contact me? Thank you in advance!",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-24 15:18:03"
      },
      {
        "time_stamp": "2024-01-03 10:18:54"
      },
      {
        "time_stamp": "2024-01-03 10:19:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Stenquist",
      "poster_handle": "mark226"
    },
    "time_stamp": "2023-12-20 09:08:41",
    "text": "Hello everyone. I’m looking for a Senior Frontend Engineer for a 1.5 month contract. The candidate should  have expertise in HubSpot CMS to help with a website redesign project that is currently underway. Ideally the candidate would have a great eye for design and the ability to implement pixel-perfect styles based on high-fidelity Figma designs. If you have experience and are interested in working with a small digital agency, I’d love to connect.",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2023-12-20 09:11:49"
      },
      {
        "time_stamp": "2023-12-20 09:33:34"
      },
      {
        "time_stamp": "2023-12-21 23:48:18"
      },
      {
        "time_stamp": "2023-12-31 12:23:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Marcelo Eduardo Da Ros Arana",
      "poster_handle": "marcelodaros94"
    },
    "time_stamp": "2023-12-20 09:11:49",
    "text": "sent you DM :)"
  },
  {
    "poster": {
      "poster_name": "Eduards",
      "poster_handle": "eduard"
    },
    "time_stamp": "2023-12-20 09:33:34",
    "text": "<@U0664FCA4LS> I can recommend <@UPDDTPW3H>. He has helped us with 2 projects so far. He responded quickly to the assigned tasks and respected our deadlines.  I'm not sure if he is currently available, but make sure to write to him privately."
  }
]