[
  {
    "poster": {
      "poster_name": "Jason Connery",
      "poster_handle": "jason.connery"
    },
    "time_stamp": "2025-02-24 05:47:26",
    "text": "There's not a specific react native sdk currently. Perhaps if react native can integrate with normal iOS / Android code or SDKs, integration can happen that way? I've not yet heard of anyone doing it yet however."
  },
  {
    "poster": {
      "poster_name": "Joao Pegoraro",
      "poster_handle": "joao.pegoraro"
    },
    "time_stamp": "2025-02-24 07:11:51",
    "text": "We use Flutter for our mobile and web apps, and being able to build the chat widget using Flutter natively, built to our design standards would be nice. Also being able to integrate our own AI model with custom system prompts instead of HubSpot Breeze would be nice as well."
  },
  {
    "poster": {
      "poster_name": "George Kemp",
      "poster_handle": "gkemp"
    },
    "time_stamp": "2025-02-24 07:47:23",
    "text": "Got it, so nothing really missing, you'd just prefer to build it closer to your designs?\n\nAs for the custom AI model, I am aware of people using the Bots feature and the code snippet/webhook modules to hook into their own AI model. That might be an option to solve for that particular ask."
  },
  {
    "poster": {
      "poster_name": "George Kemp",
      "poster_handle": "gkemp"
    },
    "time_stamp": "2025-02-24 07:47:47",
    "text": "CC: <@U06GS7BG27J> for both Flutter support &amp; additional customization features."
  },
  {
    "poster": {
      "poster_name": "Eric Song",
      "poster_handle": "esong"
    },
    "time_stamp": "2025-02-24 07:51:45",
    "text": "Thanks for the feedback, Joao! As George mentioned, it's currently not possible to interact directly with the Chat API, but we'll keep your feedback in mind as we continue to improve the SDK."
  },
  {
    "poster": {
      "poster_name": "Joao Pegoraro",
      "poster_handle": "joao.pegoraro"
    },
    "time_stamp": "2025-02-24 10:39:25",
    "text": "Thanks! In the meantime we hacked together a solutions that works fine with the SDK and our codebase. really nice job you guys have done with it, it works great! One more realistic feedback: It would be nice if we had the ability to open the chat with a initial message. For example, when an error happens in our app, a popup appears with an error code. It would be great if there were a mechanism that allowed us to open the chat with customer support, with an initial message containing the error code, so we could make the error code a button that when clicked, automatically opens the customer support chat with it to streamline the process."
  },
  {
    "poster": {
      "poster_name": "Eric Song",
      "poster_handle": "esong"
    },
    "time_stamp": "2025-02-24 10:45:16",
    "text": "That's a great idea! It also aligns with the investments we're planning to make in the chat widget's proactive support capabilities this year. We'll keep your feedback in mind and reach out if we have any updates. :+1:"
  }
]