[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-09 07:01:37",
    "text": "<@U012TAH79BQ>  if you look at the layout base.html file in the boilerplate you will see them do exactly what I referenced above. They are just setting that variable at the template level but are using it on the layout level. "
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 07:10:50",
    "text": "Oh! Thanks a bunch!"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 08:12:22",
    "text": "Did you get it to work in a section template? It gets tricky because that template is called inside the body block of the page template"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 08:25:14",
    "edited": {
      "time_stamp": "2021-08-09 08:25:24"
    },
    "text": "For now I just included all my sections stylesheet in main.css to make sure they're styled correctly wherever those sections are used and because I have to deliver quickly, but I'm still looking for a way to set the stylesheet at the section template level!"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-09 09:15:51",
    "text": "You can requrie a stylesheet from anywhere that allows hubl if you just use `{{ require_css(get_asset_url(path/to/file) }}` The docs are always helpful for this kind of stuff. I also have just started a blog not too long ago with some helpful tips and tricks for new and advanced HubSpot devs: <https://www.devbeej.com>"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 10:22:22",
    "text": "What I'm saying is `{{ require_css(get_asset_url(path/to/file) }}` doesn't seem to work from a section template. I've checked by taking my require css line and putting it in the page template that uses the section. When its directly in the page template, the stylesheet is fetched, when its in the section template, its not. If you'd like we could get in a call to get to the bottom of this?"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 10:26:06",
    "text": "maybe its because the hubl ends up inside the dnd area tag?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-09 11:25:12",
    "text": "Why does it need to be in a dnd area?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-09 11:27:08",
    "text": "Oh are you using the new coded dnd section partials? I haven’t had much time to play with them. But if you’re using them just stick it at the top of the partial instead of in the actual dnd area. "
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-09 12:11:19",
    "text": "Yeah, you have your dnd area in a page template and inside that dnd area you the include dnd partial template. So in the dnd partial section template, you're always within the dnd_area."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-09 12:33:07",
    "text": "I guess I am a bit confused as to how you have your theme configured. If youre just building a template and following how the themes are configured via the biolerplate you should have a base.html file that hosts your body templates. In that body template you can include the require_css pretty much anywhere. I would include it at the top of your file so that it’s easy to find. I would not include it in the dnd_area."
  }
]