[
  {
    "text": "So HubSpot just changed the way I do new landing pages this morning and it will no longer find templates I've built even though they are still in files. I also clicked into other files at the bottom of the page and toggled through to where those templates would be alphabetically and it's not showing them.\nAnyone know what gives?",
    "time_stamp": "2021-08-04 08:25:28",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-08-04 08:45:51"
      },
      {
        "time_stamp": "2021-08-04 09:18:49"
      },
      {
        "time_stamp": "2021-08-04 09:44:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-08-04 08:45:51",
    "text": "Hey Daniel, my guess on this would be that the template is not set to be able to be used for new content. I would check the <https://developers.HubSpot.com/docs/cms/building-blocks/templates/html-hubl-templates#template-annotations|template annotation> for this line:\n```isAvailableForNewContent: false```\nand if it is false, set it to `true`"
  },
  {
    "poster": {
      "poster_name": "Daniel Babcock",
      "poster_handle": "babcock.daniel.b"
    },
    "time_stamp": "2021-08-04 09:18:49",
    "text": "Ours are set to true. With the UI change that was just made most of your templates are no longer available for search. You have to paginate through them manually and in my companies case there are hundreds of them. It is made worse by the fact that they are not displayed in a completely alphabetical way either so it's easy to bypass what you are looking for as you manually click the paginate button.\nJust got off the phone with customer service and the guy was like \"oh I see, yeah this bad\" lol.\n<tel:18884827768|1(888)482-7768> x3 if anyone else want to complain about it."
  },
  {
    "poster": {
      "poster_name": "Daniel Babcock",
      "poster_handle": "babcock.daniel.b"
    },
    "time_stamp": "2021-08-04 09:44:10",
    "text": "If anyone else is struggling with this Victoria Elliot just reverted our account for us so templates can be found in seconds again instead of minutes!\n It seems Product skimped on UX with this update."
  }
]