[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2021-08-10 03:33:52",
    "text": "You could wrap the {% if request....%} and the corresponding {% endif %} in a extra if-statement and let your marketers/editors toggle it on/off. This should give your editors the possibility to edit the private content.\nSo while creating the page this toggle is \"off\" and switch it to \"on\" before publishing the page"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 07:45:26",
    "text": "I'mm following the boilerplate, that was my starting point. The way sections work(generally and in the boilerplate), is that there included inline within a dnd area. Also, section templates don't follow base.html(they're not a full page template). They're just a chunk that will go inside a dnd area. Meaning that in a section template file, you can't (to my knowledge), attach a css file(since hubl functions can't be inside a dnd area)."
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 07:47:45",
    "text": "I agree that the require css should go a the top, outside of the dnd area. And that means we don't have a way of attaching a stylesheet to a specific section template."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-10 08:19:08",
    "text": "Correct - Not entirely sure why you would need to attach a stylesheet to the  reusable section anyway. The section’s are supposed to be customizable and composed entirely of modules. Modules should have their own styles that travel with them based off of the module.css file. What is your use case for needing to attach a whole stylesheet to a particular reusable section?"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 08:39:07",
    "edited": {
      "time_stamp": "2021-08-10 08:42:35"
    },
    "text": "Styling background in ways that the default ways don't allow  (i.e. image + gradient overlay, more complex gradients, responsive svg background), overwriting all content text color by default (i.e. white text on everything)"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 08:41:42",
    "text": "Of course I can add those rules to main.css to make sure wherever that section is, the style comes with it(that's what I'm doing rn), but it would more efficient to load the stylesheet only if necessary"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-10 08:44:33",
    "text": "It sounds like the CSS associated with that would be pretty nominal and could likely just be included in main.css esp. when minified. And honestly if its only a few lines of code it’s likely more efficient this way. Require_css would would load an additional stylesheet which would eat up more resources on page load as oppose to it just being included from the get go."
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 08:48:30",
    "edited": {
      "time_stamp": "2021-08-10 08:48:59"
    },
    "text": "That's true, it's only an issue if you have a lot and you're loading it all through main.css when you don't need it"
  },
  {
    "poster": {
      "poster_name": "pChausseC",
      "poster_handle": "pccossio"
    },
    "time_stamp": "2021-08-10 08:52:40",
    "text": "Thanks a lot for getting into this with me <@UQWGKUEN7>! Hopefully I can help you in return sometime:)"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-08-10 09:10:26",
    "text": "For sure! Best of luck with your project!"
  },
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-08-10 12:38:38",
    "text": "Ended up doing this\n```{%if request_contact.is_logged_in or 'HubSpotpreview' in request.domain }%```"
  }
]