[
  {
    "poster": {
      "poster_name": "Davor Kirbiš",
      "poster_handle": "davor.kirbis"
    },
    "time_stamp": "2022-11-28 02:32:10",
    "text": "Does HubSpot have any icons integrated already? I noticed that if I type {% icon name=\"facebook\" %} if you copy any of the fontawesome icon name into those brackets, you geta a generated icon. I didn't link fontawesome icons in my HubSpot before",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-11-28 12:47:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Davor Kirbiš",
      "poster_handle": "davor.kirbis"
    },
    "time_stamp": "2022-11-28 02:38:16",
    "text": "You probably solved this on your own already, but if you are reusing HubSpots modules, you cannot rename the module. You have to keep the original name like \"rich_text\", it does allow you to change the \"label\" of the module, but not the first name after {% module ..."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-11-28 12:47:20",
    "text": "The <https://developers.HubSpot.com/docs/cms/hubl/tags#icon|documentation for the Icon Tag> says that it supports icons from FontAwesome 5.0.10 and 5.14.0. My understanding is that it works similarly to the automated inclusion of Google Fonts resources — if you use the functionality on a particular page, it’ll inject the relevant resources into your page head."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-11-28 14:32:10",
    "text": "Out of curiosity, how do you all prefer to handle default images in custom modules which use an image field? None of the solutions I’ve ever come up with have felt quite satisfactory.\n\nDo you include conditional styling for blank source attributes? Do you hotlink to a default image file at a source which you control? Am I missing some workaround for the “absolute URLs only” restriction on the src property that lets you point at an image you’ve included in the theme files?",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-11-29 00:57:28"
      },
      {
        "time_stamp": "2022-11-29 03:17:31"
      },
      {
        "time_stamp": "2022-11-29 09:00:36"
      },
      {
        "time_stamp": "2022-11-29 11:02:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2022-11-29 00:57:28",
    "edited": {
      "time_stamp": "2022-11-29 02:14:51"
    },
    "text": "What keeps you from just uploading a default image in the File manager in a folder like e,g. “website-default-do-not-delete”.\n\nOr checking if image_field.src is empty and if so hardcode the url to the default image to be used in the module from your theme folder?"
  }
]