[
  {
    "poster": {
      "poster_name": "Laurijn Deschepper",
      "poster_handle": "laurijn"
    },
    "time_stamp": "2023-08-02 05:58:28",
    "text": "_not an instance of HTMLInputElement_\n\nThis error means that you are trying to acces a property of a HTML INPUT FIELD on a HTML element that is not a html input field.\n\nMaybe you can try and console.log the variable where you are trying to access the field property on. Make sure that variable is of the html type input field."
  },
  {
    "poster": {
      "poster_name": "Catalin Setraru",
      "poster_handle": "catalin"
    },
    "time_stamp": "2023-08-02 05:59:38",
    "text": "<@U059YQX4CP2> it is input already, it can be console logged and it returns an input. this is why it's so hard to understand what's happening"
  },
  {
    "poster": {
      "poster_name": "Catalin Setraru",
      "poster_handle": "catalin"
    },
    "time_stamp": "2023-08-02 06:00:16",
    "text": "<@U036TUPVAV8> thanks, I'll try this and let you know here in the chat"
  },
  {
    "poster": {
      "poster_name": "Manuel Ramirez",
      "poster_handle": "manuel.ramirez"
    },
    "time_stamp": "2023-08-02 11:34:13",
    "text": "Tried but didn't work, ended up just working with an embed form. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-02 20:11:22",
    "text": "If your users are all existing, cookied contacts, you should be able to use that to pre-fill (and potentially hide) a form with an email field when the user lands on the page.\n\nIf they’re not contacts/not cookied, you can pre-fill form values using form input IDs as URL properties. For example, the URL `<https://example.com/form_test?form_field_name=fooBar>` would auto-fill a form field with the ID `form_field_name` with a value of `fooBar`. One caveat to this: according to the official documentation, this _*should*_ only work if the form pre-fill values are your *only* URL properties. I haven’t found this to be true in testing, but the official guidance is that things like UTM parameters may cause this to fail.\n\nAssuming you can’t find a way to use the standard unsubscribe link, you could create a page with a form and some JS that automatically fires the submit action if it detects that the email field has been pre-filled by either of the above means."
  }
]