[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2022-04-25 02:31:47",
    "edited": {
      "time_stamp": "2022-04-25 02:35:42"
    },
    "text": "I can confidently say you can go over +90.\nBut it won't be easy (specially if you are not building from scratch and just want to optimize a published website), and you will have to limit yourself on functionalities too like: too many CTAs, forms, smart content rules (on the same page), excesive amount of JavaScript and images, etc."
  },
  {
    "poster": {
      "poster_name": "Carel schrier",
      "poster_handle": "carel"
    },
    "time_stamp": "2022-04-25 05:38:06",
    "text": "We did build our template from scratch (<http://www.addmark.nl|www.addmark.nl>) but are not getting the 90+. I think it has to do with the CTA buttons etc."
  },
  {
    "poster": {
      "poster_name": "Carel schrier",
      "poster_handle": "carel"
    },
    "time_stamp": "2022-04-25 05:40:23",
    "text": "But besides that, I am not quite sure were to improve"
  },
  {
    "text": "Hi all, I have a question. Do you know if it’s possible to change the location of the HubSpot chat symbol/widget other than ‘left’ and ‘right’ in the HubSpot environment or to make the iframe smaller in size? The chat symbol is in front of a button in our app that now cannot be clicked. Any idea’s / suggestions?",
    "time_stamp": "2022-04-25 05:41:16",
    "edited": {
      "time_stamp": "2022-04-25 05:41:29"
    }
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2022-04-25 06:51:01",
    "text": "Well, CLS has nothing to do with HubSpot server really. A 5.1s on Time to Interactive seems a huge hit also.\nDropping some common things:\n• Defer/async your JS (non priority wich is likely to be 99% of it). \n• Avoid if you can jQuery, or at leats find a cropped version of it with the only things you are actually using on your website (instead of the defualt from HubSpot).\n• Double check your images sizes and format (use SVG &amp; webP mostly).\n• Lazy load all your images below the fold.\n• Priorize your CSS for mobile"
  },
  {
    "poster": {
      "poster_name": "Vincent Gauthier",
      "poster_handle": "vincent.gauthier"
    },
    "time_stamp": "2022-04-25 16:32:06",
    "edited": {
      "time_stamp": "2022-04-25 16:33:00"
    },
    "text": "If anyone uses workflows to send NPS ratings to a webhook url, i solved my issue. I added a 15 minute delay between receiving the NPS rating and sending it to my webhook. It seems NPS ratings in particular get parsed by HubSpot and dont appear right away."
  }
]