[
  {
    "poster": {
      "poster_name": "Babak Heydari",
      "poster_handle": "babak.h"
    },
    "time_stamp": "2022-04-05 04:07:53",
    "text": "Hi everyone, I fairly new to HubSpot and have been trying to figure out how to integrate Stripe costomer/data with existing HubSpot contact and associate deals (monthly recurring subscriptions) with them.\n\nHowever I haven't found a way yet. I can create deals in HubSpot from New Plans in Stripe. I also can update contacts from lead to customer, both with the aid of Zapier.\n\nHowever, I can't link the both together so that when ever an existing trial user upgrades to an plan, HubSpot creates a deal and associates that lead with the corresponding contact. I want to achieve this so that in HubSpot/Ads, I'll have an overview of how many deals and revenue I had in a specific timeframe and to understand from which campaign these deals came from.\n\nI can do all this individually and or manually, but I wanted to know if there's a way to automize the whole process. Thank a lot!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-04-05 05:24:02"
      },
      {
        "time_stamp": "2022-04-05 05:31:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Denis Lunev",
      "poster_handle": "denis636"
    },
    "time_stamp": "2022-04-05 05:24:02",
    "text": "Hey <@U03A4BZAE5R> with DepositFix you can connect deals and contacts based on subscription automatically <https://www.depositfix.com/lesson/creating-deals-automatically>"
  },
  {
    "poster": {
      "poster_name": "Babak Heydari",
      "poster_handle": "babak.h"
    },
    "time_stamp": "2022-04-05 05:31:41",
    "text": "Hi Denis, thanks for the link! I'll check it out"
  },
  {
    "poster": {
      "poster_name": "Gabriel Ferrazoli",
      "poster_handle": "gferrazoli"
    },
    "time_stamp": "2022-04-05 06:24:53",
    "text": "Hi guys, I want to consult an external API in order to autocomplete some form camps when creating a new company, any clues how I might be able to do that?\nThe solution I've came up with is coding an external microservice and updating those values after the company is created.\nThanks in advance!"
  }
]