[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-10 06:30:53",
    "text": "What I do, and I haven’t read if this is technically correct\n\nWhen it’s a date range and the time being visually displayed is not a duration, I don’t use the duration form of datetime, I put both the start and end date in separate time elements"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-10 06:32:02",
    "edited": {
      "time_stamp": "2019-07-10 06:37:23"
    },
    "text": "because to me that would properly convey the information, if you only give it a duration, it doesn’t understand the relationship between the two dates, it simply reads it as “This event is 3 days” vs “this starts on Jan 21st and ends on the 24th” which conveys a lot more information"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-10 06:34:39",
    "edited": {
      "time_stamp": "2019-07-10 06:34:51"
    },
    "text": "just looked it up on stack overflow, the consensus is what I said however there appears to be some proposals to add more allowed formats which would allow ranges using a `/` between the dates in the same time element"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-10 07:53:48",
    "text": "Yea we typically have done the same for this using two time elements, I just wasnt sure if someone else may have done it another way or not. The time element isnt really adopted enough (looking at you IE) but hopefully when IE dies its sudden but inevitable death, we can finally all be aligned lol"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-10 07:54:33",
    "text": "agreed"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-07-10 08:00:54",
    "text": "I kinda wonder too, what screen readers are treating time different. I often test with the Mac OS voiceover, and have some other accessibility tools that visually display that time info different but never actually heard a tool voice them other than verbatim what you can read on the screen. That said still super useful for SEO"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-10 08:03:45",
    "text": "Yea, when we did it, i believe we added aria labels to them"
  },
  {
    "text": "Yea, we did this for events.",
    "time_stamp": "2019-07-10 08:06:30"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-07-10 08:07:42",
    "text": "Ill probably follow that suit change up the labels for when its multiple days"
  }
]