[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-09-14 04:37:59",
    "text": "That's the only place you can't insert custom modules rn "
  },
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2022-09-14 07:54:48",
    "text": "Got it, thank you."
  },
  {
    "poster": {
      "poster_name": "Dewayne Higgs",
      "poster_handle": "dewayne"
    },
    "time_stamp": "2022-09-14 11:50:14",
    "text": "I think it would be great if there was a way to execute GraphQL queries in a more dynamic fashion in HubL. Maybe something like how crm_objects() and related functions operate.  We could call it crm_graphql() and pass in two arguments: the first one being the actual graph and the second one being an object that contains your parameters for your graph."
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-09-14 12:07:06",
    "text": "*More control over blog comments, please.* Currently, only this is possible:\n```{% blog_comments \"blog_comments\" limit=10000 %}```\nImagination some object functions. And to have a vote and a like feature. Also some list and sorting options. And the ability for custom markup code...",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-14 12:07:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2022-09-14 12:07:34",
    "text": "...You could build your own Micro-Community Forum and Real FAQ, with some help from Workflow APIs, where your Users can submit questions that create blog pages. And a way to manage answers from the comments. Welcome social media - even if most companies can't handle it. Because social media means more than to post some new campaigns, advertisements or news. There are still some companies how benefit from it and appreciate social media as a way to interact with the community, to build feedback loops and keep conversation going with a personal and reliable company contact point. HubSpot itself set a good leading, and they provide a lot of features, so why not just a little bit more access to the comments. And an integrated way to implement like and vote feature for comments as well as blog-posts."
  }
]