[
  {
    "poster": {
      "poster_name": "Dan Stillgoe",
      "poster_handle": "dan126"
    },
    "time_stamp": "2020-06-03 01:55:10",
    "text": "Hey Will, yes I am indeed"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2020-06-03 07:25:19",
    "text": "So the error you are getting is indicating that your key does not have permission to update secrets (which require selecting the \"Serverless Functions\" permission when you are generating your key), however, I think the core issue might be the account does not have access to serverless functions."
  },
  {
    "poster": {
      "poster_name": "Mark F",
      "poster_handle": "mark956"
    },
    "time_stamp": "2020-06-03 10:36:37",
    "text": "Apologies if this has been covered previously or is the wrong channel to post in, but I'm investigating the use of visual regression tools like <http://percy.io|percy.io> for the use of our marketing websites built using HubSpot CMS, and was curious how, if even possible, we could run a local dev server / export to static site so we can run a visual diff tool and compare it to what's on production?",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-06-03 10:38:20"
      },
      {
        "time_stamp": "2020-06-03 10:39:40"
      },
      {
        "time_stamp": "2020-06-03 11:07:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark F",
      "poster_handle": "mark956"
    },
    "time_stamp": "2020-06-03 10:38:20",
    "text": "We currently make use of the local development flow and GitHub Actions to `hs upload` the files when we merge PR's, but less clear to me how we could do visual diff tests while the PR is open without clobbering the sandbox account we already use for local development"
  },
  {
    "poster": {
      "poster_name": "Mark F",
      "poster_handle": "mark956"
    },
    "time_stamp": "2020-06-03 10:39:40",
    "text": "Theoretically, this problem can be solved if we could do something like `hs server` or `hs export` to generate a static site or a local dev server that renders our HubL template and modules without having to upload to HubSpot"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-06-03 11:07:31",
    "text": "fwiw, this problem is not specific to visual regression tools right. i'm already encountering local dev flow issues with multiple engineers relying on the same sandbox account to be able to have any visual feedback of their local HubL templates and modules, and clobbering each other's work during local dev. are there any recommended solutions/patterns to work around this?"
  }
]