[
  {
    "poster": {
      "poster_name": "James Marriott",
      "poster_handle": "james442"
    },
    "time_stamp": "2023-04-25 02:47:57",
    "text": "I don’t know the answer but I’m just about to tackle this exact task so curious if you figured it out?"
  },
  {
    "poster": {
      "poster_name": "Rimmert Zelle",
      "poster_handle": "rimmert"
    },
    "time_stamp": "2023-04-25 09:00:33",
    "text": "Hi all! I am quite new to HubSpot development. I love to work with TailwindCSS (I know it is opinionated :-)) and managed to create a TailwindCSS/HubSpot setup that is workable for me. Moreover, I am trying to get a better control on the rendered outcomes of the default modules of HubSpot. I really would like to add Tailwind classes instead of the default classes (I believe it is bootstrap 2) and maybe delete a view divs. Is there a way to change rendered outcomes? Or is this a direction I should not pursuit. Thank you for your reply.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-25 09:06:27"
      },
      {
        "time_stamp": "2023-04-25 23:37:23"
      },
      {
        "time_stamp": "2023-04-25 23:59:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-04-25 09:06:27",
    "text": "<@U04TVGPUULA> can you specify a little more in detail what it is that you want to achieve? Which default classes are you referring to?"
  },
  {
    "poster": {
      "poster_name": "Kyle Combs",
      "poster_handle": "kyle477"
    },
    "time_stamp": "2023-04-25 13:00:22",
    "edited": {
      "time_stamp": "2023-04-25 13:02:24"
    },
    "text": "Howdy all, so i've figured out now to clone all my modules etc from my production account into my developer account with the CLI, but none of my website pages are there.  Is there a way to stage pages from my production account into my developer account or do i just have to rebuild them from scratch in the developer account?  My employer wants me to restage our entire site after reducing the size of all modules by 10%, so I'm looking for an easy way to stage all of our current pages and be able to modify the modules in my developer account and stage there before we republish the entire site with different sizes.  I just can't modify the CSS on all the modules in the production account as they are still be used in deployment."
  },
  {
    "poster": {
      "poster_name": "Rimmert Zelle",
      "poster_handle": "rimmert"
    },
    "time_stamp": "2023-04-25 23:37:23",
    "text": "Yes of course! For example The dnd_area (<https://developers.HubSpot.com/docs/cms/hubl/tags/dnd-areas>) has its hubl/html syntax you can use. And it will be rendered to an HTML structure (see link). I would like to change the classes used in the rendered output and maybe tweak the structure a bit."
  },
  {
    "poster": {
      "poster_name": "Rimmert Zelle",
      "poster_handle": "rimmert"
    },
    "time_stamp": "2023-04-25 23:59:18",
    "text": "I understand that I have some control over the HTML via Modules. However, especially dnd_area, dnd_section, dnd_row, dnd_module and dnd_column are very important for the structure of your site, when using modules. And I would like to have more control over the HTML it renders to."
  }
]