[
  {
    "poster": {
      "poster_name": "Maia Torell",
      "poster_handle": "maiatorell123"
    },
    "time_stamp": "2022-07-18 01:14:04",
    "text": "Hello! I'm working with a copy of POWER theme and stuggle with the module called \"SUB IMAGE BOXES\" ..When hovering on the card only parts of the card is clickable, is there a way to make the whole card clickable? I've been trying to mess around with the code but can't fint the solution and are to scared that I will mess something up :sweat_smile: anyone have experience with this theme?"
  },
  {
    "text": "We have blog/vacancy cards with some additional information about the vacancy inside the card (Location, type of contract etc). Where do we set this information? I know hubdb would be the best for this, but the client is not on that plan (marketing professional). Is there any other way of doing this? Maybe just tags?",
    "time_stamp": "2022-07-18 03:20:45",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-18 08:31:21"
      },
      {
        "time_stamp": "2022-07-18 08:45:46"
      },
      {
        "time_stamp": "2022-07-18 08:48:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 08:31:21",
    "text": "<@U03ABR41A3H> You can inline text fields into the blog post for this info\n\n```{% text 'role' label=\"Role\" value=\"\" export_to_template_context=True %}\n\n{# access #}\n{{ widget_data.role.value }}```"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-07-18 08:45:46",
    "text": "Thats sweet. Thanks! These values would also be the filter options, do you think I could use these as well for that?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 08:48:17",
    "text": "As in the user can filter for jobs in Amsterdam on the frontend and it will filter them out? For sure — this is likely going to be JS based. So you would just add the value wherever you need it. So likely  a `data-location=\"{{widget_data.location.value}}\"` attribute on the card element. Or classname or however youre doing it."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 08:53:26",
    "edited": {
      "time_stamp": "2022-07-18 08:53:39"
    },
    "text": "Hey Bogdan,\n\nWhat does the meta.json file look like locally?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 08:54:35",
    "text": "When you create it from the CLI it typically defaults the `is_availaible_for_new_content:false` which will make it not show up on the page builders."
  },
  {
    "text": "Hi, *BJ Szyjakowski*\nNo, unfortunately, is set to “true”.\nI know about the param.",
    "time_stamp": "2022-07-18 08:58:36"
  },
  {
    "poster": {
      "poster_name": "Bogdan",
      "poster_handle": "maslyb.tf"
    },
    "time_stamp": "2022-07-18 08:59:00",
    "text": "But, I can create a new module from Panel and I can see the same issue."
  },
  {
    "poster": {
      "poster_name": "Bogdan",
      "poster_handle": "maslyb.tf"
    },
    "time_stamp": "2022-07-18 08:59:49",
    "text": "So I can’t create modules, but I did different modules for first page of my custom theme."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 09:01:16",
    "text": "Hmm very strange — i’ve never run into an issue like this before. I would contact HS support."
  },
  {
    "poster": {
      "poster_name": "Bogdan",
      "poster_handle": "maslyb.tf"
    },
    "time_stamp": "2022-07-18 09:05:18",
    "text": "Yes, Thanks.  I’ll try to ask them as it stopped my work and I tried everything, but I couldn’t find the place where it breaks. The system does not show any errors. And if I add a section with this module, there will be an error without details."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 09:06:51",
    "text": "Sometimes you can check dev tools and see if any errors are logged in the browser from HubSpot. Sometimes those are more helpful than what is actually displayed in the design manager"
  },
  {
    "poster": {
      "poster_name": "Bogdan",
      "poster_handle": "maslyb.tf"
    },
    "time_stamp": "2022-07-18 09:15:03",
    "text": "Thanks for the help. I hope it will be stable. I was working through the CLI, but I thought working through the design tool would be better, and that was my mistake.\nSometimes there are difficulties that I can’t explain and I have to comment on the code step by step to find the bug. Unfortunately, not everything is described in the documentation."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-18 09:16:36",
    "text": "Yea i’ve never run into anything that buggy working from Design tools or CLI. So it sounds like a pretty unique error that is likely coming through some theme setting and is causing a hangup. HS support should be able to help diagnose the problem hopefully."
  }
]