[
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2022-07-14 09:28:43",
    "text": "I'm creating a video background module for a web header and wanted to get thoughts on page performance. If the video is auto-playing as a background in the header, is it better to load it from HubSpot as a file or as a YouTube resource?",
    "reply_count": 5,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2022-07-14 09:30:33"
      },
      {
        "time_stamp": "2022-07-14 09:37:14"
      },
      {
        "time_stamp": "2022-07-14 12:29:41"
      },
      {
        "time_stamp": "2022-07-14 14:12:58"
      },
      {
        "time_stamp": "2022-07-15 02:27:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-07-14 09:30:33",
    "text": "is an auto-playing background video still a thing in 2022? I thought we passed that trend. Would be interesting to see how Core Web Vitals are impacted by it"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2022-07-14 09:37:14",
    "text": "I'm going to test this out as I implement it. There are some use cases where showing how a physical product works is more impactful than a static image, animation, etc. Real-world visuals via video still have a place.\n\nAside from a background video or hero video, inline videos can also add to the aesthetic.  This site, for example, does a really nice job with their inline video: <https://fundrise.com/> (not one of mine)"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-07-14 12:29:41",
    "text": "I would def load it through HubSpot. That way you can create a video element on your own and you will have much greater control over it than you would an Iframe.\n\nYou can preload the video file so that it loads as early as it can which will help with the web vitals. And I woudl still set a placeholder image/background image to fill up the little bit of extra time it might take to render.\n\nBut i’ve worked on a few projects with these and had little to no impact on web vitals as a result."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-07-14 14:12:58",
    "edited": {
      "time_stamp": "2022-07-14 14:13:27"
    },
    "text": "Our recommendations on autoplaying video:\n<https://developers.HubSpot.com/docs/cms/guides/speed#autoplaying-video>\n\nBJs suggestion gives you the most control over the video. There are obviously pros and cons to have thing the control."
  }
]