[
  {
    "poster": {
      "poster_name": "Jonas R",
      "poster_handle": "jonas.rolstad"
    },
    "time_stamp": "2022-11-22 01:24:51",
    "text": "I was attempting both with `name` and `portalId` yesterday with the \"--account\" parameter in `hs upload`. Attempting to use any version of them today still doesn't reproduce..\n\nRe-reading your comment: I don't believe so, as the proccess is fairly streamlined (hs init)"
  },
  {
    "poster": {
      "poster_name": "Jonas R",
      "poster_handle": "jonas.rolstad"
    },
    "time_stamp": "2022-11-22 07:25:50",
    "edited": {
      "time_stamp": "2022-11-22 07:26:56"
    },
    "text": "The portalId went from a number to a string now when I used a `hs watch` command. I turned it manually back into a number, but attempting to hs watch again did not change it into a string.\n\nI did not use the --account parameter and my defaultPortal was set to my sandbox. The portalId it changed was my prod portalId - this is the top/first listed account/portal in the .yml file.\nIt's noteworthy that it is always and only this first one that gets its portalId turned into a string from a number - even though it's not the account/portal I'm working towards at the time"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2022-11-22 09:50:12",
    "edited": {
      "time_stamp": "2022-11-22 09:51:16"
    },
    "text": "Hi! I did make a new array of blog_post and now I do need to access the content like this:\n\n```post[0].url```\nWhich is fine, but after every save it will reformat to post..url. Is there maybe another way of accessing the content within an array, or can I change something in the settings so it will not format it like this."
  },
  {
    "poster": {
      "poster_name": "Joe O'Brien",
      "poster_handle": "j645"
    },
    "time_stamp": "2022-11-22 16:04:06",
    "text": "I am having the exact same problem Anthony - did you ever resolve this?"
  },
  {
    "poster": {
      "poster_name": "Joe O'Brien",
      "poster_handle": "j645"
    },
    "time_stamp": "2022-11-22 16:11:55",
    "text": "Hi all - having a really basic issue with the CLI via VSCode.  I'm executing a basic `hs upload` command and I get a confirmation saying that it worked - however when I check my Design Tools there has been no upload.  I've executed a `hs fetch` which pulled the files down initially so I know that my config is all correct.  It just doesn't seem to send the files up ... I must be missing something basic?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-22 16:38:50"
      },
      {
        "time_stamp": "2022-11-22 16:44:04"
      },
      {
        "time_stamp": "2022-11-22 16:44:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2022-11-22 16:38:50",
    "text": "If you haven’t already, I suggest double-checking the value of `defaultPortal` in your HubSpot.config.yml. The CLI likes to randomly change that setting sometimes — if that’s happened, you might be uploading to the wrong environment."
  },
  {
    "poster": {
      "poster_name": "Joe O'Brien",
      "poster_handle": "j645"
    },
    "time_stamp": "2022-11-22 16:44:04",
    "text": "Thanks Ev - I've double checked just to be sure and its all correct - sigh."
  },
  {
    "poster": {
      "poster_name": "Joe O'Brien",
      "poster_handle": "j645"
    },
    "time_stamp": "2022-11-22 16:44:29",
    "text": "The sandboxAccountType: null line has me wondering if that should be something as mine is a sandbox account?"
  }
]