[
  {
    "poster": {
      "poster_name": "Grant Bunyan",
      "poster_handle": "grantbunyan"
    },
    "time_stamp": "2019-06-25 10:30:49",
    "edited": {
      "time_stamp": "2019-06-25 10:32:08"
    },
    "text": "I’ve probably missed some fundamental information somewhere, but could anyone please offer any pointers on migrating to HubSpot? My company’s site is currently hosted elsewhere. I’m due to build the new one in HubSpot. What’s the best process for developing a staged/unpublished site that once complete and reviewed, is then set live to replace the externally hosted one?\n\nCan I develop the new site in a dummy account such as one at ***.<http://hs-sites.com|hs-sites.com> then easily convert that, via the HubSpot interface, into one at my company’s root domain?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-06-25 11:16:49"
      },
      {
        "time_stamp": "2019-06-25 14:37:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Grant Bunyan",
      "poster_handle": "grantbunyan"
    },
    "time_stamp": "2019-06-25 10:49:21",
    "text": "I realise there is ‘content staging’ available for connected domains, but doesn’t that require I connect <http://www.company.com|www.company.com> as a primary/secondary domain and update DNS first, which would break the current live site hosted elsewhere?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-06-25 11:16:49",
    "text": "yep.  once you hook up your domain, you will able to transfer the content to your new primary domain"
  },
  {
    "poster": {
      "poster_name": "Grant Bunyan",
      "poster_handle": "grantbunyan"
    },
    "time_stamp": "2019-06-25 14:22:50",
    "text": "I just don’t get how to stick with the following guidelines from the knowledge base under my (arguably common) use-case:\n&gt; Some users like to use these subdomains to host their content temporarily, then move their content to their own subdomains later. However, it is not necessary to ever host any content on these subdomains. For an alternative to temporarily hosting content on these subdomains while customizing your design, check out Content Staging."
  },
  {
    "text": "Ah, this could be what I’m after. I’ve added the ‘www.[<http://company.com|company.com>]’ domain, but quit at the point it asked me to confirm it as ready. When I came back to the list of connected domains it was listed but marked as incomplete. Perhaps with this checkbox checked I’ll be able to use content staging functions with it, whilst having it able to pick up general assets inc. stylesheets associated with that domain? :thinking_face: :crossed_fingers:\n\nDefinite accidental find though.",
    "time_stamp": "2019-06-25 14:34:24"
  },
  {
    "poster": {
      "poster_name": "Grant Bunyan",
      "poster_handle": "grantbunyan"
    },
    "time_stamp": "2019-06-25 14:37:24",
    "text": "Thanks for the input Dennis. I had been digging more as it seemed at odds with the KB articles regarding system domains."
  }
]