[
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2019-12-06 09:15:43",
    "text": "Good question… I was able to do that not long ago, but we recently made an update to the URL path setup and either this is no longer possible (but should be), OR I also messed up my permissions on a recent test. I’ll dig into this a bit more and let you know what I find :slightly_smiling_face:"
  },
  {
    "text": "Yes! You can do that. I initially wasn’t able to in my account because my domain settings weren’t set up correctly (make sure you have your ccTLDs set up as “Secondary” for all the content types you want to use them for (which is probably all of them).\n1. Create the primary language page (mine is English)\n2. When you “Create language variation” choose the language you want. It will default to the TLD of the original page with the /subdirectory, but then you can edit that URL and select the new ccTLD from the list. ",
    "time_stamp": "2019-12-06 09:26:58"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2019-12-06 09:27:54",
    "text": "100% compatible with the existing multi-language feature, your pages will remain grouped in the UI and have the correct `href lang` tags."
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2019-12-06 09:28:22",
    "text": "Let me know if you run into any issues!"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2019-12-06 09:37:11",
    "edited": {
      "time_stamp": "2019-12-11 16:12:28"
    },
    "text": "P.S. in my screenshot, `<http://snaedis.org|snaedis.org>` is my “Icelandic” ccTLD. Technically not a ccTLD, I know, but it will work the same way. (Yeah, _someone_ out there bought up ALL the ccTLDs for `snaedis` but none of the generic TLDs. And they’re just sitting on them. :face_with_raised_eyebrow: …yes, I’m a little sore about it.)"
  }
]