[
  {
    "text": "hey all :wave:\nwhat’s the recommended way to create a card in the CRM (for a non-private app)? projects or with the app GUI in my developer console?\n\ndoing it through the dev console seems simpler, but I can’t get the Card to show up in the CRM/I don’t see any requests being made to the data fetch url I provide - thanks!",
    "time_stamp": "2022-12-14 09:49:05",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-14 10:00:53"
      },
      {
        "time_stamp": "2022-12-14 10:05:39"
      },
      {
        "time_stamp": "2022-12-14 10:07:28"
      },
      {
        "time_stamp": "2022-12-14 10:12:03"
      },
      {
        "time_stamp": "2022-12-15 09:04:07"
      },
      {
        "time_stamp": "2022-12-15 09:12:52"
      },
      {
        "time_stamp": "2022-12-15 09:13:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Hazlewood",
      "poster_handle": "mhazlewood"
    },
    "time_stamp": "2022-12-14 10:00:53",
    "text": "Hi Leo. Right now projects are just for private apps, so if you’re looking to create a CRM card in a public app then you’re in the right place.\n\nPublic apps work a little differently. Once the card is set up in the app config, you need to get the app installed on a HubSpot account (using OAuth). When the app is installed, then that data fetch URL should be hit when a user visits one of the CRM record pages.\n\nThese docs might be a good start:\n\n<https://developers.HubSpot.com/docs/api/working-with-oauth>\n\n<https://developers.HubSpot.com/docs/api/crm/extensions/custom-cards>"
  },
  {
    "poster": {
      "poster_name": "Leo Simmons",
      "poster_handle": "leo.simmons"
    },
    "time_stamp": "2022-12-14 10:05:39",
    "text": "gotcha thanks! so another detail I should’ve mentioned is we’re using Paragon to add our HubSpot app to the user’s HubSpot account, where Paragon manages creating/storing the tokens"
  },
  {
    "poster": {
      "poster_name": "Leo Simmons",
      "poster_handle": "leo.simmons"
    },
    "time_stamp": "2022-12-14 10:07:28",
    "text": "so I can add the app to a user account through Paragon, can see it in my `Connected Apps` page, can successfully execute queries to the API, but the Card doesn’t seem to be getting “initiated”"
  },
  {
    "text": "I see this in the `Monitoring` section - is my app still not `online` if I’m already making requests to the API with it?",
    "time_stamp": "2022-12-14 10:12:03"
  },
  {
    "text": "Hey all, I am wondering if anyone can replicate the issue happening in this thread <https://community.HubSpot.com/t5/APIs-Integrations/No-longer-able-to-add-custom-properties-to-CRM-Card-Data-Request/m-p/725430|here>. Essentially when configuring my CRM Card settings within my app (inside my developer account) and you try to add a custom property to the payload sent to your data fetch URL it is constantly pre-pending `Create option` before the internal name of the property creating issues (the workaround is copying and pasting internal names into the input field but it's not super intuitive and I know it hasn't worked like that before. I flagged this with HubSpot support but there hasn't been any movement and in the past I was able to achieve this....",
    "time_stamp": "2022-12-14 14:30:10",
    "edited": {
      "time_stamp": "2022-12-14 14:31:27"
    },
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-15 09:09:21"
      },
      {
        "time_stamp": "2022-12-15 09:38:31"
      },
      {
        "time_stamp": "2022-12-15 10:37:08"
      },
      {
        "time_stamp": "2022-12-15 12:55:57"
      },
      {
        "time_stamp": "2022-12-15 12:58:02"
      }
    ]
  }
]