[
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-01 04:29:13",
    "edited": {
      "time_stamp": "2023-08-01 04:29:34"
    },
    "text": "<@UA886MF42> regarding the search functionality, I have one concern when a user has multiple versions of the same theme, for example a clone and a child.\n\nIn the old UI if you typed in the search box, the theme results would come up first, then common modules, then all and it had to be expanded. \n\nIf you had a child theme, those modules were at the top but if your account had a clone or even a template pack, you could still access those modules which can create issues with theme updates, etc.\n\nIf the search disregards the categories and a user types Form, will all versions of the module show without distinction or will it follow the old logic?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-01 16:40:06",
    "text": "From what I’ve gathered from talking with users (as well as my own personal use), the concept of categorized modules is generally well-liked, but there are issues with context loss, disorientation and high effort of exploration presented by the execution of the interface.\n\nIn my observation, most users don’t actually remember the name or functional category of a module — they tend to recognize it by its icon and placement. By making each module category a discrete page, the hints of proximity and position have been weakened for users trying to find a specific page element. I’ve also seen a phenomenon of users “losing their place” when switching between module categories, where they forget what they have and haven’t looked at, leading to them randomly or exhaustively searching categories until they find the module.\n\nI think both of those issues might be helped by re-enabling scrolling as an exploratory behavior. A switch from categories as “pages” to a model where those categories are presented as groupings in a continuous list may be an option to facilitate this.\n\nThe issue of disorientation tends to show up with the frequent disappearance and reappearance of the sidebar. In my experience, users tend to place and edit modules in ‘batches.’ The modules panel disappearing after each placement requires users who edit in this way to “re-find their place” with each module placement. This disorientation is amplified dramatically when paired with the behavior of the “Edit Module” sidebar, which resizes the viewport and reflows the page content, potentially leading to the user simultaneously losing track of the module in the editing UI *and* on the page.\n\nThe net effect of this is a slower, higher-friction editing experience for non-expert users in which they don’t make effective use of module categories; instead, they click through categories aimlessly until they happen across what they were looking for.\n\nI’d suggest that module categories can and should be an editor experience win, but more care needs to be taken to support different exploration patterns, and to ensure consistency and reliability of the editing UI."
  }
]