[
  {
    "poster": {
      "poster_name": "Carolina Kauark Fontes",
      "poster_handle": "carolina"
    },
    "time_stamp": "2023-05-16 09:49:30",
    "text": "Hey everyone! Hope you are doing great. :deploy_parrot:\nI am developing a CRM Card without BETA. But the app to create the CRM Card is just a integration beetween HubSpot and another plataform.  After authentication in this other plataform, they returns me an access token to make the requests. Since my app doesn't have a database, I was wondering if I can store this access token in HubSpot related to the user who install the app. Can I do that? If not, do you have any suggestion to store the access token?",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-16 09:57:02"
      },
      {
        "time_stamp": "2023-05-16 09:57:48"
      },
      {
        "time_stamp": "2023-05-16 11:01:27"
      },
      {
        "time_stamp": "2023-05-16 11:47:25"
      },
      {
        "time_stamp": "2023-05-16 11:48:21"
      },
      {
        "time_stamp": "2023-05-16 11:50:56"
      },
      {
        "time_stamp": "2023-05-16 11:51:46"
      },
      {
        "time_stamp": "2023-05-16 11:52:59"
      },
      {
        "time_stamp": "2023-05-16 11:53:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 09:57:02",
    "text": "So there are a couple of options, but first one quick question.\nIs it an access token or is it a authorization code that then needs to be exchanged for an access token (and when will that access token expire?)?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 09:57:48",
    "text": "Another quick question, which other platform are you trying to work with?"
  },
  {
    "poster": {
      "poster_name": "Carolina Kauark Fontes",
      "poster_handle": "carolina"
    },
    "time_stamp": "2023-05-16 11:01:27",
    "text": "Sure, sorry about the delay answer <@U01QVR44MEY>. This token does not expire, for what a read about it, it's a permanent access token. Its a micro-saas that we are doing to use in our agency to integrate HubSpot and Teamwork, so the employee and view and create a new task inside HubSpot."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 11:47:25",
    "text": "Awesome, so because this app is going to be used by multiple portals I don't think it would be the best idea to store this token in a HubSpot portal. Most people use a simple database like PostgreSQL or RDS and store the portal id as the primary field and the token as the secondary one (you can also store the HubSpot access token if you're doing HubSpot auth)"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 11:48:21",
    "text": "While you technically could store this in a hubdb it wouldn't be super secure and you would have to keep your hub up and running for how ever long you have customers with this app, plus people in your portal could see other people's access tokens"
  },
  {
    "poster": {
      "poster_name": "Carolina Kauark Fontes",
      "poster_handle": "carolina"
    },
    "time_stamp": "2023-05-16 11:50:56",
    "text": "Thank you so much for the explanation, Carter! So the best way to do it is to create our own relational database, right? I was trying to avoid this, but I think is the best approach"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 11:51:46",
    "text": "yeah honestly it's super cheap to run and it will outlive your app and just keeps things safe, secure and standardized"
  },
  {
    "poster": {
      "poster_name": "Carolina Kauark Fontes",
      "poster_handle": "carolina"
    },
    "time_stamp": "2023-05-16 11:52:59",
    "text": "Thank you so much!"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-16 11:53:16",
    "text": "of course, let me know if you run into any issues setting it up"
  }
]