[
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-08-30 04:25:01",
    "text": "<@U05Q578230U> this seems like a good workflow that gets the work done. As for overwriting others work, that can be avoided while merging the branches right? Or am i missing something?\n\nWhy do you see each dev using their own sandbox as an issue?"
  },
  {
    "poster": {
      "poster_name": "Afron Orana",
      "poster_handle": "afron.orana"
    },
    "time_stamp": "2023-08-30 04:31:56",
    "text": "If the issue is the content not being the same, I have a similar workflow, where i also keep track of the file manager placeholder media. I have set up a naming convention for the placeholder files. Something like `file-manager/demo/module-name/placeholder-1.jpg` \n\nOnce another developer pulls the changes, both modules and files get uploaded on their sandbox and everything runs smoothly."
  },
  {
    "poster": {
      "poster_name": "Caleb Rowe",
      "poster_handle": "caleb.rowe"
    },
    "time_stamp": "2023-08-30 07:21:01",
    "text": "Thank you both for your replies. <@U01U201MTQF> Sorry, my bit about overwriting another dev's work is confusing. I was referring to a scenario in which multiple devs are using the one standard sandbox for active development and testing, meaning they all are directly connected using the HubSpot cli and uploading changes as they work. That was my original issue I was trying to work through, and how I came up with the workflow in my chart. So I was mainly asking if my workflow idea solves that issue efficiently\n\nAnd yes you are right, using traditional git versioning should avoid all overwriting issues in the codebase"
  },
  {
    "time_stamp": "2023-08-30 13:00:28",
    "text": "Reminder: Don’t forget to keep your HubSpot CLI up to date to ensure you have the latest CLI features, bug/usability fixes and performance improvements. • <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli#upgrade|How to upgrade your CLI to the latest version>."
  }
]