[
  {
    "poster": {
      "poster_name": "Marcelo Candil",
      "poster_handle": "marcelo.candil"
    },
    "time_stamp": "2023-08-22 14:41:24",
    "text": "what plugin are you using? I’m looking for one that I can integrate"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-22 14:44:04",
    "text": "We were discussing the official <https://github.com/HubSpot/prettier-plugin-hubl|HubSpot Prettier HubL> support plugin. It’s certainly better than no formatter, but as discussed here, you’ll need to look out for some of the unfixed bugs and quirks in it."
  },
  {
    "poster": {
      "poster_name": "Marcelo Candil",
      "poster_handle": "marcelo.candil"
    },
    "time_stamp": "2023-08-22 14:49:37",
    "text": "Hey <@U04AQA0QM8E> thanks for the prompt response, I remember I tried to implement that but the console returns:\n`\"Couldn't resolve parser \"hubl\"\"` \ndid you face that problem?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-22 14:53:50",
    "text": "Can’t say I faced that particular problem. I don’t know if this is the issue for sure, but one thing that jumps out as a potential cause of this error: you’re never going to be parsing a “`hubl`” file — it’ll always be found within/supporting another type of file.\n\nSpecifically, you’re going to be formatting `html-hubl` and `css-hubl` files. So, I might expect that error to show up if you’ve configured it to format `hubl` files.\n\nDon’t know if I could say what it is beyond that; might just take some tinkering."
  },
  {
    "poster": {
      "poster_name": "Marcelo Candil",
      "poster_handle": "marcelo.candil"
    },
    "time_stamp": "2023-08-22 15:08:11",
    "text": "Honestly, I’m not sure what it could be, I just followed the configuration that they recommend in the README, and what worries me the most is that I see a lot of issues and their last update was 7 months ago."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-08-22 15:11:41",
    "text": "Yes, the project appears to be abandoned currently — it seems that the person who was heading up the effort is no longer with the company, and there doesn’t seem to be anyone both interested in and capable of picking it back up."
  }
]