[
  {
    "poster": {
      "poster_name": "Lautaro Griguelo",
      "poster_handle": "griguelolautaro"
    },
    "time_stamp": "2023-11-27 05:11:17",
    "text": "Hello everyone, how are you? I had a question that could come from the templates, the problem is that I am sharing HubSpot with different accounts but I am having the problem that the nav and the footer are shared in another project, is there a way to do that? Doesn't happen using the same template or should we have another one? (we have to make different pages)"
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-11-27 12:16:02",
    "text": "Hey everyone!\nWe were at a conference last week, and got ~200 fresh qualified leads (great success).\n\nHow would you add that activity to the lead?\nThere’s no custom engagement types (except for a note which is too unstructured), and custom timeline events aren’t accessible by API (so it doesn’t flow into our data lake). \n\nMy best option right now is creating a meeting-engagement with type or outcome “conference”, but then I still lack context. \n\nHow have you brilliant people solved this before?",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-11-27 12:21:22"
      },
      {
        "time_stamp": "2023-11-27 12:21:44"
      },
      {
        "time_stamp": "2023-11-27 12:24:54"
      },
      {
        "time_stamp": "2023-11-27 12:26:04"
      },
      {
        "time_stamp": "2023-11-27 12:28:50"
      },
      {
        "time_stamp": "2023-11-27 14:07:35"
      },
      {
        "time_stamp": "2023-11-27 15:32:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-11-27 12:21:22",
    "text": "You could create a custom object representing the event or conference, and associate all contacts in the list to the custom object representing attendance at the event"
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-11-27 12:21:44",
    "text": "Can’t afford custom objects yet :smiling_face_with_tear: :smiling_face_with_tear: "
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-11-27 12:24:54",
    "text": "I think in that case your best option might be a multiple select custom property. So you can identify which events the contact has attended in the custom property"
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-11-27 12:26:04",
    "text": "But that doesn’t flow into our data lake either (at least as an event)… but might be the best solution :thinking_face: "
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-11-27 12:28:50",
    "text": "Ok. For a custom integration you will probably need workflow custom code to format the data and send to your data lake"
  },
  {
    "poster": {
      "poster_name": "Maggie Philbin",
      "poster_handle": "mphilbin"
    },
    "time_stamp": "2023-11-27 14:07:35",
    "text": "hey jonathan!! pm for custom behavioral events at HubSpot--were working on a beta which allows you to import spreadsheets of custom events which can be tied to contacts--sounds like what youre looking for. know you mentioned above that you don't have an enterprise subscription, but if you want to learn more about custom events let me know!"
  },
  {
    "text": "Can anyone weigh in on whether I’m trying to be too cute here?\n\n*General Use Case:* We have a custom Quote Template that people would like to capture some basic information with while a customer is signing.\n\n*Hack:* I was able to embed a HubSpot form into the template with a rich text field (and using the source code editor to pull in the form).  I was able to use the onFormReady action to populate a field in the form that could help us identify the Company/Quote that submitted the form. In theory, all I need to do is pass the primary company Id or quote Id to a form field.\n\n*Issue:* I can’t figure out a way to access the Quote’s runtime information in javascript.  If I try to reference the tokens in the source editor (javascript) , the system replaces them with wysiwyg markup and breaks the script.  :sweat_smile:\n\nI get the sense I’m trying to stretch the Rich Text field a little too far. I could see 2 alternate approaches - has anyone tried either?\n\n1. Bite the bullet and just update the Quote Template to pull in the form. I can use Hubl to access whatever record Id(s) I need, and then set the form field via js….using curly bracket notation to pass the values along from the template. \n2. Insert a Call To Action in the rich text area, make it a link to the _Standalone_ form (and pass the hs_record_id as a URL parameter to pre fill the field) …. downside is this takes the user out-of-band\nexample markup and behavior attached",
    "time_stamp": "2023-11-27 14:18:57",
    "edited": {
      "time_stamp": "2023-11-27 14:21:25"
    },
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-27 14:27:16"
      },
      {
        "time_stamp": "2023-11-27 14:27:55"
      },
      {
        "time_stamp": "2023-11-27 16:14:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Logan Allen",
      "poster_handle": "lallen"
    },
    "time_stamp": "2023-11-27 14:27:16",
    "text": "Have you tried embedding the form with the RTE `Embed` plugin? You might have more success there, as RTE shouldn’t break scripts inside the embed wrappers, but will inside the RTE source code."
  },
  {
    "poster": {
      "poster_name": "Aj Dellicicchi",
      "poster_handle": "aj"
    },
    "time_stamp": "2023-11-27 14:27:55",
    "text": "I have not! Let me investigate thank you <@UN0NUBU3S> "
  },
  {
    "poster": {
      "poster_name": "Jonathan Bredo",
      "poster_handle": "jonathan355"
    },
    "time_stamp": "2023-11-27 15:32:29",
    "text": "Sent!"
  },
  {
    "text": "Didn’t quite work, but along the way I figured a way out (whether its a good way is another story :slightly_smiling_face: )\n\nI never would have assumed you could declare a variable inside the script of the template.\n\nI’ll probably move this to the actual template anyway, but interesting",
    "time_stamp": "2023-11-27 16:14:03"
  },
  {
    "poster": {
      "poster_name": "Conor Linehan",
      "poster_handle": "cplinehan"
    },
    "time_stamp": "2023-11-27 17:15:50",
    "text": "Hey Matt, I’m a dev on the CTA team that log has been removed and we’re adding checks to make sure they don’t get merged in again.\n\nThe request to the localhost is coming from the cms menu, I’ll pass it on to that team to see is there a way the can hide that request behind a flag."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-11-27 17:43:31",
    "text": "Thanks for that!\n\nSince you’re here can I ask are you doing anything to reduce the load time of the CTA’s?\n\nThe new ones are much faster than the legacy ones but I still was coming into some issue with layout shifts on page load trying to optimise performance"
  }
]