[
  {
    "poster": {
      "poster_name": "Endrit Ibraimi",
      "poster_handle": "endrit275"
    },
    "time_stamp": "2023-11-24 01:20:38",
    "text": "Ti blagodaram Goran :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2023-11-24 01:56:39",
    "edited": {
      "time_stamp": "2023-11-24 01:58:25"
    },
    "text": "We're working on a HubSpot CMS build as part of a multi-agency website project for a villa and flight package holiday company. The site uses a React application to deliver villa and flight data, search, listings, user account and checkout and HubSpot CMS for all landing pages.\n \nDue to the complexity of the search the agency delivering the React application want to host the entire website on an AWS instance they manage. They have asked us to provide HubSpot in a Docker container so that they can deploy this to their AWS instance.\n \nIs there anyone here that's dealt with this before and can give us a steer on the implications? I'm not sure how that affects licensing, compliance, functionality etc?\n\nAny insight would be appreciated.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-24 02:04:25"
      },
      {
        "time_stamp": "2023-11-24 04:39:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Umakant - MakeWebBetter",
      "poster_handle": "umakantsharma"
    },
    "time_stamp": "2023-11-24 02:04:25",
    "text": "i don't think its possible to share dockerised version of HubSpot and they can host it on their account.\n\nHubSpot uses AWS and google cloud as hosting and its containerised but i never saw anything where they provided it for self hosting"
  },
  {
    "poster": {
      "poster_name": "Adeel Younas",
      "poster_handle": "adeel.younas"
    },
    "time_stamp": "2023-11-24 03:13:44",
    "text": "Hi EveryOne - Could you provide advice of how to implement HubSpot invoice functionality, created from existing quotes?"
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2023-11-24 04:39:37",
    "edited": {
      "time_stamp": "2023-11-24 04:40:47"
    },
    "text": "Thanks for the reply. Yes we feel it's an odd request but just trying to work out if it's even possible with how HubSpot is setup."
  },
  {
    "poster": {
      "poster_name": "Dario",
      "poster_handle": "dario"
    },
    "time_stamp": "2023-11-24 09:28:45",
    "text": "Hello all. Buongiorno a tutti :slightly_smiling_face: I am new to this channel\nI'm stuck in creating an automation through API to associate an external mail to a ticket.\nAnyone can help here?"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-11-24 12:05:03",
    "edited": {
      "time_stamp": "2023-11-24 12:05:07"
    }
  }
]