[
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2023-11-15 03:21:14",
    "text": "Hi all,\ndoes anyone know why if i search for new twitter icon i find it in icons in richtext but it is NOT there in custom modules icons?\nThanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-15 04:52:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-11-15 04:52:46",
    "text": "You gotta make sure the icon field is using Font awesome 6"
  },
  {
    "poster": {
      "poster_name": "Andrez Romero",
      "poster_handle": "andrez.romero"
    },
    "time_stamp": "2023-11-15 06:23:15",
    "text": "Hi <@U04MH6N4M4P>, did &lt;form onSubmit={this.handleSubmit}&gt; work for you? i have the same problem and i am searching for the solution"
  },
  {
    "text": "Hi! Does anyone have any experience building a a Sharepoint to HubSpot extension? We would like to have something similar to Microsoft Teams (screenshot attached), but it looks like there is nothing out-of-the-box for Sharepoint (except CloudFiles integration).\n\nWas wondering if anyone had any experience of building something similar for Sharepoint :slightly_smiling_face: Thank you!",
    "time_stamp": "2023-11-15 06:38:00"
  },
  {
    "text": "I'm not very versed in HubSpot's reverse proxy feature (most of our clients aren't on CMS Enterprise) and wondering about the following:",
    "time_stamp": "2023-11-15 08:42:39"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2023-11-15 08:43:28",
    "text": "I know we can make for example a HubSpot blog subfolder appear as if it's a part of another platform. But can it go in the other direction where we make a non HubSpot subfolder appear as if it's a part of HubSpot?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-15 08:44:51"
      },
      {
        "time_stamp": "2023-11-15 08:59:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2023-11-15 08:44:51",
    "text": "I think what you’re asking about is using HubSpot as a reverse proxy. Unfortunately no. You’d need to set up reverse proxy that sends all traffic to HubSpot except for that one subfolder."
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2023-11-15 08:59:46",
    "text": "Thanks Jeff!"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-11-15 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Brad Tollett",
      "poster_handle": "brad208"
    },
    "time_stamp": "2023-11-15 11:55:11",
    "text": "Anyone know how I can confirm if a Custom Code action is actually being sent from HubSpot? Since Custom Code is serverless, it constantly rotates IP addresses and we need a way to whitelist a specific IP address so HubSpot can access our internal API"
  },
  {
    "poster": {
      "poster_name": "Brad Tollett",
      "poster_handle": "brad208"
    },
    "time_stamp": "2023-11-15 11:55:35",
    "text": "IP's rotate, nothing gets sent in the header, etc."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2023-11-15 14:57:19",
    "text": "Hi All! I have a question around the Salesforce/HubSpot sync. It appears that if you delete an 'account' out of SF, it does NOT delete the company out of HubSpot. I could have sworn that used to be a feature, but I could be wrong. Does anyone have a decent work around for trying to keep deleted companies/accounts in sync between Salesforce and HubSpot?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-15 18:07:26"
      },
      {
        "time_stamp": "2023-11-15 18:16:45"
      },
      {
        "time_stamp": "2023-11-15 18:22:54"
      },
      {
        "time_stamp": "2023-11-15 18:27:47"
      },
      {
        "time_stamp": "2023-11-15 18:29:12"
      },
      {
        "time_stamp": "2023-11-15 18:39:04"
      }
    ]
  },
  {
    "text": "Hi Sam, you might be able to set this up on the initial Company sync but I am not 100% sure.\nOnce you set it it seems you cannot change it.\n\nYou can for Contacts but not for companies.",
    "time_stamp": "2023-11-15 18:07:26"
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2023-11-15 18:16:45",
    "text": "Hi Goran! Thanks for the reply. It seems like it can not change. I could have sworn that you could at least change if it is deleted in salesforce then delete it in HubSpot on the account/company object.\n\nIt definitely can not be changed/adjusted in the newer interface.\n\nThe only workaround that i can think requires an extra step on the client side for keeping things clean across both platforms. It would be creating a property on both that is 'marked for deletion' or something. Setting that to try in SF before they get deleted. Then we can see all the same companies in HubSpot that have the same true value, and could automate things form there. It just seems a bit silly.\n\nAm I missing anything?"
  },
  {
    "text": "I have not configured Ticket sync, so when I go to the Configure flow it offers me to choose what happens to Deleted tickets.\nI wonder if the same happens for Companies? Not sure if you can afford to turn off the sync and then turn it on and see if it allows you then to change the setting?\n\nBut yeah I thought of that too, a property in SF to b e ticked, then sent to HS and that to delete the company. But with that you would need to do it with custom coded action because there is no \"Delete Company\" action in workflows.",
    "time_stamp": "2023-11-15 18:22:54"
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2023-11-15 18:27:47",
    "text": "My thoughts exactly. I did try pausing the sync with no luck earlier. I always try the old 'turn it off and on' just because it does actually work sometimes.\n\nI checked a few of my clients portals and there are no options on the company object to adjust. I just thought it was weird though. I get 'do nothing' when deleted out of HubSpot as accounts can be on contacts and leads in SF so it can cause issues. The delete in SF should be able to remove in HubSpot though as its a more simple conversion.\n\nYeah, that automation would probably add them to an active list and then ping the portal admin every couple of weeks to go in and clear out that list. That was my thinking anyway."
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2023-11-15 18:29:12",
    "text": "Well perhaps reach out to support before you give up and see what they say :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2023-11-15 18:39:04",
    "text": "Yeah, I reported it to them earlier today. I would imagine it will take some digging on their part or finding the right person. Just thought i would reach out here to see if anyone else knew anything about it. Thanks for the responses!"
  },
  {
    "poster": {
      "poster_name": "Venkat medisetti",
      "poster_handle": "vm"
    },
    "time_stamp": "2023-11-15 23:25:31",
    "text": "All - We are using HubSpot as a CRM solution.\nWe are creating Contacts and companies in HubSpot and my sales team are doing the updates such as adding comments to the leads.\n\nThe task I have is &gt; to identify the contacts or companies whihc has some modifications or updates in the last 24 hours.\nI am running into API rate limiters while trying to fetch the records to see if they are modified. I did tried batching also.\n\nIs there any API or a possible way to fetch the contacts which has modifications or modifications to a specific attribute/property so that I can work on those limited contacts alone.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-16 03:59:42"
      }
    ]
  }
]