[
  {
    "poster": {
      "poster_name": "Emeline Bulcourt",
      "poster_handle": "emeline_impala"
    },
    "time_stamp": "2023-11-10 03:24:01",
    "text": "Hi there,\nHas anyone ever built a website on HubSpot showcasing more than hundreds (if not thousands) products? Wondering if (and how) HubSpot CMS can be a good fit for this type of websites (from the catalog management perspective), and what is the best approach to do so. Appreciate the insights you could have! Thx!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-10 03:25:06"
      },
      {
        "time_stamp": "2023-11-10 03:36:12"
      },
      {
        "time_stamp": "2023-11-10 03:38:10"
      },
      {
        "time_stamp": "2023-11-10 03:43:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-11-10 03:25:06",
    "text": "I think people who have had this requirement before would probably choose to select Shopify because there is a really good integration into HubSpot"
  },
  {
    "poster": {
      "poster_name": "Emeline Bulcourt",
      "poster_handle": "emeline_impala"
    },
    "time_stamp": "2023-11-10 03:36:12",
    "text": "Thanks Andreas. Was wondering if HubSpot can compete against specific solutions like Shopify that you mention, or if it’s nonsense to try to build something coherent on HS"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-11-10 03:38:10",
    "text": "\"coherent\" - Well, you certainly can use Products for a lot of use cases. But if you are talking about thousands of products, Shopify has build so many tools and capabilities that you would rebuild and reinvent the wheel, that i just does not make sense in my opinion."
  },
  {
    "poster": {
      "poster_name": "Emeline Bulcourt",
      "poster_handle": "emeline_impala"
    },
    "time_stamp": "2023-11-10 03:43:31",
    "text": "Agree, it was my guess too."
  },
  {
    "poster": {
      "poster_name": "Mohammad Ahmad",
      "poster_handle": "m.b.ahmad"
    },
    "time_stamp": "2023-11-10 03:55:32",
    "text": "is there a way to amend the size of the CTI within HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Muhammad Abuzar",
      "poster_handle": "muhammad.abuzar"
    },
    "time_stamp": "2023-11-10 04:58:39",
    "text": "hey everyone, wanted ask a quick query, i have built my app fully working , and i have also its widget working online, i want to integrate my app/widget to HubSpot market place so that HubSpot users can use its services. kindly guide me whats the best way to list my app in HubSpot market place."
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2023-11-10 07:44:47",
    "text": "<@U022YD6LGAU> Read the rest of the thread (and infact my first message, `padding-bottom:0;` is not the same as `padding-bottom:;`\n&gt; the workaround is to add a backup of 0 however it’s not the same as just letting a single statement fail completely"
  },
  {
    "poster": {
      "poster_name": "Jonathan",
      "poster_handle": "helpdesk345"
    },
    "time_stamp": "2023-11-10 10:26:37",
    "text": "Hello, not sure if this is the correct channel for my question but I'm currently utilizing the Salesforce-HubSpot integration. Would it be possible to control the Salesforce to HubSpot sync to only those contacts that are already in HubSpot? Selective Sync does not seem to control much.\n\nThank you!"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-11-10 12:05:01",
    "edited": {
      "time_stamp": "2023-11-10 12:05:03"
    }
  },
  {
    "poster": {
      "poster_name": "Galex",
      "poster_handle": "tmessi0509"
    },
    "time_stamp": "2023-11-10 15:18:17",
    "text": "Hello, everybody\nI am in search of a full-time role position as a fullstack developer and I'd like to also learn more in this channel",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-11 14:34:31"
      }
    ]
  }
]