[
  {
    "poster": {
      "poster_name": "Saad Naik",
      "poster_handle": "ceo977"
    },
    "time_stamp": "2023-11-20 02:05:14",
    "text": "Hello Guys, some beginner help required. I need to add my testimonials from <http://testimonials.to|testimonials.to> into my CMS website, can't figure out how I can create a module as well as an automation that automatically logs my future testimonials into my website."
  },
  {
    "text": ":wave: Hi everyone! I have a questions regarding with payload code. I already reached facebook even HubSpot support about this thing. Facebook give's a guide on how to paste the payload code from facebook by using HubSpot extensions  SDK. Here's the list\n\n1.Create a custom action: First, you need to create a custom action for your payload code. This can be done by developing a custom action using the HubSpot Extensions SDK.\n\n2. Install the custom action: Once you have developed the custom action, you can install it in your HubSpot account. This will make the custom action available for use in workflows.\n\n3. Add the custom action to a workflow: After installing the custom action, you can add it to a workflow in HubSpot. When configuring the custom action in the workflow, you can specify the payload code that you want to execute.\n\n4. Test and deploy the workflow: Once you have added the custom action to the workflow and configured the payload code, you can test the workflow to ensure that it functions as expected. After testing, you can deploy the workflow to start automating your desired tasks.\n\n---------------------\n\nSo if you guys wondering why we are need this, we are trying to optimize our facebook Conversion Leads and to do that we need to follow the list by using payload code also by using CRM which is HubSpot\n\nHope somone can help us :pray:",
    "time_stamp": "2023-11-20 07:00:16"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2023-11-20 08:06:34",
    "text": "is there a HubSpot AI channel? ideally developer focused but I'll take what I can get :slightly_smiling_face:",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-20 08:13:37"
      },
      {
        "time_stamp": "2023-11-20 10:44:54"
      },
      {
        "time_stamp": "2023-11-20 10:45:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Daniel Paz",
      "poster_handle": "daniel593"
    },
    "time_stamp": "2023-11-20 08:13:37",
    "text": "Thank you very much!"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-11-20 10:44:54",
    "text": "<#C0558GU8H2M|ai>"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-11-20 10:45:29",
    "text": "Not much happening in there yet but lets get the party started"
  }
]