[
  {
    "poster": {
      "poster_name": "Mark Olijslagers",
      "poster_handle": "mark290"
    },
    "time_stamp": "2023-11-17 06:23:19",
    "text": "Hi All, our client want to add some extra rich text fields (just like the default 'Comments to buyer' field) to a quote. We don't wan't to use snippets in this 'Comments to buyer' fields but create extra fields with pre-filled default content which can be changed when edit a qoute.\nIs this possible?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-17 08:46:49"
      },
      {
        "time_stamp": "2023-11-17 12:18:08"
      },
      {
        "time_stamp": "2023-11-17 12:22:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Pat Donaghy",
      "poster_handle": "pat.donaghy"
    },
    "time_stamp": "2023-11-17 07:44:18",
    "text": "Hi everyone, hoping someone can help with this. We just noticed a new cookie consent banner popup on our website and can't seem to find a way to disable it. We've been using GTM to deploy the HS tracking code and now all of the sudden, the cookie consent banner is toggled ON by default with our data privacy settings. We just want to disable to banner and continue using the tracking code as we have been. Seems to be from an update from two days ago. Anyone have any insights???"
  },
  {
    "poster": {
      "poster_name": "Daniela Arceo",
      "poster_handle": "danielaarceoherrera"
    },
    "time_stamp": "2023-11-17 08:43:54",
    "text": "Hi! does anyone know the correct way to create a redirect for old custom quotes? we recently swapped our domains and the old domain got redirected to our new domain which is making all the old quotes using our old domain break, we have the new subdomain connected to HubSpot and updated in the quote templates, but this did not update the quote's domain for any existing quote thus any new quote 404's\nHAAALP :melting_face:\n\nthe problem too, is that I can't create in HubSpot because I had to disconnect the old domain to connect the new one because I only have 1 business unit, the redirect was made at the DNS level"
  },
  {
    "poster": {
      "poster_name": "Daniela Arceo",
      "poster_handle": "danielaarceoherrera"
    },
    "time_stamp": "2023-11-17 08:46:49",
    "text": "you could create a custom quote with a property that pulls the information for this field instead, it's kind of a work around but I've seen a couple built like that"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-11-17 12:05:03",
    "edited": {
      "time_stamp": "2023-11-17 12:05:09"
    }
  },
  {
    "poster": {
      "poster_name": "Mark Olijslagers",
      "poster_handle": "mark290"
    },
    "time_stamp": "2023-11-17 12:18:08",
    "text": "Thanks <@UFDDR9SS2> ,\nWhen i try to create a custom property, it's not possible to create a quote properties, only deal properties. While a deal can have multiple quotes, and each quote should have unique content for this fields, unfortunately this ain't the way to go."
  },
  {
    "poster": {
      "poster_name": "Daniela Arceo",
      "poster_handle": "danielaarceoherrera"
    },
    "time_stamp": "2023-11-17 12:22:17",
    "text": "huum that is a good pickle, yes you'd need to have an operations rule that a deal should only have 1 quote"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-11-17 14:44:15",
    "text": "Anyone else having issues loading the email editor today? I have to completely back out of the editor every time I try to preview an email."
  },
  {
    "poster": {
      "poster_name": "Harsh Kumar",
      "poster_handle": "harsh749"
    },
    "time_stamp": "2023-11-17 22:36:46",
    "text": "Hello Everyone, I need help to pull HubSpot custom report data using report IDs.\n\nSince, they isn't any native way to pull it. Are you aware of any workaround which can do this for me ?"
  }
]