[
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2023-11-16 03:59:42",
    "text": "Typically I start with an Active list to make sure I am capturing the right leads.\n\nWithin the enrollment if you select the specific property you can query if the property has been updated in the last 1 day\n\nThis list can be used to enroll in a workflow and you can use the webhook action to fire the contact data to your chosen destinatation."
  },
  {
    "poster": {
      "poster_name": "Varun Purohit",
      "poster_handle": "varun.purohit"
    },
    "time_stamp": "2023-11-16 04:26:45",
    "text": "Hi All,\nCan someone help me with smart rules in a modules because add smart rules is not showing in a particular module wat would be the reason."
  },
  {
    "text": "Hi HubSpot Developers!\n\nI'm the co-founder of Aidlab, and we're looking to achieve a level of integration similar to what Mailchimp has done (as shown in the attached screenshot, second screenshot is what I would like to achieve). Our clients are primarily doctors, and we aim to track their activities within our system via HubSpot to offer better support. Specifically, we want to integrate with our SaaS through an API to track actions like creating an examination and display this on the HubSpot 'Activity' timeline. I believe this may involve creating a 'custom activity,' but I'm having trouble finding information on this. Could anyone guide me on how to set this up or direct me to relevant resources?\n\nThank you for your assistance!",
    "time_stamp": "2023-11-16 05:33:20"
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2023-11-16 07:23:35",
    "text": "Hi y’all, I’m trying to incorporate HubSpot’s video module into a custom module, i do this simply by copying the html, css, js and fields from HubSpots own “video.module” into my module, however, for whatever reason the video does not scale up to the container width, it stays about 200px wide, this only regards embedded videos, HubSpot videos work fine. The crazy thing is that when i place the native video module anywhere on the page, the video within my module also becomes fine. Is anyone aware of this issue and what should i do to fix it?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-16 07:24:29"
      },
      {
        "time_stamp": "2023-11-16 07:26:15"
      },
      {
        "time_stamp": "2023-11-16 07:27:01"
      },
      {
        "time_stamp": "2023-11-16 07:29:01"
      },
      {
        "time_stamp": "2023-11-16 07:32:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-11-16 07:24:29",
    "text": "do you have the width of 200px defined in your embedd code?"
  },
  {
    "text": "Not as far as im aware of, as i directly import the link",
    "time_stamp": "2023-11-16 07:26:15"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-11-16 07:27:01",
    "text": "try it with and embedd code and set the with and hight to 100%"
  },
  {
    "text": "unfortunately this still doesnt give me the expected results, I’m also afraid that this way will make it too complicated for our client",
    "time_stamp": "2023-11-16 07:29:01"
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2023-11-16 07:32:51",
    "text": "I’d be happy to share my module as a zip if you would like to take a look at my code"
  },
  {
    "poster": {
      "poster_name": "Josh Warlick",
      "poster_handle": "jwarlick"
    },
    "time_stamp": "2023-11-16 10:05:52",
    "text": "Hello all, When using HubSpot's email source tracking setting of \"Add source tracking only if no existing tags in URL\". What specifically does HubSpot consider \"existing UTM tags\"? Is it anything after the ? or does it specifically look for UTM parameters. Asking as we use non UTM parameters for commerce site links."
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2023-11-16 16:05:18",
    "text": "Hello I have one big question to the HubSpot devs here:\nSome years ago I create a portal to test new things and with the past of the time I converted in our main dev portal to do everything. Now we want to use it to sell our modules from there and to test email modules (this portal have not that feature) or custom quote development (we are using our partner portal to do it and later translate it to the client one) well… my main question is if there is a way to convert that second “just test” portal to a marketplace developer portal so we can test, and sell, everything from there?"
  },
  {
    "poster": {
      "poster_name": "Lam Kim Son",
      "poster_handle": "lam.son"
    },
    "time_stamp": "2023-11-16 20:32:23",
    "text": "Hi all, when I was switch from <https://mydomain/> to another language, I always get the URL with the slash at the end <https://mydomain/fr/>. Is there anyway to get rid of it?"
  },
  {
    "poster": {
      "poster_name": "Robbie Nixon",
      "poster_handle": "robbienixon80"
    },
    "time_stamp": "2023-11-16 20:41:16",
    "text": "Hello. I have an app that integrates with client HubSpot accounts and have set up a public app to send webhooks to my app to update data in client accounts. The integration updates metrics we display on our platform. A client can set a criteria for their metric such as count number of deals created this quarter. What i am experiencing is multiple webhoooks firing from the public to my app on a single record creation or update. For example, after creating a single deal, 12 webhooks are fired. 3 webhooks relating to deal created event and 9 for a deal update event. Has anyone come across this sort of behaviour before? Is there something I am missing in the public app set up?"
  }
]