[
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2023-11-22 07:26:39",
    "edited": {
      "time_stamp": "2023-11-22 07:34:57"
    },
    "text": "Do any of you use CTAs on sites that are not hosted by HubSpot?\n\nI am trying to see how to add Slide-in CTAs from HubSpot to pages that are hosted by another service (Netlify in our instance).\nI thought maybe connected the domain to HubSpot would work but HubSpot seems to want to update the same DNS settings that makes the domain connected to the other service. Which would cause issues obviously.\n\nWhat is the solve here?\n\nP.S. the HubSpot tracking code is on the site, of course",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-22 07:42:29"
      },
      {
        "time_stamp": "2023-11-23 02:38:07"
      },
      {
        "time_stamp": "2023-11-23 02:41:14"
      }
    ]
  },
  {
    "text": "Last time I tried CTAs on an external site, it worked with just HS tracking script added to the site, and having display rules set up for which URL you want the CTA appear...",
    "time_stamp": "2023-11-22 07:42:29"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-11-22 10:55:02"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-11-22 11:47:51",
    "edited": {
      "time_stamp": "2023-11-22 11:49:04"
    },
    "text": "Hey folks! Just a heads up that the US HubSpot offices will be closed tomorrow and Friday for thanksgiving and Native American heritage day. While this isn’t a support community, we’re usually monitoring the slack closely to ensure all is running smoothly. We won’t be as active over the next 4 days, but will still be monitoring for any code of conduct violations. If you encounter any violations, please submit them <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&d=8587152060687|here>. "
  }
]