[
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-01-14 11:41:51",
    "text": "I'd love it if HubSpot team members were available in here but it seems like some of these channels are ghost towns... My message of 3 days ago has no response (although magically notifications started working). And there seems to be no way to tag the HubSpot team in messages (nor can I tag @here to get anybody to notice my message)\n\nThe support staff in HubSpot are great but they rarely understand the deeper technical issues that devs &amp; automation workflow builders need to solve.\n\nIn addition to the above outstanding issue as it relates to Slack notifications, we're grappling with preventing conflicts in HubSpot. Like many tech companies we have a team of SDRs who prospect, call, and engage with contacts via LinkedIn but sometimes those SDRs end up prospecting against a contact when there is already an active deal in play. In response to that problem, we set up some automations that successfully transfer ownership of companies and all associated contacts to the deal owner.\n\nOur expectation was that when a contact is no longer owned by an SDR (and the SDR role is set such that they are only permitted to `communicate` with contacts who they `own`) that sequences they had started against a contact would end.\n\nI wasn't surprised when HS support told me that \"The sequences definitely appear to continue emailing contacts not owned by the SDR even after the ownership of the contract is transferred to somebody else\".... I'd be surprised if this is true though and we don't have a technical resource who can really answer this question. If this is the case then it seems like a pretty big bug, if it isn't the case I'd love to find out that I'm right and that our workflow does effectively end sequences that may be in progress.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-28 15:45:04"
      },
      {
        "time_stamp": "2021-02-03 06:22:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Darian Vretenar",
      "poster_handle": "darian.vretenar"
    },
    "time_stamp": "2021-01-14 12:39:58",
    "text": "You have DM."
  }
]