[
  {
    "poster": {
      "poster_name": "Evan Briggs",
      "poster_handle": "ebriggs"
    },
    "time_stamp": "2022-03-25 06:55:17",
    "text": "Great, thank you. "
  },
  {
    "poster": {
      "poster_name": "Melissa Nault",
      "poster_handle": "melissa525"
    },
    "time_stamp": "2022-03-25 07:15:32",
    "text": "HubSpot is doing a \"Template Setup\" for our client with a non-HubSpot website. We understand that it will be on the HubSpot boilerplate theme. We would like to maintain the header/footer that HubSpot sets up but there are so many other themes, including free ones, that I would like to consider/use. Can someone point me in the direction of *\"How to swap out a theme but maintain the original header/footer\"*? (I do know how to recreate pages in Content Staging, thats not what I am talking about here) We will just be creating landing pages but we want the header/footer to match the non-HubSpot site. This idea comes up more and more with our clients and I cannot find any great information on this. Thanks!!",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-25 07:37:14"
      },
      {
        "time_stamp": "2022-03-25 07:38:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-25 07:37:14",
    "text": "<https://HubSpotdev.slack.com/archives/C2YGWHDKQ/p1648131617429649>\n\nWas thinking about this myself. I think one solution is if you have one primary theme and you want to buy other themes for things... make sure your header and footer are global partials with modules that have styles scoped and baked in the module. This way in a new purchased theme, you could create a child and change the base template to point to your primary theme header and footer."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-03-25 07:38:09",
    "text": "The scoping prevents your styles and scripts from conflicting with ones on a purchased theme.\n\n.brandname-header {}"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-03-25 08:26:05",
    "text": "Ahh, if you’re not intending to keep both brands then business units is likely unecessary for this specific use-case"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2022-03-25 09:54:01",
    "text": "Hey everyone,\nI am having an issue with Google fonts being pulled in on my Theme's `Typography` settings. I have the google font's field with the weights etc but it doesn't actually load the dependencies from Google.\n• Does HubSpot handle this on the backend or do I need to use HubL to load it in manually?"
  }
]