[
  {
    "poster": {
      "poster_name": "Adam Stahl",
      "poster_handle": "adam866"
    },
    "time_stamp": "2022-03-24 07:49:11",
    "text": "Good day Developers!\n\nIs it possible to export all of the page templates, pages, and themes used within a HubSpot CMS Hub in a HubSpot portal in a way where:\n\n• You'd be able to then change parts of the page template and theme code (like domain, some default colors, some placeholder images)\n• Have still have the individual webpage/landing page content\n• Re-upload it essentially to the same portal with that changed domain, colors, etc.\nI was poking around to see if there was an API that could do it but I come across one that explicitly confirmed that capability.\n\nI also found this (<https://knowledge.HubSpot.com/account/export-your-content-and-data#pages-posts-and-templates>) in the Knowledge Base which specifies that it exports \"HTML files of your pages along with all coded files from your design manager\" but it seems like we were only getting HTML files exported, not the \"coded files from design manager\".\n\nThanks for any insight!",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-03-24 08:17:50"
      },
      {
        "time_stamp": "2022-03-24 08:22:37"
      },
      {
        "time_stamp": "2022-03-24 14:57:28"
      },
      {
        "time_stamp": "2022-03-24 15:04:41"
      },
      {
        "time_stamp": "2022-03-25 08:26:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-24 08:17:50",
    "text": "Hey Adam, you’re correct in your assumptions. You _can_ use the HS CLI to move assets from one portal to another, and the CMS APIs to migrate/duplicate pages and other content objects either into a different portal or within the same one. If I’m understanding your use-case correctly, I would set up a *child theme* within the portal (essentially cloning the theme, but allowing it to have different theme settings etc…) and then creating a script to duplicate your desired pages/posts and change their domain and theme selections. The main limitation at this time is CTAs, which do not have a public API, so those will likely need to be recreated and reconfigured manually.\n\nThat said, it is a fair-sized project, and in my agency experience we typically would treat it as a dedicated project outside of any retainer we had with that client."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-03-24 08:22:37",
    "edited": {
      "time_stamp": "2022-03-24 08:22:43"
    },
    "text": "Kinda sounds like in the end you’re intending to do something similar to what Business Units and brand kits enable.\n<https://www.HubSpot.com/business-units>\n<https://knowledge.HubSpot.com/account-settings/manage-brands-with-business-unit>\n\nChild theme like Mark noted is also something you may need."
  },
  {
    "text": "Hey <@U6W3H6YN8>, just searched this slack for a similar issue we're having - would you mind if I reached out when you had time?",
    "time_stamp": "2022-03-24 14:45:15"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-03-24 14:46:33",
    "text": "<@U01JV10LWGZ> can point you in the right direction"
  },
  {
    "poster": {
      "poster_name": "Adam Stahl",
      "poster_handle": "adam866"
    },
    "time_stamp": "2022-03-24 14:57:28",
    "text": "Thank you, <@U26BLKGE4> and <@U7SL518D6>, I appreciate the insight!"
  },
  {
    "poster": {
      "poster_name": "Adam Stahl",
      "poster_handle": "adam866"
    },
    "time_stamp": "2022-03-24 15:04:41",
    "text": "<@U7SL518D6> - to your point, we're exploring business units as a possibility as well. In this case, some style aspects (logo, colors, font, etc.), brand name, and _likely_ domain will be changing but they like their Theme and none of the website or landing page content itself will be changing when that transition is made (outside of instances of the old brand name is my understanding). We're trying to get ahead of when those style changes come through. They also wouldn't be maintaining both brands after the transition is my understanding."
  }
]