[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-12-10 08:35:19",
    "text": "Exactly <@U021H3TV338>, the point is there are times when a template requires 4 or more consecutive HubL tags on each line – and it gets messy fast after that. Having a HubL tag would fix it. The if statements were just an example"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-12-10 09:10:07",
    "text": "I understand what you are getting at — I guess my point was more that using a set block achieves basically the same thing. You set the var once and define it using if statements inside of the block.  The real difference is that there is an endset tag and a few extra braces. But, to me at least, writing and reading it is just as easy and quick as the liquid tag."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-12-10 09:14:41",
    "text": "&gt; But, to me at least, writing and reading it is just as easy and quick as the liquid tag.\nI think this is where we disagree then. I do realize it’s totally subjective, though, so no one can be “right” or “wrong”.\nHowever, an entire shopify dev team and large liquid community seemed to think it was worth it and I lean towards their preference"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-12-10 10:41:10",
    "text": "On a related note — <@U0183NGLSUD> reached out from the iGoMoon team after our talk at dev day to show me their tool for local building field groups and it’s heckin sweeet. I def recommend it for building locally. You can set it up pretty easily with a simple npm build and it makes theme building super fast and integrated. <@UMZFZHVUJ> — I think you’d be interested in it for sure! <@UDJV5B73R> it will allow you to dive into local module building much much easier than learning the JSON for modules.\n\nI honestly prefer it to the GUI because of how you can build module groups and compartmentalize them into their own require files. Pretty darn dope.\n\n<https://github.com/iGoMoon/HubSpot-fields-js>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-10 19:35:25",
    "edited": {
      "time_stamp": "2021-12-14 07:40:59"
    },
    "text": "I would greatly appreciate it if we could use global theme settings variables in module fields’ display conditions. i.e. hide a module field based on a global theme settings value.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-12-14 07:12:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Amanda McIntosh",
      "poster_handle": "am.mcintosh1"
    },
    "time_stamp": "2021-12-11 00:57:34",
    "text": "I'd give this a bigger up-vote if I could!  I jump back and forth between local dev and the GUI, and always wish there were more helper tools like this built-in"
  }
]