[
  {
    "poster": {
      "poster_name": "Karey Mitchell",
      "poster_handle": "kareybm"
    },
    "time_stamp": "2021-12-29 11:01:43",
    "text": "Here’s a list of current HubSpot accessibility issues we found that would be nice to fix.\n• Forms\n    ◦ `.hs-error-msgs` : Content is not a list but it is marked as such\n    ◦ Status message is not automatically announced by the screen reader. Basically, we need to auto focus the TY message. \n    ◦ When form field is not identified in error message and not associated programmatically, Screen reader users will not be able to understand which form field has error.\n    ◦ form producing an empty `&lt;h3 class=\"hs_cos_wrapper form-title\"&gt;`  tag that we don’t have access to add content or remove natively.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-29 20:02:40"
      },
      {
        "time_stamp": "2021-12-30 08:00:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-12-29 20:02:40",
    "edited": {
      "time_stamp": "2021-12-29 20:03:07"
    },
    "text": "Work is in progress to improve HubSpot forms accessibility. Using the iframe version or form landing page instead of the embed code will result in better a11y. Updating existing embed codes wouldnbreak existing javascript and CSS on existing sites, so at a later date a new version of the embed code will be released and you will be able to use that instead. The team wants to make sure they do a good job on it before releasing the embed code as its harder to update it once its in use. The iframed version and form pages are able to easily be updated.\n\nIf iframe or form page is not an option you can custom code a form and use the submit form endpoint."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-12-29 23:45:22",
    "edited": {
      "time_stamp": "2021-12-29 23:45:42"
    },
    "text": "Add a nullish coalescing operator (`??`) to HubL."
  }
]