[
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-15 08:57:52",
    "edited": {
      "time_stamp": "2018-03-15 08:58:02"
    },
    "text": "Can we get the post count to be added the variable of `contents_topics`? I am not sure how to pull this info in otherwise"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-15 09:03:17",
    "text": "Also when previewing a custom module, can we get access to the developer info on that?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-15 09:09:08",
    "edited": {
      "time_stamp": "2018-03-15 09:13:49"
    },
    "text": "had this idea for awhile don’t know how it would get implemented - maybe others have similar better ideas, just thought i’d throw it out there.\n\n_Every site I build we create classes that can be used on links to make them look like a button, we also have various classes we use for text styling - for example if a client wants to set some text to be exactly the shade of their brand red color, we have a class for that._\n\n_I have no problem myself going in and adding a class to an anchor, marketers however don’t always understand html and get confused by that stuff, and clients themselves have (a long time ago) said if there’s this great wysiwyg editor why do I have to add classes and things?_\n\nMy solution I’ve drummed around in my head, has been that it’d be nice if there was some sort of new form of custom module, basically a rich text button, and we could add multiple of these.\n\nThe idea being we could make it so  when the user clicks on the button it either pops up a window like the embed code thing does, that we can pop some fields into(like a custom module), or it just inserts something into the editor at the cursor.\n\nThen anything that is added to a rich text field using one of these buttons would display as an inline block element with a background color, with whatever the Button was called, and if the module had custom fields it would let the developer pick 1 field to use as a label within the rich text editor.\n\nThat way while the rich text editor couldn’t display what content it was. The person editing would know what it was.\n\nIf the user clicked on the inline block item in the rich text field they would have the ability to edit the values for those custom fields again if it had custom fields.\n\n<https://spin.d.pr/OLGbK9+>\n\nMaybe my idea is a little too complicated, or maybe it’s solving a problem that people feel doesn’t need solving but thought I’d throw it out there, feel free to chime in."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-15 09:55:48",
    "text": "Add a parameter to `{% post_filter %}` so we can filter out topics we dont want to show. I know this can be done using `content_tags` and a for loop but you wouldnt be able to add post count to it.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-03-15 09:57:26"
      },
      {
        "time_stamp": "2018-03-15 09:58:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2018-03-15 09:57:26",
    "text": "I believe you can use `filter_type=\"tag\"`"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-15 09:58:41",
    "text": "you can use filter _type but thats only controlling what is shown between topics, months, or authors. the name is a little misleading. should be `content_type` imo"
  }
]