[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-07 13:18:07",
    "edited": {
      "time_stamp": "2018-03-07 13:18:41"
    },
    "text": "<@U7V9DQ31P> you can create what you’re trying to create using :focus-within\n\nIt however has no support in IE and edge so a fallback would be necessary.\n<https://css-tricks.com/almanac/selectors/f/focus-within/>\n\nThis is what I was thinking about before"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2018-03-07 13:41:56",
    "text": "<@U7SL518D6> that's pretty cool!"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-07 14:32:57",
    "text": "Gonna throw this in the channel but I know its gonna take some heavy thinking/dev to figure it out:\n\n- Create a menu editor like that of the design manager to allow us to create complex menus (like mega menus) for customers.\nOR\n- Provide a loop code module (much like blog loop) that is for the menu system so we can choose to code the menus differently like adding wrapping on nested elements and so on."
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-03-07 14:37:42",
    "text": "you can build your own CM for that. with the new designer you have the tools for it (repeatable field groups). And even you can put the CM in a global group (as a header, footer or only a global module if needed the menu more than once in the webiste) and put different content in each instance"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-07 14:40:35",
    "text": "<@U7ADCU3BM> I didnt even think of repeating fields... The only think I can thik of is if they want to make edits, they'd have to make them in the design manager for fields unless it was a global module they could edit on any page"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-07 14:42:04",
    "text": "I think the key issue/difference here is if you want to use the HubSpot Advanced menus or not. IF you don’t care about using that you can build it using the menu features in custom modules, it just would require someone editing the global module every time they wanted to update the menu instead of going to advanced menus"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-03-07 14:42:41",
    "text": "true, either way, they would be editing in both depending on the change"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-07 14:43:13",
    "text": "If you want to use advanced menus the only way to do it would be separating the menus into multiple separate structures, or HubSpot adding a way to make it so you can specify a menu depth to list."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-07 14:43:35",
    "text": "which I’ve had that idea before due to a client wanting to be able to do something sort of similar"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-07 14:53:27",
    "text": "New Idea: separate but related to megamenu idea.\n\nIt would be nice if we could in custom modules on the menu field toggle on an optional additional field which determines what the starting depth of the menu is.\n\nExample use case: I have an agency client that likes to have a sidebar menu on 2nd level pages in their sites, they prefer for that sidebar menu to show the items all on the same level within the menu tree and below.\n\nIt’s doable with CSS but a royal pain in the butt.\n\nSorry if my example isn’t clear it’s hard to wrap your head around but makes perfect sense why someone would want it."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-03-07 15:46:57",
    "edited": {
      "time_stamp": "2018-03-07 15:47:03"
    },
    "text": "Woah, that's a bonkers selector! Really cool :ok_hand: Thanks for sharing"
  }
]