[
  {
    "poster": {
      "poster_name": "Fabian Pasin",
      "poster_handle": "fabian.pasin"
    },
    "time_stamp": "2024-08-02 01:04:58",
    "edited": {
      "time_stamp": "2024-08-02 01:05:45"
    },
    "text": "Hi <@U8249TTCK> and <@U05KCU0E2QG>, could you solve the issue that Ryan had with the CTAs?\nI am still experiencing issues with the slide in CTA on my clients website. firefox is not the main issue here as it happens on chrome as well. As far as I can tell, the slide in appears now mostly as expected, on occasion its clickable, but mostly not.\nHere's the URL <https://www.proalpha.com/de/unternehmen>"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-08-02 03:06:00",
    "text": "Just FYI: If you do decide to learn about using themes (and I strongly recommend that you do) go over to the <#CMXUWUY5D|hs-cms-boilerplate> channel and you'll find the slack bot has posted several videos about starting with the boilerplate theme which has all the best practices included in it and should be the starting point for your new theme if you choose to create one."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-08-02 04:11:23",
    "text": "Yes it does, but in my experience Zapier can be very unreliable and turn off for no reason"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-08-02 09:40:12",
    "text": "Thanks for the confirmation. I guess I'm used to how WordPress does it. We'll figure out how to make it work!"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-08-02 09:42:55",
    "edited": {
      "time_stamp": "2024-08-02 12:49:38"
    },
    "text": "Got another question about blogs. Right now, when I preview a page that has a blog feed in it, it doesn't show any draft blogs without publishing them. Is there a way to preview how this will look before publishing them? I've come up with a couple instances now of wanting to be able to do that now but I can't seem to figure it out.\n\nI have considered creating a second blog just for staging that is only visible to me/my company, and creating a duplicate page where I can change the blog listing module to use my staging blog. That seems a little clunky to me.\n\nIs it possible to show the feeds for two blogs in a module? If so, what would the code for that look like? and if I did that, if one had visibility settings that only allowed certain users to see it, would that work like expected, and general public could see one, and only specific people see the other in the same feed?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-07 05:29:49"
      },
      {
        "time_stamp": "2024-08-09 12:14:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2024-08-02 09:55:33",
    "text": "<https://www.linkedin.com/posts/dennisedson_kenny-loggins-danger-zone-official-video-activity-7225153424659546112-DuhX?utm_source=share&amp;utm_medium=member_desktop|live coding anyone>?\nstarting in just over half an hour!"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-08-02 10:15:00",
    "text": "Anyone have an extra ticket to Inbound they’re looking to offload? :slightly_smiling_face:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-02 11:24:37"
      },
      {
        "time_stamp": "2024-08-02 11:59:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anubhav Sharma",
      "poster_handle": "anubhav"
    },
    "time_stamp": "2024-08-02 10:55:25",
    "text": "Not exactly that. Like i need to connect with an external applications clicking connect on their pops up a window.\n\nwhich says this\n*Couldn’t complete the connection*\nAuthorization failed because you don't have permissions to authorize the scopes required by the app. Please contact your super admin to get the necessary permissions."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-08-02 11:24:37",
    "text": "Hey Emma, maybe ask in <#C072R3E9FM4|inbound24> ?"
  },
  {
    "poster": {
      "poster_name": "Emma Boroson",
      "poster_handle": "emma662"
    },
    "time_stamp": "2024-08-02 11:59:19",
    "text": "ooh didn’t know about that channel - thanks!"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-08-02 12:05:01",
    "edited": {
      "time_stamp": "2024-08-02 12:05:03"
    }
  }
]