[
  {
    "poster": {
      "poster_name": "Harry",
      "poster_handle": "hchan-maestas"
    },
    "time_stamp": "2024-08-29 06:41:51",
    "text": "<@UQNEXHW14> understood. So where should I go to get technical support? I have filed support tickets, used online chat, and called the tech support phone number. However in all instance, the person helping me was not a developer or even connected to the engineering organization. When I requested to connect or get more information from someone from the engineering organization, the person helping me always reiterated that they no means of communicating with the engineering organization."
  },
  {
    "text": "Hi everyone - I'm trying to either remove the validation errors from my form or at least change the color to black to match our footer. It just doesn't look great to us. Any suggestions?  I can't figure out how to update the script in css.",
    "time_stamp": "2024-08-29 08:12:39",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-04 09:17:42"
      },
      {
        "time_stamp": "2024-09-04 11:47:31"
      },
      {
        "time_stamp": "2024-09-04 12:04:48"
      },
      {
        "time_stamp": "2024-09-04 12:11:09"
      },
      {
        "time_stamp": "2024-09-05 12:53:49"
      },
      {
        "time_stamp": "2024-09-09 07:09:48"
      },
      {
        "time_stamp": "2024-09-09 07:09:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-08-29 09:20:03",
    "text": "Hi <@U07JSHXV17U>, I hear you loud and clear. The experience in trying to get technical support at HS is suboptimal at best, but we are working behind the scenes to make it better. A question for you to potentially route you somewhere else - are you working on behalf of a customer, solutions partner or app partner?"
  },
  {
    "poster": {
      "poster_name": "Harry",
      "poster_handle": "hchan-maestas"
    },
    "time_stamp": "2024-08-29 09:24:02",
    "text": "My company is investigating the possibility of building Apps which integrates with HubSpot services in the backend via APIs."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-08-29 10:29:43",
    "text": "<@U07JSHXV17U> take a look <https://www.HubSpot.com/partners/app/join|here> - if you fill this out, someone may be able to assist."
  },
  {
    "poster": {
      "poster_name": "Harry",
      "poster_handle": "hchan-maestas"
    },
    "time_stamp": "2024-08-29 10:33:57",
    "text": ":+1: thanks. I will take a look."
  },
  {
    "poster": {
      "poster_name": "Sam Anderson",
      "poster_handle": "sam393"
    },
    "time_stamp": "2024-08-29 12:19:06",
    "text": "Hi everyone,\n\nI was searching previous posts to see if any had asked something similar, but is it possible for *HubSpot SMS* to be connected directly to *Auth0 Passwordless login*? My gut is telling me no based on what I researched since HubSpot SMS is not a SMS provider, rather uses Twilio like Auth0 does. But I wanted to confirm just in case I missed a workaround. Thanks!"
  },
  {
    "text": "Hey Jolly. I believe you'll need to make the changes noted in the attached screenshot: Under \"Property to include in code,\" email should be changed to phone and Email should be changed to Phone number. Robert, let me know if I'm off-base here. Thanks!",
    "time_stamp": "2024-08-29 14:17:08"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-08-29 14:43:19",
    "text": "<@U071H3X1D6G> that’s probably it! I didn’t see the email property as being passed in!"
  },
  {
    "poster": {
      "poster_name": "Marianne",
      "poster_handle": "marianne680"
    },
    "time_stamp": "2024-08-29 18:23:10",
    "text": "`[ERROR] A Error has occurred. Failed fetch of folder \"project-folder\" to \"C:\\Users\\dev\\Documents\" from the Design Manager`\nHi all, does anyone know why this error occurs? The error message doesn't really give me much clue on what to work on. :sweat_smile:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-02 12:10:26"
      }
    ]
  }
]