[
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-08-06 01:11:53",
    "text": "can't sadly search for workflow even triggers :disappointed:\ni use it for 2 processes:\n• one to have action X when someone presses Link \"X\" in Email\n• and the other one is just last modified date as an reenrollment trigger to have action based on certain changes made by creating activities/changes made to objects\nHope that helps :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-08-06 02:20:06",
    "text": "Has anyone else noticed that date fields on form aren’t accessible? Try entering a date without using your mouse…",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-06 02:27:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-08-06 02:27:35",
    "text": "They’ve marked the field as readonly! :face_with_rolling_eyes:"
  },
  {
    "poster": {
      "poster_name": "Dawid",
      "poster_handle": "dev428"
    },
    "time_stamp": "2024-08-06 03:18:35",
    "text": "I noticed an issue with the \"hs theme preview\", when I up and run the example page which contains the global module (with modified settings in the global editor) - the data is missing, it looks like HS doesn't fetch the data but instead serves the ones defined from the fileds.json file - Does anyone have the same?"
  },
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2024-08-06 05:08:30",
    "text": "Hi fellow developers! :wave:\nIs there a way to change image compression that I serve from Files Manager? In content I can switch between High, Default and Low, but I want to include it in Hubl template and it seems that compression is set on Low (meaning that quality of the image is poor).\n```&lt;img loading=\"eager\" src=\"(domain url)/Images/Backgrounds/gradient%20background%20dark%20and%20light%20shapes%20.jpg\" alt=\"gradient background dark and light shapes\" width=\"1920\" height=\"2168\" style=\"z=index: 0;\"&gt;```",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-07 05:37:08"
      },
      {
        "time_stamp": "2024-08-07 05:38:28"
      },
      {
        "time_stamp": "2024-08-07 05:44:56"
      },
      {
        "time_stamp": "2024-08-07 05:48:06"
      },
      {
        "time_stamp": "2024-08-07 07:25:40"
      },
      {
        "time_stamp": "2024-08-07 07:42:28"
      },
      {
        "time_stamp": "2024-08-07 07:44:54"
      },
      {
        "time_stamp": "2024-08-07 07:45:04"
      },
      {
        "time_stamp": "2024-08-07 07:54:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Moore",
      "poster_handle": "rmoore"
    },
    "time_stamp": "2024-08-06 07:43:05",
    "text": "Hi <@UDA3F01U4> Sorry for the delay. I was seeing the issues with our .hssites staging domain. Once we launched with our brand domain (<http://HZO.com|HZO.com>) the issues went away. That probably doesn’t help in your case, but that’s how I was able to resolve."
  },
  {
    "poster": {
      "poster_name": "Vanessa Vettor",
      "poster_handle": "vanessa556"
    },
    "time_stamp": "2024-08-06 07:51:21",
    "text": "Hello all!!\nQuick question here to validate if anyone has worked with typeform and HubSpot together.\nI'm trying to improve the UX of a form pre-populating the email field.\n• From what I've found so far, seems like the fields you try to populate should be hidden :eyes: \n• Also, I made a couple of test with the info I found in Typeform documentation, but I was not able to retrieve the email info correctly. \nLooking forward to anyone's comments.\nThanks!!"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2024-08-06 08:06:30",
    "text": "why does HubSpot cache redirects for so long, I deleted a redirect we had in place like 30mins ago, and the redirect continues to be active, I have tested with `hsDebug=true` and it is showing correctly, but why is it taking so long to clear, what is the timeframe of a deleted redirect to be cleared from the cache?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-08-07 05:41:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Amit Das",
      "poster_handle": "adas"
    },
    "time_stamp": "2024-08-06 08:27:25",
    "text": "Hello everyone! Is it possible to add query parameters to a CTA? The use case here is that visitors reach a product catalog landing page (LP) with URL parameters. The LP has a CTA which directs the visitor to more details of the product. But when the CTA is clicked I need the Query Params to pass from LP to the next page. I tested by hardcoding the params in by CTA href (see below) but the target page has no query params in there. This makes me think that CTA's dont allow this (see utm_source below).\n\n```<https://cta-service-cms2.HubSpot.com/web-interactives/public/v1/track/click?encryptedPayload=AVxigLLex5BgRAgValaSWn4921xJiNmKrtGvwT2xGuIPC0BpqkLxu26kiY6vZl26iU%2Fb%2BHg2Bipl%2B5H0Pdgkb1xjc8t55z%2B44da6flzk5Zsvcz%2FoETBUJhMKHzbqVAKLZ49Xqpy6YFxSg%2By6iSi5E4MdwqjsBgwPbU9SvZyB1L3jiLZBhjuNtKjF8ISi9zPZRYWiuJcPCQG0PtP%2BLuIFm3yx%2Bg%3D%3D&amp;portalId=21613634&amp;webInteractiveId=352953769901&amp;webInteractiveContentId=174950579843&amp;containerType=EMBEDDED&amp;pageUrl=https%3A%2F%2Fadas.mulligandevelopment.io%2Fenroll-1%3Futm_source%3Dg1%26type%3Dgoogle%26way%3Dhello&amp;pageTitle=Enroll&amp;referrer=&amp;pageId=174949864470&amp;analyticsPageId=174949864470&amp;hsfp=3149345536&amp;canonicalUrl=https%3A%2F%2Fadas.mulligandevelopment.io%2Fenroll-1&amp;contentType=landing-page&amp;utm_source=g1>```"
  },
  {
    "poster": {
      "poster_name": "Maggie Philbin",
      "poster_handle": "mphilbin"
    },
    "time_stamp": "2024-08-06 08:54:13",
    "text": "hey <@U065R73V8SY>! you can use custom events as workflow triggers! lmk if you want me to show you how!"
  },
  {
    "poster": {
      "poster_name": "Maggie Philbin",
      "poster_handle": "mphilbin"
    },
    "time_stamp": "2024-08-06 08:56:22",
    "text": "and hey kobe! pm of custom events here--heres some of my favorites:\n1. using custom javascript to track activity of other apps embedded in their site--youtube video views is the most popular one\n2. tracking bespoke internal systems--once had a logistics company sending events when trucks completed routes, which fired off internal emails in workflows. "
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-08-06 09:00:08",
    "edited": {
      "time_stamp": "2024-08-06 09:00:13"
    }
  },
  {
    "poster": {
      "poster_name": "Steve Parry",
      "poster_handle": "steven.parry"
    },
    "time_stamp": "2024-08-06 16:48:48",
    "edited": {
      "time_stamp": "2024-08-06 16:50:48"
    },
    "text": "Not sure if this is the best channel or not. But I just found out some information from HubSpot support about how their A/B testing tool runs that I feel is very important for people to know. Here are some excerpts from the conversation...\n\n_\"Anyone who has already viewed the original page will not be served the test variant. In cases where a page has existed for a long time, it is expected that the original version would have more views and that would skew the A/B test split.\"_\n\n_\"In the first few days of the test, unless you heavily distribute the page across multiple channels to those who have never viewed it, it is somewhat expected that the original version will still pull more views and it can caused the split to be skewed.\"_\n\n_\"As such, when the original and test pages were published would play a part here as well. For example, if there was a brand new page that you've created and set up an A/B test for, and both the A and B versions were published at the same time, we would likely see a more even split, closer to 50-50.\"_\n\n_\"As this test was done on your Homepage which has been published for a couple of years now and that people who have already viewed the original page will not be served the test variant, it would skew the data more towards the original A version rather than the test version.\"_\n\nTo me these statements are quite concerning as I believe that this is not how split tests should be run. A split test should be an isolated thing for the period of time that the test is running. No previous tests or traffic should affect how the distribution of a new test is handled.\n\nThe way that HubSpot are handling this may work for a brand new page that you want to test two versions of. But in practice we are trying to iterate and improve our entire website. So this means old pages as well.\n\nIn our recent homepage test we could see the split difference was around 35,000 skewing towards A, which alerted us to something not being right. Well it looks like we got our answer as to why, but it also means that HubSpot A/B testing is now not usable for the majority of testing unless we continually create new versions of our already existing pages. Which in itself would just cause many more issues.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-07 01:54:18"
      },
      {
        "time_stamp": "2024-08-07 15:37:54"
      },
      {
        "time_stamp": "2024-08-08 01:29:17"
      },
      {
        "time_stamp": "2024-08-12 14:35:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Fabian Pasin",
      "poster_handle": "fabian.pasin"
    },
    "time_stamp": "2024-08-06 23:04:51",
    "text": "<@U05KCU0E2QG>, thanks for your reply. Yeah, unfortunately this happens in production.\nWould you mind sending over the link to one of your pages where the slide-in CTA works?"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-08-07 00:47:53",
    "text": "<@U05PNE9896C> dont need help i am good thx tho :slightly_smiling_face:"
  }
]