[
  {
    "poster": {
      "poster_name": "Dan Katz",
      "poster_handle": "dan.katz"
    },
    "time_stamp": "2020-07-13 13:21:40",
    "text": "Greetings braintrust :slightly_smiling_face: What are best practices for managing short snippets of content, those that don’t warrant their own pages (like a blog post). We’re putting together an FAQ module and trying to decide between a HubDB approach, just building the fields as a repeater in the module itself, or even service hub. Whatcha think? Some FAQ’s will be super short and sweet, some longer form.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-13 14:34:28"
      },
      {
        "time_stamp": "2020-07-16 07:39:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-13 14:34:28",
    "text": "really depends mostly on the editing experience.\n\nIf it truly is an FAQ and you’re not likely to have say more than  20 questions then the module approach may be the better editing experience.\n\nService Hub makes sense if it’s not just going to be FAQs but more in-depth with more than say 20+ questions and answers."
  },
  {
    "text": "building custom modules, and i had to change some values in my fields.json, and now i’m getting this “one of your modules has incorrect information” error message when i try to publish. the network tab is pointing to one of my modules, but i removed the module entirely and the error persists. is there a way to find out exactly what it thinks is broken? i’ve looked at every field of every module, and my code, and none of them have the value that’s being marked as “wrong.”",
    "time_stamp": "2020-07-13 17:02:03",
    "edited": {
      "time_stamp": "2020-07-14 07:19:57"
    },
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-07-14 06:47:37"
      },
      {
        "time_stamp": "2020-07-14 07:19:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2020-07-14 00:47:08",
    "text": "Hi <@UD5NW4PJ5>!\nImportant additional information: My initial question was regarding the `related_blog_posts` function :wink:\nI see that a callback exists for `post_listing`"
  }
]