[
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-07-14 06:47:37",
    "text": "widget_1594393264548 isn’t even on the page, and that’s the widget tagged in the error"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-07-14 07:19:32",
    "text": "nvm i renamed the template for another reason and now it’s publishing. leaving this here for reference."
  },
  {
    "poster": {
      "poster_name": "Mohammed Saqib",
      "poster_handle": "saqib.m"
    },
    "time_stamp": "2020-07-14 09:48:04",
    "text": "Hi all, i'm new to HubSpot, i have developed a page and stuck on making hamburger menu, although i followed this <https://designers.HubSpot.com/docs/snippets/responsive/how-to-implement-a-fixed-top-mobile-navigation-design-manager|documentation>.  Im unable to do it still, any suggestions on where am i going wrong"
  },
  {
    "poster": {
      "poster_name": "David F Jones",
      "poster_handle": "david568"
    },
    "time_stamp": "2020-07-14 11:16:20",
    "text": "Hey All,\n\nI'm having what seems to be a cookie/caching issue with a form.\n\nI have a form that shows personalized data such as a nickname and bio. These are all tied to contact properties that I have made. The user should be able to edit the form fields and on submission be redirected back to the same page, which should then show the updated data in the form fields.\n\nThe problem I am having is that it seems like somewhere the previous data is being stored and used in these fields instead of the updated data. I'm running the following script on my page, this just refreshes the page if there is any form data in our headers. The 2 second wait seems to be enough time to allow all form data to be submitted to HubSpot.\n\t`setTimeout(function(){`\n\t\t`window.location = window.location.pathname;`\n\t`}, 2000);`\n\nOnce the page refreshes the second time, all the data should have been submitted and the form should show the new data. The weird thing is, if I print the data with something like {{contact.nickname}}, it shows the updated contact property. Despite this however, the form field will still show the old data. This old data will stay in the form even after several refreshes."
  },
  {
    "poster": {
      "poster_name": "Tony Sova",
      "poster_handle": "tony187"
    },
    "time_stamp": "2020-07-14 11:39:35",
    "edited": {
      "time_stamp": "2020-07-14 11:41:57"
    },
    "text": "Hey all,\n\nAnyone know of a module that acts like Google map with pins for different locations?\n\nWe are working on providing a website that offers tours.  The client wants search by location or schedule.  Unsure of how to do this using different landing pages?\n\nThanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-07-14 14:45:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-07-14 11:54:38",
    "text": "any way we can remove these inline styles `height: 22px; margin-top: -5px` on #hs-pwd-widget-password? or are these styles needed for some reason? i can add a permanent override with !important tags to my boilerplate, but i'm anti-!important :smile:"
  },
  {
    "text": ":point_up::skin-tone-3:this is on the password_prompt module",
    "time_stamp": "2020-07-14 11:55:41"
  },
  {
    "poster": {
      "poster_name": "Tony Sova",
      "poster_handle": "tony187"
    },
    "time_stamp": "2020-07-14 14:45:35",
    "text": "We figured out a solution using Hubdb.  Now we just need to figure out the last piece of building a custom module for payments to <http://Authorize.net|Authorize.net>."
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2020-07-14 23:04:34",
    "text": "Hi Jon, I tried. It's done. Thank you."
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2020-07-14 23:05:50",
    "text": "If possible can you please share me any tutorial to develop mega menu. In your provided URL I did not found anything related to mega menu."
  }
]