[
  {
    "poster": {
      "poster_name": "Zach Conrad",
      "poster_handle": "zach.conrad"
    },
    "time_stamp": "2023-07-21 14:06:39",
    "text": "<@UQWGKUEN7> What is your best practice process for upgrading the boilerplate? I am using the boilerplate as basis for our theme."
  },
  {
    "poster": {
      "poster_name": "Zach Conrad",
      "poster_handle": "zach.conrad"
    },
    "time_stamp": "2023-07-21 14:09:53",
    "text": "I was going to attempt to do a git submodule, but didn't feel comfortable doing so in case things got out of control"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2023-07-21 14:23:05",
    "text": "Hey <@U02DGJY44AV> — I suppose it kind of depends on how you’re currently setup. In an ideal world I think your OG theme is a fork of boilerplate, in which case you should be able to fetch and pull down updates to master branch of the Official HS theme above."
  },
  {
    "poster": {
      "poster_name": "Zach Conrad",
      "poster_handle": "zach.conrad"
    },
    "time_stamp": "2023-07-21 14:24:15",
    "text": "Is that what you recommend doing? Is that how others keep up to date with the boilerplate?"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2023-07-21 14:30:50",
    "text": "I think that the most common use for the boilerplate is a starting point for custom themes. It gives you a solid base layer. I think it is pretty common that developers will add / remove / modify the templates and modules quite heavily sometimes. To the point where it doesn’t make sense to keep pulling changes from the boilerplate every time it’s updated.\n\nIt largely depends on how close to the boilerplate your theme is staying. But if you’re keeping things pretty close and want to keep the updates coming through you can do what I mentioned above and then cherry pick the commits you want for even more granular control. Or you can keep an eye on updates and make adjustments manually to your theme if there is enough deviation from the official HS boilerplate.\n\nDoes that make sense?"
  },
  {
    "poster": {
      "poster_name": "Zach Conrad",
      "poster_handle": "zach.conrad"
    },
    "time_stamp": "2023-07-21 14:31:38",
    "text": "Yes, this makes sense"
  },
  {
    "poster": {
      "poster_name": "Zach Conrad",
      "poster_handle": "zach.conrad"
    },
    "time_stamp": "2023-07-21 14:32:51",
    "text": "I am still trying to figure out how to make changes to the boilerplate that don't break...for the most part things are working, but I cannot get the header to work the way I want"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2023-07-21 14:50:13",
    "text": "Hmmmm can you elaborate a bit more? What do you mean by _*“figure out how to make changes to the boilerplate that don’t break”?*_"
  }
]