[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-25 07:35:49",
    "text": "been asking for this for a while, just hope it someday comes to fruition.\n\nwhen doing show dependents on a blog template, I want the link to go to the front end of the blog, not the settings area of the blog.\n\nif that change doesn’t jive with everyone at the very least on the settings area for the blog there should be a link to the blog’s front end. can’t imagine it’d be hard to build as you’re already displaying the blog’s url in the page."
  },
  {
    "poster": {
      "poster_name": "Jenny Sowyrda",
      "poster_handle": "jsowyrda"
    },
    "time_stamp": "2019-02-25 11:18:03",
    "text": "Hey <@U7SL518D6> it looks like this post is up and running now; just getting caught up from being OOO but my guess is it was wrongly marked as spam and has since been removed from that quarantine :slightly_smiling_face: . Thanks for the flag!\n\nLet me know if you're seeing anything different on your end (I checked incognito/not signed in as well as signed in)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-25 11:24:17",
    "text": "re-igniting the fire on this one as the post is now out of the “spam” bin.\n\nBeing originally from Minnesota, home of Spam, it’s okay I’m used to being viewed as spam. lol"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-25 13:58:05",
    "edited": {
      "time_stamp": "2019-02-25 13:58:26"
    },
    "text": "If you have any development/design manager related ideas posted to the idea forum please ping me with a link to your idea. Going to see about a way to make these more visible - stay tuned for how that’ll work",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-02-25 13:59:25"
      },
      {
        "time_stamp": "2019-02-25 14:00:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-02-25 13:59:25",
    "text": "Does it involve you being hired by HubSpot :wink:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-25 14:00:41",
    "text": "in a way hopefully it’s better than that :thinking_face:"
  }
]