[
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Kyle Joseph",
      "poster_handle": "kyle.joseph"
    },
    "time_stamp": "2017-11-07 05:10:15",
    "edited": {
      "time_stamp": "2017-11-07 05:12:37"
    },
    "text": "Just an idea: looking at the developer info view got me thinking, why can’t HubSpot provide us with something like a ejected/custom create-react-app (or any other framework) that uses the developer info as a store using something like redux. All of the edits in the GUI done my marketers can just affect the store and filter down to our components, you can provide a lot of helper functions, api, reducers to make our lives easier. Components and reactjs already suggest we have css/js attached to each component to improve coverage etc like you’re suggesting. HubL just seems way to inefficient to me compared to the react way of interacting with the dom. Sorry if this doesn’t make sense :sweat_smile:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2017-11-07 07:27:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kyle Joseph",
      "poster_handle": "kyle.joseph"
    },
    "time_stamp": "2017-11-07 05:11:27",
    "text": "things like styled components etc including our own boostrap, deploying from git, all these things would make HubSpot a lot more of a pleasure to build with"
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2017-11-07 07:27:55",
    "text": "It makes sense - From your perspective hubl is not what you are looking for, but it serves the majority of needs for HubSpot sites. I don't see something like that happening, tbh."
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Jeff Boulter",
      "poster_handle": "boulter"
    },
    "time_stamp": "2017-11-07 07:57:06",
    "text": "I like your thinking <@U7VHMAX0R>. Eventually I think this will happen, because that’s where the web is moving, but it will be a big change. We’ll need to provide a lot of components so developers don’t need to rebuild everything from scratch."
  }
]