[
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-10-25 03:26:56",
    "text": "the edit preview options only appear on tables that are connected to a page, if the table is not connected to any page it won't appear"
  },
  {
    "poster": {
      "poster_name": "Bhaskar Katikala",
      "poster_handle": "bhaskar.katikala"
    },
    "time_stamp": "2024-10-25 04:06:40",
    "text": "Hi team, We are not able to capture few properties like _first page seen, last page seen, IP country, IP timezone, IP state_ etc . we are using API to collect information from our form in the website and fill it in a dummy form created in the tool to create a contact. Any idea why this is happening and how do we solve for this?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-25 07:30:56"
      },
      {
        "time_stamp": "2024-10-25 07:31:49"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "joe conery",
      "poster_handle": "joe277"
    },
    "time_stamp": "2024-10-25 07:29:03",
    "text": "ah.. thanks Frederico.. I was wondering why I didn't see that for a couple of custom objects that I created. Maybe that's the reason. I'll have to dig into that. Not essential for me, but I'm curious"
  },
  {
    "poster": {
      "poster_name": "joe conery",
      "poster_handle": "joe277"
    },
    "time_stamp": "2024-10-25 07:30:56",
    "text": "there are property attributes. I forget the specific attribute and value, but it may not get those properties by default with a GET request for records... However, you could specifically list all the properties in the GET request and you should get them."
  },
  {
    "poster": {
      "poster_name": "joe conery",
      "poster_handle": "joe277"
    },
    "time_stamp": "2024-10-25 07:31:49",
    "text": "comma separated string of properties you want:\n```the_url = f'<https://api.hubapi.com/crm/v3/objects/{table_name}?properties={properties_str}>'```"
  },
  {
    "poster": {
      "poster_name": "Connor Stolfa",
      "poster_handle": "cos"
    },
    "time_stamp": "2024-10-25 15:37:52",
    "text": "Hey everyone. My company has been syncing HubSpot data into our Snowflake database for a while now using their API. Our data pipeline just started failing because the column `property_zip` is gone. I've checked and zip code still is a property on our contact objects. It's the column in the database this is gone.\n\nHas anyone else encountered this and how did you recover the column?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-28 10:30:41"
      }
    ]
  }
]