[
  {
    "poster": {
      "poster_name": "Andreas Cederblad",
      "poster_handle": "andreas.cederblad"
    },
    "time_stamp": "2019-10-18 03:17:40",
    "text": "Are you using Cloudflare with HS when you find issues with java/CSS thats needs to be minified?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-10-18 07:13:35"
      },
      {
        "time_stamp": "2020-03-03 02:02:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-18 07:13:35",
    "text": "HubSpot already uses cloudflare, so you don’t need to set that up.\n\nCSS and JS is automatically minified, in-fact we just recently released an upgraded minifier that affects all newly created js files.\n\nHubSpot also auto-combines css files for you.\n\nhere’s kind of a run down of some of the features\n<https://www.HubSpot.com/products/marketing/content-management-system/site-speed>"
  },
  {
    "poster": {
      "poster_name": "Sylvain Tirreau",
      "poster_handle": "sylvain"
    },
    "time_stamp": "2019-10-18 07:48:06",
    "text": "Hi. On one of my portals, I can synchronize (`npx hscms watch --mode=draft local remote`) local code with remote one. But on another portal, I cannot. For those portals, I can fetch remote content. An idea?"
  },
  {
    "poster": {
      "poster_name": "Bill Huertas",
      "poster_handle": "bhuertas"
    },
    "time_stamp": "2019-10-18 09:52:50",
    "edited": {
      "time_stamp": "2019-10-18 09:52:59"
    },
    "text": "Hey all! I've been lurking on here for a couple weeks now, trying to suck in as much as I can. I've inherited a HubSpot CMS with lots of landing pages and the file structure is quite messy.\n\nWe've recently been playing with the beta dev tools in hope of making development easier (mainly such I and other developers can work within our local processes &amp; editing apps). I'd really love to clean up the existing structure, have the files under version control &amp; encourage local development.\n\nAre there any resources in terms of what a best practice setup might look like, given those three goals?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-10-18 09:58:32",
    "text": "Your best bet is going to be the local dev boilerplate:\n\n<https://github.com/HubSpot/cms-theme-boilerplate>\n\nAs you said, these tools are still in beta, so we're all still trying to figure out exactly what \"best practice\" looks like, especially with the many beta programs around these new processes"
  }
]