[
  {
    "poster": {
      "poster_name": "Samriti Chandel",
      "poster_handle": "samriti.chandel"
    },
    "time_stamp": "2019-10-15 02:26:53",
    "text": "So, in order to do that. I have to assign them, there is now way i can do that"
  },
  {
    "poster": {
      "poster_name": "Samriti Chandel",
      "poster_handle": "samriti.chandel"
    },
    "time_stamp": "2019-10-15 02:27:02",
    "text": "Don't misguide please"
  },
  {
    "poster": {
      "poster_name": "Samriti Chandel",
      "poster_handle": "samriti.chandel"
    },
    "time_stamp": "2019-10-15 07:20:27",
    "text": "Hi"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-15 09:32:19",
    "edited": {
      "time_stamp": "2019-10-15 09:32:39"
    },
    "text": "Hi Samriti, it is possible to filter items exactly like  the <http://prequin.com|prequin.com> site, The functionality actually comes right out of the box there is a filtered tags module and a module which lets you filter in an archive format like the dates you see.\n\nThese can also be built manually using HubL.\n\nTo add custom filters, it’s possible but you will need to have a good understanding of HubL in order to do it. There are multiple ways you can do it, but possibly the easiest might be to use a prefix on a tag, and use that prefix to visually separate the filter, you can then visually hide the prefix when outputting the tag. Clicking that tag will still take you to the tag’s listing page, sorting all of the results."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-15 09:34:39",
    "edited": {
      "time_stamp": "2019-10-15 09:34:57"
    },
    "text": "You would need to assign the tags to the blogs.\n\nIf this isn’t feasible for your project, you could instead make it so that those filters are simply keywords that are entered into a search when clicked.\n\nThis may not always be the best results as that word or similar words would need to be in the posts."
  }
]