[
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-05 04:18:37",
    "text": "I guess if it wasn’t read only, it’d be an absolute nightmare to offer any sort of update functionality, right?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-06-05 06:34:47",
    "edited": {
      "time_stamp": "2020-06-05 06:37:00"
    },
    "text": "Hi Kevin, as Kieran suspected. We want marketplace providers of themes to be able to update them. To be able to grant that, the files must be read-only in the customer’s account, otherwise any marketplace provider issued updates would break customer modifications. The solution for customer specific customization is to clone the module and make changes to the clone. Preserving the integrity of the original.\n\nFor themes created directly in a HubSpot account they do not have this read-only restriction.\n\nThis same read-only reasoning applies to the `@HubSpot` folder which contains the default modules and default themes."
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-05 06:40:45",
    "text": "Makes sense!"
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-06-05 06:50:15",
    "text": "The design manager is the template. For instance, every page should have an h1 toward the top of the page, so you would lock that down to being an h1."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-06-05 06:50:39",
    "text": "there are certain things that shouldn’t be up for discussion on a page-by-page basis, and those are templated."
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-06-05 06:51:05",
    "text": "if you need something more flexible, you’ll need to go with some kind of a WYSIWYG/rich text box, where you can choose the level of heading."
  },
  {
    "poster": {
      "poster_name": "Louis Chaussé",
      "poster_handle": "louis.chausse"
    },
    "time_stamp": "2020-06-05 15:17:35",
    "text": "Hey there! What is the quickest way to move a website from any CMS to HubSpot themes? Can it be partly automated? I see rates that some agencies are charging for migration work and I am wondering how they can do this at a cost so low if it is not automated at all? I saw 3000$ for a site of up to 50 pages. In my opinion, copying the CSS and the JS can be done very quickly but \"rebuild\" everything with HubL takes more time than that, no? If not automated, maybe they are using cheap labour? I'd appreciate your thoughts on that topic.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-06-05 17:05:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2020-06-05 17:05:24",
    "edited": {
      "time_stamp": "2020-06-05 17:06:08"
    },
    "text": "I don’t imagine you’ll be able to automate much. I have a feeling that by “migration” they mean picking a theme close enough and dropping your content in?\n\nReally though, I always try and talk a client out of talking about a “migration”. I don’t feel it makes sense just to migrate a site 1:1 - I think it should be an opportunity to look at UX and the site in general. Additionally, a lot of the CSS and HTML on existing sites may not play well with a drag/drop editor (if it’s not bem/block based) it’;l always be a lot more work!"
  }
]