[
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-06-04 05:32:31",
    "text": "It's selected as an H1 on the right in the design manager. That will lock it down in the editor."
  },
  {
    "poster": {
      "poster_name": "Jessica Shaw",
      "poster_handle": "jshaw"
    },
    "time_stamp": "2020-06-04 14:54:57",
    "text": "Hello all, \nI am currently utilizing the \"Martech\" theme for my new website. I have gone into global settings and changed my colors, fonts, etc. However, I want to be able to have the website menu stay visual on the page as I scroll down. How do I accomplish this or what snidbit of code can I apply to this page for that function to happen. I also want to be able to remove the green hover color on the top bar navigation. \n \nPlease help Thank you in advance."
  },
  {
    "text": "HubSpot TEAM:  I'm curious what the intention is behind making custom modules within a theme read-only?\n\nI can for-see this being an issue when helping customers with a customization to a module or small bug/css fix.   I understand why locking the theme file may be important but wonder about the custom modules.",
    "time_stamp": "2020-06-04 16:09:17",
    "reply_count": 7,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2020-06-04 16:18:29"
      },
      {
        "time_stamp": "2020-06-05 04:18:37"
      },
      {
        "time_stamp": "2020-06-05 06:34:47"
      },
      {
        "time_stamp": "2020-06-05 06:40:45"
      },
      {
        "time_stamp": "2020-06-07 05:49:44"
      },
      {
        "time_stamp": "2020-06-07 07:08:55"
      },
      {
        "time_stamp": "2020-06-08 16:24:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-06-04 16:18:29",
    "text": "For us, it's to prevent any changes in the cloud IDE at all and force all changes to come from GitHub so there isn't a version conflict"
  },
  {
    "poster": {
      "poster_name": "Giovanni Zuanon",
      "poster_handle": "giovanni.zuanon"
    },
    "time_stamp": "2020-06-05 00:50:59",
    "text": "What is the use of having the possibility to change in design manager and then in page editing I can't do anything anymore?"
  }
]