[
  {
    "text": "Hey! I was wondering if anyone can point me in the right direction for setting module attributes for a module that need to render multiple time within a DnD section template.  Attached are the fields for a card module I created that can have text and an icon. I need to be able to set the icon and the text within the DnD file so that the module can render with not all of the same icons across the page. Any ideas?\n\nI just need to be able to set the values within the code snippet below, I just cant seem to make it work. Any ideas would be greatly appreciated!\n\nIf this message would be better off in another channel, I am happy to delete and repost in the proper channel!\n\n```{% dnd_module \n                  path=\"/Studio-Canvas-Theme/modules/Single Card.module\",\n                  horizontal_alignment=\"CENTER\"\n              %}\n{% end_dnd_module %}```",
    "time_stamp": "2020-06-02 10:08:37",
    "edited": {
      "time_stamp": "2020-06-02 10:19:00"
    },
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-06-02 10:56:10"
      },
      {
        "time_stamp": "2020-06-02 11:02:23"
      },
      {
        "time_stamp": "2020-06-02 11:12:22"
      },
      {
        "time_stamp": "2020-06-02 11:13:26"
      },
      {
        "time_stamp": "2020-06-02 11:37:42"
      },
      {
        "time_stamp": "2020-06-02 11:40:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2020-06-02 10:56:10",
    "text": "<@U011DL81GAY> what you can do is. Add your module to a drag and drop template, you can edit the defaults of repeater there. Then you can clone that template to html, and it will have the code snippet on the coded template. Should be able to then convert that snippet to a dnd_module.\n\nKinda weird way to do it, but only way Ive been able to do it"
  },
  {
    "poster": {
      "poster_name": "Brennan Sieck",
      "poster_handle": "brennan"
    },
    "time_stamp": "2020-06-02 11:02:23",
    "text": "<@UATE4ATHP> Thanks! That makes sense and I was totally not thinking about it that way. I'll give it a shot and post back in here with the outcome!"
  },
  {
    "poster": {
      "poster_name": "Brennan Sieck",
      "poster_handle": "brennan"
    },
    "time_stamp": "2020-06-02 11:12:22",
    "text": "<@UATE4ATHP> I set up a page with the modules set up how I would like, but I can't seem to find the option to clone that specific page to HTML. Any ideas?"
  },
  {
    "text": "not a page, a drag and drop template. then you right click and clone to html",
    "time_stamp": "2020-06-02 11:13:26"
  },
  {
    "poster": {
      "poster_name": "Brennan Sieck",
      "poster_handle": "brennan"
    },
    "time_stamp": "2020-06-02 11:37:42",
    "text": "<@UATE4ATHP> It worked!!! Thank you so much for your assistance with this. I can use this same process for so many other similar issues, which is awesome! Thanks again"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2020-06-02 11:40:33",
    "edited": {
      "time_stamp": "2020-06-02 11:40:40"
    },
    "text": "no prob. glad it worked"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-06-02 13:59:32",
    "text": "Hey, all. I'm curious how your workflows have changed with the advent of Themes. Are you using Themes with DnD areas as your primary build method now? Are you sticking with custom coded templates _without_ DnD areas? Or a mixture of both, based on things like project requirements and budget?\n\nThe reason I ask is that our agency uses something we call a \"modular\" approach. I think other HubSpot developers may do something similar. The process is that we have 1 coded template with our global header &amp; footer, and a main flexible column in between. Then we create as many custom modules as the design requires. The main flexible column allows for users to drag and drop custom modules inside of it, essentially giving them the ability to create their own, unique page layouts, while maintaining a level of consistency at the same time.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-06-02 14:02:24"
      },
      {
        "time_stamp": "2020-06-02 14:04:55"
      },
      {
        "time_stamp": "2020-06-03 06:24:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2020-06-02 14:02:24",
    "text": "little bit of both. <https://github.com/HubSpot/cms-theme-boilerplate|HS’s boilerplate theme> really has been helpful in the approach we’ve taken"
  },
  {
    "poster": {
      "poster_name": "Tony Strack",
      "poster_handle": "tstrack"
    },
    "time_stamp": "2020-06-02 14:04:55",
    "text": "Agreed, and I've worked in some of their boilerplate best practices into our own internal boilerplate. Seems like there is a use case for both Themes and this \"Modular\" approach. Just really curious as to what others are doing."
  },
  {
    "text": "Hello! Has anyone ran into this error while editing the fields.json file? I am working on setting up additional fields within an existing group of settings, but I cannot view them because of this error. The fields.json file is not returning and syntax errors, so I am unsure about what could be causing the issue. Any help would be much appreciated!",
    "time_stamp": "2020-06-02 16:21:31"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-06-02 16:22:16",
    "text": "<@U011DL81GAY> scroll up a couple posts"
  },
  {
    "poster": {
      "poster_name": "Brennan Sieck",
      "poster_handle": "brennan"
    },
    "time_stamp": "2020-06-02 16:22:50",
    "text": "<@U25C65C3S> Will do! Thanks for the heads up"
  }
]