[
  {
    "poster": {
      "poster_name": "Adam King",
      "poster_handle": "adam481"
    },
    "time_stamp": "2023-07-21 03:52:43",
    "text": "What Trigger settings should I use if I want to only Enroll folks using the API, yet still support Re-Enrollment. Essentially I don't have anything in my trigger, so therefore the Re-Enrollment settings don't appear.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-07-21 10:42:10"
      },
      {
        "time_stamp": "2023-07-24 03:03:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2023-07-21 06:51:13",
    "text": "Has anyone used google maps api in custom coded actions to calculate distance? Just want to know if its possible. Client wants to compare distance between client and service reps and assign the one that is closest",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-07-21 09:11:25"
      },
      {
        "time_stamp": "2023-07-22 08:12:21"
      },
      {
        "time_stamp": "2023-07-22 08:12:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Katie Broyles",
      "poster_handle": "katie966"
    },
    "time_stamp": "2023-07-21 09:06:20",
    "text": "That would be sick <@U03REFNRMB3>! Yeah, it's been a heck of an issue, and I'm only just learning how to code, so only had some vague ideas on where to start"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-07-21 09:06:56",
    "text": "<@U0594PYFME2> is signor email a custom property on the deal’s record?"
  },
  {
    "poster": {
      "poster_name": "Katie Broyles",
      "poster_handle": "katie966"
    },
    "time_stamp": "2023-07-21 09:11:25",
    "text": "Honestly this is a brilliant idea and I want to follow the thread. My initial thought first is to create a zap between where the client submits a form or set a trigger that anytime that field changes to initiate an update and send it to google sheets. From within google sheets, have it connect to the maps feature, and be sure to have a separate layer with the  service reps and their ideal radius for service. I'm betting there is an even more direct way to do it, but as I'm kinda new to coding this was the first thought that came to my mind."
  },
  {
    "poster": {
      "poster_name": "Jesse Bartola",
      "poster_handle": "jbartola"
    },
    "time_stamp": "2023-07-21 10:42:10",
    "text": "Hey there! are you using the filter-based triggers, or event-based triggers?"
  }
]