[
  null,
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2018-08-27 02:46:39",
    "text": "Hi, i have a client that has a menu which reveals the second level after hovering over the parent.  but i would like to have the second level shown at all times. Can somebody tell me how to do this?"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-27 07:16:38",
    "text": "You can target that UL specifically and add a “display:block” or whatever. I think it’s fairly easy to overwrite since it isn’t declared inline."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-27 11:27:38",
    "text": "Is it not possible to place an editable module in blog post template?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 11:29:07",
    "text": "you can but no longer inside the blog post module itself"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 11:29:21",
    "text": "last week around thursday it appears this change was made,"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-27 11:29:27",
    "text": "You can have it living in the template though right?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 11:29:32",
    "text": "yes"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-08-27 11:30:07",
    "text": "Just not included in the HubSpot default listing/post module?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 11:32:47",
    "edited": {
      "time_stamp": "2018-08-27 11:33:40"
    },
    "text": "this was kind of a controversial change, hot debate last week on it. General consensus though was that while everyone gets that you shouldn’t be able to nest modules inside of eachother - like we were doing with the blog content module, this update if rolled out to older sites will break tons of sites It also kinda made the default module kind of pointless for a lot of us, who aren’t just doing simple blog posts with it."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 11:32:58",
    "text": "no HS employee weighed in"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-27 12:03:06",
    "text": "Yea, I hope it's not a breaking change, that would be catastrophic. I'm pretty sure the site we QC'd early last wt week was editable and it is not. I'll have to check"
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-27 12:03:31",
    "text": "maybe <@U22PU4G4A> or <@U22PNRAJD> can give us some insight into this."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-27 12:04:17",
    "text": "NOTE: i had to seperate the blog listing/post layouts and then add a custom module with the title and elements I needed the modules for. No longer in the \"blog post template\" item..."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 12:34:40",
    "text": "the key thing I’m worried about with it is - is this the sort of change where if we go into an old template that was working  with modules that were done like this previously, and we make a change and try to save it, is it going to break at that moment? that’s a scary thought for us, the majority of sites we maintain have fields in the blog content module."
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2018-08-27 12:41:43",
    "text": "I'm on the same page as you here."
  },
  {
    "poster": {
      "poster_name": "eileenk",
      "poster_handle": "eileenk"
    },
    "time_stamp": "2018-08-27 13:50:45",
    "text": "Has anyone launched a HubSpot site on Cloudflare? We’re having trouble getting the root domain forwarding to work correctly."
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 13:56:08",
    "text": "<@U24PLTUJD> it’s kinda pointless. HubSpot already uses cloudflare",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-08-27 13:57:14"
      },
      {
        "time_stamp": "2018-08-27 14:04:45"
      },
      {
        "time_stamp": "2018-08-27 14:11:27"
      },
      {
        "time_stamp": "2018-08-27 14:22:57"
      },
      {
        "time_stamp": "2018-08-27 14:31:59"
      },
      {
        "time_stamp": "2018-08-27 14:33:18"
      },
      {
        "time_stamp": "2018-08-27 15:20:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "eileenk",
      "poster_handle": "eileenk"
    },
    "time_stamp": "2018-08-27 13:57:14",
    "text": "Gotcha. I'm probably asking the wrong question then haha. Regardless we got it figured out, thank you though!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 14:04:45",
    "text": "Glad you were able to figure it out. but yea just as an fyi HubSpot around like 6 months ago or so integrated cloudflare into their platform to handle caching, I think it’s how they do their SSL certs too. it’s why occasionally when you make css or js changes it takes a bit to see them kick in. (thus the need for the <#CBBAW6Z3R|community-browser-extension> )"
  },
  {
    "poster": {
      "poster_name": "eileenk",
      "poster_handle": "eileenk"
    },
    "time_stamp": "2018-08-27 14:11:27",
    "text": "I think the issue was that we were only using Cloudflare as a DNS, and it sounds like the page roles that handle forwarding won't be active in that case. But it sounds like what you're saying is that if we were straight-up hosting with Cloudflare, we wouldn't have had to run the root domain forward at all?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 14:22:57",
    "text": "I’m not an expert here on cloudflare setups, but I know that HubSpot themselves is already using cloudflare on all HubSpot portals and using it for caching.\n\nRegarding using Cloudflare for DNS I would maybe contact HS support to see what configuration they recommend.\n\nBut otherwise if you implement caching through cloudflare on a HubSpot site, unless Cloudflare is smart enough to detect it, you’re going to be cloudflare caching cloudflare cached assets, possibly leading to super slow cache updates"
  },
  {
    "poster": {
      "poster_name": "eileenk",
      "poster_handle": "eileenk"
    },
    "time_stamp": "2018-08-27 14:31:59",
    "text": "Gotcha, I think. Okay well we got it all worked out, which is what's important, and I doubt it will come up often. I think we were actually noticing the slow cache updates issue earlier. That's really interesting. Ironically I tried to contact HubSpot support about the forwarding issue and they didn't even mention that HubSpot uses Cloudflare for caching, but I guess not every support person will be an expert."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-08-27 14:33:18",
    "text": "Yea, that and it’s one of those more advanced things that’s also relatively new. I would assume a lot of the support people wouldn’t know about it just yet."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-08-27 15:20:45",
    "text": "Thanks for talking through this one <@U7SL518D6> :pray:"
  }
]