[
  null,
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2018-08-08 02:28:39",
    "text": "Hi everybody! i would like to add a custom module to the blog single page layout, but the Design Manager tells me that those modules are not allowed in the single template. If i paste just the html/hubl code in the template it is not displaying correctly"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-08 09:07:06",
    "text": "Is there a channel for the email drag and drop beta?"
  },
  {
    "text": "My question on this is that in the email beta, there looks like you can drag modules over for layout options and in those modules, you can add content to the areas. This would be the perfect functionality to be able to create in CM for pages. Similar to having flexible columns inside CM's.",
    "time_stamp": "2018-08-08 09:19:45",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-08-08 10:22:29"
      },
      {
        "time_stamp": "2018-08-08 10:28:20"
      },
      {
        "time_stamp": "2018-08-08 15:31:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2018-08-08 10:22:29",
    "text": "<@U2H3TT8F2> We're working on something really similar to this on pages! The idea is to have very similar interactions to email, with a few differences that are more suited to pages. In pages, we won't add the ability to add layouts first, but you'd be able to drag modules from the sidebar onto the layout to create new columns and rows."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-08-08 10:28:20",
    "text": "is there a beta scheduled for that for the pages?"
  },
  null,
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2018-08-08 15:31:21",
    "text": "We'll be going into Alpha in the next few weeks. If you have any portals in mind that you think would be a good fit for trying out drag and drop and would be willing to give us lots of feedback, feel free to send them my way!"
  }
]