[
  {
    "poster": {
      "poster_name": "Matouš Najman",
      "poster_handle": "matous"
    },
    "time_stamp": "2024-06-22 01:32:43",
    "text": "Hello, I am trying to map Webflow forms to HubSpot, but i keep getting the error: *PROPERTY_DOESNT_EXIST.*\n```{\"status\":\"error\",\"message\":\"Property values were not valid: [{\\\"isValid\\\":false,\\\"message\\\":\\\"Property \\\\\\\"int-education\\\\\\\" does not exist\\\",\\\"error\\\":\\\"PROPERTY_DOESNT_EXIST\\\",\\\"name\\\":\\\"int-education\\\",\\\"localizedErrorMessage\\\":\\\"Property \\\\\\\"int-education\\\\\\\" does not exist\\\",\\\"portalId\\\":144630777},...```\nI have double checked all the custom properties and the Internal Name (Id) is the same.\n\nSteps i did:\n• Created Private App on HubSpot\n• Created all the custom properties i need on HubSpot (Contact properties)\n• Create a new Flow on Webflow to make POST on form submission -&gt; whenever i try to test the form, i get the error.\nCould someone please help me or point me in some direction? Is there something i have forgotten to do?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-22 16:08:20"
      },
      {
        "time_stamp": "2024-06-23 06:22:08"
      },
      {
        "time_stamp": "2024-06-23 06:24:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sandeep Kumar",
      "poster_handle": "sandeep91085"
    },
    "time_stamp": "2024-06-22 04:05:11",
    "text": "Please point me to the section where Update api is exposed for Timeline event. I can only see updating of Event template.\nIn the create a single event api description I can see it is mentioned that `Creates an instance of a timeline event based on an event template. Once created, this event is immutable on the object timeline and cannot be modified.`"
  },
  {
    "text": "Does the webflow form have fields in it that are being sent that aren’t part of the HubSpot form it’s posting data to? HubSpot will error out if you post anything outside the form definition (which is IMO a hamfisted approach - but i digress).\n\nHubSpot property internal names can’t contain `-` characters they usually get converted to underscores. It's complaining about a property being passed with an internal name of `int-education` which would not be valid.",
    "time_stamp": "2024-06-22 16:08:20",
    "edited": {
      "time_stamp": "2024-06-22 16:08:38"
    }
  }
]