[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-06-04 04:51:00",
    "text": "You could uninstall the app and then recreate it with a super-admin account."
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas689"
    },
    "time_stamp": "2024-06-04 07:55:00",
    "text": "I have a API endpoint that was working fine but as of this morning is returning a CloudFlarte blocked IP error on the HubSpot end; has anyone dealt with this before?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-04 13:23:33"
      },
      {
        "time_stamp": "2024-06-04 13:24:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Pedro Henrique Ferrari Magnago",
      "poster_handle": "pedro.magnago"
    },
    "time_stamp": "2024-06-04 08:09:12",
    "text": "Hello, everyone.\nI'm not sure if there is a way to get what I need, but can someone tell me if there is a way to retrieve all marketing email that I sent, who were the recipients for each one of these emails and the engagements of each recipient.\nI've searched at the documentation, but, I've got kinda confused about the using of each endpoints.\nI'm sorry if this is a basic question, but this is my first time using the API."
  },
  {
    "poster": {
      "poster_name": "Eva Rodriguez",
      "poster_handle": "evarista.se"
    },
    "time_stamp": "2024-06-04 08:21:49",
    "text": "Hello! Has anyone tried retrieving contact data using an api with pagination?"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-06-04 08:31:33",
    "text": "Any update to this issue? <@U03N5FHUHQT>"
  },
  {
    "poster": {
      "poster_name": "Val Kotlarov",
      "poster_handle": "val.kotlarov"
    },
    "time_stamp": "2024-06-04 09:01:43",
    "text": "<@U06KP87QUJW> another question - we have everything secured and only permitted IPs can POST to the servers. If we need to permit specific HubSpot IPs for the private app to be able to post, what are they?"
  },
  {
    "poster": {
      "poster_name": "Bolt",
      "poster_handle": "bolt.shiny220"
    },
    "time_stamp": "2024-06-04 10:22:51",
    "text": "Hello, everyone!\nIt's a great noon today!\nI hope all of you are having this noon together!\n\nNow, I want to get all the tickets which have notes in their activity through API.\nHow can I implement this?\nI tried to use searchAPI of the ticket object, but I failed to get the tickets that have notes in their activity.\nI would appreciate if anyone could help me.\nP.S. <@U06KP87QUJW> I have another problem again, I believe you can help me this time too! :grin:",
    "reply_count": 14,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-06-04 14:36:11"
      },
      {
        "time_stamp": "2024-06-04 14:44:02"
      },
      {
        "time_stamp": "2024-06-04 14:46:46"
      },
      {
        "time_stamp": "2024-06-04 14:50:00"
      },
      {
        "time_stamp": "2024-06-05 00:39:27"
      },
      {
        "time_stamp": "2024-06-05 00:43:56"
      },
      {
        "time_stamp": "2024-06-05 01:23:08"
      },
      {
        "time_stamp": "2024-06-05 02:47:18"
      },
      {
        "time_stamp": "2024-06-06 10:04:32"
      },
      {
        "time_stamp": "2024-06-06 10:05:17"
      },
      {
        "time_stamp": "2024-06-06 10:06:30"
      },
      {
        "time_stamp": "2024-06-06 10:07:58"
      },
      {
        "time_stamp": "2024-06-06 10:08:18"
      },
      {
        "time_stamp": "2024-06-06 10:08:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Aldo Carrillo",
      "poster_handle": "aldo948"
    },
    "time_stamp": "2024-06-04 13:23:33",
    "text": "Yes, I usually receive that error when there are weird characters on the payload. For instance, when creating contacts if the name is something like this: '&lt;script&gt; ..something something &lt;/script?' HubSpot returns that message as a security measure, I imagine your case is something similar"
  },
  {
    "poster": {
      "poster_name": "Thomas Lane",
      "poster_handle": "thomas689"
    },
    "time_stamp": "2024-06-04 13:24:00",
    "text": "ahhh that would explains it, yeah im sending binary data over thanks Aldo"
  },
  {
    "poster": {
      "poster_name": "Willem Reus",
      "poster_handle": "wreus"
    },
    "time_stamp": "2024-06-04 13:31:17",
    "text": "Not really <@U059RH2S34H>. Seems like the (GraphQL) API calls make it appear as if tickets (conversations inbox) and tickets (helpdesk) are the same object, but they are not. And this is confusing as ...\nBut as a result there is no easy fix, and looking at cost-benefits to solve this we decided to leave it."
  },
  {
    "poster": {
      "poster_name": "Rod Waynick",
      "poster_handle": "rodwaynick"
    },
    "time_stamp": "2024-06-04 13:32:31",
    "text": "Is there any way for us to get third party messages into that conversation panel in the help desk view? Im specifically working with ZenDesk"
  },
  {
    "poster": {
      "poster_name": "Rod Waynick",
      "poster_handle": "rodwaynick"
    },
    "time_stamp": "2024-06-04 13:32:44",
    "text": "<@U03N5FHUHQT>"
  },
  {
    "text": "<@U06LHL57QLA> don't think there are APIs which you can use for this in order to fetch tickets which have notes associated with them only. (as far as I know) - maybe someone else can correct me. In my opinion the best approach would be to use the List Tickets endpoint '*/crm/v3/objects/tickets*' using the associations parameter to fetch any related notes and then looping through them and storing a list of IDs on your end. You can use the limit and after parameters to paginate through results.\n\nHOWEVER a ticket might not have a note today and then have a note tomorrow. So I think for the future tickets ideally you create a webhook which is triggered on Ticket Association Changed.\n\nI am tagging <@UD53A9UUR> just in case there is a better way to go about it which I am not aware of :slightly_smiling_face:",
    "time_stamp": "2024-06-04 14:36:11"
  },
  {
    "poster": {
      "poster_name": "Omar Tanti",
      "poster_handle": "omar.tanti"
    },
    "time_stamp": "2024-06-04 14:41:29",
    "text": "<@U06SDFMD947> as far as I know and from a quick research I just did HubSpot do not have a finite list of fixed IPs which you can white list. If it is not safe to open the firewall for the whole infrastructure maybe you can have the server processing HubSpot Webhooks outside of the firewall which just varifies the HubSpot Signatures and then forwards the request through your firewall. Then you can whitelist the IP of the server verifying HubSpot Webhooks only. (if that makes sense - but at least you do not open the firewall for all the servers)"
  },
  {
    "poster": {
      "poster_name": "Bolt",
      "poster_handle": "bolt.shiny220"
    },
    "time_stamp": "2024-06-04 14:44:02",
    "text": "Hi, <@U06KP87QUJW>\nThank you for your reply.\nAnyway, how can I set the association parameter while using List Tickets endpoint?\nCould you please send me an example code?\nI couldn't find any documentation about the association parameter while using List Tickets endpoint."
  },
  {
    "poster": {
      "poster_name": "Bolt",
      "poster_handle": "bolt.shiny220"
    },
    "time_stamp": "2024-06-04 14:46:46",
    "text": "And I completely agree with your opinion that we need Webhook which is triggered on Ticket Association Changed. :smiley:"
  },
  {
    "text": "Of course, there is association fields in the List Tickets endpoint, but I don't know what the object type of Note is. So, I would appreciate it if you could let me know. :grin:",
    "time_stamp": "2024-06-04 14:50:00"
  },
  {
    "text": "Hey there, does anyone know if there's an endpoint to have a user 'Follow' a ticket via the API?",
    "time_stamp": "2024-06-04 14:55:30"
  },
  {
    "poster": {
      "poster_name": "Carlos Rodriguez",
      "poster_handle": "crodriguez952"
    },
    "time_stamp": "2024-06-04 21:55:01",
    "text": "Hello, how can I filter a user through the position field?"
  },
  {
    "poster": {
      "poster_name": "Omar Tanti",
      "poster_handle": "omar.tanti"
    },
    "time_stamp": "2024-06-05 00:39:27",
    "text": "<@U06LHL57QLA> please understand that all the info is already available on the documentation and there are samples online. If you are a Full Dev you should be able to pick this up without my assistance. Please put some effort from your end to unblock this. I am sure you can do it, if you are still blocked reach out."
  },
  {
    "poster": {
      "poster_name": "Bolt",
      "poster_handle": "bolt.shiny220"
    },
    "time_stamp": "2024-06-05 00:43:56",
    "text": "Hi, <@U06KP87QUJW>\nThank you!\nI think I should use two APIs to retrieve the tickets with notes.\nFirst, search tickets with Search API, and then retrieve the tickets using Read API by ticket id that I get the from search API, and using Read API, I have to loop for every tickets and that means I have to use so many APIs as tickets count, doesnt it?\nI just want to implement this by using only one API. :sweat_smile:\nBTW, thank you again and I will try again."
  }
]