[
  {
    "poster": {
      "poster_name": "Makoy Cameña",
      "poster_handle": "marcneilc"
    },
    "time_stamp": "2024-06-21 01:05:45",
    "text": "HubSpotClient.crm.objects.communications.batchApi.read(BatchReadInputSimplePublicObjectId, archived)\nis not working. But in the documentation it works.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-21 10:41:48"
      },
      {
        "time_stamp": "2024-06-23 19:34:34"
      },
      {
        "time_stamp": "2024-06-23 22:12:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "D",
      "poster_handle": "dinesh804"
    },
    "time_stamp": "2024-06-21 01:27:55",
    "text": " <@U072PGW197D> ah gotcha! Yep, that makes sense, just to check when you say you're adding the utm tags are you implying you're creating every combination of utms that can access the landing page and creating zaps for those or are you saying you can create a zap to just pull the utm parameters from the link directly regardless of what the value is? I don't have much experience with Zapier but looking into it as a possible solution.\n\nEssentially we have a non-HubSpot form that isn't accurately collecting form submissions so once someone fills on the form we're currently storing that data in an external database and pushing it to HubSpot from there. The problem is because of this most of our sources indicate they came in from the integration so we're trying to figure out how to either fix the non-HubSpot form to be more compatible with HubSpot's regulations or find some other way to allow HubSpot to make the connection that the pushed in user is the same individual that already have tracking cookies for. Based on what you're seeing here do you think the solution you used would work?\n\nWe have a countless number of sources and campaigns that point to the form as this is our key form so it would be impossible to map out all the possible entryways so if we need to create something new for every combination of utm parameters this might not work for us unfortunately. "
  },
  {
    "poster": {
      "poster_name": "Syed Vilayat",
      "poster_handle": "vilayat.rizvi"
    },
    "time_stamp": "2024-06-21 02:09:14",
    "text": "<@U053QAXA0LR> can you please provide a link for more info for it?"
  },
  {
    "poster": {
      "poster_name": "Ollie Bradley",
      "poster_handle": "ollie.bradley"
    },
    "time_stamp": "2024-06-21 02:11:57",
    "text": "Thank you so much both, got it now :+1:"
  },
  {
    "poster": {
      "poster_name": "Kunal Rwt",
      "poster_handle": "jagmohanrwt1210"
    },
    "time_stamp": "2024-06-21 04:15:06",
    "text": "Hi everyone :wave: I have a property name event date in all of my contact How can get all of the event date from i with api",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-06-21 10:43:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bharat Geleda",
      "poster_handle": "bgeleda"
    },
    "time_stamp": "2024-06-21 05:15:54",
    "edited": {
      "time_stamp": "2024-06-21 05:16:02"
    },
    "text": "<@U03MLCLS5BN>: thanks for getting this on the radar!\n\nIs there a way to track the status on this or know if there's any timeline for this? It would be really great if we could use this for our integration.. happy to give more details on our usecase and what we're trying to achieve"
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-06-21 05:36:59",
    "text": "We have a process in place where we GDPR delete (aka purge, hard delete) contacts through API. Does anyone know if its possible in HubSpot to re-register contacts through API if the contact buys something 2 years after?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-21 10:44:21"
      },
      {
        "time_stamp": "2024-06-21 11:08:27"
      },
      {
        "time_stamp": "2024-06-21 11:30:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Isabelle OMahony",
      "poster_handle": "isabelle.omahony"
    },
    "time_stamp": "2024-06-21 05:44:04",
    "text": "Amazing , thanks so much! :star:"
  },
  {
    "poster": {
      "poster_name": "Aldo Carrillo",
      "poster_handle": "aldo948"
    },
    "time_stamp": "2024-06-21 06:28:56",
    "text": "<https://developers.HubSpot.com/docs/api/crm/timeline|https://developers.HubSpot.com/docs/api/crm/timeline>"
  },
  {
    "poster": {
      "poster_name": "Rahul Yadav",
      "poster_handle": "ryadav"
    },
    "time_stamp": "2024-06-21 06:52:33",
    "text": "Hey, i'm new to HubSpot API's and trying out the access token API inside my Salesfroce Apex class, but i'm not able achieve it. Cananyone help me on steps to follow ?"
  },
  {
    "poster": {
      "poster_name": "Hannah Seligson - Developer Advocate",
      "poster_handle": "hseligson"
    },
    "time_stamp": "2024-06-21 07:16:52",
    "text": "Hey Bharat - the issue has been submitted internally and added to our task board. Unfortunately, we can’t provide an exact timeline for when engineering will be able to complete this, but a few of us are keeping an eye on it so we can see when the change goes live and we will let folks know when it does!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-06-21 10:41:48",
    "text": "difficult to help you with this, you haven’t included error messages, the data going in, etc."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-06-21 10:43:00",
    "text": "you would use the contact api <https://developers.HubSpot.com/beta-docs/reference/api/crm/objects/contacts#get-%2Fcrm%2Fv3%2Fobjects%2Fcontacts%2F%7Bcontactid%7D>\n\nAnd then you would want to make sure you include the property names in your query"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-06-21 10:44:21",
    "text": "what does re-register mean? create a contact? Yes you can create a contact."
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2024-06-21 11:06:02",
    "text": "Hey, just an alert and an ask for similar experiences:\n\nA few weeks ago, the GET endpoints would return an array of File IDs for File Type properties. *Now it returns an array of File URLs.*\n\nI had an integration using the File ID working properly. Client reported the issue and I found this.\n\nJust a heads up, if you have integrations reading Property Files, it may need an update.\n\nIf someone from HubSpot can confirm this change, I'd appreciate it :smile:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-21 11:23:00"
      },
      {
        "time_stamp": "2024-06-21 11:31:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-06-21 11:08:27",
    "text": "Create contact"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-06-21 11:23:00",
    "text": "Thanks for sharing! This is a positive change preventing the need to then lookup the file id for the url."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-06-21 11:30:57",
    "text": "yeah, and if you want to go test it you can test it out and see for yourself"
  },
  {
    "poster": {
      "poster_name": "Matheus Jiran",
      "poster_handle": "matheus"
    },
    "time_stamp": "2024-06-21 11:31:55",
    "text": "Agree!\n\nThank you!"
  },
  {
    "text": "Hello, We are encountering this error when we try to access through an integration we have connected via a auth private application in HubSpot. (First screenshot). But if i include that scope to the url i got this error. (Second screenshot).",
    "time_stamp": "2024-06-21 11:43:50",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-21 12:29:30"
      },
      {
        "time_stamp": "2024-06-21 13:35:53"
      },
      {
        "time_stamp": "2024-06-21 13:41:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-06-21 12:29:30",
    "text": "Hi <@U079LR3NBND>, based on the error message I'm guessing this needs to be added to your app's auth settings as a required or optional scope `e-commerce`\n\nMore information is available in this changelog post <https://developers.HubSpot.com/changelog/advanced-auth-and-scope-settings-for-public-apps>"
  },
  {
    "poster": {
      "poster_name": "Andrew Daltas",
      "poster_handle": "adaltas"
    },
    "time_stamp": "2024-06-21 12:32:40",
    "text": "Not really. Fivetran is finally <https://fivetran.com/docs/connectors/applications/HubSpot/troubleshooting/too-many-records|pointing out the issue in their Troubleshooting section>. When I raised a ticket with them they said that fivetran will not fix it and given the nature of the problem, I don't blame them. HubSpot should at least be providing a field for metadata_updated.\n\nThis has delayed our internal publishing of these tables.\n\nFivetran's proposed solution was to periodically perform a full table resync and that we would be paying for that.\n\nFor now, I like fivetran's ability to just get whatever table we might be interested in. I'm considering manually pruning the fivetran tables by using the HubSpot api to see if all of the objects that purportedly exist have not been archived.\n\nBut given the issues you've had <https://fivetran.com/docs/connectors/applications/HubSpot#customobjects|finding your custom objects>, it might be best for us to consider making our own bespoke HubSpot data sync process. We've got our eyes on making custom HubSpot objects as well."
  },
  {
    "text": "Hello, thank you for the response. As I mentioned earlier, when I add the e-commerce scope to the URL as required, I get an error indicating that the user does not have the necessary permissions to access the application. When I add it optionally, I get the same error in the development console.",
    "time_stamp": "2024-06-21 13:35:53"
  },
  {
    "poster": {
      "poster_name": "Roger Brown",
      "poster_handle": "robrown"
    },
    "time_stamp": "2024-06-21 13:41:55",
    "text": "The classification of the scope is important for the authorization context in the url. Can you share your installation url and the auth settings with me (ok if you want to send over DM)?"
  }
]