[
  {
    "poster": {
      "poster_name": "asher Lin",
      "poster_handle": "asher"
    },
    "time_stamp": "2024-06-13 02:01:06",
    "edited": {
      "time_stamp": "2024-06-13 05:14:28"
    },
    "text": "Hey <@UJJ239SC9> thanks for the reply, we want to send each clients metrics of their performance for the week so the data would have to be dynamic and from external sources but fit the style of a template that I have created using HTML. I was thinking of calling the HubSpot API to populate such dynamic fields so that the numbers are different while style is consistent."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-06-13 07:17:26",
    "text": "• This sounds like a good fit for the single send API\n• I work at HubSpot and can check to see if your subscription has the right subscription types to make that work. Just shoot me over your HubID and I can take a look."
  },
  {
    "poster": {
      "poster_name": "asher Lin",
      "poster_handle": "asher"
    },
    "time_stamp": "2024-06-13 07:18:49",
    "text": "<@UJJ239SC9> 139854299"
  },
  {
    "poster": {
      "poster_name": "Ainars Klavins",
      "poster_handle": "ainars"
    },
    "time_stamp": "2024-06-13 07:44:16",
    "text": "Thank you, will check out the Lists.\n\nThe use case is this - I am making api that would sync HubSpot accounts with another database, but our solution price will depend on amount of contacts, so before doing the sync, we need to understand how many contacts there are."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-06-13 08:19:17",
    "text": "• Another question: It doesn't sound like it, but are these emails that are transactional in nature (i.e. this is a notification of receipt that should not be subject to unsubscribe/resubscribe?)\n• Happy to DM about this if you'd like - what you're trying to accomplish *is possible* with HubSpot, but likely requires at least Marketing Hub Enterprise. \n    ◦ Marketing Single Send requires Marketing Hub Enterprise (not Professional)\n    ◦ Programmable email is available on Marketing Hub Pro for standard object data (contact, company, deal), or Enterprise (include custom object data). \n        ▪︎ Depending on the data type/complexity of your use case, you could potentially just store the data in Contact properties (this use case isn't a good fit if you have 1:Many data type since Contact properties can only store 1 value at a time)\n• The key piece to consider is that HubSpot sent emails can be personalized via data tokens for data that lives on a HubSpot object (i.e. dynamically pull in the Contact first name or the Deal name). \n    ◦ If the data lives on a custom object record, you could pull the data into an email via a token - custom objects are available if you have at least one Enterprise tier Hub\n    ◦ The Single Send API let's you trigger emails 1 by 1 via an API call and include the dynamic/personalized data in each API call\n        ▪︎ <https://www.loom.com/share/c3f81fe7d2d3446d965db1e5073c8bfa?sid=de122600-f83d-4b87-8fbc-8d277741a899|Here's a video where I show how the Single Send Email API works> - you should be able to see a parallel for your use case\n"
  },
  {
    "poster": {
      "poster_name": "asher Lin",
      "poster_handle": "asher"
    },
    "time_stamp": "2024-06-13 08:20:41",
    "text": "Nope it is not transactional! Yes I am aware that we might need to get an enterprise account if we want to do this."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-06-13 08:24:40",
    "text": "Want to shoot me an email and I can connect you with your account team? `rainslie [at] <http://HubSpot.com|HubSpot.com>`"
  },
  {
    "poster": {
      "poster_name": "Violet Tveit",
      "poster_handle": "violeta.tveit"
    },
    "time_stamp": "2024-06-13 08:29:52",
    "edited": {
      "time_stamp": "2024-06-13 08:31:24"
    },
    "text": "Hello Karthik. We have the same issue in our org -- did you ever get an answer? I tried contacting help, but unfortunately, they are non-technical and could provide no update. We have six Apex classes that utilize legacy APIs that are no longer supported\n• HubSpotController\n• HubSpotGlobals\n• HubSpotLeadNurturing\n• HugSpotMessageLogger\n• HubSpotPendingChanges\n• HubSpotVersionResource"
  },
  {
    "poster": {
      "poster_name": "Robson Rodrigues",
      "poster_handle": "rrobh1dire"
    },
    "time_stamp": "2024-06-13 08:42:52",
    "text": "Hello everyone\n\nI need help pulling some data from HubSpot. Specifically, I need:\n1. *Delivery Confirmation*: Proof that a notification was delivered.\n2. *Read Confirmation*: Proof that the notification was read.\nHow can I get this info using the HubSpot APIs? Examples with the endpoints and parameters would be super helpful.\n\nThanks"
  },
  {
    "poster": {
      "poster_name": "Carlos Rodriguez",
      "poster_handle": "crodriguez952"
    },
    "time_stamp": "2024-06-13 10:08:23",
    "text": "I already resolved it"
  },
  {
    "poster": {
      "poster_name": "Jon Martin",
      "poster_handle": "jon175"
    },
    "time_stamp": "2024-06-13 16:41:11",
    "text": "For a short time there were commerce API write end points (a few weeks ago) but now, they're no longer listed in the api documentation. Does anyone have insight into what is going on with them?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-06-13 17:29:49"
      },
      {
        "time_stamp": "2024-06-13 17:48:12"
      }
    ]
  },
  {
    "text": "You mean those?",
    "time_stamp": "2024-06-13 17:29:49",
    "edited": {
      "time_stamp": "2024-06-13 17:30:59"
    }
  },
  {
    "poster": {
      "poster_name": "Jon Martin",
      "poster_handle": "jon175"
    },
    "time_stamp": "2024-06-13 17:48:12",
    "text": "Yes those"
  },
  {
    "text": "Does anyone know how to get the property details with property event webhook?",
    "time_stamp": "2024-06-13 17:49:41"
  }
]