[
  {
    "poster": {
      "poster_name": "Gabriel Perte",
      "poster_handle": "gabriel.perte"
    },
    "time_stamp": "2022-05-30 01:05:44",
    "text": "Hello, I'm having problems getting an idea about how this sort of blog search might be done: <https://www.safebreach.com/resources/blog/> .  Shortly, blog posts loading on the same page using the blog post article style"
  },
  {
    "text": "Hello! I created a module that retrieves data in a HubDB table and displays it. It works fine in the template page but as soon as I preview it (and in the new window as well) everything disappears (see screenshots attached) :disappointed: Do you have any idea why it's behaving this way and how to fix it? Thanks :pray:",
    "time_stamp": "2022-05-30 02:03:00",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-30 10:57:32"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Quentin Maison",
      "poster_handle": "quentin.maison"
    },
    "time_stamp": "2022-05-30 02:03:50",
    "text": "In this example it is supposed to show 'table_test' and 'row 1' as in the first screenshot"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2022-05-30 02:36:20",
    "text": "you would need to use on form ready, on formsubmit fires after the data has already gone, if you need to do something on the traditional submit, inside you’re onFormReady do a .on(‘click’,function(){}) on the submit button, (even though this is just a click event it works when the user hit’s enter to submit the form, I assume HubSpot triggers a click or something)"
  },
  {
    "poster": {
      "poster_name": "Andreas Katzian",
      "poster_handle": "andreas.katzian"
    },
    "time_stamp": "2022-05-30 10:57:32",
    "text": "Hi, I think this heavily depends on how you are doing the data fetch. Check this:\n• Is the hubdb table a module field you can edit for the page? \n• Did you allow the “public API access” for your hubdb table? -&gt; Check settings of the table\n• Did you enable your webpage for dynamic content?"
  },
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2022-05-30 14:23:23",
    "text": "I think this is a bug and I've found two previous mentions from <@UFURR5PM3> this April and <@UA5DFM7CK> last April.\n\nWhen you change a module's parameter from `\"global\": true`  to `\"global\": false`  in the meta.json file, in the editor it's no longer showing the global overlay, but when you click into it it has the \"The creator of this template prevented editing this module in the content editors.\" message.\n\nI've even tried creating a new local module from scratch, not touching the meta.json file and copying over the HTML, CSS and fields files and still no go :smiling_face_with_tear:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-05-30 14:41:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Barry Grennan",
      "poster_handle": "barry"
    },
    "time_stamp": "2022-05-30 14:41:05",
    "text": "I luckily hadn't made too many changes after changing from local to global, so I was able to use my revision history without too much loss"
  }
]