[
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-07-12 01:56:53",
    "text": "We're thinking about a few ways to tackle that problem, one of the issues with loading in the stylesheets that way is that we can't be sure which of them will actually impact the CTA where it ends up being loaded, we could end up with a compound of 3 or 4 different styles all adding to each other. One of the alternative ideas we had was to provide a way to directly link a CTA to a specific style sheet and we'd load that stylesheet down with the CTA wherever it's embedded. Does that sound like it might work?  Do you have an example of some of the CSS you use today?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-07-12 13:43:48"
      },
      {
        "time_stamp": "2018-07-12 14:26:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-12 04:16:49",
    "text": "something more easy could be set a setting portal where we drop there our CSS (so you have it separate from the other and can load by JS for external portals and in the preview to generate the right image). Another option is the ability to link to a separate CSS file.\n\nI sometimes have different CTAs and I manage through custom classes so that should work fine.\nThen or you inject it in the frontend or give us a way to call the file as we call the basic and recommended CSS files with:\n`{{ get_public_template_url( \"HubSpot/styles/responsive/required_base.css\") }}`"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-12 04:21:28",
    "edited": {
      "time_stamp": "2018-07-12 04:21:45"
    },
    "text": "otherwise, we will need to link to each CTA a file and that won't be too nice (another step to handle, and for current portal will be a pain if you have several CTAs :disappointed: ) meanwhile with the global setting can be handled as a general stylesheet even with different CTA styles :slightly_smiling_face:\nAnd you could extract the right styles even for CTAs on email where you need to style inline :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-07-12 05:27:57",
    "text": ":ok_hand: great feedback, thanks Gonzalo!"
  },
  {
    "text": "Idea: add option to module field groups to collapse/expand by default. Use case: collapse advanced options, just the way Advanced Options are on the page editor &gt; settings.",
    "time_stamp": "2018-07-12 12:55:39"
  },
  {
    "poster": {
      "poster_name": "Peter Emerson",
      "poster_handle": "pete-the-balls-guy"
    },
    "time_stamp": "2018-07-12 12:57:42",
    "text": "I like that idea, sometimes we have fields that are super tall, like when we want someone to paste in SVG code and this would make them more user friendly."
  },
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-07-12 13:43:48",
    "text": "I like the idea of a separate stylesheet simply for CTA's"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-07-12 13:45:40",
    "text": "In the DMv1 (might be two as well) Form Module, once you select a form, have a way to clear that so the default \"Get a free widget\" form can appear. I find myself having to create a sample form in client portals when doing templates that require them so they don't end up creating pages and accidentally leaving the wrong form on there."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2018-07-12 14:26:07",
    "edited": {
      "time_stamp": "2018-07-12 14:26:11"
    },
    "text": "We're thinking that this could also be a neat way to \"share\" CTA styles across portals or even sell them on the marketplace too :thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-07-12 17:38:45",
    "text": "Default contact/company/deal records/fields by team vs the whole company "
  },
  null
]