[
  {
    "poster": {
      "poster_name": "Francisco Andres Sierra Munoz",
      "poster_handle": "fransierra.s.15"
    },
    "time_stamp": "2020-11-17 09:08:27",
    "text": "How do I know if I passed or failed? :astonished: Do I receive an email or do I check on <http://app.HubSpot.com/academy|app.HubSpot.com/academy> for any updates?"
  },
  {
    "poster": {
      "poster_name": "Jeff Ausura",
      "poster_handle": "jausura"
    },
    "time_stamp": "2020-11-17 09:13:42",
    "text": "Just checked it out. Passed! Haha. Clowns... I think this may be the first clown themed page I've seen. Definitely had the IT clown here and there, but this one is very colorful and clown-centric"
  },
  {
    "poster": {
      "poster_name": "Francisco Andres Sierra Munoz",
      "poster_handle": "fransierra.s.15"
    },
    "time_stamp": "2020-11-17 09:22:00",
    "text": "Wow, thanks a million! I had done a cat app with React a few months ago so I decided to go with clowns this time. I’m proud of it, but Pasta Grannies is the best example I’ve seen so far :laughing:"
  },
  {
    "poster": {
      "poster_name": "Jeff Ausura",
      "poster_handle": "jausura"
    },
    "time_stamp": "2020-11-17 09:24:59",
    "text": "Haha. It's really well done. To be honest it's so polished I'm not sure if you're genuinely enthusiastic about clowns or if it's done in jest (get it, JEST!) Ugh."
  },
  {
    "poster": {
      "poster_name": "Jeff Ausura",
      "poster_handle": "jausura"
    },
    "time_stamp": "2020-11-17 09:25:06",
    "text": "Yeah, pasta grannies is on some kind of level"
  },
  {
    "poster": {
      "poster_name": "Fang Zhang",
      "poster_handle": "rzhang401"
    },
    "time_stamp": "2020-11-17 20:01:06",
    "edited": {
      "time_stamp": "2020-11-17 20:13:37"
    },
    "text": "Hello everyone, can i ask a silly question?\ni built a custom module with multiple fields and added it to the drag and drop template, but there is no default content appear in the template. it says \"this component has no editable file\", but i do have like text or menu in the custom module. Why is that?\nI can see the default value for the reusable fields in the preview of the custom module, but I cannot change the field value in a template level. There isn't a menu under the default content."
  },
  {
    "poster": {
      "poster_name": "Fang Zhang",
      "poster_handle": "rzhang401"
    },
    "time_stamp": "2020-11-17 20:14:59",
    "text": "please, anyone? i think im missing some setting things but just cannot figure it out."
  }
]