[
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2024-05-15 03:13:11",
    "text": "So, in conclusion, it was a pre-rendering problem. It was fixed thanks to the support ticket that raised the issue and followed up with the internal team."
  },
  {
    "poster": {
      "poster_name": "Ahmed Jamal Tariq",
      "poster_handle": "ahmed.jamal.tariq"
    },
    "time_stamp": "2024-05-15 05:18:52",
    "text": "I'm getting empty data with `{{ contact }}` on the `hubl` template after a form submission. It started happening all of the sudden and when sometimes when testing the page in incognito window it works.  Does anyone know what's going wrong?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-05-15 08:04:42",
    "edited": {
      "time_stamp": "2024-05-15 08:05:15"
    },
    "text": "Haven’t tried it but you might be able to `require_css` within your section template. Thus effectively doing what you’re asking. It may not work, but… it might just work."
  },
  {
    "poster": {
      "poster_name": "Wesley Clock",
      "poster_handle": "wesley575"
    },
    "time_stamp": "2024-05-15 10:50:05",
    "text": "You joke but also bring up a very good point."
  },
  {
    "poster": {
      "poster_name": "Wesley Clock",
      "poster_handle": "wesley575"
    },
    "time_stamp": "2024-05-15 10:52:04",
    "edited": {
      "time_stamp": "2024-05-15 10:53:33"
    },
    "text": "Any way I can avoid this?\nThese user's have not been cookied by our site as they were part of an acquisition ( we acquired a competitor of ours).\n\n• I need to send them their appraisals \n• BUT that dollar amount _*needs*_ to be shown on the landing page _*not*_ in an email\n• Because including large dollar amounts in email to users (who you don't have a sending history with) can cause the emails to go to spam."
  },
  {
    "text": "Hi all - I'm on our Product team and wanted to share that we've built a way to make files uploaded to custom file properties 'public' (rather than private, which was what was preventing these fileIDs from being used externally). This change will apply only to newly created custom file properties in the short-term, but we plan to enable it for existing file properties in the longer-term.\n\nIf you'd like access to this change &amp; would be willing to test it out, please share your portalID and I can give you access today.",
    "time_stamp": "2024-05-15 10:57:30"
  },
  {
    "poster": {
      "poster_name": "Tony Felice",
      "poster_handle": "tf959"
    },
    "time_stamp": "2024-05-15 10:58:22",
    "text": "Often, devs will hash the params somehow, and decode them on the server side. I think that may be a good idea just to avoid putting the idea in people’s heads, as that URL did.\n\nEven after obfuscating the params, it’s still just as easy to edit a page in devtools and take a screenshot. You could add a JS listener to the element displaying the offer, and if the value in the DOM doesnt’ match the server side value you’re comparing it to, it rewrites the DOM with the correct value."
  },
  {
    "poster": {
      "poster_name": "Daniel Wong",
      "poster_handle": "dan.wong"
    },
    "time_stamp": "2024-05-15 19:57:15",
    "text": "<@U053QAXA0LR> i spoke to support and they rolled back the updates for me. I then had to reupload the ones which were causing issues to overwrite the values back to string rather than ID.\n\n<@U07104JNL15> how would this work in terms of dynamic pages? The file_by_id function can only be used 10 times per page so if I had a listing, it would simply break half way through."
  }
]