[
  {
    "poster": {
      "poster_name": "Balagopal K.V.",
      "poster_handle": "bala459"
    },
    "time_stamp": "2020-09-10 09:38:14",
    "text": "Hi! Is there any way we can customize the positioning and the size of the chatbot?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-10 14:33:00"
      },
      {
        "time_stamp": "2020-09-10 14:35:13"
      },
      {
        "time_stamp": "2020-09-11 00:03:11"
      },
      {
        "time_stamp": "2020-09-11 16:40:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Seth.I.D.",
      "poster_handle": "seth.dorr"
    },
    "time_stamp": "2020-09-10 14:33:00",
    "text": "The ability to put the widget on Left/Right was added awhile back, but currently styling options with positioning are reserved to the more technical solutions with CSS and such.\n\nThis idea contains a lot of those conversations and especially on the fourth page where folks are sharing their CSS where they've bumped the Chat widget up pixels to clear bottom page bars.\n\nAnother one where they even adjust the iframe chat window during chat too.\n\n<https://community.HubSpot.com/t5/HubSpot-Ideas/More-Chat-Widget-Styling-Options/idi-p/13806>"
  },
  {
    "poster": {
      "poster_name": "Seth.I.D.",
      "poster_handle": "seth.dorr"
    },
    "time_stamp": "2020-09-10 14:35:13",
    "edited": {
      "time_stamp": "2020-09-10 14:35:19"
    },
    "text": "I up-voted the idea, I suggest you do the same and get anyone else to as well to show the Product team we really want to see more styling options without having to use code!"
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2020-09-10 16:11:33",
    "text": "Are there any hooks for firing client-side callbacks/events via chatbots or even just accessing the interactions via JS?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-09-10 22:24:39"
      },
      {
        "time_stamp": "2020-09-11 09:55:53"
      },
      {
        "time_stamp": "2020-09-11 12:17:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adam Wright",
      "poster_handle": "adam377"
    },
    "time_stamp": "2020-09-10 17:13:31",
    "text": "Barring that, do chatbot conversations and live chats via widget both use the `conversation ID` that can be listened for in the browser? If that ID is (or could be) passed along in the payloads for webhook or code snippet actions, that could create an opportunity to react to chatbot activities in the browser"
  },
  {
    "poster": {
      "poster_name": "Seth.I.D.",
      "poster_handle": "seth.dorr"
    },
    "time_stamp": "2020-09-10 22:24:39",
    "text": "No idea, I would love to know this as well. We are forging new paths with using the Code snippets and Webhooks and looking for any resources or examples.\n\nNot sure if they help but here's everything I was able to find so far on webhooks or code snippets with bots and HubSpot.\n\n<https://HubSpotdev.slack.com/archives/C019VT42R8X/p1599614344011300>"
  },
  {
    "poster": {
      "poster_name": "Balagopal K.V.",
      "poster_handle": "bala459"
    },
    "time_stamp": "2020-09-11 00:03:11",
    "text": "Thanks Seth! How can we do this through CSS? We're slightly struggling with this aspect at the moment. We've tried changing the size and the position but it doesn't seem to be working out for us so far."
  }
]