[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 05:41:45",
    "text": "You can using a work around but it's not great. You use a group around the field set to 1 condition, and the field set to the other. Both have to be true for it to show"
  },
  null,
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2019-01-17 09:14:36",
    "edited": {
      "time_stamp": "2019-01-17 09:14:56"
    },
    "text": "<@UEZ3125LL> does spinning up a AWS instance through OpenVPN cost money? I do not have much experience with that"
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-01-17 09:30:41",
    "text": "<@U26BLKGE4>, I'd be interested in hearing if you find anything for this. Upgrading from Pro to Enterprise just for this seems like quite the expense, at least on the surface. Plus, I'd need to get the brand domain add-on. So I'd love to hear if you can find something decent that isn't just \"build it from scratch\""
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Dustin Locke",
      "poster_handle": "dustin"
    },
    "time_stamp": "2019-01-17 11:40:57",
    "text": "So more newbie questions: are most people here using/making drag and drop templates? Or just html+hubL?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 11:46:09",
    "text": "I build drag n drop primarily as clients tend to prefer atleast the illusion of them being able to go into a drag n drop template and make minor changes(most of my clients don’t actually ever edit their own templates).\n\nWhen it comes to email templates I mostly do coded because I’ve been doing email marketing for several years and prefer the control."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 11:48:25",
    "edited": {
      "time_stamp": "2019-01-17 11:48:41"
    },
    "text": "for website pages, blog pages etc. drag n drop templates while they take getting used to. Once you have a system worked out, they’re almost as flexible as coded."
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2019-01-17 11:50:34",
    "text": "I agree with Jon, most of our clients prefer to hear that the website is built in a \"drag and drop\" editor that allows them to go in and manipulate templates if they needed to (even though most never touch their own website). When possible I prefer to build using Bootstrap 4 in a html/hubl template however and it's just as flexible on the front end when it comes to creating pages."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 11:51:34",
    "text": "There is one situation that I do exclusively build in coded templates for website pages/blogs now.\n\nand that’s if the client’s got 2 sites that are supposed to look identical (wordpress + HubSpot, Shopify +HubSpot) etc. in those cases it’s substantially easier to do coded, then I can maintain the exact same files as the other site with just tweaks for HubSpot"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-01-17 12:09:27",
    "text": "I'm yet to encounter a client who really wants a drag and drop template.  Any needs they may have for manipulating templates are met using customizable modules in flexible columns.  That way, they never even need to think of touching the design manager."
  },
  {
    "poster": {
      "poster_name": "Dustin Locke",
      "poster_handle": "dustin"
    },
    "time_stamp": "2019-01-17 12:16:50",
    "text": "Next question: from my ~2 days building, it feels like hubL delivers a lot of extra markup (like `menu` outputting a ul nested in two divs or something). Is there a way around this or is it just how it works? Or am I doing something wrong?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 12:20:55",
    "text": "The menu module does render a fair amount of html, and brings with it some automatic accessibility features. due to the automatic accessibility stuff being awesome, I would just use CSS to make it look how you want.\n\nYou can if you really hate the navigation system HubSpot has, use HubDB or a custom module to build your own custom menu code. Though the editing experience will not be as good as the menu editor HS has"
  },
  {
    "poster": {
      "poster_name": "Dustin Locke",
      "poster_handle": "dustin"
    },
    "time_stamp": "2019-01-17 12:21:49",
    "text": ":thumbsup:"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-01-17 12:26:14",
    "text": "for other hubl tags, if you're looking to limit extra markup, the `no_wrapper=True` parameter can be pretty helpful"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 12:30:23",
    "text": "I will note though - use `no_wrapper=true` when it makes sense to. the wrapping span tags that get generated are for a feature HS has on the back burner, related to making things easier to edit in the page editor."
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2019-01-17 12:52:14",
    "text": "Anyone have issues accessing drag and drop builder for emails? It doesn't show as an option for some of our clients even though they have Marketing Pro"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 12:55:56",
    "text": "the drag n drop templates are possible through the design manager.\n\nThe drag n drop email builder however is a beta, not everyone has it"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2019-01-17 12:57:41",
    "text": "Yeah, weird. We have a number of clients with it and a number without, it seems"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2019-01-17 12:58:45",
    "text": "Thanks <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 12:59:00",
    "text": "I believe though you can request for a portal to be added to that drag n drop builder <#CES6JU0RY|drag-drop-email-beta>"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2019-01-17 12:59:37",
    "text": "Awesome!"
  },
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-01-17 13:55:18",
    "edited": {
      "time_stamp": "2019-01-17 13:55:37"
    },
    "text": "dumb question im sure but how do i stop the logo module from resizing the image to be smaller? for some reason, its shrinking the logo, even though the branding settings have a larger logo in them and the I have adjusted the column width"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 13:56:34",
    "text": "I’ve had that problem before, forgot the solution I used but I you could ovveride the site settings logo instance and link to the logo with ?noresize"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-01-17 13:57:17",
    "text": "not a great solution but it’d work.\n\nOr clone the module and add a field for controling the resize so you could put it at like 2x in-case the full res version is insanely huge"
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-01-17 13:59:53",
    "text": "Yeah, you'd pay the costs for the AWS instance and bandwidth. It looks like an existing OpenVPN instance you could buy is about 2 cents per hour. If you're not familiar though with setting up cloud hosting and server config, this probably wouldn't be the best choice though."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-01-17 14:16:03",
    "text": "yea i might just do a CM for it. the logo module seems wonky"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-01-17 14:16:10",
    "text": "Thanks <@U7SL518D6> :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-01-17 14:21:12",
    "text": ":wave: New doc about creating a complete form within in a custom module! Please feel free to hmu with any questions.\n<https://designers.HubSpot.com/how-to-create-a-form-module-in-a-custom-module>"
  },
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 15:54:48",
    "text": "Hello folks.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-01-17 15:59:07"
      },
      {
        "time_stamp": "2019-01-17 15:59:33"
      },
      {
        "time_stamp": "2019-01-17 16:00:15"
      },
      {
        "time_stamp": "2019-01-18 10:04:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-01-17 15:59:07",
    "text": "What's up <@UFHQCMR8X> - welcome to the party :tada:. We're excited to have you a part of our community :bmo:"
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 15:59:33",
    "text": "I am really seeing amazing possibility with HubSpot. So it is great to be here"
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:00:15",
    "text": "I have questions, but I am not sure how to articulate the questions. This is my problem right now."
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:03:54",
    "text": "I need to make a calculator on a landing page that shows the potential client a result and that also updates the 'contact properties'."
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:04:08",
    "text": "The calculator will most likely need to be a custom module with custom css design."
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:04:49",
    "text": "I went through about 2 hours of tutorials on how HubSpot works on the design side. I am just not seeing any in depth tutorials on how eerything connects."
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:05:30",
    "text": "I got tasked with this job. I am very confident with coding and css. I am just not confident on how all this should be set up."
  },
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 16:07:07",
    "text": "Are there any tutorials that show how to make a custom modules with custom css that also updates the contact properties? If I can just see one of these and how it works. This would clear up so my questions and questions I am not sure that I have right now.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-01-17 16:14:49"
      },
      {
        "time_stamp": "2019-01-18 09:44:31"
      },
      {
        "time_stamp": "2019-01-18 09:46:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "James Cutler",
      "poster_handle": "jcutler"
    },
    "time_stamp": "2019-01-17 16:14:49",
    "text": "Hi <@UFHQCMR8X>, you can reference the modules section of our designers docs here - <https://designers.HubSpot.com/docs/modules/getting-started>\nPer the goal of updating contact properties from a web page, this can be done in two ways:\n1. Forms - You could potentially leverage client-side JavaScript to manually submit a HubSpot form that has been populated with the desired values. More on that here <https://developers.HubSpot.com/docs/methods/forms/advanced_form_options>\n2. API - You can leverage the contacts API in order to create/update contacts in HubSpot. Note that HubSpot API do not allow CORS, so the information on the page will need to be sent through a middle-tier application (like Zapier, or a custom-built application)\nOverall, custom modules allow for a lot of flexibility in terms of empowering the end user/marketer to display content on a page. They do not possess any functionality that allows for automatic updating of any objects in HubSpot."
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Michael Bruce Allen",
      "poster_handle": "codeamend"
    },
    "time_stamp": "2019-01-17 18:16:16",
    "text": "Is there an expert at custom modules, that updates contact properties when used, that would be interested in a paid 1 on 1 with me? I just need some quicker access to questions and I am running out of time. I am also doing all the tutorials I can get my hands on.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-01-17 20:31:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-01-17 19:45:18",
    "text": "Hey Patrick, unfortunately I haven't been recommended any quite yet, and as you say, \"roll your own\" seems to be the popular alternative. Still have some research to do though, and I'll definitely keep you posted if I find anything else."
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2019-01-17 20:31:15",
    "text": "Sent you a PM, I’ll be happy to help you out free of charge. "
  },
  null
]