[
  {
    "text": "so extension is created but it doesn't show up in the customization section even though i have reinstalled the app. <@U06NHDWP5UG> any idea?",
    "time_stamp": "2025-02-12 06:53:01"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-02-12 06:55:20",
    "edited": {
      "time_stamp": "2025-02-12 06:56:21"
    },
    "text": "you probably need to use the upload command to upload the project to your developer account - hs project upload"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-02-12 06:57:16",
    "text": "you can add the account with hs project upload --account=999999 or something like that - look it up"
  },
  {
    "text": "i did run and got successful build also. uploading is working fine",
    "time_stamp": "2025-02-12 06:58:40"
  },
  {
    "poster": {
      "poster_name": "Kiara Munz",
      "poster_handle": "kimunz"
    },
    "time_stamp": "2025-02-12 13:43:01",
    "text": "Did you install the app with the `tickets` scope group? If it is an optional scope, there is a chance you did not install it with that. If the install does not authorize the `tickets` read scopes,  the helpdesk card will not show up."
  },
  {
    "poster": {
      "poster_name": "Richard Marques",
      "poster_handle": "richardm"
    },
    "time_stamp": "2025-02-12 18:57:28",
    "text": "Very new to HS development, and my UI Extension was working fine. This morning the sidebar container for the extension, an the powered by XYZ renders in the UI, but none of the components. I also see the same thing happening with a 3rd party UI extension tat I had installed to trial. Is there some global issue or is this specific to my portal?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-12 19:26:47"
      },
      {
        "time_stamp": "2025-02-13 04:52:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Richard Marques",
      "poster_handle": "richardm"
    },
    "time_stamp": "2025-02-12 19:26:47",
    "text": "After a brilliant support call with HubSpot support we diagnosed that the issue is related to network. Moving from the office network onto my phone resolved the issue. If anyone has any documentation or advice on setting up firewall settings etc. for HubSpot UI extensions that would be much appreciated, else it's going to be a trial and error approach!"
  },
  {
    "poster": {
      "poster_name": "Praveen",
      "poster_handle": "praveen"
    },
    "time_stamp": "2025-02-12 23:10:03",
    "text": "i did install it with `tickets` scope"
  }
]