[
  {
    "poster": {
      "poster_name": "Twan Derks",
      "poster_handle": "twan"
    },
    "time_stamp": "2023-04-11 04:36:01",
    "edited": {
      "time_stamp": "2023-04-11 04:36:51"
    },
    "text": "Hi,\n\nMy use case is as follow:\n1. i have two portals connected to my app\n2. when i change a property in one portal the event hook is triggerd and i get the portal id with the changed property\n\nQuestion:\nHow can i use the event with portal id to call endpoints?\n\nI use one auth for the app and this autogerenate refresh token and store in DB\nProgramming language: PHP",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-11 07:09:02"
      },
      {
        "time_stamp": "2023-04-23 11:39:21"
      },
      {
        "time_stamp": "2023-04-24 09:05:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-04-11 07:09:02",
    "text": "No unfortunately each token is tied to the portal directly, so you need to keep that token and refresh that token each time it dies you can't just call the endpoints with the portal id"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-04-11 07:47:44",
    "text": "Has there been a change with marketplace notification emails for purchase/download notices? There's supposed to be a notification setting for that, but I'm not seeing one anymore. Some people on our team are weird and don't like all of the notifications from Marketplace. :) Anyone able to help?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-11 08:06:31"
      },
      {
        "time_stamp": "2023-04-11 08:14:25"
      },
      {
        "time_stamp": "2023-04-11 09:08:13"
      },
      {
        "time_stamp": "2023-04-11 10:59:41"
      }
    ]
  },
  {
    "text": "Settings &gt; Your Preferences &gt; Notifications &gt; Marketplace",
    "time_stamp": "2023-04-11 08:06:31"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-04-11 08:14:25",
    "text": "Hey thanks! I knew this was there of course, but I could swear that \"New asset purchase by a customer\" was not there last week. I had people getting notices that didn't used to and this didn't seem to be there for me to help them. Maybe it was off for a bit for something?? Who know, but either I can be excited that it's back or concerned for my eyesight. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-04-11 09:08:13",
    "text": "I'm not sure if it changed recently, maybe it was rolled out incrementally? I started getting the notifications automatically several months ago without changing my settings"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-04-11 10:59:41",
    "text": "Yeah, we've been getting notifications for a long while now... but those that didn't want them turned that off. Then last week, everyone started getting them again and there was no place to turn it off. We were all checking and that particular checkbox was just gone. We had reached out to a couple people to ask about it and didn't hear back. After your reply today, I went and looked and lo and behold... the checkbox was back! Not sure how long it was gone, but must have been some temporary snag in the mix. Team members have confirmed that it was better. They thought that I had fixed it, but it was just their preference being acknowledged again. Weird. :slightly_smiling_face:"
  }
]