[
  {
    "poster": {
      "poster_name": "Imran Mohammed",
      "poster_handle": "imran532"
    },
    "time_stamp": "2024-12-06 07:34:44",
    "text": "Hi Everyone, \nNeed a little help in figuring out a thing: \nI'm actually integrating hubSpot with my platform in which, I need to fetch essential CRM data i.e,deals , contacts , activities (calls/meetings) from users. Created a public app and added necessary scopes. While working on this, i didn't find any such API link for activities. To be more precise about activities, I need to fetch meetings/calls/appoinments/engagements data from those corresponding users. \nI found links for contacts,deals\n<https://api.HubSpot.com/crm/v3/objects/contacts|https://api.HubSpot.com/crm/v3/objects/contacts>,\n<https://api.HubSpot.com/crm/v3/objects/deals|https://api.HubSpot.com/crm/v3/objects/deals>\n\nI tried using this link for meetings \n<http://api.HubSpot.com/engagements/v1/engagements|api.HubSpot.com/engagements/v1/engagements>\nBut it didn't work. \nAlso tried appointments, but it didn't work.\nIf possible, can any of you please help me with this?? Also what scopes should I need to add when I do that? (crm.objects.appointments.read didn't work when I tried for appointments entity)."
  },
  {
    "poster": {
      "poster_name": "David Boyd",
      "poster_handle": "dboyd"
    },
    "time_stamp": "2024-12-06 07:41:06",
    "text": "Hello\n\nWe are in the process of a POC to verify if HubSpot Content/CMS Hub can fit into a Composable DeCoupled Headless Frontend Architecture.\n\nThe POC is built using a React App that will pull data from a commerce platform as well as to interact with it, for such things as login, cart, order placement and other commerce activities.\n\nWant the React App to be able to pull a page from HubSpot Content/CMS and then be able to inject commerce data as needed or to handle any of the CTA.\n\nFor example, create a simple login template which has a dnd banner area on top, left hand side of a 2 column table would be the login name and password and then right hand side of the table will be another dnd area -\n\nThen create a webpage from this template, have the content editor manage the dnd areas, then have the react app pull the page down.\n\nWe did a test using the following API from curl\n\n<https://api.hubapi.com/cms/v3/pages/site-pages?state__in=PUBLISHED_OR_SCHEDULED&amp;slug=login%27|/v3/pages/site-pages?state__in=PUBLISHED_OR_SCHEDULED&amp;slug=login'> \\\n --header ‘Authorization: Bearer &lt;code&gt;’\n\nBut the results doesn’t contain a representation of the page.\n\nI think I might be using the wrong endpoint here so looking for some guidance in this area as well as confirmation if the POC makes sense.\n\nWe are also looking at ContentFul for example in order to do proper comparison"
  },
  {
    "poster": {
      "poster_name": "Loris Anobile",
      "poster_handle": "anobileloris"
    },
    "time_stamp": "2024-12-06 10:07:25",
    "text": "Hi - I am trying to migrate `landing_pages` from an HS-account to another.\n\nNow what is driving me crazy is. If I use `list_landing_pages`  I get a `templatePath`  property.\n\nBut then to get the template I can ONLY use `templateId`  - what am I doing wrong?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-09 08:13:55"
      },
      {
        "time_stamp": "2024-12-09 08:15:07"
      },
      {
        "time_stamp": "2024-12-09 08:19:01"
      },
      {
        "time_stamp": "2024-12-10 09:22:47"
      },
      {
        "time_stamp": "2024-12-12 07:15:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "DemandHub Support",
      "poster_handle": "support144"
    },
    "time_stamp": "2024-12-06 12:31:07",
    "text": "Hello! We are noticing some issues with the Survey feature.\n\n<https://www.loom.com/share/79f602e95901405d8aec90002123762e>\n\nEssentially the survey keeps reappearing for the user, even after they have submitted a score and a message. Is there any additional logic we are supposed to include?\n\nWe followed the identity logic provided in this documentation: <https://developers.HubSpot.com/beta-docs/reference/api/analytics-and-events/tracking-code#identify-a-visitor>"
  }
]