[
  {
    "poster": {
      "poster_name": "Zach Klein",
      "poster_handle": "zach282"
    },
    "time_stamp": "2024-12-20 01:35:39",
    "text": "Hi <@U083S9VFJ2F>, the *expirationSeconds* parameter takes a *duration in seconds*, not a timestamp. So, if you want the URL to be accessible for 1 minute, your endpoint would look something like this:\n```<https://api.hubapi.com/files/v3/files/{$attachment_id}/signed-url?expirationSeconds=60>```"
  },
  {
    "poster": {
      "poster_name": "Raza",
      "poster_handle": "raza.ataki"
    },
    "time_stamp": "2024-12-20 02:24:02",
    "text": "okay thank you I will try and update you if it's works"
  },
  {
    "poster": {
      "poster_name": "Harkirat Dhanoa",
      "poster_handle": "harkirat"
    },
    "time_stamp": "2024-12-20 06:36:37",
    "text": ":wave: Hello, team! Our customers have been facing issues while trying to add OAuth connections for our integration (Dashworks, App ID: 209505). According to <https://community.HubSpot.com/t5/APIs-Integrations/OAuth-Connection-Error-for-Non-Super-Admin-Users/m-p/932530/highlight/true#M71422|this> community post, having a super-admin connect it once should've been enough for all members of the org to connect. Still non-admins are facing issue despite having App Marketplace Access. Could someone please help us unblock them?"
  },
  {
    "poster": {
      "poster_name": "Lee M",
      "poster_handle": "lee467"
    },
    "time_stamp": "2024-12-20 08:47:09",
    "text": "Greetings all.\n\nIn short: Deal's unpublished quote line items are being removed after another quote is published.\n\nSituation - Someone creates a deal in HubSpot, we have created an internal company website where someone can enter a HubSpot deal id and another systems quote id which basically uses HubSpot api code to port over the quote data and create a new quote for that deal in HubSpot.  This works great.  Say they have 2+ quotes in draft status.  They open quote #1 and publish it.  After quote 1 is published, if you go to quote 2 and when you get to viewing line items, all the products are gone.\n\nIs this a bug or feature of HubSpot?  Is it because I created the quotes with the api?",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-20 08:51:47"
      },
      {
        "time_stamp": "2024-12-20 10:02:49"
      },
      {
        "time_stamp": "2024-12-20 10:05:51"
      },
      {
        "time_stamp": "2024-12-20 10:06:14"
      },
      {
        "time_stamp": "2024-12-20 10:14:58"
      },
      {
        "time_stamp": "2024-12-20 10:18:43"
      },
      {
        "time_stamp": "2024-12-20 10:26:30"
      },
      {
        "time_stamp": "2024-12-20 10:33:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lee M",
      "poster_handle": "lee467"
    },
    "time_stamp": "2024-12-20 08:51:47",
    "edited": {
      "time_stamp": "2024-12-20 08:52:09"
    },
    "text": "Just did a test, after publish, if you quote again, the new quote has line items.  It's like once you publish all quotes in draft mode get erased"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:21:00",
    "text": "It is very hard to determine what is going on because you are using the node project and not just using axios. You could have an old version. Depending if you are using this in your own code or a workflow or a serverless function it could be different versions. \n\nIf you were using axios and gave the actual error message and the file you are uploading we would have a better chance to be able to proceed with helping "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:22:59",
    "text": "Did this work for you? I’ve always used a very simple regex match to do this but I’d never catch that typo with it"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:24:12",
    "text": "6 is the max, there isn’t a way to get more. You do have filter groups. It’s possible you could do a better job of combining your search query’s but you haven’t given an example of what you are doing. \n\n"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:26:44",
    "text": "This is a solid answer for just about anything with programming. Sometimes you create something with the ui, then read it via the api, it helps you see the different things in how they are set, etc. "
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-12-20 09:30:59",
    "text": "not sure what Axios had to do with anything, but if you mean to use the api directly without the SDK, pretty sure we tried that as well, with no success.\n\ntldr: we were migrating our client from Zoho to HS, and inside Zoho they had an image field - using their API, we got the Buffer for the image as well as the image name, then we tried saving it using the HS files API"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:32:57",
    "text": "You would update the contact owner property \n\nYou will likely need to get the proper ids and owners mapped in your code. Look up the contact owner on one of the contacts you know the owner of. Then you see their id. You can also use api to access this if you have a bunch. But for auto associating a contact record you need the contact id. So your mapping would need to factor that in as well. If you are looking to map this data very easily and allow for users to change this information and update it over time, building this data out in a hubdb table might be a good direction to go\n\nYou can also do this in a workflow without code. "
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-12-20 09:33:22",
    "text": "either way, under the hood the SDK uses the API, so it shouldn’t really matter what we used. the response from the API was as mentioned above - Unsupported media type"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-12-20 09:34:30",
    "text": "might be that zoho is providing us with corrupted Buffer or something, since we never had trouble with your API / SDK previously"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:35:33",
    "text": "Public or private app?\n\nPrivate app isn’t related to a user authorizing in, so you are granting the app to have content access. \n\nIf it is a public app I have no clue or where to find that. I decided to google HubSpot public app scope api and this was the top result \n\n<https://developers.HubSpot.com/docs/guides/apps/authentication/scopes|https://developers.HubSpot.com/docs/guides/apps/authentication/scopes>\n\nI only looked at it briefly and didn’t verify that content was in there. "
  },
  {
    "poster": {
      "poster_name": "Caedmon Mullin",
      "poster_handle": "caedmon.m"
    },
    "time_stamp": "2024-12-20 09:37:48",
    "text": "Thanks Nicholas, I'd missed that document, that had exactly what I needed."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:42:19",
    "text": "I create notes and mess with the create engagement options to assist, then I add details to the note in a structure that I can filter and digest in other parts of my app I’ve built on this. \n\nYou just upload file and associate with note and not with record. \n\nThere has been lots of talk and stuff in here ideas board for attachments. I haven’t checked to see if something made it into beta yet. Might be worth searching around the HubSpot settings and see if that has something or some beta APIs"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:44:59",
    "text": "the user is cookied and you have the HubSpot tracking code on that domain you will be able to see page views in the contact record and you can create reports around this\n\nThese are all very default features. Send it to yourself, open the email up and see what happens. It is better to log out of HubSpot when doing this or to use an incognito window imo but that can complicate things. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:47:15",
    "text": "What is the follow thing?\n\nSo that is an internal api and not a public api. It may need authentication \n\nError 401 aligns with that, as that is a typical authentication error message \n\n<https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/401|https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/401>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:50:42",
    "text": "I suggest adding some logging functionality for mathxung email and record ids. Log that stuff to a file and you can determine what is going sideways. \n\nLog out the email addresses, log out the properties, that way you can see the path of everything. Log inputs and outputs. \n\nWithout you putting some data out there for us to look at there is zero way we can help solve. We can just say look at the data and share it"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:53:35",
    "text": "The documents state that the headers have content type application/json\n\nI didn’t look at all the endpoints but most of HubSpot APIs work in that content type"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:58:27",
    "text": "I don’t believe there is a create conversation. There are beta APIs that allow for reading this data and updating to some amount <https://developers.HubSpot.com/docs/guides/api/conversations/inbox-and-messages?_gl=1*15ycsbw*_gcl_au*NjUyMzA5MzM4LjE3MzMxODEyNDU.*_ga*NDEyODUyODQ5LjE3MzMxODEyNDM.*_ga_LXTM6CQ0XK*MTczNDcxMjQ2NS43LjEuMTczNDcxMzc5NS41LjAuMA|https://developers.HubSpot.com/docs/guides/api/conversations/inbox-and-messages?_gl=1*15ycsbw*_gcl_au*NjUyMzA5MzM4LjE3MzMxODEyNDU.*_ga*NDEyODUyODQ5LjE3MzMxODEyNDM.*_ga_LXTM6CQ0XK*MTczNDcxMjQ2NS43LjEuMTczNDcxMzc5NS41LjAuMA>.."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 09:59:29",
    "text": "You can have your integration send an email to tigger the new conversation to the inbox you want it to, but this is likely a major work around and I have no clue any of the requirements of you app"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:01:51",
    "text": "What quotas are you speaking about specifically? There are ways to move up your limits if you want to pay. Some don’t raise with those limits iirc depending if you are talking about total requests per second or ten second or the month. \n\nAs mentioned above private app and public app have different limits. \n\nFor some clients have we use three different private app api keys to help us manage the api quotas"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:02:49",
    "text": "I have dealt with this before Lee. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:05:51",
    "text": "I worked with a team that would have multiple quotes per deal. We found that the line items on the deal would change to the most recently updated quote but I hadn’t noticed that line items in the quote disappeared. \n\nWe created a work around and told the team they needed to publish the quote that was active so that it was updated. \n\nIt might be possible to do this via api? I dunno about that api at all"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:06:14",
    "text": "Is there a reason to not publish them?"
  },
  {
    "poster": {
      "poster_name": "Lei Ming",
      "poster_handle": "lming"
    },
    "time_stamp": "2024-12-20 10:08:14",
    "text": "Thanks all for the info. I read the above doc earlier. My understanding is that the quota limit in the doc is per account. My question is if there’s is quota limit cross multiple accounts ? e.g IP-based quota limit."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:08:57",
    "text": "Is this a public app or private app. "
  },
  {
    "poster": {
      "poster_name": "Cristian Ursena",
      "poster_handle": "cristian.ursena"
    },
    "time_stamp": "2024-12-20 10:09:06",
    "text": "thank you"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:09:42",
    "edited": {
      "time_stamp": "2024-12-20 10:09:55"
    },
    "text": "You can have multiple private apps. The limits are per private app"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:10:27",
    "text": "I don’t see any up address based quota on that page, is there something you are seeing that creates this worry?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:11:11",
    "text": "I’m just trying to get as many questions answered on this little break of time I had. Whenever you do get into that, will you respond back and let me know what type of account contact needs or whatever? For the content scope? I am a little curious."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:12:09",
    "text": "Are you able to get a public URL that you can do a file upload via URL?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:13:39",
    "text": "The reason why I mentioned without the SDK is because if I looked at the air, it would likely be something I could understand for the sdk we’re logging"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:13:43",
    "text": "Error "
  },
  {
    "poster": {
      "poster_name": "Lei Ming",
      "poster_handle": "lming"
    },
    "time_stamp": "2024-12-20 10:13:58",
    "text": "My question is more about clearing some concerns from other Integration, which has shared quota cross accounts. Then based on the doc and discussion, looks HubSpot does not have the shared quota cross multiple accounts."
  },
  {
    "poster": {
      "poster_name": "Caedmon Mullin",
      "poster_handle": "caedmon.m"
    },
    "time_stamp": "2024-12-20 10:14:44",
    "text": "Well, thanks for spending your break so helpfully!\n\nAs for the account type, it depends what the content scope is used for by the looks of it. We're using it to create HTML email templates for use in marketing emails, so our users will need Marketing Hub Professional or Enterprise."
  },
  {
    "poster": {
      "poster_name": "Lee M",
      "poster_handle": "lee467"
    },
    "time_stamp": "2024-12-20 10:14:58",
    "text": "<@U25PYL3Q8> thanks for the info.  So we have a different system that quoting is done that the sales person will basically send 2-3 quotes using different sets of products to the client so the client then can pick which option to go with.  So we can then create multiple quotes in a HubSpot deal which the sales person will then need to go to each quote to publish and grab the url of each quote to send to the client for them to determine what option they like best.\n\nThe current way is to add one quote, then publish then add the next quote then publish which works but isn't not idea."
  },
  {
    "poster": {
      "poster_name": "Lee M",
      "poster_handle": "lee467"
    },
    "time_stamp": "2024-12-20 10:18:43",
    "text": "To me you should be able to publish many quotes (all with unique url to view), the client then can pick of the multiple quotes the one they want as winner for the deal."
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-12-20 10:26:11",
    "text": "&gt; Are you able to get a public URL that you can do a file upload via URL?\nnope, sadly they have auth middleware for the images / uploaded files in general, and I don't think they have an option to make it publicly available\n\nit's not 2 big of a deal since worst case scenario is we manually migrate those files as this custom object has only about 350 records and only about 30% have those file fields filled :gun:"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:26:30",
    "text": "Yeah. That is the problem we had as well Lee. We couldn’t find a reasonable way to work in the system. \n\nI have no clue if this is the way it is supposed to be.  "
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-12-20 10:27:48",
    "text": "&gt; The reason why I mentioned without the SDK is because if I looked at the air, it would likely be something I could understand for the sdk we’re logging\nnot sure what you mean with this, but all good"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-12-20 10:27:49",
    "text": "Thanks! \n\nParent pick up line goes fast when you are looking through a backlog of unanswered questions in here!"
  },
  {
    "poster": {
      "poster_name": "Lee M",
      "poster_handle": "lee467"
    },
    "time_stamp": "2024-12-20 10:33:23",
    "text": "<@U25PYL3Q8> ok, thanks for the info.  I was just hoping I maybe had to associate differently but doesn't sound like it.  I am going to keep digging into api.  If I find a resolution I will let you know."
  },
  {
    "poster": {
      "poster_name": "Joaquín Sateler",
      "poster_handle": "jsateler"
    },
    "time_stamp": "2024-12-20 11:01:35",
    "text": "Do you know If i can use the beta APIs you sent with a private app?"
  },
  {
    "poster": {
      "poster_name": "Joaquín Sateler",
      "poster_handle": "jsateler"
    },
    "time_stamp": "2024-12-20 11:05:09",
    "text": "Can i use the beta \"Create custom channels\" API through a private app?"
  },
  {
    "poster": {
      "poster_name": "Nageswara Mannem",
      "poster_handle": "nageswara"
    },
    "time_stamp": "2024-12-20 17:15:45",
    "text": "Hi, I am trying to use an api marked as \"beta\" (Automation/Sequences) and I am getting below error related to not having enough scopes. While in fact \"automation.sequences.read\" scope is already given (it was shown on the consent screen as well). Does this problem sound familiar to any of you ? Thanks.\n```[HubSpot] failed to get sequences {\n  \"status\": \"error\",\n  \"message\": \"This app hasn't been granted all required scopes to make this call. Read more about required scopes here: <https://developers.HubSpot.com/scopes>.\",\n  \"correlationId\": \"0effd922-6483-4e1e-81b2-*****\",\n  \"errors\": [\n    {\n      \"message\": \"All of the following scopes are required.\",\n      \"context\": {\n        \"requiredGranularScopes\": [\n          \"automation.sequences.read\"\n        ]\n      }\n    }\n  ],\n  \"links\": {\n    \"scopes\": \"<https://developers.HubSpot.com/scopes>\"\n  },\n  \"category\": \"MISSING_SCOPES\"\n}```",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-20 17:27:53"
      },
      {
        "time_stamp": "2024-12-20 17:29:30"
      },
      {
        "time_stamp": "2024-12-20 21:46:54"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nageswara Mannem",
      "poster_handle": "nageswara"
    },
    "time_stamp": "2024-12-20 17:27:53",
    "text": "extra context: 1. these are the scopes requested from the user: \"automation.sequences.read automation.sequences.enrollments.write crm.objects.companies.read crm.objects.companies.write crm.objects.contacts.read crm.objects.contacts.write crm.objects.deals.read crm.objects.marketing_events.read crm.objects.marketing_events.write crm.objects.owners.read crm.schemas.companies.read crm.schemas.companies.write crm.schemas.contacts.read crm.schemas.contacts.write timeline\". 2. I am using the access token obtained from OAuth flow. 3. Other API calls are working fine."
  },
  {
    "poster": {
      "poster_name": "Nageswara Mannem",
      "poster_handle": "nageswara"
    },
    "time_stamp": "2024-12-20 17:29:30",
    "text": "I am using node.js SDK and using `apiRequest` method."
  },
  {
    "poster": {
      "poster_name": "Nageswara Mannem",
      "poster_handle": "nageswara"
    },
    "time_stamp": "2024-12-20 21:46:54",
    "text": "i think i found the issue. node.js SDK doesn't add auth automatically when using .apiRequest method."
  }
]