[
  {
    "text": "Hi, I am trying to create new contacts using the POST endpoint\n<https://api.hubapi.com/crm/v3/objects/contacts>\nI tried integrating into my application but doesnt work, so I decide to test directly on the official api docs.\ntesting it on postman, gives an error.-1st Image\nI have used my access token and used it as Auth(bearer Token)-2nd image\nI have also used my access token as Oauth 2.0-3rd Image\nlastly, I deceided to include the apikey in the params and also used my access token as Oauth2.0 - 4th image\nBut at the end of the day, none works.\nI would really appreciate feedback and response on this, Thanks.",
    "time_stamp": "2024-12-21 01:08:32",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-21 14:58:58"
      },
      {
        "time_stamp": "2024-12-23 01:14:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dev dev",
      "poster_handle": "devdivakar8"
    },
    "time_stamp": "2024-12-21 03:14:18",
    "text": "I checked with support. Adding attachment without *engagement* is not possible for now."
  },
  {
    "poster": {
      "poster_name": "Zach Klein",
      "poster_handle": "zach282"
    },
    "time_stamp": "2024-12-21 14:58:58",
    "edited": {
      "time_stamp": "2024-12-21 14:59:45"
    },
    "text": "Hi <@U086S7U99DE> :wave:\nIf authorising using a Private App access token, this needs to be supplied as a request header (key\n```Authorization```\nand value\n```Bearer {{your_private_app_access_token}}```\n).\nRemove all query string parameters you aren't using (i.e. the ones where the <string> placeholders are still present). You can do this by unchecking them. Also, remove the 'hapikey' query string parameter. Authorisation using a 'hapikey' is generally no longer supported (except for a small number of cases involving developer accounts).\nThat should get you closer to a success reponse :fingerscrossed:"
  },
  {
    "poster": {
      "poster_name": "Vishnu Aru",
      "poster_handle": "vishnu.aru"
    },
    "time_stamp": "2024-12-21 22:07:33",
    "text": "Thanks <@U25PYL3Q8>,\nwill try this."
  }
]