[
  {
    "poster": {
      "poster_name": "Jake Kohl",
      "poster_handle": "jake421"
    },
    "time_stamp": "2024-12-26 08:43:37",
    "text": "Hello all - I was directed here for my question since HubSpot support couldn't provide me the specifics for my question. I am looking to make spam management more easily manageable as my options are limited to just being able to leverage HubSpot.\n\nWhen in the Help-Desk view, you can mark a conversation as spam and it will delete the ticket and the conversation + mark them as spam. Support was not able to tell me if there were any other CRM object updates that occur when I performed this action within the UI - so I am looking for any opinions or experience with replicating the `Mark-As-Spam` functionality in Help Desk using the APIs."
  },
  {
    "poster": {
      "poster_name": "Juan Mercado",
      "poster_handle": "juan.mercado"
    },
    "time_stamp": "2024-12-26 13:43:47",
    "text": "Hi guys, do you know how to add more properties into the webhooks? (the one created from private applications)  .. I'm setting a hook that notify me once a new user is created or updated (in order to sync with other system).. but into the requests I'm not having the created user id (just the creator and that's useless for this project).",
    "reply_count": 13,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-26 23:48:52"
      },
      {
        "time_stamp": "2024-12-27 05:11:35"
      },
      {
        "time_stamp": "2024-12-27 05:12:33"
      },
      {
        "time_stamp": "2024-12-27 05:31:43"
      },
      {
        "time_stamp": "2024-12-27 05:36:59"
      },
      {
        "time_stamp": "2024-12-27 05:37:09"
      },
      {
        "time_stamp": "2024-12-27 05:41:41"
      },
      {
        "time_stamp": "2024-12-27 05:43:24"
      },
      {
        "time_stamp": "2024-12-27 05:43:50"
      },
      {
        "time_stamp": "2024-12-27 05:44:19"
      },
      {
        "time_stamp": "2024-12-27 05:44:48"
      },
      {
        "time_stamp": "2024-12-27 05:45:45"
      },
      {
        "time_stamp": "2024-12-27 05:56:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nadheem",
      "poster_handle": "ahamed.nadheem"
    },
    "time_stamp": "2024-12-26 23:48:52",
    "text": "Hey <@U086YAZKJRX>, If you are configuring the webhook via Private Apps means once the webhook is received into the system you have to fetch those details through API, If you are configuring the webhook through the workflow means you can able to customize the requests in the workflow itself."
  }
]