[
  {
    "poster": {
      "poster_name": "Peter Rastello",
      "poster_handle": "peter"
    },
    "time_stamp": "2020-07-08 12:45:50",
    "text": "Hi, I am new at Hubl and am trying to build a simple navigation module in an attempt to learn more about the language. I have defined a menu structure in settings, successfully created a module using the menu Hubl tag and wish to style the default vertical bulleted list of parents and children into a horizontal fly-out menu that only shows the top level parent items at rest, and the children upon mouseover. I've made some progress, but without being able to see the HTML generated by the menu tag, I am guessing about the menu structure. Is there reference material that shows the HTML for this menu tag? If not, how do I apply classes to an unknown structure like this? Make sense?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-08 13:17:18"
      },
      {
        "time_stamp": "2020-07-08 14:40:32"
      },
      {
        "time_stamp": "2020-07-08 14:41:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-07-08 13:17:18",
    "text": "<@UBETLG6CC> So there are actually qutie a few different ways to go about building a HS navigation and you can flex just about as much or as little control over the process as you would like. Here is an article giving you an overview of a lot of the possibilities: <https://developers.HubSpot.com/docs/cms/building-blocks/menus-and-navigation>\n\nHere is the actual markup for the menu tag: <https://developers.HubSpot.com/docs/cms/building-blocks/menus-and-navigation/menu-tag>"
  },
  {
    "poster": {
      "poster_name": "Peter Rastello",
      "poster_handle": "peter"
    },
    "time_stamp": "2020-07-08 14:40:32",
    "text": "Thanks BJ, this looks like what I was looking for - I'll try applying some of those selectors and adding some others based on the menu markup you shared. not sure how I missed all that in the documentation."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-07-08 14:41:45",
    "text": "No worries! I have def missed a lot of things in here before. Its pretty exhaustive and there are a lot of nooks and crannies haha Best of luck!"
  }
]