[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2020-07-19 08:13:09",
    "text": "Just picked this thread up, here's some feedback here and I hope it's useful cc <@U7SL518D6> (or even, has been addressed? in the roadmap)\n\nphpstorm,webstorm,intellij (pretty legit IDEs for web developers, the last one less so) don't have active Jinja2 plugins. There are some ansible playbook jinja stuff but it won't really help. The good thing about this is that you could have a clever `.editorconfig` for setting CSS/templates/whatever to use Jinja. This is my IDE of choice for all sorts of languages mostly out of muscle memory.\n\n&gt; I used to do Drupal 7 / Drupal 8 sites for uk bluechips and PHPStorm was used pretty much exclusively... so it seems some support this way would help D7/D8 devs not just go bleurgh this doesn't work for my workflow (however \"dinosaur\"-like PHPStorm is, it's still a very veeery good IDE even for TS/JS/Vue/React/whatever.\nVS Code *is* gaining popularity for sure, it's not my cup of tea, but I guess if I wasn't already semi-active on this HS channel (and wasn't familiar that you should search for things in a Slack before you ask the same question and then have to wait 24h for somebody to wake up)\n\nSo, yes, the Jinja thing is fine, but I guess you'd need to then set up a project specific workflow file.\n\nIt seems to me a slightly missed opportunity somewhere that HubSpot don't provide a \"VS Code Pack\" and also by extension, include project-level settings as I know many developers who have struggled to understand how on earth to change say, CSS in this case, to Jinja.\n\nThe boilerplate could come with these project settings I am guessing for both IDEs, even simply just for VS Code, simply match all the relevant Jinja templates `src/xx/*.css` etc etc...\n\nMaybe this has been fixed but I am currently working on a handful of projects where developer onboarding is really seamless, I also have problematic 3rd party development firms who don't for example use Prettier as they prefer Sublime Text 2/3 etc...\n\nIs this somewhere in the roadmap? I notice the HubL extension macro/mixin/tab completion thing which is cool but if you lose people at syntax highlighting... all of that good stuff goes to waste"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-19 08:36:46",
    "edited": {
      "time_stamp": "2020-07-19 08:37:34"
    },
    "text": "We agree good tooling matters and thats why we made it possible to code locally. We will continue to keep building on what we have to make the experience even better. The other advantage of local development, you can use your own tools, preferred code editor, extensions etc. So if we dont yet have an extension or tool you think would be useful, you dont have to wait on us, its probably a good candidate for a project.\n\nAll of the code editors you mentioned as far as I'm aware  support open source submitted projects. The hubl vs code extension is open source, the boilerplate is open source. Jinjava (the open source part of HubL) is open source. You can litterally add the improvements you'd like and benefit the entire community. \n\nOpen source work is great for your career as well because you can show your work to potential employers and prospects."
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-07-19 09:01:44",
    "text": "oh yes, I totally understand. + definitely agree with your latter point, I am on a daily open source live stream almost daily and I started my entire career on contributions to FOSS. :pray:\n\nI could chat to the hubl templating folks first see if they've thought about it as it seems with support for your own code editor. There may be a weird edge case or even some appetite *to* develop IDE specific configurations etc. :smile: (so might save some time here) ;-)\n\nIs there an active conversation or some thread around the other sort of issues e.g. everyone needs a sandbox essentially (online), I know that's sort of how it works, but I am wondering in future if there would be support for this?\n\nI thought the intro videos were really useful, host is friendly and makes sense and I was wondering if there was an appropriate forum (ideally really a voice call) with HS internal, people in the open source community etc? e.g. not getting on the phone to sales teams.\n\nUltimately, from experience w/ £100K-1Mill+ CMS budgets the HubSpot CMS seems a steal for what it offers, all the sales/marketing suite to drop in etc etc... but there's still some stuff that, maybe only to me, seem to be a lot of places where some finesse would make this really sweet and it'd be better to raise this with some sort of feedback loop (with developers?!)"
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-07-19 09:02:42",
    "text": "of course there is also the idea of the sandbox accounts not having full access to the suite so the OSS developers would probably be sometimes using the clients HS account, maybe this is all worked out :slightly_smiling_face: I'll read on... but yes, agree, good suggestions, thanks!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-19 09:21:11",
    "edited": {
      "time_stamp": "2020-07-19 09:29:56"
    },
    "text": "We are actively trying to improve the developer accounts to give them more functionality akin to normal accounts. There will always be some functionality that for security would not be supported in a free developer account(ability to mass email for example, as that makes it easy to abuse for spam.)\n\nRegarding meetings between HS and open source community members. We do sometimes meet on an individual basis. An example is a developer built a popular api library, he communicated he personally could not maintain it any longer, and asked us if we would take it on, we did. We dont have say big group ones or have a regular cadence for these its just when it makes sense for all involved.\n\nAnd historical context before joining HubSpot i created the developer chrome extension, contributed to the hubl language vs code extension and was building a framework similar to the HubSpot boilerplate. Each were public community driven open source projects. HubSpot was good to me and when i would present a good solution to a problem we occasionally collaborated or in some cases features i was going to build, HubSpot would implement directly inside HubSpot instead.\n\nKeep in touch we dont have a dedicated say \"open source team\". We just have a lot of folks internally that are inspired by what the community builds and want to see things flourish further."
  },
  {
    "poster": {
      "poster_name": "Steve Mount (stemount // ste.london)",
      "poster_handle": "sm"
    },
    "time_stamp": "2020-07-19 09:28:02",
    "text": "for sure, cool :slightly_smiling_face:"
  }
]