[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-27 01:56:07",
    "text": ":face_with_peeking_eye: I actually meant the left hand side... oops.\n\nBut yes, a custom card on the left, with a button that can kick off a workflow is what i'm after"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-02-27 09:10:23",
    "text": "I don't think a \"button\" on the left is possible but I do think adding a \"property\" on the object which you can call \"Trigger {Workflow Name}\" would be a viable option.\n\nYou can then build a workflow that listens for the \"property changed\" event and allow for objects to be enrolled more than once.\n\nWhen \"Trigger {Workflow Name}\" is \"Yes\" - enroll object.  At the end of the workflow you can clear out this property so if you need to run it again, you can then select it.\n\nHope that makes sense."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-02-27 09:11:33",
    "text": "More on this...I have created a single-select field called \"actions\" where I can place multiple values inside and branch on each value.  Essentially, when the \"actions\" property is changed, the workflow branches based on the selected value."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-02-27 09:20:13",
    "text": "Hey Ryan, thanks for coming back! So interestingly... I actually think i've got the button to work (almost)!\nMy only problem is for some reason, I cannot get the contact email to pull through to the function... I'm quite new to using projects/private apps as i'm used to doing customcode in workflows where it's much easier to map your input/output variables etc.\n\nIn my react file I have a button with onclick, and a function.js file which makes a post to the workflow api onclick. But the URL needs the contact email and i keep getting undefined in my logs...\n\nI don't suppose you have any sample files you could share with me on how you get contact data into these functions? It seems to be so simple and yet i'm not getting it right..."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-02-27 09:34:04",
    "text": "Can you share a screenshot of your local?"
  },
  {
    "poster": {
      "poster_name": "Sydney Hodges",
      "poster_handle": "sydney630"
    },
    "time_stamp": "2024-02-27 14:50:19",
    "edited": {
      "time_stamp": "2024-02-27 14:51:40"
    },
    "text": "<@U01QVR44MEY> Hey Carter - I tried both. I am now running the function on a dev server. I get logs in the terminal when I run the serverless function via an extension card, however when I try to call the serverless function from a webhook, I don't get any logs. Furthermore, when I call the function via the card, it all works. And when I call the function via a webhook (and confirm the inputs are sent & received properly, and it begins to run), it doesn't work. It looks to be getting caught when I use an external api (Google Sheets)... but it is hard to confirm what is really going on, as I have no logs :sweat_smile:"
  }
]