[
  {
    "poster": {
      "poster_name": "Fred Sandoval",
      "poster_handle": "fred.sandoval"
    },
    "time_stamp": "2024-08-16 01:40:17",
    "text": "Thanks Annie! My computer was acting out so I had to “sudo” it but it worked. Thank you soooo much :star-struck:"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-16 07:17:41",
    "text": "Hi everyone :slightly_smiling_face: I'm looking to do something in my mind which is fairly simple, but i'm struggling to make it work.\n\nI want to display a custom card on a contact, which will display various things along with 2 alert banners.\n1 alert banner (which is working) looks at 10 different properties on the contact record, and if any of them are null/blank it returns a danger alert of something along the lines of \"these mandatory fields are missing: 'list of fields' \" - or - returns a \"all mandatory fields completed\" success alert banner.\n\nThe 2nd alert banner is the same concept, but with deal properties (from a deal which is associated to the contact with a specific association label). There will be multiple deals association, but only ever 1 deal with this association label on each contact record.\n\nI cannot get this 2nd alert to correctly display. I've amended my code probably 100+ times now and I still cannot get this to work.\nI'll post a code snippet in the thread, but i'm wondering what you method would be of doing this in the simplest way as my code has gotten longer and longer as i've tried to get it working....",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-08-16 07:19:03"
      },
      {
        "time_stamp": "2024-08-16 07:34:12"
      },
      {
        "time_stamp": "2024-08-16 07:47:19"
      },
      {
        "time_stamp": "2024-08-16 07:48:00"
      },
      {
        "time_stamp": "2024-08-18 23:42:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-16 07:19:03",
    "text": "```        const dealAssociations = await fetchAssociations(\"contacts\", context.objectId, \"deals\", {\n          label: \"internal_ref_of_label\",\n        });```"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2024-08-16 07:34:12",
    "text": "Hey Stacey. Is this code in a react card of a serverless function? Are you seeing any console errors?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-16 07:47:19",
    "text": "Hi Seth! Exactly right - this is in my react card file, and my serverless functions are doing something else based on other content in the file (buttons/onclick).\n\nI can't see any console errors at all, despite trying to debug.\nI've tried to get the deal by association label, i've tried to get ALL associated deals on the contact and filter by something specific to then return the fields i want, but still having trouble.\n\nAt this point i've over-complicated it to myself :face_with_peeking_eye:"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2024-08-16 07:48:00",
    "text": "Is this uploaded to a project somewhere? If you dm me your portalId where its uploaded I can take a look :slightly_smiling_face:"
  }
]