[
  {
    "poster": {
      "poster_name": "Dorian McFarland",
      "poster_handle": "dorian475"
    },
    "time_stamp": "2024-08-06 03:32:10",
    "text": "I spent a bit of time trying to find this out yesterday and couldn't see any documentation for supported libraries for Node v20. Everything I could find was Node v16. Are there any plans to update the docs?"
  },
  {
    "poster": {
      "poster_name": "Samuel Ballesteros",
      "poster_handle": "sballesteros"
    },
    "time_stamp": "2024-08-06 14:30:04",
    "text": "Does anyone know why the date input field in custom workflow actions lessens one day when selecting any date, for example, when the calendar opens and I click August 6, it will put August 5 instead (one day before the one selected). This happens with any case, does anyone have any idea?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-07 14:44:22"
      },
      {
        "time_stamp": "2024-08-08 15:54:22"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2024-08-06 16:14:39",
    "text": "Hi <@U03REFNRMB3> So I have this so far: <https://github.com/aw249/HubSpot-custom-code-actions>"
  },
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2024-08-06 16:14:57",
    "text": "forgive the roughness of the repo"
  },
  {
    "poster": {
      "poster_name": "Emma Golborne",
      "poster_handle": "egolborne"
    },
    "time_stamp": "2024-08-06 17:07:46",
    "text": "The PM for custom code is out of town, but ill pass this along to her to update once she's back!"
  },
  {
    "poster": {
      "poster_name": "Santhoshkumar R",
      "poster_handle": "santhosh.kumar"
    },
    "time_stamp": "2024-08-06 23:54:29",
    "text": "Hello there,\nThis is Santhoshkumar, a web developer\n\nI'm using a HubSpot form for all kinda forms on my website, especially signup. I'm using this HubSpot form for form submission followed by the Revenue Hero meeting scheduler. I could see that the HubSpot form accepts numbers and special characters in the name fields such as first and last names. So, there is a possibility of injecting the anonymous code into the field which is against our security policy.  So, I need to restrict those by setting the rules. I have explored some community forums for <https://community.HubSpot.com/t5/APIs-Integrations/Custom-validation-or-prevent-form-submission/m-p/666857|Custom validation or prevent form submission> - which recommends adding custom validations on the form fields by preventing the default behavior of the form submission. This actually works as expected on form validation but after the form submission, the Revenue Hero meeting scheduler is not showing up.\n\nI have also explored some documentation that says that the rules can be set up only while creating a property that is even for custom property, not for default property. I can't able to set rules for the default names field property.\n\nI want to restrict the numbers and special characters in the name fields. So, Could you please assist me with the same?\n\nThanks in advance,\nSanthoshkumar R"
  }
]