[
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-29 04:03:57",
    "text": "Can you amend the workflow trigger so it is if 'trigger' property is known AND other 3 properties are known? It should then only enrol once it meets the whole criteria as opposed to a waiting period within the workflow?\nYou could even have a list which handles contacts with the trigger property known, and have the workflow enrolment based on list membership + 3 custom properties all being known. It just depends on what value your trigger property contains (is it yes/no... known/unknown.. etc) and if the list part would work for that.\n\nIf you'd rather a waiting period then another option is probably to have a branch with a delay of how ever long you want to wait before then checking again. You could have a custom coded action which outputs true/false if the 3 other properties are all known, and then loop it around with a delay of X time if its still false, only proceeding to the branch you want once it's all 'true'.\n\nProbably not the best or most sophisticated solution, but it's something that comes to mind."
  },
  {
    "poster": {
      "poster_name": "Veerle Struyf",
      "poster_handle": "veerle.struyf943"
    },
    "time_stamp": "2024-08-29 06:13:14",
    "text": "Hi, I want to sent an email to an emailadress I lookup in a custom object in a workflow. I was thinking about doing it with custom code, because in the email options, you always have to choose an emailadress that is already in HubSpot. Did anybody already did this? (with net in node js, because nodemailer isn't available in the custom code libraries)"
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-08-29 07:46:49",
    "text": "I am not able to create loops..how to create loops for checking the branch condition repeatedly?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-29 08:06:32",
    "text": "Sorry you are exactly right - you cannot create loops. I made an assumption but quickly tried it and can see it's not possible.\nYou may need to throw it between 2 workflows in that case (if false go to workflow 2, delay, throw back into workflow 1), but that's really probably not the best way to do it.\nTrying to only get the contact to enrol in the workflow when you need to may be the better option?\n\nOut of interest, how quickly do those 3 custom properties become updated after the 'trigger' field is changed? Does it vary or is it usually just a couple of minutes?"
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-08-29 08:08:45",
    "text": "Mostly 10 mins.."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-29 08:11:24",
    "edited": {
      "time_stamp": "2024-08-29 08:11:54"
    },
    "text": "Could you in that case, duplicate your custom coded step and use it later on in the same workflow?\nCheck true/false on property validation... if true = branch 1 = custom code... if false = branch 2 = delay 15mins and then do property validation again and branch again? (a clone of previous steps)\nIf it is unvalidated again it could create a task or such to the user."
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-08-29 08:13:03",
    "text": "in the conditional branch...if the property has not been updtaed..you are asking me to again create the same condition and check for true or false like that?"
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-08-29 08:18:41",
    "text": "Someone else may have a more sophisticated way to handle it, and i'm certainly not as familiar with all workflow features as some others are - so that would just be my idea yes!\n\nIf you want to keep it in the same workflow and not handle the enrolment better, then validate and branch... then add a delay and validate and branch again (until desired result). You'd probably want to only do it once or twice though, rather than delay and branch for hours on end... so it doesn't perfectly fit your desired outcome."
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-08-29 08:31:00",
    "text": "Ok i will check on it! Thank you for the idea"
  },
  {
    "poster": {
      "poster_name": "Rodrigo Apetito",
      "poster_handle": "rodrigoapetito"
    },
    "time_stamp": "2024-08-29 14:02:36",
    "text": "Hello guys!\n\nI have a quick question.. I'm working with a workflow to send email, but I need to encode an url to be used in email, I created a custom code on workflow to encode values to put on URL (like first name, last name, etc) but on next step of my workflow is the email, how I can get returned values from custom code like a link on email body ? I'm using on that way: `{{custom_code.link}}`\n* The return value of my custom code is `link`",
    "reply_count": 28,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-08-29 14:07:05"
      },
      {
        "time_stamp": "2024-08-30 02:35:14"
      },
      {
        "time_stamp": "2024-08-30 02:37:34"
      },
      {
        "time_stamp": "2024-08-30 03:53:46"
      },
      {
        "time_stamp": "2024-08-30 04:12:24"
      },
      {
        "time_stamp": "2024-08-30 04:14:31"
      },
      {
        "time_stamp": "2024-08-30 09:33:08"
      },
      {
        "time_stamp": "2024-08-30 10:35:57"
      },
      {
        "time_stamp": "2024-08-30 10:36:34"
      },
      {
        "time_stamp": "2024-08-30 10:36:50"
      },
      {
        "time_stamp": "2024-08-30 10:37:20"
      },
      {
        "time_stamp": "2024-08-30 10:38:08"
      },
      {
        "time_stamp": "2024-08-30 10:38:27"
      },
      {
        "time_stamp": "2024-08-30 10:38:53"
      },
      {
        "time_stamp": "2024-08-30 10:39:19"
      },
      {
        "time_stamp": "2024-08-30 10:40:59"
      },
      {
        "time_stamp": "2024-08-30 10:41:21"
      },
      {
        "time_stamp": "2024-08-30 10:41:45"
      },
      {
        "time_stamp": "2024-08-30 10:43:31"
      },
      {
        "time_stamp": "2024-08-30 10:43:57"
      },
      {
        "time_stamp": "2024-08-30 10:44:19"
      },
      {
        "time_stamp": "2024-08-30 10:45:29"
      },
      {
        "time_stamp": "2024-08-30 10:45:46"
      },
      {
        "time_stamp": "2024-08-30 10:46:20"
      },
      {
        "time_stamp": "2024-08-30 10:46:40"
      },
      {
        "time_stamp": "2024-08-30 10:46:55"
      },
      {
        "time_stamp": "2024-08-30 10:46:57"
      },
      {
        "time_stamp": "2024-08-30 10:54:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Psalm Gajudo",
      "poster_handle": "pgajudo"
    },
    "time_stamp": "2024-08-29 14:07:05",
    "text": "Hi <@U03REFNRMB3> hope you can help us here. :relaxed:"
  },
  {
    "poster": {
      "poster_name": "Jacob Jennings",
      "poster_handle": "jacob550"
    },
    "time_stamp": "2024-08-29 14:25:23",
    "edited": {
      "time_stamp": "2024-08-29 14:27:21"
    },
    "text": "Is there no way to delay until a datetime field? Or trigger a workflow when a datetime field is \"now\""
  },
  {
    "poster": {
      "poster_name": "Muhammad Mahad Hanif",
      "poster_handle": "mahad.hanif"
    },
    "time_stamp": "2024-08-30 00:44:45",
    "text": "Hello everyone,\nCurrently I'm using aircall connected with HubSpot to make calls. I want a workflow which will increase the value of property by 1 whenever the call attempt is taken (every single time). Is there any specific trigger you could suggest me? I had tried multiple triggers like call started, call ended trigger of HubSpot event occurs trigger. I had also tried on the basis of associated object (activity) which is the call direction."
  }
]