[
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-08-08 02:53:58",
    "text": "<@UT35DSBMF> <@U04C0NVUQ7Q> <@U01QVR44MEY>\n<https://app-eu1.HubSpot.com/product-updates/26608090/in-beta?update=13943243>\na resubscribe API just got added as public beta on 5th of August it includes a resubscribe API which can resubscribe already unsubscribed Users :open_mouth: :partyparrot:\njust tested it and got a successful request :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Zachary Myr",
      "poster_handle": "zachary.myr"
    },
    "time_stamp": "2024-08-08 02:54:18",
    "text": "Nice!!"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-08-08 02:57:09",
    "text": "just dont forget to add the scopes that are necessary that come with the beta :slightly_smiling_face: :raised_hands:"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-08-08 03:46:11",
    "text": "<@U07FYDHS7FC> if you want i can sent you my version of this dedupe code\n\nI revised it with a dev of mine and it works by checking a custom property with a unique value on both contacts and if this value is the same on both contacts it merges them\n\nits really messy, because i started learning javascript/node but its pretty easy to use if you need it just send me a DM :slightly_smiling_face: :raised_hands:"
  },
  {
    "poster": {
      "poster_name": "Psalm Gajudo",
      "poster_handle": "pgajudo"
    },
    "time_stamp": "2024-08-08 04:06:57",
    "text": "Hi <@U065R73V8SY>! It's nice to e meet you! Sent you a DM!"
  },
  {
    "text": "never use this any activity  and associated activity trigger its like sooo bad\n\n<@U05SNV4CJ2D> what kind of action does happen when the file gets attached is it like a user adding a file to a note or an activity or do they add it at the right side of the contact or is it a form submission from a contact itself?\n\ni would recommend creating a file property and then when this file property gets uploaded with a certain file you have a trigger like file property is Known you copy the property over to a custom property single line text and then filter on certain values that you want to execute based like for example:\nyou can filter out files by months for example etc there are a lot of possiblities",
    "time_stamp": "2024-08-08 04:51:17"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-08-08 06:16:21",
    "text": "Beautiful"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-08-08 08:57:28",
    "edited": {
      "time_stamp": "2024-08-08 08:57:34"
    },
    "text": "<@U07FWM5CDM3>, how can we get the documentation update to provide this very important details."
  },
  {
    "poster": {
      "poster_name": "Emma Golborne",
      "poster_handle": "egolborne"
    },
    "time_stamp": "2024-08-08 09:12:18",
    "edited": {
      "time_stamp": "2024-08-08 09:12:24"
    },
    "text": "As I mentioned above, I'll work with the pm for this area when shes back on monday to get this updated in our documentation!"
  },
  {
    "poster": {
      "poster_name": "Dorian McFarland",
      "poster_handle": "dorian475"
    },
    "time_stamp": "2024-08-08 09:56:16",
    "text": "Is the list of supported libraries dictated by whatever AWS Lambda supports for a given node-version? "
  },
  {
    "poster": {
      "poster_name": "Psalm Gajudo",
      "poster_handle": "pgajudo"
    },
    "time_stamp": "2024-08-08 15:02:28",
    "text": "Hi <@U03REFNRMB3>! Following up here. It seems like the link you provided with the custom codes for merging contacts is totally different from what's on the HubSpot workflow template."
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-08-08 15:23:02",
    "text": "Correct, I was just sharing the latest APIs documentation for what's needed to merge two contacts."
  },
  {
    "poster": {
      "poster_name": "Psalm Gajudo",
      "poster_handle": "pgajudo"
    },
    "time_stamp": "2024-08-08 15:39:16",
    "text": "One last question <@U03REFNRMB3> :slightly_smiling_face: Our developer has already figured out and modified the code, thanks to your latest documentation! We just ran another test, and it worked.\n\nI have a question: How does the custom code handle merging if both contact ID share the same phone number, but the other one has the email address? Does the contact with the email address automatically become the primary, or are we certain that the contact IDs without email addresses will be merged into the one with the email address? We want to ensure that no email addresses are lost in the process.\n\nThank you so much! :hugging_face:"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-08-08 15:41:21",
    "text": "Your developer should handle that logic in the code."
  },
  {
    "poster": {
      "poster_name": "Alex Woodbridge",
      "poster_handle": "alex.woodbridge"
    },
    "time_stamp": "2024-08-08 15:54:22",
    "text": "This is true, our account is BST but the server is UTC. Are you converting the datetime property into milliseconds?"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-08-08 16:04:09",
    "text": "The `primaryObjectId` become the primary contact record and everything will merge into that record. So email address will become the primary from the other record if primary doesn’t have one."
  },
  {
    "poster": {
      "poster_name": "Psalm Gajudo",
      "poster_handle": "pgajudo"
    },
    "time_stamp": "2024-08-08 16:06:42",
    "text": "Thanks, Justin! We just did a couple of test and confirming that email address will not be lost in the process. Appreciate your help! :slightly_smiling_face:"
  }
]