[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-03-25 01:40:51",
    "text": "Hey Angelic, HubSpot minifies the css (and js) for you. There’s no need to minify it yourself\n\nTipp: If you want to get rid of the empty space that’s created by hubl in a rendered css(only in the design manager) you can write your hubl like this:\n```{%- set HUBLNAME = SOMETHING -%}\n\n{#- comment -#}\n\n{%- for X in Y -%}\n\n{%- if X -%}\n{%- else/elif -%}\n{%- ended -%}\n```\nSo just add a „dash/minus“ to it. "
  },
  {
    "poster": {
      "poster_name": "Imran Ali",
      "poster_handle": "imran134"
    },
    "time_stamp": "2024-03-25 02:20:49",
    "text": "Hi All,\nI'm customzing a Quote template where i want multiple line items table,\nI've imported line items module but that only creates one table, where as i want to create multiple line items table\nMy line items has a property called 'facility ' and each line item can have same or different properties, hence i want to create multiple tables that has same facility value\n\nI've successfully sorted a list with that has same facility items grouped\nbut I'm unable to create dynamic separate lists because the items list can have N number of facilities selected"
  },
  {
    "poster": {
      "poster_name": "Bobby Makynen",
      "poster_handle": "bobby605"
    },
    "time_stamp": "2024-03-25 06:52:31",
    "text": "Thanks! My main problem is I can't seem to access the values at all. It's like one module doesn't know that the other one is there. I read this on the community forum after starting this thread. Can anyone confirm whether or not this is true? Is what I'm trying to do (access one module's values from another module) just not doable in programmable emails?\n\n_The module would have to be a static module to be able to grab it's data. With both the widgets and widgets_data tags a module ID (this is separate from the label and name) is required to access the module. Drag-and-drop modules have their IDs arbitrarily assigned so there's no way to know what ID to use to access them._\n\n_So this is not possible in a drag-and-drop email since currently HubSpot hasn't yet come out with the ability to create custom coded drag-and-drop templates, meaning there's no way to add static modules._"
  }
]