[
  {
    "poster": {
      "poster_name": "Rushik vaghasia",
      "poster_handle": "rushikvaghasiya21"
    },
    "time_stamp": "2024-03-14 02:24:03",
    "text": "Yes"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-03-14 05:33:10",
    "text": "Yeah I think it just depends on the blog posts your module is pulling in. And if there is a module tag with the first 150 characters or whatever you're truncating to"
  },
  {
    "poster": {
      "poster_name": "phlp",
      "poster_handle": "philip.braeunlich"
    },
    "time_stamp": "2024-03-14 06:26:13",
    "text": "I opened a ticket. keep you updated when I hear back vom HubSpot."
  },
  {
    "poster": {
      "poster_name": "Krzysztof Gonciarz",
      "poster_handle": "krzysztof.gonciarz"
    },
    "time_stamp": "2024-03-14 07:54:56",
    "text": "same issue here: just noticed the problem and came to figure out whether it's on our or HubSpot end"
  },
  {
    "poster": {
      "poster_name": "Aruljothi Kuppusamy",
      "poster_handle": "aj974"
    },
    "time_stamp": "2024-03-14 10:17:08",
    "text": "Thank you <@U022YD6LGAU>"
  },
  {
    "poster": {
      "poster_name": "Aruljothi Kuppusamy",
      "poster_handle": "aj974"
    },
    "time_stamp": "2024-03-14 10:18:55",
    "text": "Could you please help on this issue I'm using <https://requirejs.org/> for loading multiple js files to draw google maps. Getting this error\n\nrequire.js:166\nUncaught Error: Script error for: markerClusterer\n<http://requirejs.org/docs/errors.html#scripterror>\n    at makeError (require.js:166:17)\n    at HTMLScriptElement.onScriptError (require.js:1696:36)"
  },
  {
    "poster": {
      "poster_name": "phlp",
      "poster_handle": "philip.braeunlich"
    },
    "time_stamp": "2024-03-14 23:28:04",
    "text": "Hi everyone.\nHubSpot responded and here are the important parts :\n&gt;  This is a known backend limitation that we are tracking but I do not have a timeline for a resolution.\n&gt;  There are two suggested workarounds:\n&gt; \n&gt; 1) Unpublish the blog references in the module temporarily while working on the module changes that are causing the issue and re-publish it once the changes are finalized.\n&gt; \n&gt; 2) Create a new test blog, and add test blog posts only with text (no modules). Add a blog field to the module and select the test module in that field (update the module code to reference the field). The error will not be present anymore and allow you to publish the changes. Go to the webpage that will use the blog module, adding the blog module will display the blog field to be selected, and change the field from the Test Blog to the correct blog. That will display a yellow alert saying that an error was found, but that will not prevent the module from being added and the page updated/published. The module should work as expected, then. (recommended approach)"
  },
  {
    "poster": {
      "poster_name": "phlp",
      "poster_handle": "philip.braeunlich"
    },
    "time_stamp": "2024-03-14 23:31:29",
    "text": "I this the workaround 1 isn’t practical at all, and the second one doesn’t work in my dev-portal as you can only have one blog there.\n\nI asked them if they could provide a hubl-regex so we can work around the issue doing this:\n```post.post_summary|escape_jinjava||regex_replace(\"[REGEX TO REMOVE THAT MODULE-MARKUP]\", \"\")```\nIn my tests this would work, but I’m a total loser at writing these kind of regex-things.\nIs somebody able to write a regex that would work here?"
  }
]