[
  {
    "text": "Hello,\nIs there any way to modify the code of the \"Tabber\" module so as to include a text-block and an image for each of the tab, so that the text-block and the image are positioned side by side for each tab ?\nI want the end result to look like this...",
    "time_stamp": "2019-10-23 05:23:53",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-10-23 06:01:57"
      },
      {
        "time_stamp": "2019-10-23 23:51:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-10-23 05:32:47",
    "text": "What's the best way to write module javascript so that it's scoped to only 1 instance of a module?  I was thinking that I could add the module name to the id of the module with hubl, but I forgot we can't use Hubl in the js portion of the module.  I could move the script into the html portion, but that seems sloppy."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-23 06:01:57",
    "text": "Any of the default modules can be cloned in the design manager, the clone can be modified to do anything you want.\n\nIn this case i would consider creating your own Tabber type module as the design of this is fairly different, it may be easier starting from scratch."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-10-23 06:23:40",
    "edited": {
      "time_stamp": "2019-10-23 06:24:27"
    },
    "text": "Ah... furthermore, if you have multiple instances of a module on a page, does it only load 1 instance of the script on the page? If that's the case, then inserting that module name into the id wouldn't work even if we could use hubl in the js. But, then I can target all instances of the module by class without duplicating references.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-10-23 07:34:32"
      },
      {
        "time_stamp": "2019-10-23 07:43:50"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-23 07:34:32",
    "text": "javascript added to the module’s JS pane only loads once per page. If you need to handle multiple instances of the module on a page, there are several ways you can tackle it. One common route is to loop through each instance of the module and use data attributes to grab the data you need for each instance, so you can treat each instance separately."
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-10-23 07:43:50",
    "text": "Great, thanks for confirming <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Sandipan Saha",
      "poster_handle": "sandipan.s"
    },
    "time_stamp": "2019-10-23 23:51:31",
    "text": "I see... Thanks for the info!"
  }
]