[
  {
    "poster": {
      "poster_name": "Krzysztof Gonciarz",
      "poster_handle": "krzysztof.gonciarz"
    },
    "time_stamp": "2019-10-29 04:02:06",
    "edited": {
      "time_stamp": "2019-10-29 04:04:08"
    },
    "text": "Hi folks :wave:\nIs there any way to include module inside other module and pass some values to it?\n\n*Example*:\nI have a *header* with heading and subheading. I'd like to use this header in a few other places of the website (generally, *other modules* like sections, CTA's, etc.). To keep it consistent throughout the entire page, I'd like to keep all my styles and markup in one place. However, I'd like to be able to set different heading and subheading lines in each instance of the header.\n\nAny chances to do it? :pray:",
    "reply_count": 6,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-10-29 05:49:02"
      },
      {
        "time_stamp": "2019-10-29 06:57:22"
      },
      {
        "time_stamp": "2019-10-29 07:14:42"
      },
      {
        "time_stamp": "2019-10-29 07:24:59"
      },
      {
        "time_stamp": "2019-10-29 08:41:03"
      },
      {
        "time_stamp": "2019-10-30 06:36:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2019-10-29 05:49:02",
    "text": "You can't nest modules, you could create a macro in an external file and include it in your module but you'll need to add the fields every module you add the file to..."
  },
  {
    "poster": {
      "poster_name": "Krzysztof Gonciarz",
      "poster_handle": "krzysztof.gonciarz"
    },
    "time_stamp": "2019-10-29 06:57:22",
    "text": "Thanks a lot Matt. It's a pity, as I think it's a common development practice, especially when we talk about modules"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-10-29 07:14:42",
    "edited": {
      "time_stamp": "2019-10-29 07:28:07"
    },
    "text": "There are several reasons we don’t currently support nesting modules, probably the biggest reason is that, there’d be no way for the marketer to configure the nested modules providing a terrible experience for them. Developers could work around this by having 1 module have all the fields for all of it’s sub modules, but then that’s a terrible experience for the developer. In addition, there’s the unfortunate possibility someone will create an infinite loop.\n\nLargely though we have to balance the developer and marketer experience. What is good for the developer isn’t always good for the marketer.\n\nMost of the time developers only want to nest modules for layout reasons. Most of the reasons are solved for with the drag and drop areas functionality.\n<https://designers.HubSpot.com/docs/tutorials/drag-and-drop-areas>\n<#CDU990ECW|drag-n-drop-pages>"
  },
  {
    "poster": {
      "poster_name": "Krzysztof Gonciarz",
      "poster_handle": "krzysztof.gonciarz"
    },
    "time_stamp": "2019-10-29 07:24:59",
    "text": "Thanks Jon, I'll definitely take a look :wink:"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-10-29 08:41:03",
    "text": "<@UPHA2AUEM> You can use Partials its more akin to what you are asking for."
  }
]