[
  {
    "poster": {
      "poster_name": "Matthew Isbrecht",
      "poster_handle": "matt520"
    },
    "time_stamp": "2023-09-12 13:15:46",
    "text": "Hey Seth, just a quick update here. I'm using the JSON based card as a jump off point, and I have the iframe working, displaying a simple test site that has data from an api call to HS contacts, and a print button. Unfortunately the print function is being ignored due to the key word 'allow-modals' not being present in the iframe sandbox attribute. Would you be able to tell me if that is an attribute that can be added to within the HS card, if not I'm worried this is going to put the kybosh on the print functionality. Thanks!"
  },
  {
    "text": "<@U04EJHVD8FM>",
    "time_stamp": "2023-09-12 13:15:54"
  },
  {
    "text": "",
    "time_stamp": "2023-09-12 13:16:16"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2023-09-12 13:19:16",
    "text": "Ah, interesting. I know we have some restrictions on the iframe but I wasn't aware of what we specifically allowed / didn't allow using that sandbox attribute."
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2023-09-12 13:19:36",
    "edited": {
      "time_stamp": "2023-09-12 13:19:39"
    },
    "text": "And for some reason I thought it would treat the print window/modal differently."
  },
  {
    "poster": {
      "poster_name": "Matthew Isbrecht",
      "poster_handle": "matt520"
    },
    "time_stamp": "2023-09-12 13:23:00",
    "text": "Ok, that being the case I may have to move to a simple button that launches a new window instead of an iframe. I wanted to keep it as self contained as possible, but if I can't add that to the sandbox attribute I have to shift gears a bit."
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2023-09-12 13:23:44",
    "text": "My gut is to say that we don't allow it for security reasons (spammy popups/etc). And I do remember we have had similar requests to change the window.parent `url` that we also had to deny."
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2023-09-12 13:24:43",
    "text": "I'd say what you mentioned above would be the best bet moving forward. Thanks for giving this a go! We appreciate the feedback and I'll let you know of any updates from the team re: printing contents of cards."
  },
  {
    "poster": {
      "poster_name": "Matthew Isbrecht",
      "poster_handle": "matt520"
    },
    "time_stamp": "2023-09-12 13:26:10",
    "text": "Of course, very happy to have your help on this as well, you just saved me a few hours of beating my head against the wall on this lol. Appreciate you Seth!"
  },
  {
    "poster": {
      "poster_name": "Seth Kaplan",
      "poster_handle": "skaplan"
    },
    "time_stamp": "2023-09-12 13:26:36",
    "text": "Any time :slightly_smiling_face:"
  }
]