[
  {
    "poster": {
      "poster_name": "John Elmer",
      "poster_handle": "john.elmer"
    },
    "time_stamp": "2023-07-13 12:18:57",
    "text": "Announcing a new, free migration tool from HubSpot App Partner <http://Datawarehouse.io|Datawarehouse.io>:  The <https://datawarehouse.io/product/HubSpot-to-HubSpot-schema-replicator/|HubSpot Schema Replicator>!\n\nThe self-service HubSpot Schema Replicator copies the HubSpot schema/setup from one portal to another.   Did I mention that it's free?\n\nThis special version of our <https://datawarehouse.io/product/HubSpot-to-HubSpot-migrator/|https://datawarehouse.io/product/HubSpot-to-HubSpot-migrator/> does not migrate data.  It only copies the schema and setup of a HubSpot portal from one to another. An example of a schema in HubSpot would be how all Contact properties are set up (standard and custom).\n\nWhy would I need this, you may ask?  A few use cases for this application are:\n• For HubSpot Solutions Partners doing implementations, you could create a pre-set schema in a development environment, then use this app to rapidly load all of that information into your client's new HubSpot portals. \n• Easily load a set of properties from one portal into another.\n• Replicate the schema of your production portal into a development or test environment \n• Prepare a new HubSpot portal for a data migration at a later time using our <https://datawarehouse.io/product/HubSpot-to-HubSpot-migrator/|https://datawarehouse.io/product/HubSpot-to-HubSpot-migrator/>.\nTo use this app, simply create an account at <http://datawarehouse.io|http://datawarehouse.io> and go through the self-service checkout process. The migration of your HubSpot schema from one portal to another is automatic.\n\n<https://datawarehouse.io/product/HubSpot-to-HubSpot-schema-replicator/|https://datawarehouse.io/product/HubSpot-to-HubSpot-schema-replicator/>\nOur service replicates the following HubSpot Object Schemas from one HubSpot portal into another:\n• Folders\n• Company Properties\n• Contact Properties\n• Deal Pipeline/Stages\n• Deal Properties\n• Line Item Properties\n• Ticket Pipeline/Stages\n• Ticket Properties\n• Custom Objects and Properties\n• Association Labels\n• Engagement Properties\nPlease note that at this time we cannot replicate Calculated Properties.  The app will also be able to replicate workflows, reports, and dashboards as soon as a new public API for them is made available.\n\nOur service uses (SSL/TLS) encryption at all times while data is “in transit” to and from HubSpot, so the data remains secure. We do not store any of your data aside from the secure tokens required to migrate your schema. Those tokens are destroyed after the replication is completed. In addition this application is GDPR Compliant and hosted in the EU.\n\nFor any questions about how the HubSpot Schema Replicator works please visit <https://support.datawarehouse.io/|https://support.datawarehouse.io/>\n\nWe recommend reading the documentation explaining how the tool works before proceeding. <https://support.datawarehouse.io/hc/en-us/articles/4402190492051|https://support.datawarehouse.io/hc/en-us/articles/4402190492051>"
  }
]