[
  {
    "poster": {
      "poster_name": "Simon Lafis",
      "poster_handle": "simon"
    },
    "time_stamp": "2022-12-08 02:27:06",
    "text": "Hey,\n\nJust discovered that the e-mail input fields in HubSpot forms doesn't get the class \"error\" or \"invalid\" when a user has opted out of email communication.\n\nThe only things that happens is that this message shows up.\n_\"Looks like you've opted out of email communication. Click here to get an email and opt back in.\"_\n\nShouldn't the field get the \"error\" or \"invalid\" class as well?"
  },
  {
    "poster": {
      "poster_name": "Oleksii Poplavskyi",
      "poster_handle": "olpo"
    },
    "time_stamp": "2022-12-08 05:30:37",
    "text": "Hello, can someone help me with this?\nI have in website search, and I need to show a label if the input is empty and stop the form submission, but all I tried is redirecting me to the results page"
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-12-08 07:50:30",
    "text": "Good morning all, how you are doing?  Someone has some tip?"
  },
  {
    "poster": {
      "poster_name": "Carlos Martínez",
      "poster_handle": "carlos315"
    },
    "time_stamp": "2022-12-08 11:24:23",
    "text": "Good morning all, somebody knows how to create a *Flexible URL Redirect*\n*From* this: <http://www.miweb.com/abc.html|www.miweb.com/abc.html>\n*to* this: <http://www.miweb.com/abc|www.miweb.com/abc>\nI only need to create a substring or something like that to erase \".html\"\nThanks",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-08 13:52:07"
      },
      {
        "time_stamp": "2022-12-08 17:44:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2022-12-08 13:49:58",
    "edited": {
      "time_stamp": "2022-12-12 08:59:16"
    },
    "text": "A reminder to all that by participating in this community, you are committed to abiding by our <https://developers.HubSpot.com/slack/code-of-conduct|Code of Conduct>. Recently we've seen an uptick in the following violations:\n\n• *Channel spamming (posting the same question or topic, verbatim, in multiple channels at once to increase visibility.)* Please don't do this. Try one, and if you don't get a response, please reference your initial post in another channel to keep everything organized. \n• *Solicitation by DM.* DMing members to promote or sell your company services is STRICTLY FORBIDDEN. We're here to collaborate with and support each other, not sell to each other. \n• *Solicitation in general.* With the exception of the <#CBNDYJJAZ|jobs> channel,  please do not solicit your services. And if you do post in <#CBNDYJJAZ|jobs>, keep your posts limited to one a week at the very most. \n• *Personal attacks.* I wish I didn't have to remind y'all of this one, but personal attacks of any kind are absolutely forbidden. \nThe HubSpot Community admins will do our best to warn you and give you a chance to adapt should any violations be reported or observed against you. But, if you continue to violate our Code of Conduct, we will ban you from this community for good. We don't want to do that!\n\nThe :sparkles:vast majority:sparkles:of interactions here are professional and community oriented,  and we want to keep it that way. Thank you for your help in keeping our Dev Community awesome :orange_heart:"
  },
  {
    "poster": {
      "poster_name": "Simon Lafis",
      "poster_handle": "simon"
    },
    "time_stamp": "2022-12-08 13:52:07",
    "edited": {
      "time_stamp": "2022-12-08 13:53:14"
    },
    "text": "Maybe this? Haven't tested it though.\nFrom: `<https://www.miweb.com/*rest-of-url.html>`\nTo: `<https://www.miweb.com/{rest-of-url}>`"
  },
  {
    "poster": {
      "poster_name": "Carlos Martínez",
      "poster_handle": "carlos315"
    },
    "time_stamp": "2022-12-08 17:44:14",
    "text": "I tried but didn't works. takes all as a variable. :melting_face:"
  },
  {
    "poster": {
      "poster_name": "Bonnie GMG",
      "poster_handle": "bonniegmg"
    },
    "time_stamp": "2022-12-08 17:45:21",
    "edited": {
      "time_stamp": "2022-12-08 17:46:45"
    },
    "text": ":wave: Hi everyone! Glad to learn about this slack channel. I have a question and would appreciate some help. I was wondering if when you enable gdpr and cookie option banners in the bottom of your website, if that injects any code into the header of your website as well. I'm using wordpress and some added code in the header interferes with my Gtranslate and nav functionality. Thanks so much!"
  }
]