[
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-04-13 08:45:28",
    "text": "Yeah, I definitely get where you’re coming from. I think the eventual goal is to pack as much editing power as possible into the sidebar of the page editor, but because the forms app is so complex, there’s a ceiling to how much we can squeeze into the much smaller real estate of the page editor sidebar. The new beta gives you quite a bit more editing power from the sidebar than you had previously, so I’m hoping it’s a step in the right direction!"
  },
  {
    "poster": {
      "poster_name": "Nikan Shahidi",
      "poster_handle": "nikanshahidi"
    },
    "time_stamp": "2020-04-13 10:01:12",
    "text": "If anyone has any crazy ideas for some custom modules (either email or website page/landing page) my team is having a HubSpot CMS Hackathon next week and would love some code challenges from the community. The more complex the more exciting :wink: shoot me a DM",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-04-13 10:20:32"
      },
      {
        "time_stamp": "2020-04-13 10:22:02"
      },
      {
        "time_stamp": "2020-04-13 14:58:13"
      },
      {
        "time_stamp": "2020-04-17 11:29:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-04-13 10:20:32",
    "edited": {
      "time_stamp": "2020-04-13 10:21:58"
    },
    "text": "Just pitching some module idea excuses for you to try serverless functions :stuck_out_tongue_winking_eye:\n• A pricing quote calculator - where all of the logic is hidden in a serverless function\n• A multiplayer drawing game(I did this this weekend - will share a link to anyone interested)\n• A customer dashboard screen - could be for invoicing, could be an overview of their products, could be a tool to request work\n• A module that makes it easy to create multi-step forms."
  },
  {
    "poster": {
      "poster_name": "Nikan Shahidi",
      "poster_handle": "nikanshahidi"
    },
    "time_stamp": "2020-04-13 10:22:02",
    "text": "^ love this"
  },
  {
    "poster": {
      "poster_name": "Markus Schrickel",
      "poster_handle": "markus.schrickel"
    },
    "time_stamp": "2020-04-13 14:58:13",
    "text": "+1 for a module to easy create multi-step forms. :slightly_smiling_face:"
  }
]