[
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-07 10:34:39",
    "text": "It’d be great if in the Contacts area of HubSpot you could use the cropping function when setting a profile pic, Also the ability to link to a an image URL to pull that in as a person’s profile pic."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-07 11:00:53",
    "text": "Also the contacts area when you assign a profile pic stretches images to fit the dimensions instead of scaling using say background cover."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-07 15:05:24",
    "text": "Idea - a marketer editable way to define a bunch of color swatches which could be  used in color fields on a portal. I envision this being somewhere in content settings, similar to the way the email colors work.\n\nThe idea is similar to the way WordPress’s Divi Theme handles colors. Where at the site level you can assign up to like 10 colors as brand colors. Then whenever you’re in a color picker those 10 colors show up as presets you can use instead of manually having to find similar colors or copy and paste hex codes.\n\nI would imagine that if a user used a preset swatch instead of directly inputting the hex for the color it would instead actually pop in a universal HubL variable for that color. That way should anyone do a re-brand they could effectively change those colors throughout the site in 1 fell swoop. (I do see some issues with that like if you’re doing a full redesign but maybe someone else has solutions for that)"
  },
  {
    "poster": {
      "poster_name": "Jon Eichler",
      "poster_handle": "jeichler"
    },
    "time_stamp": "2018-09-07 15:08:05",
    "text": "The color picker favorites in email show up in every rich text editor"
  },
  {
    "poster": {
      "poster_name": "Jon Eichler",
      "poster_handle": "jeichler"
    },
    "time_stamp": "2018-09-07 15:08:20",
    "text": "At least I have noticed that it does in our portal"
  },
  {
    "poster": {
      "poster_name": "Jon Eichler",
      "poster_handle": "jeichler"
    },
    "time_stamp": "2018-09-07 15:08:50",
    "text": "But I agree with the Hubl code idea it would be great"
  }
]