[
  {
    "poster": {
      "poster_name": "Alexander Guedes",
      "poster_handle": "aguedes"
    },
    "time_stamp": "2021-01-28 04:38:25",
    "text": "Hello,  there's an issue happening in <https://bayshore.aws.bsshost.me/work> It has to do with the script provided by HubSpot, this is needed on the site to collect and track visitor information and activity. The script reference is : &lt;script type=\"text/javascript\" id=\"hs-script-loader\" async=\"\" defer=\"\" src=\"<http://js.hs-scripts.com/1923820.js|js.hs-scripts.com/1923820.js>\"&gt;&lt;/script&gt; I debugged using Dev Tools and what is happening is that when parentNode property is accessed on variable \"i\" in this case, \"i\" is undefined, that's causing the error: var i = document.getElementsByTagName(\"script\")[0]; i.parentNode.insertBefore(n, i). To be able to replicate the issue, you'll need to select any value from any of the dropdowns, then you can check in the Browser console and will see an error pointing to the HubSpot Javascript file. Let me know if you have any question",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-28 07:11:40"
      },
      {
        "time_stamp": "2021-01-28 08:01:09"
      },
      {
        "time_stamp": "2021-01-28 12:04:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Matt Coley",
      "poster_handle": "mcoley"
    },
    "time_stamp": "2021-01-28 07:11:40",
    "text": "It looks like you are removing all elements on the page while the script is executing. I think the script assumes that itself is not removed from the page"
  },
  {
    "poster": {
      "poster_name": "Alexander Guedes",
      "poster_handle": "aguedes"
    },
    "time_stamp": "2021-01-28 08:01:09",
    "text": "thanks Matt, after what you said I realized there's a redirect taking place when a dropdown is updated, this might be causing the issue, will be working with my IT team on that, will keep you posted"
  },
  {
    "poster": {
      "poster_name": "Alexander Guedes",
      "poster_handle": "aguedes"
    },
    "time_stamp": "2021-01-28 12:04:28",
    "text": "<@U6GNQ7JBU> issue has been resolved, your observation put me in the right direction, the issue was happening because there was a redirect setup in the .htaccess file to remove trailing slashes. Thank you!"
  }
]