[
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-07-02 07:08:29",
    "text": "Disappointed to see such a big hike in pricing announced today, is a shame as we had been getting some traction from potential new clients.",
    "reply_count": 23,
    "reply_users_count": 8,
    "replies": [
      {
        "time_stamp": "2021-07-02 07:09:07"
      },
      {
        "time_stamp": "2021-07-02 07:22:37"
      },
      {
        "time_stamp": "2021-07-02 07:23:01"
      },
      {
        "time_stamp": "2021-07-02 07:26:08"
      },
      {
        "time_stamp": "2021-07-02 07:27:55"
      },
      {
        "time_stamp": "2021-07-02 07:29:08"
      },
      {
        "time_stamp": "2021-07-02 07:30:50"
      },
      {
        "time_stamp": "2021-07-02 07:35:05"
      },
      {
        "time_stamp": "2021-07-02 11:37:41"
      },
      {
        "time_stamp": "2021-07-02 11:37:49"
      },
      {
        "time_stamp": "2021-07-05 08:51:55"
      },
      {
        "time_stamp": "2021-07-07 04:44:35"
      },
      {
        "time_stamp": "2021-07-07 11:44:30"
      },
      {
        "time_stamp": "2021-07-08 03:06:50"
      },
      {
        "time_stamp": "2021-07-08 05:33:11"
      },
      {
        "time_stamp": "2021-07-12 15:58:48"
      },
      {
        "time_stamp": "2021-07-15 14:41:49"
      },
      {
        "time_stamp": "2021-07-15 14:42:44"
      },
      {
        "time_stamp": "2021-07-15 14:55:23"
      },
      {
        "time_stamp": "2021-07-15 15:00:25"
      },
      {
        "time_stamp": "2021-07-15 15:01:05"
      },
      {
        "time_stamp": "2021-07-16 03:04:21"
      },
      {
        "time_stamp": "2021-07-19 11:38:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-07-02 07:09:07",
    "text": "Indeed, i was suprised as well!"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-07-02 07:22:37",
    "text": "Remember. HubSpot is t trying to compete with WordPress. It's competing with other enterprise CMS/CRM offerings."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-07-02 07:23:01",
    "text": "If you look at others they are still rather good deal."
  },
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2021-07-02 07:26:08",
    "text": "They are not there yet, so is premature to be increasing the pricing, and it doesnt have the track record of the likes of sitecore to justify the price. No issue with rising the price but is a significant jump."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-07-02 07:27:55",
    "text": "i kinda feel the same as Rohan! While there has been an increase in features of the  last couple of months /years, i find it hard to justify in some areas."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2021-07-02 07:29:08",
    "text": "btw.. i think that is a good candidate for a survey here."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-07-02 07:30:50",
    "text": "Well there's one thing about being in a capitalist society is the market will tell the truth"
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-07-02 07:35:05",
    "text": "Is there a link to new pricing?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2021-07-02 11:37:41",
    "edited": {
      "time_stamp": "2021-07-02 11:40:53"
    },
    "text": "Hi folks :wave: Luke here from the CMS Hub team at HubSpot.\n\nI want to help clear any fog and get us on the same page on why we are changing the price of CMS Hub Professional and Enterprise. I can understand why a price change may cause some anxiety and confusion (I’m sure any of you who have changed your agency pricing have experienced this). \n\n&gt; *First  - We have no plans to increase the price for current CMS Hub customers*\nOur plan is that all existing CMS Hub customers who purchase before August 3rd will remain at the same price at renewal. \n\nApologies if our standard pricing disclaimer included in the email caused some confusion. Since this is a pricing change email, we felt it was appropriate to reference this disclaimer from our existing Terms of Service. While it’s not specific to this change, we (HubSpot) always reserve the right to change price at future renewal. It doesn’t mean we have plans to increase prices in this case.\n\n\n&gt; *Second - CMS Hub continues to mature quickly*\nSince launch we’ve continued improving CMS Hub. We’ve released many new features and editing improvements including: site tree, global content editing, blog DND functionality, sections, improvements to our SEO and import tooling, SMART content to custom modules, CRM-powered dynamic pages, APEX redirects and hosting at CMSE, custom objects at CMSE, and more. Additionally, we’ve seen the ecosystem around CMS Hub continue to grow (including this paid developer slack so we can all collaborate together).\n\nBut it doesn’t stop there - We have ambitious plans to bring CMS Hub customers even more power, flexibility and ease of use features over the next six months and beyond. \n\n:point_down::point_down::point_down:\nWe are actively working on a Digital Asset Manager (DAM), team collaboration and approval workflows, headless capabilities, developer sandboxing environments, making multisites easier and more affordable, and more (see image below). \n\nYou can view everything we can publicly talk about on our public roadmap at <http://HubSpot.com/new|HubSpot.com/new>. These improvements will help you win more up-market deals and sell bigger engagements on top of - personally I’m very excited by all of these. \n\n&gt; *Third - We are exploring a lighter option*\nWe understand not everyone is a good-fit and ready for CMS Hub Professional - just like not everyone is ready for Marketing Hub Professional. \n\nWe want to make it easy to get started with CMS Hub and make sure we can serve all companies who are a good fit for HubSpot. We’re actively exploring what a lighter weight option of CMS Hub might look like - more details coming very soon.\n\n----\n\nAs someone who use to run an agency who worked on WordPress, Joomla, Magento, HubSpot “COS”, and more - the direction of both CMS Hub and the ecosystem around it has me EXTREMELY fired up… we are just at the beginning."
  },
  {
    "text": "",
    "time_stamp": "2021-07-02 11:37:49"
  }
]