[
  {
    "poster": {
      "poster_name": "Megan Legge",
      "poster_handle": "mlegge"
    },
    "time_stamp": "2024-02-12 12:44:29",
    "text": "Hi everyone :wave: I'm Megan, the product manager for the workflows tool at HubSpot. My team is running a very small, private beta for a new AI Assistant in Workflows that can be leveraged for building triggers and actions.\n\nTo be clear, the feature is in a very early state so it’s likely you’d see unexpected results and may encounter bugs. Despite that, you’d have final control over everything you build and your involvement would mean an opportunity to improve and influence the future version of the feature.\n\nIf this is something you’re interested in participating in, we’d ask you to complete a short survey (~2 minutes) about your experience with workflows and your initial thoughts about using AI at work. <https://www.surveymonkey.com/r/XZQYWBG|Click here for the survey>. You’ll hear from me by email after doing so. DM me with questions. Thank you!"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2024-02-12 12:54:29",
    "text": "Template Marketplace: Updates to New Item Submission Limits for Providers We are updating the submission limits of new items for providers on the Template Marketplace. *What is it?* Starting Monday, February 19, 2024, HubSpot Template Marketplace providers will be limited to submitting one template type – theme and/or module – for review and listing at a time. Any submission exceeding this limit will be automatically rejected until all submissions in review are approved or withdrawn. *Why does it matter?* This change aims to increase the efficiency of the listing process and improve the quality of submissions. By setting submission limits, our goal is to encourage thoughtful template submissions, reduce similar edits among multiple submissions, and expedite the review process. Read more about this change on our developer changelog. :rolled_up_newspaper: View on Changelog button :mega: Discuss on Community Forum button"
  }
]