[
  {
    "poster": {
      "poster_name": "Ariel - www.outsourceHubSpot.com",
      "poster_handle": "ariel.rajmaliuk603"
    },
    "time_stamp": "2020-07-15 05:55:48",
    "text": "Thank you Vesa!\n And do you know what is that error about?"
  },
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2020-07-15 06:11:20",
    "text": "No, I see it too but the theme gets created anyways. Kinda think it’s a bug since user cannot really do anything except to define a name for the theme in that dialog."
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2020-07-15 07:04:37",
    "text": "Is there going to be a recording for this?"
  },
  {
    "poster": {
      "poster_name": "Andrew Wilson",
      "poster_handle": "socialmedia"
    },
    "time_stamp": "2020-07-15 08:01:55",
    "text": "Does anybody have any ideas? I'm Looking for a solution regarding forms and personalization tokens. We have a form with a field for \"company name\"; when a guest fills out the form they are redirected to thank-you page or an inline thank-you message is displayed. The URL that they are redirected to contains a token <http://example.com//{{|example.com//{{> personalization_token('contact.employed_by__c', 'TRG-general') }}-retirement-guide.pdf\". The issue that I am having is that the time from when the form is submitted to the thank you page redirect is to fast. There is not a enough time for the contact to be created on the back-end (takes 10-20 seconds) and the token defaults instead of serving the dynamic material."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-07-15 08:27:57",
    "text": "Yep, there should be an email going out today to all registrants with the recording. We will also have a blog post on our developers blog that recaps the event with a video as well"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2020-07-15 08:40:30",
    "text": "Awesome thanks!"
  },
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2020-07-15 13:55:21",
    "text": "I'm very interested in this effort, and will help if I can. The information of page speed optimisations is, I feel, incomplete and at time contradictory - and Google PSI often confuses me more than it helps."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-15 14:02:15",
    "text": "There is definitely more detail that we want to include in the page speed doc, but where you find it incomplete or contradictory please do highlight it so we can improve it."
  },
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2020-07-15 15:19:17",
    "text": "Hi <@U7SL518D6> I'm not referring specifically to HubSpot's documentation but documentation on the topic in general. HubSpot can and will help, I have no doubt. Plus I'm not a proper developer, so I get easily confused and don't always know how to search out the right information. But I'm keen to understand and guide our developers and other HubSpot users, i.e. on community, as well as I can. In terms of contradiction (and I'm probably wrong here) I'm not clear on role of HubSpot's built in image optimisation vs. that of developers compressing images - as I write this I'm betting the two together produce the best results? Given that lazy loading seems to be the biggest single opportunity (on most of the sites I've seen) I'm surprised that I don't find greater clarity or consensus on when and how to implement it. I'm in awe of HubSpot's mobile PSI score of 92 and would love to know how to get close."
  },
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2020-07-15 15:19:59",
    "text": "<@UDHT6N5SM> found your post on community - will watch with interest."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-07-15 15:21:46",
    "text": "I’m editing it now. I starting gathering my thoughts late last night so it sounds like a crazy person wrote it."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-15 15:38:02",
    "text": "Thank you for elaborating Phil.\n\nI hear ya, in-general when talking performance optimization the hard part is there are some macro level things you can do, and then inside of those things tons and tons of micro level things.  We’re working to improve our speed doc to help cover more and more of the micro level things while still making it easy to understand at the macro level.\n\nSpecifically on the images question you had. Yes it is best to optimize images before uploading. HubSpot’s CDN does resize images, but there are several benefits to uploading appropriately sized images right off the bat.\n\nRegarding lazy loading, I would advise using native lazy loading and not a javascript plugin. It’s easy, just requires an html attribute, and gives browsers the control to influence performance."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-15 15:38:47",
    "text": "For a breakdown on how we did it for <http://HubSpot.com|HubSpot.com> <https://developers.HubSpot.com/blog/how-we-improved-page-speed-on-HubSpot.com>"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-07-15 15:39:35",
    "text": "really happy to see this thread actively running"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-07-15 15:39:49",
    "text": "<@UDHT6N5SM>, link to that crazy man post!!"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-07-15 15:42:20",
    "text": "<@UD53A9UUR> It’s slightly less crazy now but still very much in progress: <https://community.HubSpot.com/t5/CMS-Development/A-place-to-gather-resources-issues-and-solutions-to-optimize/td-p/354462>"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-07-15 15:42:56",
    "text": ":pray:"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-07-15 15:42:58",
    "text": "thanks!"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-07-15 15:44:28",
    "text": "np, I definitely hope to keep adding to it. I might have slightly different concerns than Phil mentioned (lots of overlap though) so this might be interesting"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2020-07-15 15:45:52",
    "text": "totally!  i like that it is somewhat general.  am thinking we will get some interesting ideas!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-07-15 15:58:27",
    "text": "Wow great read Andrey thank you for posting this. Not only will it help external folks but helps us internally to identify some less obvious items. forms being an example I see that I haven’t personally experienced."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-07-15 15:58:44",
    "text": "<@U7SL518D6> I think there are two distinct scenarios here. In the first scenario, I need to spend time learning about best practices and trying things out until something works.\n\nIn the other scenario, adding a HubSpot contact form (or chat) shows up as a big hit in testing/analytics and I have to “hack” something together to prevent it from loading right away or HubSpot is loading extra files but I’m not sure what they do."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-07-15 15:59:49",
    "edited": {
      "time_stamp": "2020-07-15 16:02:56"
    },
    "text": "I think you got it without that additional thought. I didn’t mean to pile on. :slightly_smiling_face:"
  }
]