[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2020-07-23 02:05:35",
    "text": "Hi <@UK277PCMP>, <https://www.cookiebot.com/de/> is also a solutions that i have been told works for HubSpot Sites, haven´t tried it myself yet."
  },
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2020-07-23 02:09:35",
    "text": "We need to be able to see what platform our incoming leads are using: mobile or desktop or tablet\npercentage of each are engaging with our material\npercentage of each that are booking meetings or asking questions\npercentage of each that have gone through to 'create proposal'\npercentage that have signed proposal\npercentage that have closed\n\nthis will be used to direct our marketing via FB, Insta etc\n1. any other metrics you can suggest would be appreciated\n2. if any metric requested is not possible, please continue with remainder as we need this quickly\n3. we have advertised with FB recently. is it possible to seperate out those leads who came in response to the FB marketing so we get\n a clearer picture if they came from FB marketing, what platform they use compared to if they did not come from the FB marketing\n\n\nhow I can do this in HubSpot ?"
  },
  {
    "poster": {
      "poster_name": "Aitor",
      "poster_handle": "aitor.tomas"
    },
    "time_stamp": "2020-07-23 02:11:58",
    "text": "I saw it while investigating about options, but I would have expected something more generic as a solution from HubSpot"
  },
  {
    "poster": {
      "poster_name": "Raman verma",
      "poster_handle": "ramanverma2005"
    },
    "time_stamp": "2020-07-23 03:56:33",
    "text": "<@UEZ3125LL> I am HubSpot designer and developer let me know what kind of menu are you looking for ?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2020-07-23 08:25:04",
    "text": "<https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1595514274217100>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-24 07:08:05"
      },
      {
        "time_stamp": "2020-07-24 07:38:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Shaun Gehrke",
      "poster_handle": "sgehrke"
    },
    "time_stamp": "2020-07-23 13:32:55",
    "text": "New to the channel: I am a php developer looking to build a dynamic HUBL template. I am looking to send an email with a link to a landing page and use all the great tracking variables that HubSpot has on a HubSpot landing page. I would like to start by printing all those variables back on the landing page after a user clicks the link. Is that available in the HUBL language?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-07-23 13:45:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2020-07-23 13:45:06",
    "text": "Hey Shaun, HubL is a templating language similar to blade in Laravel. Check out the HubL docs for available variables: <https://developers.HubSpot.com/docs/cms/hubl/variables>\n\nAny contact property in the CRM is available within the `{{contact}}` object. Also useful: the \"Developer Info\" view in the sprocket menu will show all the data that's available to you in HubL on a particular page (you may need a JSON parsing browser extension) and you can also use the |pprint filter to pretty print an object or dict to see its available props."
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2020-07-23 14:07:05",
    "edited": {
      "time_stamp": "2020-07-23 14:07:19"
    },
    "text": "<@U26BLKGE4>, so I did not realize that HubSpot only makes one “Flexible” redirect when renaming a blog url, it used to be that it created a redirect for every post like a year or so ago, now that they upgraded this, seems like it would be easy enough to just rename the original blog to “/blog-old”, then delete one flexible redirect, then rename my temp named blog to “/blog” which would then reactivate all those original blog post URLs"
  }
]