[
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2020-07-22 03:24:06",
    "edited": {
      "time_stamp": "2020-07-22 03:24:37"
    },
    "text": "Thanks for this AJ. It's good that Cloudflare now has an infrastructure in China, but do you know if HubSpot CMS customers automatically benefit from this? This article describes how challenging the China market is and ends by indicating that business have to request access to the China network: <https://blog.cloudflare.com/how-we-extended-cloudflares-performance-and-security-into-mainland-china/>"
  },
  {
    "poster": {
      "poster_name": "Aitor",
      "poster_handle": "aitor.tomas"
    },
    "time_stamp": "2020-07-22 04:56:55",
    "text": "I am wondering how you people comply with GDPR regulation about blocking tracking scripts/cookies before having the consent of the user. We use iubenda which allows to do so, but we are struggling with HubSpot's CMS templates and its HubSpot tracking code. It gets added via `standard_footer_includes` and therefore we cannot apply the custom class that iubenda requires to block/unblock the scripts. We have taken a look to the HubSpot's cookie consent solution but, apart from the fact that it is too basic, it seems to handle the blocking/unblocking script only for HubSpot, but what do you do then with other scripts (for example LI retargeting)?",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2020-07-22 08:08:33"
      },
      {
        "time_stamp": "2020-07-22 08:09:09"
      },
      {
        "time_stamp": "2020-07-22 08:25:37"
      },
      {
        "time_stamp": "2020-07-22 08:44:20"
      },
      {
        "time_stamp": "2020-07-22 11:45:59"
      },
      {
        "time_stamp": "2020-07-23 02:05:35"
      },
      {
        "time_stamp": "2020-07-23 02:11:58"
      },
      {
        "time_stamp": "2020-07-29 02:24:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nenad Kostic",
      "poster_handle": "nenad"
    },
    "time_stamp": "2020-07-22 06:03:54",
    "text": "Create separate form for each device. In contacts you can find which is form filled. Create enrollement in workflow for .\nDid it help?"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-07-22 08:08:33",
    "text": "```_hsq.push([\n    \"addPrivacyConsentListener\",\n    function(consent) {\n      if (consent.allowed === true) {\n\n      } else if (consent.allowed === false) {\n\n      }\n    }\n  ]);```\n"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-07-22 08:09:09",
    "text": "You can use add a privacy consent listener and then fire or not fire any tracking from there"
  },
  {
    "poster": {
      "poster_name": "Aitor",
      "poster_handle": "aitor.tomas"
    },
    "time_stamp": "2020-07-22 08:25:37",
    "text": "so basically this approach is forcing me to use HubSpot's cookie solution, no way to use an external 3rd party service, no? And how do you deal with Facebook Connect, Twitter Button and Twitter Syndication? They seem to be loaded with `standard_header_includes`"
  },
  {
    "poster": {
      "poster_name": "Aitor",
      "poster_handle": "aitor.tomas"
    },
    "time_stamp": "2020-07-22 08:44:20",
    "edited": {
      "time_stamp": "2020-07-22 08:44:27"
    },
    "text": "I have tested and it seems to work. We normally use iubenda and have a \"per purpose\" consent policy which is not available in HubSpot solution :disappointed: but at leas I can block the tracking until consent is given.\nThanks for the help"
  },
  {
    "poster": {
      "poster_name": "Gavin Cohen",
      "poster_handle": "gavin"
    },
    "time_stamp": "2020-07-22 11:04:37",
    "text": "Thanks. This is a terrific suggestion. I'm sure I can figure out something, but is there an easy way to target which form shows on mobile vs desktop?"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2020-07-22 11:45:59",
    "text": "Sorry, just seeing this now.  Glad you were able to get it to work.\n\nI’m just using this function to push an event to Google Tag Manager and then loading all my tracking scripts from there.\n\nGood question about Facebook Connect, Twitter button and Twitter Syndication.\n\nAs far as I know, those weren’t an issue for me."
  },
  {
    "poster": {
      "poster_name": "Andrew Gantan",
      "poster_handle": "andrew.gantan"
    },
    "time_stamp": "2020-07-22 12:27:28",
    "text": "Hello, my name is Andrew from Accelo, and  I have been directed here from HubSpot support.  I would like to request assistance on a small change on our <https://app.HubSpot.com/ecosystem/3966505/marketplace/apps/productivity/project-management/accelo|HubSpot Integration> page. Can someone point me in the right direction? Thanks!"
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2020-07-22 14:10:06",
    "text": "Anyone by chance have a navigation menu module or code they would be open to sharing? I'd even be willing to pay a little if it saves me a few hours of work.\n\nI like the native HubSpot menu module, but I don't want to use JQuery. Need either simple JS or CSS for mobile hamburger menu. I looked on the Marketplace and didn't see anything useful. I can spend a day figuring out the HubSpot menu classes and implementing in CSS, but I'd rather not reinvent the wheel if someone has something already that works with HubSpot menu functionality without using JQuery. Thanks!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-22 14:17:37"
      },
      {
        "time_stamp": "2020-07-22 14:48:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Josh A",
      "poster_handle": "josh307"
    },
    "time_stamp": "2020-07-22 14:17:37",
    "text": "I haven’t tried it before but here is a CSS only multi-level menu from the Code Gallery.\n<https://designers.HubSpot.com/code-gallery/entry/founders/adriancblack-css-only-HubSpot-responsive-multi-level-nav>"
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2020-07-22 14:48:14",
    "text": "Awesome, thanks <@U010F27NS6L>! Will check it out. I didn't even know there was a Code Gallery. That's a good resource to know in general."
  }
]