[
  {
    "poster": {
      "poster_name": "Brett Hooker",
      "poster_handle": "brett.hooker075"
    },
    "time_stamp": "2023-05-01 02:12:51",
    "text": "<@UQWGKUEN7> Thanks for the tip.  I've studied the endpoint in graphql and cannot find \"contact_signers\" anywhere."
  },
  {
    "poster": {
      "poster_name": "Brett Hooker",
      "poster_handle": "brett.hooker075"
    },
    "time_stamp": "2023-05-01 02:14:46",
    "text": "When I create the quote through automation, the Signer value doesn't get set (neither do the values hs_esign_num_signers_completed and hs_esign_num_signers_required).  If I go back through the UI I can set the \"Required Signatures\" by checking boxes next to the email addresses and then the eSign quote works fine.\nI'll keep looking, but it seems I need to set the Signing contacts somewhere."
  },
  {
    "text": "Hi All,\n\nBy using form API I am sending data to the HubSpot form,\nIn the form I have a Multiple Checkbox field, but when I check the Submission values it shows error like below,",
    "time_stamp": "2023-05-01 04:37:06",
    "edited": {
      "time_stamp": "2023-05-01 04:37:43"
    }
  },
  {
    "poster": {
      "poster_name": "Dewayne Higgs",
      "poster_handle": "dewayne"
    },
    "time_stamp": "2023-05-01 08:42:10",
    "text": "Hey everyone, who can I talk to regarding the Files API?  Right now I have a blocker involving HubSpot's current CloudFlare content scanning setup incorrectly labelling certain files as malicious, even though they are not, and because of this mislabeling, these same files are not being uploaded via the Files API."
  },
  {
    "time_stamp": "2023-05-01 10:00:13",
    "text": "Reminder: *Want to be the first to know when a new API is available or an existing API has a new version?*  We publish all of that on our <https://developers.HubSpot.com/changelog|Developer Changelog>.  While we do our best to avoid <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes> to our APIs, sometimes for security, and reliability we have to. The Changelog is where we’ll post announcements ahead of time about it. <https://developers.HubSpot.com/changelog|Subscribe to the Developer Changelog> to stay up-to-date on what’s happening in the world of HubSpot development."
  },
  {
    "poster": {
      "poster_name": "Osvaldo Ayala",
      "poster_handle": "ayala.osvaldo"
    },
    "time_stamp": "2023-05-01 11:03:18",
    "edited": {
      "time_stamp": "2023-05-01 11:03:43"
    },
    "text": "Hi, I'm trying to create a reporting bot but have a couple of questions:\n\n1. I'm aware you're unable to setup sales goals unless you have at least the Starter tier.\n2. Do I need to pay this tier in order to access the `goals` API?"
  }
]