[
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-02-27 10:33:59",
    "edited": {
      "time_stamp": "2020-03-04 09:04:53"
    },
    "text": "Hello Developers, \n\nWe have a couple pieces of exciting news to share.\n\n*First*, the CMS Boilerplate is now out of beta! The CMS Boilerplate is the fastest way to get starting building on the CMS. We are excited to share this progress and look forward to continue to iterate on it with your feedback to make it even better in the future.\n\nLearn more here: <https://github.com/HubSpot/cms-theme-boilerplate>\n\n*Second,* We will be opening the Asset Marketplace to start accepting Theme submissions on 3/10. Here at HubSpot, we believe Themes represent the future of how marketer-friendly websites will be designed on the HubSpot CMS. Developers who wish to build websites that delight content creators and use the latest HubSpot CMS features should start utilizing Themes.\n\nSee full announcement here: <http://bit.ly/2TmpUj3>\n\nBuild your next site as a theme and try to use drag-and-drop areas today! Can’t or don’t want to? Let us know why."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-02-27 12:44:20",
    "text": "<@U26AKMZ19> the hope if groups are required was to have a specific font, text-transform, and font-styles all in the same group. Ideally, just having those connected to one font is ideal. It’s too much trouble creating separate groups for every font"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2020-02-27 15:45:32",
    "text": "<@U7SL518D6> thanks that does help. `fallback` is nice to have."
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2020-02-27 15:50:42",
    "text": "Yes - that definitely makes sense! Will definitely pass this feedback along."
  }
]