[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-08-31 08:54:36",
    "text": "I didnt realize it at first- but they are using a  vidyard plugin that is converting all the videos to vidyard format automatically. If I toggle off the sharing settings after uploading the video then I can just use the normal URL and I dont have to go searching for the hidden vidyard URL."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-08-31 15:29:10",
    "text": "Hi All! I think I have an easy question. I have a hubdb that is joined to another hubdb via the foreign_id option. In a custom module, I am pulling all the items from the fist Hubdb, and I want to build a select field that will operate as a quick filter pulling only the unique values from that foreign_id field. What is the correct Hubdb call to get only the unique values from that foreign_id column?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-08-31 15:45:01"
      },
      {
        "time_stamp": "2020-08-31 15:46:40"
      },
      {
        "time_stamp": "2020-08-31 15:57:11"
      },
      {
        "time_stamp": "2020-08-31 15:57:34"
      },
      {
        "time_stamp": "2020-08-31 16:00:01"
      },
      {
        "time_stamp": "2020-08-31 16:00:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-08-31 15:45:01",
    "text": "Can u describe your use case with some examples?"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-08-31 15:46:40",
    "text": "Via HubL, you will get access to the  selected foreign table rows and you need to iterate the rows and get the unique values of the column you are interested.."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-08-31 15:57:11",
    "text": "Hi Gobi, thanks for the response. That is exactly what I want to do, grab the unique values out of that column. The original Hubdb is going to be a list of items that the client can add to a page and filter based on the ‘contains’ parameter, so they only show what items from that hubdb that they want. I want to look at those items, and build a small select field with the unique values in that foreign_id column to make a quick / simple js filter of those items from the original Hubdb."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-08-31 15:57:34",
    "text": "I have a super basic prototype in my portal if you want to take a look. It can be tom as well, no hurry as i know its late in the day"
  },
  {
    "poster": {
      "poster_name": "Gobi Selvaraj",
      "poster_handle": "gselvaraj"
    },
    "time_stamp": "2020-08-31 16:00:01",
    "text": "send me the link."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-08-31 16:00:38",
    "text": "<https://app.HubSpot.com/design-manager/2659978/modules/34325312832>"
  }
]