[
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-04-09 01:58:26",
    "text": "<@U04CC57CMBP> yeah testing it is no problem, I just ensure my test contact has whatever properties that would make stuff appear. So in my inbox I see the actual results. It's just ugly and annoying in the actual email editor. Not to mention that it's confusing for the end user content creator who only sees a white block and doesn't understand if his email is working or not.\n\nI'll have a look at that beta"
  },
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-04-09 02:45:21",
    "text": "<@U04CC57CMBP> I actually never realised the preview function, when previewing as a specific contact, would pull in that data too. It already works even without that beta. Still doesn't really fix the issue though, I'm looking for something to show inside the actual editor. Maybe I can solve it in the code, with an {% if %} to show some placeholder content if ... if what actually? It would only need to show something like \"This module will be auto populated once the email is sent\", just so the editor has something to look at other than that blank box, but I have no idea how to proceed :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-04-09 02:52:13",
    "text": "Yeah I doubt you'd be able to do it haha\n\nI've had to explain to clients many times that it does work you just can't see it haha"
  },
  {
    "poster": {
      "poster_name": "Srishida i",
      "poster_handle": "srishida.illath"
    },
    "time_stamp": "2024-04-09 09:05:58",
    "text": "Hi there! I am working on an email template project where I have a request to dynamically populate \"rate\" information based on the customer's region. The ask was to host rate information in a central location and have the email template populate it dynamically based on what region the person was in.\n\nIn HubSpot, can I identify the person's region based on where he opens the email? Would that be a good approach? Please let me know your thoughts! Thanks, Sri",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-09 10:43:52"
      },
      {
        "time_stamp": "2024-04-10 05:24:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2024-04-09 10:43:52",
    "text": "You’re better off collecting that somehow as your own data directly from the user. Trying to guess someone’s location based on where they open the email is not accurate due to proxy servers ISPs use. Additionally someone could open an email away from home (i.e. vacation) or while using a VPN which may then not provide accurate info."
  }
]