[
  {
    "poster": {
      "poster_name": "Bob Balm",
      "poster_handle": "bob209"
    },
    "time_stamp": "2024-04-17 08:17:17",
    "text": "Has anyone tried this before? I'm sure it should be possible somehow with the Programmable email beta...\n\nI have:\n• A *custom object* Machines, with Brand as a string / text property\n• A *contact* property \"Machine brand list\", which is a *multiselect* property. This keeps track of machine brands bought by the contact in the past.\n• A workflow that will append a purchased Machine's brand as selected in the contact's multiselect property once they buy it.\nWhat I want to do:\n• Write a crm_objects() function in an email that will fetch Machines from my CO where the Brand property matches *any* of the ticked options the recipient contact's \"Machine brands list\" property. Basically I want to show them a list of products of the same brand as any of their past purchases. \nSo far I've got:\n```{% set machine_brand_list = contact.machine_brand_list.value|split(\",\") %}\nMachine brand list variable: {{ machine_brand_list|pprint }}&lt;br&gt;&lt;br&gt;\n{% set querydt =\"brand=\"~contact.machine_brand_list.value|split(\",\") %}\nQuery: {{ querydt|pprint }}&lt;br&gt;&lt;br&gt;\n{% set events = crm_objects(\"machine\", querydt, \"bunch of fields here\") %}\nResults: {{ events.results|pprint }}```\nI use the pprints to debug. What I get as return values:\n```Machine brand list variable: (SizeLimitingPyList: [Linde, BT])\n\nQuery: (String: brand=[Linde, BT])\n\nResults: (SizeLimitingPyList: [])```\nSo the first one is cool - I've mapped the values of my multiselect property to an array.\nNow I can't figure out what to put in my querydt variable to basically make it go \"Get Machine records where the Brand property value matches one of the values in this array\".\n\nI've tried `brand__in` and `brand__contains` but neither produces any results.\n• The latter doesn't seem suited, because it would work the other way around. It looks for CO records where the Brand property contains the entire array.\n• The former doesn't seem to do anything. I doubt if this is even a supported operator as it's also not in the documentation. \nHas anyone tried to build something like this before and see what I'm doing wrong?"
  }
]