[
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-01-10 16:14:18",
    "text": "Hi Sergey, can you please DM the names of the themes and I will check. Per the rules, for themes entered into the contest, the time in which we will be approving those themes is:\n\n&gt; Marketplace Approval Period: January 31, 2022 (9:00am Eastern Time, USA) – February 14, 2022 (5:00pm Eastern Time, USA) (the “Marketplace Approval Period”)"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-01-10 16:14:44",
    "text": "Hey Dustin, let me circle up with some people on this to verify for you."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-10 16:48:35",
    "edited": {
      "time_stamp": "2022-01-10 16:50:09"
    },
    "text": "Alright, thanks AJ.\n\nIf you decide yes, it is a deal breaker (I hope not), I would like the reasoning, if you can share that. I assume it would be for performance reasons, but I'd like to know the process behind how it's detrimental to performance. In my case, I'm simply using it as an easier way to import something globally into every module.\n\nI could do so without the import as well, but it makes things much better having a centralized place for the code where I only have to modify it once in one place and the changes are reflected in every module, rather than having to then go through and modify every single module."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-01-10 17:28:00",
    "text": "Would you be able to provide me a link (can DM if you need to) to the module? I can look it over tonight (am away from comp at the moment) and review with folks in the AM as it's after hours right now for the team"
  },
  {
    "poster": {
      "poster_name": "Sergey Sedykh",
      "poster_handle": "sergey.sedykh"
    },
    "time_stamp": "2022-01-10 23:35:23",
    "text": "Thanks for the super quick reply <@U2H3TT8F2>! I've just DM you :pray:"
  }
]