[
  {
    "poster": {
      "poster_name": "Casper Kraken (HubDo)",
      "poster_handle": "casper928"
    },
    "time_stamp": "2023-12-22 02:43:19",
    "text": "yeah it seems to be more on user actions, not integration wise. Otherwise that would be awesome.\n\nWe are seeing some same kind of issue where some associated taxes to quotes are disappearing, but it has been hard to debug it, so if you learn anything <@U25PYL3Q8> I would be keen to know any info/insights"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-22 07:16:04",
    "text": "Okay sounds good, I have to get client to agree to allow me to bill for it — if they do I’ll share any progress I find"
  },
  {
    "text": "Hello everyone!\nI'm reaching out with a technical issue I'm facing and would greatly appreciate any assistance. My challenge involves aspects of workflows, APIs, and JavaScript, and I'm not sure where to best pose this question.\nHere's the situation: I have a Lambda function that makes calls to two APIs:\n1. *Get Property Information*\n2. *Patch New Property Option*\nWhen I run tests using Postman, everything functions flawlessly. The response is a 200 status code with the message “Value added successfully”. I've verified that the property value has indeed been successfully updated as indicated by the response. However, the problem arises when I try to execute this via a workflow. In this case, I still receive a 200 status code, but with “body: null,” and the property value does not update.\nTo isolate the issue, I conducted a test in Postman where I deselected all default headers and identified that the request must include these four specific headers for a successful operation.\nIf any of these headers are missing, I encounter the same issue: a 200 status code with “body: null,” and no update to the property value.\nThe complication is that within the workflow, I don’t have the option to add any custom headers. I'm uncertain if the absence of these headers is the root cause of the issue or if there's something else I'm overlooking.\nI greatly appreciate your time and any insights you can provide on this matter. Thank you!",
    "time_stamp": "2023-12-22 07:22:27"
  },
  {
    "poster": {
      "poster_name": "Callum Soutar",
      "poster_handle": "callum.soutar"
    },
    "time_stamp": "2023-12-22 15:10:06",
    "text": "Hi everyone. I have an automation that creates a new custom object (through Zapier HTTP POST request) using a private app (and token). This all seems to work fine, but then the next step in Zapier is to create an association with the new object, and a contact record. This seemed to work a week ago, but no longer does. I am wondering if there is anything I could do differently to get this up and running. All I am using, is a simple HTTP PUT Method inside of Zapier, where I pass it the endpoint, and headers including the bearer token.\n\nWhere a custom object ID that has been created recently is for example XXXXX and the contact ID I would like it to be associated with is YYYYY, my code looks like: <https://api.HubSpot.com/crm/v3/objects/2-21526658/XXXXX/associations/contacts/YYYYYY/35>\n\nThen the headers below which are application/json and the bearer token.\n\nAny help would be very much appreciated thank you!",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-12-22 19:14:03"
      },
      {
        "time_stamp": "2023-12-23 12:22:00"
      },
      {
        "time_stamp": "2023-12-23 13:36:05"
      },
      {
        "time_stamp": "2023-12-26 09:22:48"
      },
      {
        "time_stamp": "2023-12-26 09:22:59"
      },
      {
        "time_stamp": "2023-12-26 11:11:30"
      },
      {
        "time_stamp": "2024-01-08 08:16:21"
      },
      {
        "time_stamp": "2024-01-10 16:57:05"
      },
      {
        "time_stamp": "2024-01-10 17:22:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2023-12-22 19:14:03",
    "text": "are you able to add a post body to your original object record creation? if you are able to on your plan then you could add the association inside the create zap and it would associate the record by the post data. "
  }
]