[
  {
    "poster": {
      "poster_name": "Patrick O'Neal",
      "poster_handle": "poneal"
    },
    "time_stamp": "2018-03-13 07:38:17",
    "text": "Not sure if this has been brought up yet. When transferring templates to other portals, is there a way to select more than one template? I’m only seeing the ability to do so on the template that is open at the time."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-13 08:19:24",
    "text": "I was able to, think I had to ctrl/cmd click multiple items.\n\nI do remember there were a lot of bugs when I did it though if you tried to copy resources of different types(coded files + builder templates + modules) but I’d suggest giving it a try because that should ultimately work."
  },
  {
    "poster": {
      "poster_name": "Patrick O'Neal",
      "poster_handle": "poneal"
    },
    "time_stamp": "2018-03-13 08:21:50",
    "text": "Awesome! Thanks!"
  },
  {
    "text": "Love seeing this little addition today!",
    "time_stamp": "2018-03-13 15:20:32"
  },
  {
    "text": "A file, which can't be shown because your team is past the free storage limit, was commented on.",
    "time_stamp": "2018-03-13 15:24:53"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-13 15:42:32",
    "edited": {
      "time_stamp": "2018-03-13 15:43:02"
    },
    "text": "Feedback on the HuBL reference added to DM2 - Please update the reference to exclude(or add a big deprecated notice to) the tags and functions that are no longer supported:\n* Include\n* extends \n* raw_jinja\n* raw_html  \n* include_css\n* include_js\n*head_css\n*head_js\netc.\n\nThank you."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-03-13 16:02:35",
    "text": "Suggestion: it’d be awesome if in the right click context menu for a template if you added “Create New Staged Page” and it would work as if you created a brand new page through content staging.\n\nUse-case: when doing re-designs we typically try to do everything except the blogs in content staging to prevent people from stumbling upon the pages, also makes it so the pages can link to eachother within staging."
  }
]