[
  {
    "poster": {
      "poster_name": "Dhayanand Velmurugan",
      "poster_handle": "dhayanand"
    },
    "time_stamp": "2025-01-29 01:15:54",
    "text": "Hey everyone,\nMy team is experiencing an issue with custom workflow actions. We have a custom action with four select input fields, where each selection triggers an API call to our external server. Previously, in the second, third, and subsequent API calls, the values selected in the previous fields were included in the request.\nHowever, for the past 3 to 4 days, this behavior has changed. Now, when selecting the third input field, the API call only includes the second field's value, but not the first one. This was working fine for the past year, but the issue started occurring suddenly.\nHas anyone else encountered this issue? Any insights would be greatly appreciated."
  },
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2025-01-29 01:58:44",
    "text": "Thank you Anton! For clarity, what is full custom \"twister\"?"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2025-01-29 02:02:05",
    "text": "hey - autocorrect :smile: it should have been \"template\""
  },
  {
    "poster": {
      "poster_name": "Sabreen Sansi",
      "poster_handle": "sabreen.sansi"
    },
    "time_stamp": "2025-01-29 03:40:10",
    "text": "Thank you, Ahmed - that is helpful.\n\nIts strange because it is not happening to any of the other domain urls just the HubSpot landing pages.\n\nI've created a URL cleaner tag until I can figure out what or where this might be occurring from. Even if i remove the domain from the conversion tracking it still there."
  },
  {
    "poster": {
      "poster_name": "Juha Lehtonen",
      "poster_handle": "juha.t.lehtonen.91"
    },
    "time_stamp": "2025-01-29 03:52:30",
    "text": "Hi all!\n\nI have an automation Workflow with a *custom code action* connected to a form on a page. That page has a specific language set to it. What would be the best way for me to access the language information within that custom code action? Is it pre-populated in some variable by HubSpot somehow?"
  },
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2025-01-29 04:10:15",
    "text": "You're welcome.\n\nDid you connect GA or Google Ads with HubSpot <@U08771V9M9D>? Also is this issue wide for all landing pages or just a few? Alternatively you can try adding a rule in HS URL redirects to remove them dynamically."
  },
  {
    "poster": {
      "poster_name": "Sabreen Sansi",
      "poster_handle": "sabreen.sansi"
    },
    "time_stamp": "2025-01-29 04:28:34",
    "text": "I've connected the Google Ads to HubSpot"
  },
  {
    "poster": {
      "poster_name": "Sabreen Sansi",
      "poster_handle": "sabreen.sansi"
    },
    "time_stamp": "2025-01-29 04:29:07",
    "text": "all HubSpot landing pages this is occuring on - the corporate pages built on Wordpress are fine"
  },
  {
    "poster": {
      "poster_name": "Mariia Berezhna",
      "poster_handle": "mashaberezhna0209"
    },
    "time_stamp": "2025-01-29 05:12:50",
    "text": ":rocket: *Join the HubSpot Devs Ukraine Community!* :rocket:\nHey everyone! :wave:\nAre you from Ukraine? :flag-ua: Then this is the perfect community for you!\nI’d love to invite you to be part of *<https://www.meetup.com/HubSpotdevsukraine/?eventOrigin=your_groups|HubSpot Devs Ukraine>* – a dynamic space for Ukrainian developers, marketers, and tech enthusiasts passionate about HubSpot.\n\n:sparkles: *Why Join?*\n:heavy_check_mark: Connect with like-minded professionals\n:heavy_check_mark: Stay updated on the latest HubSpot trends &amp; best practices\n:heavy_check_mark: Participate in insightful discussions &amp; networking events\n:heavy_check_mark: Learn from industry experts\n:heavy_check_mark: *Find new work opportunities and project collaborations*\n:heavy_check_mark: *Support and grow the Ukrainian tech community*\n\nClick the link to *join us today* and become part of an engaging, innovative network. Looking forward to seeing you there! :rocket::bulb:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-29 11:58:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jan Ekholm",
      "poster_handle": "jan.ekholm"
    },
    "time_stamp": "2025-01-29 06:58:42",
    "text": "I’m doing some product data updating via REST and the Python API. Things are mostly working well as I can fetch products along with properties I need as well as update products with changed properties. I see the changed properties just fine in HubSpot. However, for some update I get this HTTP error:\n```HTTP response body: {\"status\":\"error\",\"message\":\"Cannot set PropertyValueCoordinates{portalId=144691183, objectTypeId=ObjectTypeId{legacyObjectType=PRODUCT}, propertyName=hs_sku, value=60200668} on 36654815432. 36079598779 already has that value.\",\"correlationId\":\"e770dcdf-660a-41ce-b405-427cb05e90e3\",\"category\":\"VALIDATION_ERROR\"}```"
  },
  {
    "poster": {
      "poster_name": "Jan Ekholm",
      "poster_handle": "jan.ekholm"
    },
    "time_stamp": "2025-01-29 07:00:59",
    "text": "This when I’m updating the `hs_sku` property. Why would I get an error if the value happens to be the same?"
  },
  {
    "poster": {
      "poster_name": "Stefan Kovacic",
      "poster_handle": "stefan.kovacic"
    },
    "time_stamp": "2025-01-29 07:04:18",
    "text": "I accidentally deleted the Landing Page, is there a way to recover it or do I have to contact customer support?"
  },
  {
    "poster": {
      "poster_name": "Jan Ekholm",
      "poster_handle": "jan.ekholm"
    },
    "time_stamp": "2025-01-29 07:18:30",
    "text": "Although in this case I’m most definitely certain that the product does not have a `hs_sku` set at all and I’m setting it to something valid, ergo they are different. Sounds like a bug in the API."
  },
  {
    "poster": {
      "poster_name": "KiriChili",
      "poster_handle": "kirishanth.rajaraj"
    },
    "time_stamp": "2025-01-29 08:17:49",
    "text": "Hello everyone, im having trouble with some contacts of ours that got merged.\nOne of our non HubSpot forms seemed to have caused merging of some contacts that it created, because of some cookie setting that was turned on in the HubSpot settings.\n\nWhat we want to do now is, safely umerge those contacts, without losing any data from all the merged contacts. They are all listed within one contact as additional email.\n\nVery much grateful for your help:+1:"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2025-01-29 10:55:01"
  },
  {
    "poster": {
      "poster_name": "Jorge Teixeira",
      "poster_handle": "jteixeira"
    },
    "time_stamp": "2025-01-29 11:52:59",
    "text": "Hey guys, My name is Jorge Teixeira. I work at the Diocese of Paterson and I hope to get to know all of you and to see how we can help each other navigate this great API!"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2025-01-29 11:58:21",
    "text": "Hey <@U04FF4AE9V2>! This looks like such a fantastic event, so excited to learn more about it - just messaged you :slightly_smiling_face: As a heads up, we typically reserve any promotional posts for the <#C0121KGC6RM|showcase> channel - I'll leave this one up this time but kindly use <#C0121KGC6RM|showcase> for any future promos. Thank you!!"
  },
  {
    "poster": {
      "poster_name": "Antonio Garcia",
      "poster_handle": "antoniogarcia.gt"
    },
    "time_stamp": "2025-01-29 13:07:55",
    "text": "Sad news!\n\nI rely on the historical messages here to explore specific behaviors that you typically won’t find in forums or documentation. This resource has proven to be incredibly useful, and I strongly encourage HubSpot to preserve that content in some form. I’m sure there are many others benefiting from it just like I do."
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2025-01-29 13:17:38",
    "text": "We are hoping to be able to provide a link to download an export of the historical data, but there are some legal considerations our team is looking into. I will keep you all posted!"
  },
  {
    "poster": {
      "poster_name": "Dan Guenet",
      "poster_handle": "dan425"
    },
    "time_stamp": "2025-01-29 22:49:07",
    "text": "Just submitted my first app the the HubSpot marketplace. Trying to connect with others building public HubSpot apps. Shoot me a dm if that’s you!"
  }
]