[
  {
    "poster": {
      "poster_name": "Amaan Wani",
      "poster_handle": "amaan"
    },
    "time_stamp": "2025-01-07 01:34:17",
    "text": "<@U087FF89T8B> hey there, What I think from the screenshot is that there's some additional css applied in your form in your external site. Maybe display:flex; property try to remove it."
  },
  {
    "poster": {
      "poster_name": "Mohamed Yamani",
      "poster_handle": "elamine.yamani"
    },
    "time_stamp": "2025-01-07 02:50:30",
    "text": "Hello everyone, hope you're all having an amazing day :slightly_smiling_face:!"
  },
  {
    "poster": {
      "poster_name": "Jennifer Craig",
      "poster_handle": "jcraig"
    },
    "time_stamp": "2025-01-07 06:25:14",
    "text": "Good morning, has anyone had any luck using workflows to automatically associate contacts or leads to deals?"
  },
  {
    "poster": {
      "poster_name": "Harriet Newell",
      "poster_handle": "harriet.newell807"
    },
    "time_stamp": "2025-01-07 07:42:41",
    "edited": {
      "time_stamp": "2025-01-07 07:43:06"
    },
    "text": "Hi everyone, I've been tasked with creating a database flow map (mapping out the HubSpot database) to show how a contact moves through HubSpot. For example, a new contact enters the database... whats the first engagement that happens, do they go into an email workflow, that kind of thing. Also looking at what channels they come in from, eg Paid. My manager basically wants to see their journey mapped out in Miro but i'm unsure where to start with this.\n\nHas anyone done this before and able to share some starting points or examples? I'd greatly appreciate it!\n\nHave a good day!"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2025-01-07 09:00:43",
    "edited": {
      "time_stamp": "2025-01-07 09:01:11"
    }
  },
  {
    "poster": {
      "poster_name": "Sylvia King",
      "poster_handle": "sylvia.king"
    },
    "time_stamp": "2025-01-07 11:54:55",
    "text": "Yes! Happening now. Also with my sister company. They removed HubSpot-added redirects containing ?p=xxxx and got it to work. I found one with /? and removed it but am still troubleshooting. If you found a solution, please supply it here."
  },
  {
    "poster": {
      "poster_name": "Timothy Neighbors",
      "poster_handle": "tim570"
    },
    "time_stamp": "2025-01-07 11:58:46",
    "text": "We had this happen this morning to an entirely different domain where their homepage suddenly started redirecting to 404 page …luckily PingdomAlert caught the outage for us"
  },
  {
    "poster": {
      "poster_name": "Timothy Neighbors",
      "poster_handle": "tim570"
    },
    "time_stamp": "2025-01-07 12:01:31",
    "edited": {
      "time_stamp": "2025-01-07 12:03:18"
    },
    "text": "As a follow up to my original post- the support team got back to us and told us  “due to a job that was run, which had some unexpected effects, causing certain domains to be updated in unintended ways. “"
  },
  {
    "poster": {
      "poster_name": "Ruarri Serpa",
      "poster_handle": "rserpa"
    },
    "time_stamp": "2025-01-07 14:15:17",
    "text": "Has anyone noticed degradation in service for reverse proxies? I've had my ~80 domains connected to HubSpot via reverse proxy going on two years now, but it seems like recently they disconnect, and stay disconnected. In my setup, I have groups of domains running through common Cloudfront distributions. For the domains on any particular distribution, I will have some that are connected and passing all checks in HubSpot, and others that are disconnected."
  },
  {
    "poster": {
      "poster_name": "Timothy Neighbors",
      "poster_handle": "tim570"
    },
    "time_stamp": "2025-01-07 19:22:16",
    "text": "<@U087K62MM2R> - for the fix for us was removing similar redirects with query strings.  The ones we had causing this were older legacy ones…so the HubSpot Product team must have updated the way Query string redirects are treated"
  }
]