[
  {
    "poster": {
      "poster_name": "Erik Reijrink",
      "poster_handle": "erik782"
    },
    "time_stamp": "2025-01-17 01:06:50",
    "edited": {
      "time_stamp": "2025-01-17 01:07:15"
    },
    "text": "Hi everyone, I'm new here. Just joined today. So I am unsure where to post my question.\n\nI need help changing how our Cookiebot consent banner is shown on our website when using mobile phones.\nContacting Cookiebot support did not get me any where. And the advice of HubSpot support was to ask for assistance here.\n\nThe problem has to do with global styling rules affecting the banner.\n\nWhere do I go from here?\nThank you so much for any replys and help you can offer."
  },
  {
    "poster": {
      "poster_name": "Arnel Labastilla",
      "poster_handle": "arnel244"
    },
    "time_stamp": "2025-01-17 02:45:12",
    "text": "Hello, what is the right channel to ask regarding the HubSpot data warehouse?"
  },
  {
    "poster": {
      "poster_name": "Melissa Nault",
      "poster_handle": "melissa525"
    },
    "time_stamp": "2025-01-17 09:23:27",
    "text": "BLOG REPUBLISH QUESTION regarding the option to re-send blog notification emails for updated/republished posts. It looks like people have been <https://community.HubSpot.com/t5/HubSpot-Ideas/Option-to-Send-Blog-Notification-Emails-for-Re-Published-Posts/idi-p/269627|asking HubSpot for this option> for years. Does anyone have a good workaround? Or, is there a way to manually create an email template that could pull from a particular blog post? I understand it might be easier to just build the one-off emails but we do a lot of \"update blogs\" for clients so it would save time to have it automated a bit. Thank you!"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2025-01-17 12:05:01",
    "edited": {
      "time_stamp": "2025-01-17 12:05:05"
    }
  },
  {
    "poster": {
      "poster_name": "Alan Martinez",
      "poster_handle": "alan.martinez"
    },
    "time_stamp": "2025-01-17 17:49:05",
    "text": "Hi all!\n\nDoes anyone know if is it possible to import a contact list without having the email address?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-17 18:18:44"
      },
      {
        "time_stamp": "2025-01-17 19:09:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zach Klein",
      "poster_handle": "zach282"
    },
    "time_stamp": "2025-01-17 18:18:44",
    "edited": {
      "time_stamp": "2025-01-17 18:19:12"
    },
    "text": "Hi <@U07VDEB7LKF> :wave:\nGenerally speaking, it is technically possible to create HubSpot Contacts without populating the email address property. So I'd imagine this would be possible via a Contact import, but I could be wrong."
  },
  {
    "poster": {
      "poster_name": "Alan Martinez",
      "poster_handle": "alan.martinez"
    },
    "time_stamp": "2025-01-17 19:09:01",
    "text": "thanks for your response. I did a manual Contact Import in the CRM and it worked."
  }
]