[
  {
    "text": "Hello! :wave: :wave:\nIs there a way to add smooth hover transition for the new CTA buttons? There is no such option in CTA settings itself and these buttons are secured within an iframe root document. The button itself doesn't inherit values put on iframe...",
    "time_stamp": "2025-01-23 02:46:00"
  },
  {
    "text": "Hello everyone!!\n\nMy name is Excellence, and I'm trying to use google places api in an HubSpot form. I'm able to successfully integrate the api, however, the dropdown from google api is not showing. I have attached the input element to the autocomplete method of google api and tried all that I can but to no avail. See attached files below; (what is expected is A, and what I see is B).",
    "time_stamp": "2025-01-23 04:51:11"
  },
  {
    "poster": {
      "poster_name": "Kyle Keenan",
      "poster_handle": "kyle.keenan"
    },
    "time_stamp": "2025-01-23 08:07:52",
    "text": "Hey, Does anyone know why when a user is login into their HubSpot account through the SSO which has presviously worked before and no one else is having this issue, Immeditaly signed them out and they have to redo the process?"
  },
  {
    "poster": {
      "poster_name": "Ivan Rivas",
      "poster_handle": "ivan795"
    },
    "time_stamp": "2025-01-23 08:08:41",
    "text": "Hi Nicholas, I want a mi k to my externally viewed email"
  },
  {
    "poster": {
      "poster_name": "Ivan Rivas",
      "poster_handle": "ivan795"
    },
    "time_stamp": "2025-01-23 08:08:51",
    "text": "<@U25PYL3Q8> "
  },
  {
    "poster": {
      "poster_name": "Ivan Rivas",
      "poster_handle": "ivan795"
    },
    "time_stamp": "2025-01-23 08:11:49",
    "text": "<@U25PYL3Q8> It could also be a link to a preview or to the email template."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2025-01-23 09:09:12",
    "text": "Not sure if it's already possible somehow via BETA or i've missed any settings... but we would love for the middle tabs on a CRM record to be conditional like they can be on the left hand side!\nDoes anyone know a way the achieve this or know if it's in the roadmap? I'll submit an idea request if not :)"
  },
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:04:49",
    "text": "Hello guys how are you doing ?\nI need help to create a plugin on HubSpot to connect other API's platforms like MercadoLibre and FincaRaiz (real estate platform)"
  },
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:34:34",
    "text": "anyone can helpme with this ?",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-23 12:56:16"
      },
      {
        "time_stamp": "2025-01-23 12:58:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:34:55",
    "text": "Please ?"
  },
  {
    "poster": {
      "poster_name": "Sergio González Sánchez",
      "poster_handle": "soysergiogonza"
    },
    "time_stamp": "2025-01-23 10:35:00",
    "text": ":slightly_smiling_face:]"
  },
  {
    "poster": {
      "poster_name": "Chuck Patterson",
      "poster_handle": "chuck.patterson"
    },
    "time_stamp": "2025-01-23 11:45:54",
    "text": "Hi all, I am a dev for my company and we're trying to send an automated email that includes a custom username that we generate in our application. Is there a way to create a webhook to receive data for an automated email inside a workflow? We have received the info we need from the workflow successfully but now I need to respond with the username and send an email through HubSpot with that username."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-01-23 12:56:16",
    "text": "I think you'll have better luck posting this in the <#CBNDYJJAZ|jobs> channel."
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-01-23 12:58:39",
    "text": "also you might try looking at Zapier which can conncet to hundreds of systems from HubSpot - search in the marketplace"
  },
  {
    "poster": {
      "poster_name": "Rene Freiburghaus",
      "poster_handle": "rene.freiburghaus"
    },
    "time_stamp": "2025-01-23 14:12:11",
    "text": "Hello Everybody! If i a trying to track two way communication between one of my employees and a clients, is there a way to accomplish that programatically?"
  },
  {
    "poster": {
      "poster_name": "Desirene Neo",
      "poster_handle": "desirene"
    },
    "time_stamp": "2025-01-23 17:42:10",
    "text": "hi everyone! i was wondering if when a cookie banner is placed on our website or landing page would it remove all cookie tracking for both pixels that are installed through HubSpot system and the ones that we've manually added? i've chatted with HubSpot support before and they shared that the banner will affect anything that is integrated with HubSpot. was wondering if anyone could help point direction to understand what apps are firing without consent and how can we get the apps that are not integrated in HubSpot to be included in the cookie banner as well?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-24 02:23:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jay Nanavati",
      "poster_handle": "jay520"
    },
    "time_stamp": "2025-01-23 22:44:54",
    "text": "Hello everyone, I found the solution for it, whenever you add the text property in the workflow You just have to format the data and remove HTML text using the data ops function, By this way you will be able to see clear text on slack or any other platform where you are sending the alert"
  }
]