[
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2025-01-20 02:18:11",
    "text": "I am trying to get a report running where I would filter out companies that has the Child association label and only have companies with the Parent label or no label.\n\nFor that I understand that I would need to edit the data sources to have the parent-child association label to filter with.\nI've selected the Association for the report to be Parent to Child. <https://prnt.sc/LoWrE6mlyD_s>\n\nThe report seems to just duplicates the Parent data per child account. <https://prnt.sc/7OQ2hQzNHmZ2>\nAnd I haven't event applied a filter to get rid of child accounts. But if I did the table would be empty.\n\nHow could I just get the data on Parent accounts? What am I missing here?\n\n_(bit of additional context - The aggregated persona count in the screenshots is a calculated property. What it does is aggregates the number of contacts that have a specific Persona in the account. So it would tell me how many of each persona we have available in that account, and show what personas are missing._ \n _Contacts have their primary associations to the Parent accounts (as we want to use Parent accounts in general for data, activity tracking etc.) so everything is essentially available there. Child company data should be filtered out._ \n_This is really the main thing I am trying to achieve in the report. Just filtering out child accounts.)_"
  },
  {
    "text": "Hi all! I'm creating a custom card for my app in the Right Sidebar of HubSpot. I've been looking all over, and I have probably misunderstood it, but I'm looking for a way to add a button like `Set up payments` in the screenshot here. When clicking this button, it needs to trigger a POST API call.\n\nFrom what I can understand from the docs, I need to use the `primaryAction` setup when fetching card contents for this in the response. But I can't get the button to show up. I can add a button under the `Actions` dropdown and trigger the API call to the right endpoint from there, but I'd love to have a button like `Set up Payments` to make it more intuitive for our users.\n\nThanks so much in advance!",
    "time_stamp": "2025-01-20 08:20:05"
  },
  {
    "poster": {
      "poster_name": "Adit Sapkota",
      "poster_handle": "aditsapkota.as"
    },
    "time_stamp": "2025-01-20 16:30:13",
    "text": "Hi All, I'm new to HubSpot. \n\nDoes anyone know a good formatter for Hubl and HubSpot in general? I'm using the standards I guess (VS Code /w Prettier/EsLint).\n\nAnd would appreciate any tips and tricks for a beginner.\n\nThanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-21 19:03:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jay Nanavati",
      "poster_handle": "jay520"
    },
    "time_stamp": "2025-01-21 00:03:15",
    "text": "Hey everyone, I would like to send a webhook from HubSpot to slack where I want to share the note body (which is in HTML format) to slack. Can anyone guide me here?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-21 18:55:05"
      },
      {
        "time_stamp": "2025-01-23 22:44:54"
      }
    ]
  },
  {
    "text": "Currently it comes in this format",
    "time_stamp": "2025-01-21 00:05:31"
  }
]