[
  {
    "poster": {
      "poster_name": "mehul parmar",
      "poster_handle": "mehul.engt"
    },
    "time_stamp": "2025-01-24 01:36:59",
    "edited": {
      "time_stamp": "2025-01-24 06:37:20"
    },
    "text": "Hi all, I have to publish my golang library that have code to integrate with HubSpot api so I have to put it  publicly please suggest me how I can do that."
  },
  {
    "poster": {
      "poster_name": "Rob Harris",
      "poster_handle": "robh"
    },
    "time_stamp": "2025-01-24 02:23:20",
    "text": "I'd recommend adding everything through the HubSpot integrations. So pixels, GA4 and Google tag manager.\nAnything that doesn't have a HubSpot integration, add it into your tag manager and fire it through that way.\n\nAnything added directly into your &lt;head&gt; I don't think will get picked up.\n\n<https://knowledge.HubSpot.com/privacy-and-consent/support-google-consent-mode-v2>"
  },
  {
    "poster": {
      "poster_name": "Evan Schultz",
      "poster_handle": "evan.schultz"
    },
    "time_stamp": "2025-01-24 07:33:03",
    "text": "thank you, i'll take a look at this!"
  },
  {
    "poster": {
      "poster_name": "András Boros",
      "poster_handle": "andras.boros"
    },
    "time_stamp": "2025-01-24 10:03:22",
    "text": "Hey! I'm not sure that this is the right channel to ask help with our problem, sorry about that, but I couldn't find a better place in first glance...\nWe have SAAS product, and we are using HubSport as CRM tool. Our site has the HS plugin, but we are only using the chat functionality at the moment.\nWe would like to targeting our users with CTAs based on their email addresses after login, and we did the recommended steps by doing the identification via  Visitor Identification API, setup the credentials to the js plugin(tracking code snipet)\n• we tried with hsConversationsSettings\n• and another desperate attempt `_hsq.push([\"identify\", { {identity details} }]);`\nBut still, all the CAT appears only if we set the \"Logged in Visitor = false\", and of course the segmented list with specific email addresses doesn't work either, because it looks like we can not pass the identifiers in the right place.\n\nI know it's a bit messy, but any advice would be appreciated! :pray: // Angular FE, Java BE"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2025-01-24 12:05:01",
    "edited": {
      "time_stamp": "2025-01-24 12:05:04"
    }
  },
  {
    "poster": {
      "poster_name": "Gonzalo Sabatino",
      "poster_handle": "gonzalo.sabatino"
    },
    "time_stamp": "2025-01-24 13:02:41",
    "text": "Hi everyone :hugging_face:\n*Context:* Once a day, I want to run an airflow task to update all our contacts in bigquery. We currently have approximately 7M contacts.\nWhat would be the best way to fetch these contacts for the update?\nWe’ve noticed that interacting directly with the API (<https://api.hubapi.com/crm/v3/objects/contacts>) to request all contacts at this scale tends to cause issues.\nThe options we’ve considered are:\n• Performing a search for the latest contact updates: <https://api.hubapi.com/crm/v3/objects/contacts/search>. In this case, is there a recommended time frame to use?\n• Adding contacts to a list and retrieving that list.\n• Using a webhook for updates. However, we think this might consume more resources than necessary since we only want to update our data warehouse once a day.\nAny feedback or other suggestions would be greatly appreciated!"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2025-01-24 13:06:30",
    "edited": {
      "time_stamp": "2025-01-24 13:07:23"
    },
    "text": ":mega: *Announcement: Upcoming Change to this Developer Slack*\n\nHi everyone,\n\nWe have an important update to share about the future of this Developer Slack workspace. Starting *January 28th*, we’re transitioning this space to a free plan to better focus our efforts on improving your overall community experience. Here's what this means for you:\n\n• *A Focus on Peer-to-Peer Connections:* We want to focus on making this community a space for collaboration; troubleshooting with the community, peer to peer code vetting, and conversations and connection among developers like you. For specific questions about HubSpot products or bug reports, <http://help.HubSpot.com|HubSpot Support> and the <https://community.HubSpot.com/|HubSpot Community Forums> will be the best places to go.\n• *Message History:* Moving to a free plan means message history will now be limited to the last 90 days. \n• *No Changes to Beta Channels:* Beta channels for dev products will stay as they are, and we'll give you plenty of notice before any changes occur.\nWe’re making these changes to ensure we’re allocating resources where they’ll have the biggest impact.\n\nIf you have any questions or ideas to share, feel free to reach out. Thanks for being an invaluable part of this community!\n\n_PS - This Slack has been around since 2016, and we know so many of you have built important relationships because of it. Any decisions we make around here have all of you in mind - community is a beautiful thing and change can be hard. But we won't be making any further changes here until we're confident we can give this community the kind of home that continues to allow for the real time connection and collaboration that has made this space so special. And when we do, you'll have a lot of advance notice._ \n\nSincerely,\n\n:sj: me, SJ Morris, your dev community guardian at HubSpot :HubSpotheart:",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2025-01-26 03:38:43"
      },
      {
        "time_stamp": "2025-01-27 11:34:58"
      },
      {
        "time_stamp": "2025-01-28 02:18:49"
      },
      {
        "time_stamp": "2025-01-28 02:20:41"
      },
      {
        "time_stamp": "2025-01-28 09:18:23"
      },
      {
        "time_stamp": "2025-01-29 13:07:55"
      },
      {
        "time_stamp": "2025-01-29 13:17:38"
      }
    ]
  }
]