[
  {
    "poster": {
      "poster_name": "Jacob Flender",
      "poster_handle": "j.flender"
    },
    "time_stamp": "2025-01-06 06:57:49",
    "text": "Hey,\nFollowing problem: I have a blog post and a listing for this blog post. The problem applies to both. Whenever it uses a date it defaults to the format: Month (Full name of the month), DD, YYYY\". So an entry would look like this: \"December 24, 2024\". I updated the Format to a default Format in the general blog settings and this is what I input: \"DD MMMM YYYY\". Now in the preview it shows the correct formatting of the date. However in the blog it is still wrong. This applied to existing and new blogs.\nCan anyone help me with the problem? Is this a known issue?"
  },
  {
    "poster": {
      "poster_name": "Kate Karpovich",
      "poster_handle": "karpovichkate.dev"
    },
    "time_stamp": "2025-01-06 07:52:35",
    "text": "Hello! I am looking for some ideas on how to generally implement an auto addition of the trailing slash for each URL of the HubSpot website/landing pages without adding them manually via page settings. I tried redirect/flexible redirect ie from `<http://mywebsite.com/about|mywebsite.com/about>` to `<http://mywebsite.com/about/|mywebsite.com/about/>`  but am getting stuck in a loop of redirects from `about` to `about/`. Same if to try implement redirect via javascript with `window.location.href` approach. Is there something HubSpot is doing with that under the hood? Does anyone know any workarounds on that? Thanks!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-01-06 07:53:35"
      },
      {
        "time_stamp": "2025-01-06 08:04:59"
      },
      {
        "time_stamp": "2025-01-06 08:06:18"
      },
      {
        "time_stamp": "2025-01-06 08:15:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2025-01-06 07:53:35",
    "text": "out of curiosity, why is that needed/desired?"
  },
  {
    "poster": {
      "poster_name": "Kate Karpovich",
      "poster_handle": "karpovichkate.dev"
    },
    "time_stamp": "2025-01-06 08:04:59",
    "text": "There is something how search engines see same page without trailing slash and with trailing slash as separate pages with duplicated content what is impacting seo and increase costs for crawlers (they count per link). Since both version may exist, one of them should be redirected.\nI could't find how HubSpot treats that by default, tbh."
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2025-01-06 08:06:18",
    "text": "<https://knowledge.HubSpot.com/seo/set-canonical-urls-for-duplicate-content>"
  },
  {
    "poster": {
      "poster_name": "Kate Karpovich",
      "poster_handle": "karpovichkate.dev"
    },
    "time_stamp": "2025-01-06 08:15:41",
    "text": "Thanks for the reply! Yes, we have that set already, but it does not solve the issue completely in terms of crawlers visit same link twice at least for the first time which increase costs (since we have many pages) and out SEO team in unhappy with that :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2025-01-06 09:24:33",
    "edited": {
      "time_stamp": "2025-01-06 09:36:12"
    },
    "text": "Hey John — this is actually an internal feature (hence why it’s not documented) Im guessing you saw this in use on a default module somewhere? We use this internally for when we are building out new features / have multiple versions of features in existence that require different inputs until they are merged together. It helps us ensure that modules can still work while platform features are migrated from alpha to beta to prod to versions etc. Wouldn’t recommend trying to use it as scope names (in this context) change often and are not publicly stable"
  },
  {
    "text": "Hello, My dev team is having issues embedding a HubSpot form to our external CMS page.  I've tried our AM, customer support and posted something on the forum, but no one seems to know and they're all pushing me around to different places.  Who should I contact to help us with this issue?  Here's a screen shot of what it currently looks like on our page. Thanks.",
    "time_stamp": "2025-01-06 09:53:51",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-07 01:34:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andrei Axinoi",
      "poster_handle": "andreiaxinoi"
    },
    "time_stamp": "2025-01-06 11:25:55",
    "text": "Hi everyone,\nI hope this is the right channel for this. We’ve noticed an uptick in spam form submissions on our HubSpot landing pages. We’ve tried a few approaches, like activating reCAPTCHA, but we’re still receiving a significant number of spam leads.\nMost of these spam leads seem to use invalid email addresses, so we’re considering implementing time-of-capture email validation to block these submissions. Does anyone have experience using third-party services for email validation via API calls?\nLooking forward to any insights you can share!"
  }
]