[
  {
    "poster": {
      "poster_name": "Max Shuter",
      "poster_handle": "max.shuter"
    },
    "time_stamp": "2024-12-04 06:44:44",
    "edited": {
      "time_stamp": "2024-12-04 06:57:02"
    },
    "text": "Hi all! We have a couple of senior developer roles still to fill at Tillo so thought I'd share them here. Primarily PHP and Python devs and also support hybrid working but with some office attendance expected so only really suitable for those based within commuting distance of Brighton, UK or willing to relocate:\n\n<https://careers.tillo.io/postings/42c7a1fe-153d-4305-a5e7-ab27a27f5dcb>\n\n<https://careers.tillo.io/postings/c67f2725-5118-493a-a319-b71fea99ac7d>\n\n<https://careers.tillo.io/postings/7537b5f8-af71-43c3-9f53-671e08594bd8>"
  },
  {
    "text": "Hi, we have open a new position for HubSpot project\n\n*To apply - send your CV to <mailto:yaroslav.burlakov@addaxcrm.com|yaroslav.burlakov@addaxcrm.com> with subject \"{Your name}* <https://djinni.co/jobs/672756-HubSpot-consultant/|HubSpot Consultant>*\"*\n\n*Key Responsibilities*\n• Understand and align with the commercial objectives of Marketing, Sales, Service, and other departments, tailoring HubSpot to address operational challenges and enhance team efficiency.\n• Manage user access, permissions, and system configurations, including custom objects, workflows, web forms, playbooks, sequences, lead scoring, and profile management.\n• Collaborate with senior leadership on CRM-related contracts, including negotiation and execution of these.\n• Create and optimize complex workflow rules, approval processes, and data validation, aligning CRM capabilities with business needs.\n• Generate and manage dashboards, reports, and analytics to provide actionable insights on team performance and productivity.\n• Partner with Development, Product, and Marketing teams to gather requirements, oversee integrations, and implement solutions.\n• Coordinate integrations with third-party apps, plugins, and internal systems.\n• Troubleshoot daily issues, facilitate user adoption, and conduct training sessions to maximize system utilization.\n• Identify and resolve data anomalies, maintaining accuracy and integrity within the CRM.\n• Other duties as assigned.\n*Minimum Qualifications & Competencies*\n• 1 + years in HubSpot CRM Administration, with a strong record of collaborating with Marketing and Sales teams to implement functional CRM Solutions.\n• Demonstrated experience with CRM system administration, including custom objects, workflows, permissions, and automation processes.\n• Skilled in data analysis, dashboard/report creation, and insights generation to drive strategic improvements.\n• Excellent interpersonal skills, capable of translating technical terms and fostering teamwork across departments.\n• Proficient in integrating HubSpot with external systems; familiarity with AWS, MySQL databases, Postman, and IoT platforms is a plus.\n• Experience with API’s",
    "time_stamp": "2024-12-04 08:09:19",
    "edited": {
      "time_stamp": "2024-12-04 08:09:37"
    }
  },
  {
    "poster": {
      "poster_name": "Andrew Schulz",
      "poster_handle": "andrew448"
    },
    "time_stamp": "2024-12-04 16:37:00",
    "text": "<@UV1A259HT> do you have bandwidth? i have a large HubSpot website that i may need strategic support with- send me a DM?"
  }
]