[
  {
    "poster": {
      "poster_name": "Philippe Greban",
      "poster_handle": "pg834"
    },
    "time_stamp": "2019-03-05 04:57:17",
    "text": "I am experiencing an error on a client website. A page is using Google Map and everytime I load the page I get :\ngeocode was not successful for the following reason over_query_limit\n\nThe site is using a symphony Google map module which has inside of it the JS Code for Google Map. As far as I understand the query is done everytime someone is loading the page. That's why the client get this message. Am I wrong? Did you experience it? Is there a quick work around?\nI've read a lot of stuff explaining that the query should we cached on the server in the db etc..."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-03-05 10:58:23",
    "text": "<@UFBA31SP5> I haven't used that template before, but I would look to make sure you're using a client-specific Google Maps API key first, so that your requests aren't being lumped in with other sites as well.\n\nIf the key is indeed unique to your site/client, then the next point to look at is how the API is actually being used. The query is likely not only being done every time the page is loaded, but also for every location that needs to be placed on the map. If you're loading a map with hundreds of locations, this can obviously be an issue, as that could be hundreds of requests per pageload. In this case, yes, it would be better to store the coordinates using HubDB or another static source if possible.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-06 01:10:44"
      },
      {
        "time_stamp": "2019-03-06 06:39:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-03-05 13:55:22",
    "text": "remember when you had to clean up a document's spacing manually...",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-05 14:22:26"
      },
      {
        "time_stamp": "2019-03-05 14:23:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Patrick Eng",
      "poster_handle": "patrick404"
    },
    "time_stamp": "2019-03-05 14:22:26",
    "text": "that sounds like something that had to happen before I was born"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-03-05 14:23:42",
    "text": "BURN"
  }
]