[
  {
    "poster": {
      "poster_name": "Can Arslan",
      "poster_handle": "can.a"
    },
    "time_stamp": "2024-06-12 03:46:42",
    "text": "Hey Hey,\n\ni got at the moment a problem and i hope you can help me - maybe you got an workaround.\n\nWe have a workflow and part of it, is a custom code which is working with the HubSpot Api to get data and analyse ist.\nThe code is also working fine and do not got problems. Never the less when i run the workflow to many contacs at once are added into and i got after several time a 429 because the limit of the api is over.\n\nIs there a way to throttle the amount of contacts which are picked up in the workflow? Do you have a workaround?\n\nCan't wait to hear from you.\n\nBest Can",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-06-12 05:55:30"
      },
      {
        "time_stamp": "2024-06-12 07:53:28"
      },
      {
        "time_stamp": "2024-06-12 10:10:39"
      },
      {
        "time_stamp": "2024-06-12 10:59:09"
      },
      {
        "time_stamp": "2024-06-13 05:34:43"
      },
      {
        "time_stamp": "2024-06-13 10:40:22"
      },
      {
        "time_stamp": "2024-06-14 05:58:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-06-12 05:55:30",
    "text": "The ones where you get a 429 will try and run again - problem is if a step in your workflow AFTER the custom code relies on what is returned you have a problem.  I personally look at the limits of whatever api call I am making and use a sleep function in my code to allow enough time to pass after each call to let them all run without errors.  Others may have a different approach."
  },
  {
    "poster": {
      "poster_name": "Can Arslan",
      "poster_handle": "can.a"
    },
    "time_stamp": "2024-06-12 07:53:28",
    "text": "perfect thanks :slightly_smiling_face: that helps!"
  },
  {
    "poster": {
      "poster_name": "Andre Zorn",
      "poster_handle": "azor"
    },
    "time_stamp": "2024-06-12 10:10:39",
    "edited": {
      "time_stamp": "2024-06-12 10:10:58"
    },
    "text": "Sry to barge in, but I have a question about that approach. Doesn't the sleep function apply to all records enrolled in the workflow and you simply delay the api calls of all enrolled records meaning you just postpone the 429?"
  },
  {
    "poster": {
      "poster_name": "Can Arslan",
      "poster_handle": "can.a"
    },
    "time_stamp": "2024-06-12 10:59:09",
    "text": "i understand that the sleep function is part of the custom code, or?\n\nNever the less it is good to know that the custom code is more then once triggert with the code 429"
  }
]