[
  {
    "poster": {
      "poster_name": "hungGP",
      "poster_handle": "hungbm"
    },
    "time_stamp": "2024-06-11 04:06:50",
    "edited": {
      "time_stamp": "2024-06-11 04:07:45"
    },
    "text": "Hello Support,\nI was created custom action, when setup workflow and put  Contact Date property token to my custom action input, my action endpoint received input value in short date format (m/d/yy).\n How to get Date value in (dd/MM/YYYY) format?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-07-02 09:48:50"
      },
      {
        "time_stamp": "2024-07-07 20:08:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-06-11 04:56:10",
    "text": "when you are looking for an activity based workflow trigger: <@U071VPHRPL3>\nactivity X should trigger X thing\nyou can look at this comm post, just search \"MHolzer\" i explained my workaround there its even codeless\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Activity-Based-Workflows/idi-p/398086/page/4#comments>"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-06-11 04:58:58",
    "text": "<@U06RQGQ27A6> you can look at user based workflows mayabe that can help?"
  },
  {
    "text": "you prob can do this without custom code: <@U022YD6LGAU>\nso you ultimately have the deal name as a unique value and you want to have the outcomes:\nif dealname -&gt; exist somewhere -&gt; update dealstage\nif dealname -&gt; is new -&gt; create new deal\n\nthat could be done with a calculation property:\n\nyou just create a custom property which copies the deal name and depending on the outcome (which you check with the calculation property you just have to make it boolean and have it like Dealname = Copy of Dealname, and if its true can it exists if its not true then it couldnt be copied bc the property is unique, and then you create a new deal, / you branch based on the calc property with true/ false)",
    "time_stamp": "2024-06-11 05:12:48"
  },
  {
    "poster": {
      "poster_name": "Maximilian Holzer",
      "poster_handle": "maximilian.holzer"
    },
    "time_stamp": "2024-06-11 05:31:21",
    "text": "Hey <@U071VPHRPL3>!\nnot 100% getting the question..\n so someone creates a ticket manually and if they associated the task with this deal you want the task to be then reassigned to the owner property?\n\nyou can do that via custom code and this api:\n<https://developers.HubSpot.com/docs/api/crm/tasks>\n\nyou just take the \"update\" endpoint then you copy the record id of the task into a property(or search for it however you like) and then you just assign the task to someone with the owner property\n\nbut you can also do this without custom code by just creating the task over a workflow instead of it being manually created (if thats the case) -&gt; you can do this with one property:\nwhere it ist just like a Yes or No Question on the deal where you say something like you wanna create a task for this dealowner and then they put yes -&gt; thats your trigger, you can then assign task to an existing owner and then just choose which owner you like\nTask title also can be customizable by just adding a property line text where they first fill this property out and then put the check on yes -&gt; or you can also make it that if property Yes or No gets filled in then they have to fill in Custom property X which is task title\n\nOnly downside you can't put a custom date you have to choose how many business days ahead (in this codeless version)"
  }
]