[
  {
    "poster": {
      "poster_name": "Simon Grant",
      "poster_handle": "sgrant"
    },
    "time_stamp": "2022-02-22 15:46:47",
    "text": "*Writing HTML content into an email via a personalisation token*\nHello - I’m trying to get to the bottom of some behaviour when using a personalisation token that contains HTML content.  The personalisation tokens only write out the escaped HTML string - e.g. it will populate the email with `&lt;a href=\"<http://url.com>\"&gt;link text&lt;/a&gt;` instead of <http://url.com|link text>.  However, I have actually seen the emails write rendered HTML from the same field, but the behaviour seems to have changed without me doing anything.\nAs I understand it, I can’t even get so much as a line break in email content from a personalisation token unless I can get the HTML to render (i.e. `&lt;br /&gt;` tags).  `\\n` characters don’t appear to be supported in text fields.\n\nI’ve found several discussions of this same issue (including people reporting that the behaviour has been inconsistent), but the resolutions haven’t been documented that I can see - there are some allusions to changing email portals, but I can’t see anything I can action.\n<https://HubSpotdev.slack.com/archives/CJ5DN6RKP/p1614796088064400>\n<https://community.HubSpot.com/t5/APIs-Integrations/HTML-in-eMails-Escaped-in-Some-Portals/td-p/235827>\n<https://community.HubSpot.com/t5/APIs-Integrations/Transactional-emails-displaying-escaped-html-when-they-used-to/td-p/240753>\n<https://community.HubSpot.com/t5/CMS-Development/Using-contact-custom-fields-in-HTML-email-template/td-p/283352>\n<https://community.HubSpot.com/t5/Email-Marketing-Tool/Insert-Personalization-Tokens-with-HTML-into-mails-they-do-not/m-p/407620>\n\nIs anyone able to point me in the right direction to get HTML rendering in emails from personalisation tokens or any other alternatives to get rich text mail merging into emails that I should be considering?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-04 14:06:39"
      },
      {
        "time_stamp": "2022-03-05 22:44:09"
      }
    ]
  }
]