[
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-04-20 07:47:37",
    "edited": {
      "time_stamp": "2022-04-20 07:53:52"
    },
    "text": "*GraphQL BETA Query Complexity Limits Update*\nHello GraphQL BETA developers,\n\nI am writing to inform you about an upcoming change to the BETA graphQL functionality. On April 28th, we are going to begin enforcing <https://developers.HubSpot.com/docs/cms/data/query-HubSpot-data-using-graphql#query-complexity-and-account-limits|query complexity limits for GraphQL queries>. To ensure optimal performance for querying your data, we will enforce a limit on the aggregate complexity of your GraphQL queries, based on factors such as the total number of objects and their associated properties in your query.\n\nWithin the extensions field of the response to your queries, you will now see limit information broken down within _query_complexity_. There is an additional per rolling minute complexity limit, that only applies when hitting the `collector/v3/graphql` endpoint (not for queries in themes). An example query broken down and more information on the limits can be found in the <https://developers.HubSpot.com/docs/cms/data/query-HubSpot-data-using-graphql#query-complexity-and-account-limits|documentation>.\n\nWe want this functionality to be both powerful, but also used within reason, so we welcome any feedback and thoughts on the limits as we continue to refine the functionality. If you hit the limits, please let us know your use case! We want to hear your feedback and refine the limits based on your feedback and use cases.\n\nFor anyone who currently is surpassing the limits, I have already touched base with you individually to help aid in resolving any issues. The likely solution to not hitting the limit would be to implement pagination of the data or just fetching a reasonable amount of data up front and progressively fetching more data as you need it.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-04-28 10:25:26"
      }
    ]
  }
]