[
  {
    "poster": {
      "poster_name": "Vitalii Sili",
      "poster_handle": "v.sili"
    },
    "time_stamp": "2024-10-14 01:20:58",
    "text": "Hello, HubSpot Community\nMy Company searching for experienced HubSpot Developer\n\n*Responsibilities:*\n• Teach and train our team on how to effectively use HubSpot CMS with React, including best practices and advanced features.\n• Collaborate with our development and marketing teams to design, build, and optimize websites using HubSpot CMS and React.\n• Develop custom modules, templates, and integrations for HubSpot CMS using React.\n• Provide guidance on HubSpot’s ecosystem, including CRM, CMS, workflows, and other tools.\n• Troubleshoot and assist the team with any HubSpot-related issues or technical challenges.\n• Help integrate HubSpot with third-party applications and APIs.\n• Share insights on the latest trends, tools, and best practices for HubSpot CMS and front-end development.\n• Participate in creating internal documentation and resources to support ongoing learning.\n*Requirements:*\n• Strong knowledge and experience with HubSpot CMS (including HubL, templates, and modules).\n• Proficiency with React and modern JavaScript frameworks.\n• Experience with front-end technologies such as HTML5, CSS3, and responsive design.\n• Ability to explain complex technical concepts clearly and patiently to non-developers.\n• Familiarity with REST APIs and how to integrate them into websites.\n• Strong problem-solving skills and a collaborative mindset.\n• Excellent communication skills, both for technical and non-technical audiences.\n",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-14 03:23:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2024-10-14 03:23:01",
    "text": "Hi Vitalii,\n\nI am a Certified HubSpot Developer and a Platinum HubSpot Partner.\n\nHubSpot Profile <https://ecosystem.HubSpot.com/marketplace/solutions/hub-devs>\n\nHubSpot Themes <https://ecosystem.HubSpot.com/marketplace/website?eco_providers=oAppsIT>\n\nHubSpot Modules <https://ecosystem.HubSpot.com/marketplace/modules?eco_providers=oAppsIT>"
  }
]