[
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-25 10:00:59",
    "text": "Interested for that we need to build custom module and design it. Let me know if u need help me for me about that."
  },
  {
    "poster": {
      "poster_name": "Alfonso Ramirez",
      "poster_handle": "alfonso.renovatio.x"
    },
    "time_stamp": "2024-10-25 10:50:13",
    "text": "Hi everyone, a HubSpot Partner I work for is currently hiring a HubSpot Developer Consultant in LATAM. Here's the main point of contact: <mailto:soporte@andresmorera.com|soporte@andresmorera.com>\n\nJob Description:\n\n• Between 2-4 years of experience working in HubSpot implementations, automations, onboarding and integration projects.\n• We are in search of a HubSpot Implementation Specialist who is fully bilingual in Spanish and English, with advanced experience in HubSpot's Sales Hub and Marketing Hub, as well as programming and web development.\nThis role is critical to optimize our marketing and sales operations through the HubSpot platform, creating effective and customized solutions for our needs.\n\nResponsibilities:\n\n• Implement and manage HubSpot's Sales Hub and Marketing Hub tools.\n• Develop landing pages and websites using HubSpot.\n• Create and optimize workflows, sequences, sales templates, email marketing campaigns and forms.\n• Configure properties, products, pipelines and stages, and automate actions and tasks within HubSpot.\n• Publish and manage blogs, newsletters, marketing subscriptions and social media campaigns.\n• Connect and manage the integration of WhatsApp, team emails, SMS and VoIP with HubSpot.\n• Lead integration projects with external systems to ensure seamless integration with HubSpot.\n• Monitor and analyze performance of marketing campaigns, providing detailed reports and recommendations for continuous improvement.\n• Collaborate with sales, marketing and development teams to ensure project goals are met.\nRequirements:\n\n• Proven experience implementing and managing HubSpot Sales Hub and Marketing Hub.\n• Advanced programming and web development skills.\n• Strong knowledge in creating workflows, sequences, sales templates, email marketing, and task automation in HubSpot.\n• Experience integrating external tools such as WhatsApp, SMS, VoIP with HubSpot.\n• Strong analytical and problem solving skills.\n• Excellent communication skills in *Spanish* and *English*.\n• Ability to lead and manage system integration projects.\n• Attention to detail and ability to work in a fast-paced, dynamic environment.\nDesirable:\n\n• HubSpot Sales Hub and Marketing Hub certifications.\n• Experience in publishing and managing blog and social media content through HubSpot.\n• Knowledge in creating and managing custom pipelines and properties in HubSpot.\n",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-25 10:56:13"
      },
      {
        "time_stamp": "2024-10-25 10:58:26"
      },
      {
        "time_stamp": "2024-10-25 11:01:25"
      },
      {
        "time_stamp": "2024-10-27 08:29:58"
      },
      {
        "time_stamp": "2024-10-28 10:09:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Miteshkumar Padariya",
      "poster_handle": "mitesh"
    },
    "time_stamp": "2024-10-25 10:56:13",
    "text": "<@U07PATM6ZRV> if your client is interested in working with an agency at a fixed monthly fee with unlimited tasks, let me know will DM you details."
  },
  {
    "poster": {
      "poster_name": "Alfonso Ramirez",
      "poster_handle": "alfonso.renovatio.x"
    },
    "time_stamp": "2024-10-25 10:58:26",
    "text": "Hi <@UBZ8C6DTK>, no we are looking to hire a developer to join our Latam based team."
  },
  {
    "poster": {
      "poster_name": "Miteshkumar Padariya",
      "poster_handle": "mitesh"
    },
    "time_stamp": "2024-10-25 11:01:25",
    "text": "No worries <@U07PATM6ZRV> if in a case your partner needs a team with vast experience of HubSpot including all hubs, let me know we are happy to schedule a call to discuss your needs."
  }
]