[
  {
    "poster": {
      "poster_name": "Maria Dabezies",
      "poster_handle": "maria.dabezies"
    },
    "time_stamp": "2024-10-10 09:16:05",
    "text": "Hi, everyone! Not sure if this is the right channel, but I have a requirement from content editors who want to be able to share links to specific modules in a page.\nFor instance, they want a link like <http://mypage.com/#my-rich-text-module|mypage.com/#my-rich-text-module> to link to a specific rich text module within a page (that may or may not have other modules of the same kind)\nIs there a HubSpot native way of doing this?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-10 09:57:24"
      },
      {
        "time_stamp": "2024-10-10 10:51:29"
      },
      {
        "time_stamp": "2024-10-14 04:40:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-10-10 09:57:24",
    "text": "Hey <@U06GSRMB84C>, the function you're looking for is called \"jumpmarks\" or \"anchors\".\n\nUnless you'd like to create a super simple jumpmark module(I could give you such a module), the only real option here is to use a rich-text for such anchors.\n\nSo drop a default rich-text module above the place you like to jump to, open the source code view and place following code there:\n`&lt;div id=\"my-custom-jumpmark-name\" style=\"height:0\"&gt;&lt;/div&gt;`\n\nPlease note that the text, you'll replace \"my-custom-jumpmark-name\" with should NOT contain spaces or special characters. So if you want to jump to a section that is called \"Learn more about the preferneces of using 11 jumpmarks on one page\", I'd recommend to simply put a name like \"learn-about-jumpmarks\" or something similar. If the page has the \"default\" URL of <http://mycompany.com/mypage|mycompany.com/mypage> The url with the jumpmark would be <http://mycompany.com/mypage#learn-about-jumpmarks|mycompany.com/mypage#learn-about-jumpmarks>"
  },
  {
    "poster": {
      "poster_name": "Maria Dabezies",
      "poster_handle": "maria.dabezies"
    },
    "time_stamp": "2024-10-10 10:51:29",
    "text": "Thank you! We were thinking of a module that was just an empty div with an id, but were wondering if there was some other way."
  }
]