[
  {
    "poster": {
      "poster_name": "Stefan Ionita",
      "poster_handle": "stefan.i"
    },
    "time_stamp": "2024-10-02 03:19:50",
    "text": "I have a email template and a rich text module in it.\nThis module contains placeholder text, and when my API exports an email and its content, it is pulling both the placeholder text and the actual content that has replaced it for that specific email. As you can imagine, this causes confusion since it retrieves two different types of content.\nIs there a way to check how long has the placeholder text been there?\nHow can I identify if there were any other placeholder text before this one?\n\nI want to understand if there is a way to view history for this module in the backend to understand how long this text has been present.\nThis way, our analytics team can set rules to exclude the current placeholder text and any historic ones used for this template"
  },
  {
    "text": "anyone ever solve this problem?\nconditions:\n1. Two separate modules, chosen arbitrarily via DnD in the CMS.\n2. Each module has its own background color -- here, module 2's background is WHITE, not transparent. or it might be a different shade of blue, gray, etc.\n3. There's an ambient \"wave\" image on top of the background color of each module, but under the content of each module.\n4. There are several wave images to choose from, also they each switch responsively (mobile and desktop versions).\n5. I don't want to build a section for each set of arbitrarily-chosen modules; this could be applied to dozens of combinations.",
    "time_stamp": "2024-10-02 12:23:51",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-02 12:58:12"
      },
      {
        "time_stamp": "2024-10-03 03:53:09"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sébastien Rochon",
      "poster_handle": "srochon"
    },
    "time_stamp": "2024-10-02 12:58:12",
    "text": "You could create a module to manage your wave. You put your wave module between section in absolute position within a relative section it should do the trick with some z-index"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-10-02 13:26:27",
    "edited": {
      "time_stamp": "2024-10-02 13:27:57"
    },
    "text": "Is there any reason why a module would not display on a blog post page template?\n\nHere's my code and when I go to the page and inspect the source there's nothing being put on the page where this module code is. If I take everything out except the path and label it still doesn't work.\n\n       {% module \"module_172789598656025\"\n          path=\"/MyTheme/modules/related-posts\",\n          label=\"related-posts\",\n          select_blog=123123123123,\n          style={\n          \"display\" : {\n            \"button\" : false\n            }\n          }\n        %}\n\n** edit, actually it seems like it's finally outputting something now**\n\n<div id=\"hs_cos_wrapper_module_172789598656025\" class=\"hs_cos_wrapper hs_cos_wrapper_widget hs_cos_wrapper_type_module widget-type-post_listing\" style=\"\" data-hs-cos-general-type=\"widget\" data-hs-cos-type=\"module\"></div>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-03 10:06:59"
      }
    ]
  }
]