[
  {
    "poster": {
      "poster_name": "Swapnil Harde",
      "poster_handle": "swapnil"
    },
    "time_stamp": "2022-10-14 04:48:50",
    "text": "Hi Everyone,\n\nI'm currently working on a usecase wherein I need to insert some records in Custom Objects daily. In order to achieve this, I have created a workflow with Custom Code action added in it. I need to execute this workflow on dailty basis to delete existing records and push fresh records daily.\n\nCustom code action is responsible for following actions:\n1. Get the list of records from custom object and form a data structure to delete existing records after insertion of fresh records.\n2. Insert fresh records in Custom Object.\n3. Delete the pre-existing records using data structure created in step#1.\n\nAfter scheduling the workflow to execute daily the behavior of workflow is very diasy. I'm facing following issues:\n1. Sometimes the workflow doesn't get executed at all at the scheduled time.\n2. The code for deletion takes place fine, but during insertion it inserts the same set of data multiple times. This behavior is a bit abnormal as sometimes the insertions works correct and sometimes it inserts multiple times.\n\nNote: If I test the custom code action manually it executes as expected every single time.\n\nAny leads on resolving these issues would be very helpful.  Thank you in advance.",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-14 06:21:17"
      },
      {
        "time_stamp": "2022-10-14 06:22:32"
      },
      {
        "time_stamp": "2022-10-14 06:22:42"
      },
      {
        "time_stamp": "2022-10-14 06:23:10"
      },
      {
        "time_stamp": "2022-10-14 06:23:49"
      },
      {
        "time_stamp": "2022-10-14 06:30:56"
      },
      {
        "time_stamp": "2022-10-14 06:31:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2022-10-14 06:21:17",
    "text": "To give some info, daily executions are sometimes delayed heavily. We had custom code workflow actions that where delayed to up to 20 min each time"
  },
  {
    "poster": {
      "poster_name": "Swapnil Harde",
      "poster_handle": "swapnil"
    },
    "time_stamp": "2022-10-14 06:22:32",
    "text": "What could be possible alternative to get this working?"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2022-10-14 06:22:42",
    "text": "Make sure you use good error logging, and are not exceeding any API rate limits. Also use error throwing inside custom code reporting so the actioin will repeat automatically explained here\n<https://developers.HubSpot.com/docs/api/workflows/custom-code-actions#hs_cos_wrapper_widget_1617643818423_>"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2022-10-14 06:23:10",
    "text": "I can't see what is wrong with your workflows of course, but try to pinpoint the exact call where it goes wrong, and work from there"
  },
  {
    "poster": {
      "poster_name": "Arno Van de Weyer",
      "poster_handle": "arno.vandeweyer"
    },
    "time_stamp": "2022-10-14 06:23:49",
    "text": "I have cases of a daily update of +20k custom objects via the API, so should work."
  },
  {
    "poster": {
      "poster_name": "Swapnil Harde",
      "poster_handle": "swapnil"
    },
    "time_stamp": "2022-10-14 06:30:56",
    "text": "ok. I'll have a look into it and get back to you if needed."
  },
  {
    "poster": {
      "poster_name": "Swapnil Harde",
      "poster_handle": "swapnil"
    },
    "time_stamp": "2022-10-14 06:31:01",
    "text": "Thank you for the details."
  },
  {
    "poster": {
      "poster_name": "Logan Armstrong",
      "poster_handle": "logan565"
    },
    "time_stamp": "2022-10-14 18:10:37",
    "text": "Hey all, couple questions:\n\n1. Could we use a custom-coded workflow action to automatically associate any companies and deals with a custom object, when said companies and deals have a contact that is already associated with that custom object?\n1. Is it possible to assign association labels based on whether a date property from a company/deal is before or after a date property of a custom object?\nthank you in advance!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-14 18:51:54"
      },
      {
        "time_stamp": "2022-10-17 07:36:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-10-14 18:51:54",
    "text": "Heck Yeah, both are super easy to build"
  }
]