[
  {
    "poster": {
      "poster_name": "Thomas Niederberger",
      "poster_handle": "thomas.niederberger"
    },
    "time_stamp": "2022-10-05 05:18:48",
    "edited": {
      "time_stamp": "2022-10-05 05:19:01"
    },
    "text": "See that with Sakari. I did an install and it’s also pretty well integrated within the contact view. Guess if I would do Twilio I don’t have that. Right, except I write the code for it?"
  },
  {
    "poster": {
      "poster_name": "Ericsen Wrice",
      "poster_handle": "ericsen.wrice"
    },
    "time_stamp": "2022-10-05 10:43:30",
    "edited": {
      "time_stamp": "2022-10-05 10:44:06"
    },
    "text": "Hi All! So, I have my CS team that is looking for the best workflow to track renewals coming up oppose to adding another integration to our tech-stack with a third-party application. Does anyone have best practices for when deals are pushed to \"Closed Won\" from sales team and passed to our Customer Support team where a workflow automatically generates from the subscription/product line items and notifies via email to the proper CSM we choose for that based on \"territory\" or CSM assigned? We'd like notifications for renewals coming up within a certain period of time. (Ex. 60, 90 days out for contact renewal)"
  },
  {
    "poster": {
      "poster_name": "Rafi",
      "poster_handle": "rafipn01"
    },
    "time_stamp": "2022-10-05 14:27:34",
    "text": "Woah! This is neat :raised_hands: We deal with a lot of free email domains with no websites so this could be a game changer in associating folks to the right company. :nerd_face:"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2022-10-05 15:35:50",
    "text": "We have a custom code step in a small workflow that executes some Node 12 JS. We haven't touched it in a few months and it has been running great, but it is throwing odd errors such as `Custom code wasn't able to execute, but will retry soon` and no other errors. When we run the code in our test environment it works fine, when we run the code manually against the same object it works fine (using the workflow editor). It also works fine *sometimes* so I think it is not the code but rather that the workflow product continues to be completely unreliable.\n\nAnybody seeing this? Any suggestions?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-10-06 07:45:19"
      }
    ]
  }
]