[
  {
    "poster": {
      "poster_name": "Nil SJ",
      "poster_handle": "niladri123"
    },
    "time_stamp": "2022-10-28 11:52:01",
    "edited": {
      "time_stamp": "2022-10-28 12:04:02"
    },
    "text": "Hey coders, I am feeling really low, as for several hours I am trying to solve a problem. My company website needs a reading time (that looks like \"5 min read\" against a blog based on word count). I could actually make the necessary HubL code for this. The main problem lies in implementing the code in the project as I described below (apologies for the long post, but I wanted to share the context in as much detail as possible):\n\n1. I am working on a dummy website to make sure I do it right.\n2. In that website the blog contains - one blog index page, blog post pages. And this website is using a theme. I need to add the custom code for reading time in two places - on individual blog post page, near the top of the blog post, and on the blog index (listing page) against each list item reflecting each blog.\n3. Since the website is using a marketplace theme that does not allow me to edit the blog index or blog post pages. So, the next best alternative is to make a child theme or clone the theme and then edit. I created a cloned theme. And then for my blog index and blog post pages I applied the respective templates from the cloned theme.\n4. In the cloned theme, I edited the blog post template and added my custom code directly in it. As a result the blog post pages are showing the reading time information correctly.\n5. However, when I see the structure of the blog-index page - it has in it, one blog listing module, and one blog pagination module, in the blog listing module there is a for loop which runs through all blog posts and lists the details from those posts. Here when I add my custom code. I don't see the changes in the blog index page (i.e. the custom code output is not shown here). I googled and found that a template change will only be reflected on the future pages created from the template. However, in HubSpot there is no way to create a new Blog List page. Of course when I create an entirely new blog (not blog post but new setting and new set of blog posts), there I can see the changes in the newly made blog listing page. However, I need to see the change in my existing blog list page. Is there anybody who came across this issue? If so please help me in resolving it. Thanks in advance. "
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 12:09:53",
    "text": "Have you looked into reading-time.js"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 12:10:37",
    "text": "<https://github.com/michael-lynch/reading-time|https://github.com/michael-lynch/reading-time>"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 12:12:47",
    "text": "Oh I see you also need on index"
  },
  {
    "poster": {
      "poster_name": "Nil SJ",
      "poster_handle": "niladri123"
    },
    "time_stamp": "2022-10-28 12:57:20",
    "text": "<@UG7S8J18D> yes, I could build my code and it worked on the blog post itself. But when it comes to editing the template (or its component module) for the blog index page, the changes are not reflected on current blog. But yes, if I create a new blog with the blog index template then that new blog index page does show the change. That is frustrating me. I would need to see the changes in my existing blog index. Thanks for your reference on this topic though.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-10-28 13:26:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 13:21:50",
    "text": "Have you tried the bust cache option or print the blog post content to see if it has the widget data you need to output?"
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 13:26:20",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1666100303409809?thread_ts=1666086338.642379&amp;cid=C22PU4LV8|https://HubSpotdev.slack.com/archives/C22PU4LV8/p1666100303409809?thread_ts=1666086338.642379&amp;cid=C22PU4LV8>"
  },
  {
    "poster": {
      "poster_name": "Nil SJ",
      "poster_handle": "niladri123"
    },
    "time_stamp": "2022-10-28 13:27:39",
    "text": "<@UG7S8J18D> I tried printing, but still the changes are not getting reflected on the blog-index page output.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-10-28 13:29:18"
      },
      {
        "time_stamp": "2022-10-28 14:42:08"
      },
      {
        "time_stamp": "2022-10-28 15:00:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 13:29:18",
    "text": "Have you tried editing a post and selecting the field you need to populate and then publish again? I have seen if you preset a field in a blog post it doesn't save unless you set in the post and publish it again."
  },
  {
    "poster": {
      "poster_name": "Nil SJ",
      "poster_handle": "niladri123"
    },
    "time_stamp": "2022-10-28 14:42:08",
    "text": "I tried that too. But the issue still persists."
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2022-10-28 15:00:14",
    "text": "Hmm I'm sorry I'm not helping much maybe someone else has another idea"
  }
]