[
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2024-12-24 07:49:09",
    "edited": {
      "time_stamp": "2024-12-24 08:09:00"
    },
    "text": "Hello everyone,\n\nI'm struggling with CTAs (the new ones, I think it's not wise to use the legacy ones as of now), I admit I'm no expert in dealing with them but I suspect I'm tilting with windmills...\n\nBasically, I have a custom module on a web page that does quite heavy logic about handling data to then build the url that a button should redirect to (I mean, this url reads its base from a Javascript variable storing a HubL field and then a query string built out of a complex logic is appended to it).\nNow, our client asked us to allow them to track that button's clicks, so that they have HS reports on it ecc.\nMy first thought was \"Ok, I'll replace that button with a HS CTA, adding my custom style and logic, and we're done\".\nEeeh... not so fast :sweat_smile:\nI mean, I fiddled with an embedded HTML CTA and while there's no problem with CSS I'm not seeing any option to edit its logic. Moreover, I see the url field which is required but as I laid out above I don't have a static url to point to, it's built anew on every click.\nI put \"#\" as url field and tried to intercept the click event on the CTA with some JS on the module but to no avail, I mean I can see the CTA click event but there's no way to preventDefault it and apply my current logic to its redirect.\n\nSo I'm wondering if anyone knows any way to get this sorted with CTAs or if I'm asking too much from HS CTAs.\nIf so, do you happen to know any other way to achieve my goal?\nI read about custom (behavioral) events (specifically \"clicked element\" events), maybe they would help me out?\nOr is a Google Tag Manager solution the way?\n\nThank you.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-01-03 10:04:24"
      }
    ]
  }
]