[
  {
    "poster": {
      "poster_name": "Purusothaman K",
      "poster_handle": "pk"
    },
    "time_stamp": "2024-12-05 04:35:56",
    "edited": {
      "time_stamp": "2024-12-05 04:36:18"
    },
    "text": "I have created a custom workflow to update a deal's custom string property with the most recently attached contact email, and it is working fine as per my requirements. Could you please guide me on how to automatically create this workflow when a customer installs our public app?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-12-05 05:44:26",
    "text": "I have not personally used the the new automations api (currently in beta) but you can look at that.  The older workflows api is very limited whereas the new  automations, according to the docs page, allow you to \"You can use the automation v4 API to fetch data from existing workflows, create new workflows, as well as delete workflows you no longer need.\"  <https://developers.HubSpot.com/beta-docs/guides/api/automation/workflows-v4#action-types>"
  },
  {
    "poster": {
      "poster_name": "Purusothaman K",
      "poster_handle": "pk"
    },
    "time_stamp": "2024-12-05 05:45:25",
    "text": "Ok how we can add the workflow to the public app?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-12-05 05:52:16",
    "edited": {
      "time_stamp": "2024-12-05 05:53:34"
    },
    "text": "I think that depends how you have the installation routines set up where you would add that.  How does your installation code currently work?  Is there a place toward the end of the installation process where you can add your api code to create the workflow?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-12-05 05:56:27",
    "text": "I have not yet tried this myself but I usually look at other apps to get ideas how they handle installations that require multiple steps.  Zapier is one I got some ideas from initially."
  },
  {
    "poster": {
      "poster_name": "Purusothaman K",
      "poster_handle": "pk"
    },
    "time_stamp": "2024-12-05 21:28:21",
    "text": "Ok thanks <@U01GW2U4WMA>"
  }
]