[
  {
    "poster": {
      "poster_name": "Sam Basile",
      "poster_handle": "sbasile"
    },
    "time_stamp": "2023-01-24 08:56:00",
    "text": "This is a very difficult question to answer based on the information given.\n• What HubSpot level are you working with? If Enterprise can you accomplish some of your goals using server-side functions?\n• With regards to transactional payments, what is your gateway? Can the same be accomplished with HubSpot payments or A8 Labs HubSpot/Stripe integration?"
  },
  {
    "poster": {
      "poster_name": "Laura Taylor",
      "poster_handle": "laura071"
    },
    "time_stamp": "2023-01-24 13:27:47",
    "edited": {
      "time_stamp": "2023-01-24 13:33:40"
    },
    "text": "Hello Everyone in <#CCQ7H31D5|developer-tools>!\nI have a web developer building my site and he is used to using WordPress and said that HubSpot CMS won't have all the customization options he has in Wordpress. He mentioned PHP etc... I am not a developer, but would like to know if there are limitations using HubSpot CMS vs. WordPress? We want scroll animation and cursor animation on our website. Any info to help us see the distinction and the limitations is appreciated!",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-01-24 14:17:05"
      },
      {
        "time_stamp": "2023-01-24 14:25:08"
      },
      {
        "time_stamp": "2023-01-25 04:52:09"
      },
      {
        "time_stamp": "2023-02-10 02:34:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-01-24 14:17:05",
    "text": "Hey Laura!\n\nAs with any managed platform, HubSpot’s CMS does have its own strengths, weaknesses, and  limitations. Regarding design limitations vs Wordpress, there’s a few major points I can think of:\n• Wordpress page builders tend to be more flexible out-of-the box. HubSpot CMS’s page builder is easier to extend, but is pretty simple in its base configuration.\n• Wordpress page builders tend to be better-suited for building very advanced and complex page layouts, whereas the HubSpot page builder is more targeted towards making pages easier to build for non-technical users.\n• Wordpress page builders tend to have the advantage in customizing layouts for different screen widths and device sizes.\n• HubSpot isn’t very well-suited to running in a SPA (single-page application) setup. This isn’t typically something that’s necessary (or desirable) for marketing websites, but can be useful for facilitating things like animated page transitions.\n• With HubSpot CMS, you don’t have direct access to your web server — however, this is typically only used for advanced and complex functionality.\n• HubL can’t directly fetch data from APIs and other external/3rd-party sources, whereas PHP can.\nFor the most part, the HubSpot CMS templating system is very powerful and doesn’t present a huge number of things that you “can’t do” — it simply requires that you approach doing things in a different way than you might on Wordpress.\n\nThings like scroll animations or cursor animations are 100% possible within HubSpot CMS, and could potentially even be implemented in the drag-and-drop editor, with clever use of custom modules.\n\nI could crow all day about how I think HubSpot CMS’s approach is superior, but you asked about limitations, so I’ll restrain myself for now.\n\nIn a practical sense, the largest limitation is going to be whether your organization’s developers feel  comfortable working with the tools, systems, and philosophies that power HubSpot CMS sites."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-01-24 14:25:08",
    "text": "One big asterisk to put on all of that: that’s all assuming that you’d be building your Wordpress pages with a visual page builder supplied by your base theme.\n\nIf that’s not the case, and you’re going to be doing a custom implementation for your more complex site pages, only the limitations mentioned in the last three bullet points are relevant."
  }
]