[
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-10-09 14:32:01",
    "text": "Hey! Anyone know the code to include in a theme template to establish default padding on a core image and core form module? Nothing I've tried is working."
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-09 14:36:36",
    "text": "Hey everyone :wave: ,\nI have a client that has created a subdomain at `events.<http://DOMAIN_NAME.com|DOMAIN_NAME.com>` and it will be used to host a big event they do yearly so it will have separate styling and branding than the main domain `<http://DOMAIN_NAME.com|DOMAIN_NAME.com>`. Is it possible to use a different theme for just the subdomain instead of the current theme or is that only available with Business Units? Any help is appreciated!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-09 14:39:03"
      },
      {
        "time_stamp": "2023-10-09 14:42:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-10-09 14:39:03",
    "text": "Definitely! A theme is not tied to a domain... so, while I wouldn't recommend it, you could use a different theme for each page of the website. :slightly_smiling_face: When you create a page, you select a theme and then a template from that theme. You'll have a different set of global elements, like header/footer, when using a different theme, but sounds like that shouldn't be an issue here. All good... proceed!"
  },
  {
    "poster": {
      "poster_name": "Joshua Todd",
      "poster_handle": "josh290"
    },
    "time_stamp": "2023-10-09 14:42:02",
    "text": "Thank you so much. I finally found it on the docs. You're right it looks like it's at the page level and doesn't effect anything on the core domain.  I appreciate the help <@U0397BZRK6G>!"
  }
]