[
  {
    "text": "Hi all,\n\nI have a question about the relationship between themes and micro sites. We use a number of domains to support our micro sites (<http://hppi.com|hppi.com>, <http://careers.hppi.com|careers.hppi.com>, <http://supplier.hppi.com|supplier.hppi.com> - you get the idea) and I want to edit what I believe are theme-wide settings, such as system pages, headers, footers, header navigation, etc. My first thought was that each micro-site needs its own child theme, but I'm not able to associate the appropriate child theme to its micro-site, and when I look at Branding in Account Defaults, it's showing me that we can only have one theme.\n\nAny ideas or suggestions on how to resolve this issue?? Thanks!",
    "time_stamp": "2023-10-20 14:05:20",
    "edited": {
      "time_stamp": "2023-10-20 14:05:49"
    },
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-10-20 14:46:55"
      },
      {
        "time_stamp": "2023-10-20 15:00:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-10-20 14:46:55",
    "edited": {
      "time_stamp": "2023-10-20 14:48:22"
    },
    "text": "The theme under Branding kit doesn't really matter. I think it just set the default, but you can change it.\n\nI'd just used multiple child themes . I've done it before and it works just fine."
  },
  {
    "poster": {
      "poster_name": "Amanda White",
      "poster_handle": "amanda.white"
    },
    "time_stamp": "2023-10-20 15:00:36",
    "text": "Thanks, Bradley! Did you have to edit anything in the Design Manager to make your micro-site use the appropriate child theme? For example, I want our suppliers portal to use a supplier-specific child theme, but it keeps defaulting to the main one; basically can't get the 2 domains to use separate child themes"
  },
  {
    "poster": {
      "poster_name": "Bradly León Sánchez",
      "poster_handle": "bleon"
    },
    "time_stamp": "2023-10-20 17:46:08",
    "text": "<@U049YGVBGBC> thank you so much !!!"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2023-10-20 19:45:00",
    "text": "There is a Default module that you can use for that."
  }
]