[
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 12:39:57",
    "text": "Question for the crowd: What FTP client are most of you using? It seems transmit is the favorite around here, but I am looking to set up watching and syncing for a bunch of different folders. Any solution suggestions? also not afraid of a CLI over here so maybe that opens up some other possibilities",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-07-16 18:36:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 12:44:43",
    "text": "Also, I should add the file structure locally will not mirror the organization in the file manager, so I need to sync specific folders one to one, ie: local/unique-path-#1/img -&gt; HubSpot/unique-path-#2/img",
    "reply_count": 11,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-07-16 13:13:08"
      },
      {
        "time_stamp": "2019-07-16 14:27:44"
      },
      {
        "time_stamp": "2019-07-16 14:27:45"
      },
      {
        "time_stamp": "2019-07-16 14:30:01"
      },
      {
        "time_stamp": "2019-07-16 14:33:55"
      },
      {
        "time_stamp": "2019-07-16 14:36:07"
      },
      {
        "time_stamp": "2019-07-16 15:46:37"
      },
      {
        "time_stamp": "2019-07-16 16:40:36"
      },
      {
        "time_stamp": "2019-07-17 06:31:25"
      },
      {
        "time_stamp": "2019-07-17 12:19:03"
      },
      {
        "time_stamp": "2019-07-17 12:21:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 12:44:53",
    "text": "thanks in advance!"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-07-16 13:05:48",
    "text": "cyberduck",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-07-17 12:22:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-07-16 13:13:08",
    "edited": {
      "time_stamp": "2019-07-16 13:14:40"
    },
    "text": "Hey Douglas! Thanks for the feedback.\n\nWould you prefer for all of you developer assets to be colocated in the file project that makes up the rest of your developer assets? AKA those images could live as part of your Design Manager project, as opposed to living in the File Manager?"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 14:27:44",
    "text": "<@U6W3H6YN8> Thats a good question and to be honest, its really a yes and a no..."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 14:27:45",
    "text": "For the yes-to-colocation, I noticed it was a little disjointed while I was in early development to have markup/css/and js colocated in the DM and then all other assets (fonts, images) in the file manager. I was under a tight deadline and didn't have the luxury to set up a good dev workflow, so I literally had three finder windows (one with markup, one with css, and one with images) and two ftp client windows (one with DM and one with FileManager) open so I could drag and drop as I locally developed quickly."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 14:30:01",
    "text": "So having everything colocated would makes sense for this type of development. You could even implement some kind of git pull setup here so that lets say I have a master branch and when there is a push to master from local to origin, HubSpot could pull from master automatically and deploy (or not for safeguards :wink: )"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 14:33:55",
    "text": "BUT for the no to colocation, my other marketers who are not developers want a more logical organization of assets within the filemanager so they can use them for various projects. For example, seperate folders for logos, team headshots, product shots, etc. That file organization is completely outside of the version controlled development of the website. So in this case, i would love to set up some kind of watch -&gt;file sync on each folder mapping to a local folder or even a g-drive folder so that lets say I create a new graphic or logo locally, I could just save the file in a specific folder on my machine and then have it upload to the appropriate folder on HubSpot automatically so that marketers can use it at their discretion."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 14:36:07",
    "text": "right now I can do this manually with transmit, but something more a little automated would be nice. Wondering if there are any Gulp scripts folks might be using to do this. In fact having it in Gulp would be amazing because I already have gulp scripts running to deploy css and js with HubSpot apis"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2019-07-16 15:46:37",
    "text": "Makes sense, thanks for the insight!"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-07-16 16:40:36",
    "text": "you bet! and if you know of any solutions for this please pass it on!"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-07-16 18:36:51",
    "text": "it is my goal to add this to my webpack file someday.."
  }
]