[
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2019-05-23 04:44:50",
    "edited": {
      "time_stamp": "2019-05-23 04:45:03"
    },
    "text": "Hey! Do you usually prefer active lists or static lists when creating list of newsletter subscribers? Or do you prefer sending newsletter based on custom contact property?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-05-23 04:45:44"
      },
      {
        "time_stamp": "2019-05-23 04:47:31"
      },
      {
        "time_stamp": "2019-05-23 04:51:18"
      },
      {
        "time_stamp": "2019-05-23 04:57:59"
      },
      {
        "time_stamp": "2019-05-23 06:25:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Lizzie Griffiths",
      "poster_handle": "lizzie"
    },
    "time_stamp": "2019-05-23 04:45:44",
    "text": "Active!"
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2019-05-23 04:47:31",
    "text": "<@UHYGU3WLE> do you have a way to remove people from that list then?"
  },
  {
    "poster": {
      "poster_name": "Lizzie Griffiths",
      "poster_handle": "lizzie"
    },
    "time_stamp": "2019-05-23 04:51:18",
    "text": "Do you want to continually remove contacts from the list if they don’t meet a certain criteria or just one time?"
  },
  {
    "poster": {
      "poster_name": "Sami Sundberg",
      "poster_handle": "sami.sundberg"
    },
    "time_stamp": "2019-05-23 04:57:59",
    "edited": {
      "time_stamp": "2019-05-23 04:58:26"
    },
    "text": "Problem is that conditions list is growing too long and has multiple filters. I am considering to move to static list that would be managed by workflow.\n\nIf you base your active list on form submissions, how can you remove the contact from the list without removing the form submission?"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-05-23 06:25:08",
    "text": "You can make negative workflows as well. That remove people instead of adding"
  },
  {
    "poster": {
      "poster_name": "Paul Clifton",
      "poster_handle": "paul.clifton"
    },
    "time_stamp": "2019-05-23 08:13:50",
    "text": "Anyone have experience importing Blogger XML file to HubSpot for all posts?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-05-23 08:14:30"
      },
      {
        "time_stamp": "2019-05-23 08:21:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-23 08:14:30",
    "text": "I haven’t personally done that but this likely will help you out dramatically <https://github.com/williamspiro/hubXml>"
  },
  {
    "poster": {
      "poster_name": "Paul Clifton",
      "poster_handle": "paul.clifton"
    },
    "time_stamp": "2019-05-23 08:21:02",
    "text": "Cheers Jon I'll take a look, much appreciated :+1:"
  },
  {
    "poster": {
      "poster_name": "Clare",
      "poster_handle": "cpak"
    },
    "time_stamp": "2019-05-23 09:38:06",
    "text": "Thanks for the screenshots + context Jon! We have been rolling out a new version of the inline editing toolbar.\n\nWith regards to their feedback about change notifications, we try to balance the amount of shepherd pop overs and announcements about features so that it’s not annoying for customers. Do you know what this customer’s preferred method of hearing about these kinds of changes might be? Specifically, would they prefer in-app or out of app notifications?\n\nAs for the source code button being hidden, this is something we’ve intentionally put away for the time being. We’re actively keeping an eye on customer feedback, but for context, we found content creators in the source code editor got themselves into tricky situations that requires developer support to bail them out. Given that not all customers have these kinds of resources, we wanted to make this less readily available in the toolbar"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-23 09:41:34",
    "text": "regarding notifications - i think in this specific case it would have made sense to have like a little dismiss-able banner appear in the editor itself to explain.\n\nregarding source code button - Obviously as a developer I’m prone to be like - don’t hide that I use that.\n\nBut I can say that for nearly every site we build the marketers need access to that source code area as well, so hiding this, while I get the reasoning, I don’t know that it’s a great idea."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-05-23 09:42:20",
    "text": "Example common scenario that a marketer would need to get into the source code area - adding a text class or a button class to add a styled regularly used component throughout the site anywhere they want."
  },
  {
    "poster": {
      "poster_name": "Clare",
      "poster_handle": "cpak"
    },
    "time_stamp": "2019-05-23 14:29:40",
    "text": "I hear that - thanks for providing the use cases some customers would need this for. I can see the need for accessing this, but don’t think that placing the source code editor under the “Advanced” dropdown should be equated with it being taken away from the user. It will still be available in the tool for our power users.\n\nAs we continue to roll out this toolbar to more customers, we’ll continue to keep a pulse on this and adjust course accordingly. If your clients have more feedback on this or other parts of the toolbar, please share them with us!"
  }
]