[
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-06 14:03:14",
    "text": "Thanks <@UE24LMGSZ> :raised_hands:"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-06 14:06:09",
    "text": "thanks for helping walk through all this <@UDARG2NKZ> - going above and beyond to help others :raised_hands:\n\n<@UEYQ0QHT3> Have you called into HubSpot support? Honestly, this would be the best because they can screenshare/walk through it while they have you on the call. I believe this should be within what they can help with (sometimes more coder-heavy stuff they can't help with as they aren't coders, but this isn't really code focused)"
  },
  {
    "poster": {
      "poster_name": "Joel Warren",
      "poster_handle": "joel"
    },
    "time_stamp": "2019-02-06 14:16:21",
    "text": "no worries Luke, apparently APAC support was on holidays yesterday\nThe issue seems to be that when creating the slug of the blog as a draft, punctuation is added - which then Kara had copied that generated URL and used it in an email. But once the blog is published, HubSpot removes the punctuation leading to differing urls."
  },
  {
    "poster": {
      "poster_name": "Kara Moffatt",
      "poster_handle": "kmoffatt"
    },
    "time_stamp": "2019-02-06 15:06:00",
    "text": "<@U22PKFRU5> yep - I contacted them immediately, but got an instant notification that they're away. It's the lunar new year! Thankfully <@UDARG2NKZ> was able to rescue me and walk me through it."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-02-06 15:11:09",
    "text": "Cool - just wanted to make sure you know they are there to help, too. (when not a holiday). Glad you got the help and thanks again Joel"
  },
  {
    "poster": {
      "poster_name": "Julie Costales",
      "poster_handle": "julie609"
    },
    "time_stamp": "2019-02-06 20:13:06",
    "text": "Hi All, would like to ask if there is an update on this thread?\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Enable-Smart-Content-on-Rich-Text-in-Custom-Modules/idc-p/251260#M29178>",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-02-06 21:42:00"
      },
      {
        "time_stamp": "2019-02-07 06:52:42"
      },
      {
        "time_stamp": "2019-02-07 20:30:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joel Warren",
      "poster_handle": "joel"
    },
    "time_stamp": "2019-02-06 20:13:49",
    "text": "you can use global content in global custom modules if that helps"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-02-06 21:42:00",
    "edited": {
      "time_stamp": "2019-02-06 21:42:52"
    },
    "text": "If you find out, please let us know! I was just on our call with our onboarding consultant today and after building a bunch of custom modules with text fields, was told that only rich text fields support smart content. if you or anyone has insight, would love to hear it. As much as it pains me, I would go back and switch my text fields to rich text fields (shudder) in order to enable marketers to use smart content"
  },
  {
    "poster": {
      "poster_name": "Julie Costales",
      "poster_handle": "julie609"
    },
    "time_stamp": "2019-02-06 21:48:56",
    "text": "Hi <@UDARG2NKZ>, appreciate your recommendation but seems that using global custom module will not work on what we are expecting since it prevents the content editor from editing the module. My actual goal was to insert a smart rich text module in a custom module. I’ve tried adding a rich text widget block from it but its not working. Is there other work around for it? As per checking the net for a solution, seems that we dont have other option. Also the given link above is still in planning, but hopefully its already in development and have a target date for release."
  },
  {
    "poster": {
      "poster_name": "Joel Warren",
      "poster_handle": "joel"
    },
    "time_stamp": "2019-02-06 22:48:17",
    "text": "Other way is to use a rich text field for the whole html of the module, but this is less easy to edit. I think you'd be able to make it work with a global module just need to help the content editors understand how to make changes"
  }
]