[
  {
    "poster": {
      "poster_name": "Kiara Munz",
      "poster_handle": "kimunz"
    },
    "time_stamp": "2024-09-23 05:23:41",
    "edited": {
      "time_stamp": "2024-09-23 09:01:06"
    },
    "text": "This could be because the developer test account does not have Sales Enterprise! Try renewing the ~scopes~  trials.\nDeveloper Tests Accounts tend to be targets for installation of an app from the developer portal, not where the project is uploaded, although that is fine to do as well! It just means you will have to translate between public and private app configurations if you are intending it making it a public app."
  },
  {
    "poster": {
      "poster_name": "Muhammad Ammar",
      "poster_handle": "malik.ammar"
    },
    "time_stamp": "2024-09-23 05:24:34",
    "text": "Hello everyone, how i can display a softphone in test account or is HubSpot give access of sofphone in free account?"
  },
  {
    "poster": {
      "poster_name": "Dan Guenet",
      "poster_handle": "dan425"
    },
    "time_stamp": "2024-09-23 05:30:08",
    "text": "Thanks for the help! I will try this out later today. I was trying to make a private app and I thought I read that the developer test account bypassed the need for any requirements with enterprise or professional. \n\nWhen you say try renewing the scopes, what do you mean by that?"
  },
  {
    "poster": {
      "poster_name": "Muhammad Ammar",
      "poster_handle": "malik.ammar"
    },
    "time_stamp": "2024-09-23 05:54:32",
    "text": "i make a developer account and test account, now i want to display a softphone, how i can display softphone on HubSpot. please anyone guide me"
  },
  {
    "text": "I guess I should have said \"renew trials\". Developer Test Accounts have trials of enterprise to bypass those requirements, but they need to be refreshed ocassionally",
    "time_stamp": "2024-09-23 09:04:25"
  },
  {
    "poster": {
      "poster_name": "Loriauna Mora",
      "poster_handle": "loriauna"
    },
    "time_stamp": "2024-09-23 09:45:55",
    "text": "Hello everyone and apologies if I am in the wrong channel! I have developed a script I will be hosting within Google Functions that will be triggered to go off on the 1st of every month.\nWhat the script does: The script will delete ALL emails older than 1 year, excluding contacts that have an open deal. This is an enterprise client that has millions of emails in their HubSpot portal and have started receiving association limit notifications, so we need to implement some type of solution to avoid hitting the limit.\n\n*My issue:* As I was testing the script on my PC, it does well at deleting 100s of emails for about 10 minutes, then I'll get a 400/429 Server Code Error, and the script will suddenly stop. I tried adding in logic that will delay after a 400 or 429 error, retry, then skip if not possible - but even with this logic in place, the script is still stopping when an error 400/429 error shows up.\n\nCan anyone please help me understand what I am doing wrong? Also open to feedback if there's a more efficient / better way to do this. I am by no means an expert so appreciate any advice :slightly_smiling_face:  Thanks so much!\n\nCode - <https://github.com/tomieaoba/email-deletion-hs-help/blob/main/deleteOldEmails.js>"
  },
  {
    "poster": {
      "poster_name": "Dan Guenet",
      "poster_handle": "dan425"
    },
    "time_stamp": "2024-09-23 10:06:19",
    "text": "Thanks! that is good to know! I appreciate the help!!"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2024-09-24 00:23:08",
    "text": "Hello anyone who will listen. I am having a hard time with the HUBL VS code plugin. When I add a new module it doesn’t get recognized by — watch or upload."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2024-09-24 00:23:32",
    "text": "it does when i use the cli to directly create the module."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2024-09-24 00:25:45",
    "text": "any changes i make to the modules after I create them using the CTA are not recongnized either."
  }
]