[
  {
    "poster": {
      "poster_name": "Simon Kohnstamm",
      "poster_handle": "simon787"
    },
    "time_stamp": "2024-09-13 07:47:00",
    "text": "Hi everyone, my team is just getting started with HubSpot Local Development, but we’re running into an issue. When we run `hs theme preview . .` within our HubSpot resources repository, we’re able to run the local development mode, but the changes made on our local machine (specifically we’re working on revising CSS and HTML within modules) aren’t showing up on the site. Anyone have thoughts as to what we might do to correct this?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-13 09:08:34"
      },
      {
        "time_stamp": "2024-09-13 09:22:21"
      },
      {
        "time_stamp": "2024-09-15 04:33:10"
      },
      {
        "time_stamp": "2024-09-16 07:38:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-09-13 09:08:34",
    "text": "Hey <@U07M515KXM4>, do you mean the \"live environment\"? If so, `hs theme preview` doesn't sync files. It's just for local preview. Also it might be a cache issue. Try adding `?hsCacheBuster=4-DIGIT-NUMBER`(like `?hsCacheBuster=8976` ) to the URL you're watch.\n\nAlso - to sync files you have to run `hs upload LOCAL-FOLDER HS-FOLDER`  or `hs watch LOCAL-FOLDER HS-FOLDER` . The watch command is super useful since it will auto upload the file you're working on everytime you save it."
  },
  {
    "poster": {
      "poster_name": "Simon Kohnstamm",
      "poster_handle": "simon787"
    },
    "time_stamp": "2024-09-13 09:22:21",
    "text": "Hi Anton, thank you for the reply. So my understanding was that local development would show the changes being made in your local environment being hosted in a local node server, and that changes to the local source would be reflected in that local node server. Is it my understanding that instead we’re hosting the remote files on a local development server?\n\nOur goal is to prevent the need to upload changes to our production site as we’re developing — if we need to instead sync the changes to the remote, this negates the usefulness of this feature, for us."
  }
]