[
  {
    "poster": {
      "poster_name": "Vadim",
      "poster_handle": "bilyy"
    },
    "time_stamp": "2019-11-18 02:50:43",
    "text": "Hey colleagues. I’m new to HubSpot development. Maybe someone had an experience with generating email templates from react components? Witch generators are more convenient for you or just using webpack to get static HTML  and CSS bundle and then copy it into templates of HubSpot? Thanks.",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-11-18 07:23:17"
      },
      {
        "time_stamp": "2019-11-18 07:32:46"
      },
      {
        "time_stamp": "2019-11-18 07:33:40"
      },
      {
        "time_stamp": "2019-11-18 07:37:11"
      },
      {
        "time_stamp": "2019-11-18 07:39:24"
      },
      {
        "time_stamp": "2019-11-18 09:49:28"
      },
      {
        "time_stamp": "2019-11-19 12:17:08"
      },
      {
        "time_stamp": "2019-11-20 05:52:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-18 07:23:17",
    "text": "Hi Vadim, while I haven’t heard of anyone specifically using react components for compiling HubSpot email templates. I’ve seen a lot of people share they like working with MJML and uploading the compiled files to HubSpot."
  },
  {
    "poster": {
      "poster_name": "Vadim",
      "poster_handle": "bilyy"
    },
    "time_stamp": "2019-11-18 07:32:46",
    "text": "Thanks, Jon. Actually, in my case, we are working on the project in react and we have our lib of UI components and idea was to create an HTML template with all necessaries HUBL tags, insert rendered react component as HTML, and paste it into “create email template” in HubSpot."
  },
  {
    "poster": {
      "poster_name": "Vadim",
      "poster_handle": "bilyy"
    },
    "time_stamp": "2019-11-18 07:33:40",
    "text": "I think, that I found a solution already."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-11-18 07:37:11",
    "text": "Awesome!\n\nI understood what you meant about how you’re using react, I think you’re possibly a little bit of a pioneer at the moment. I haven’t seen anyone talk about doing that with HubSpot email templates yet. MJML and Inky have been popular in the past. We also have some folks who prefer to do all the table work themselves.\n\nWould be awesome if you publish a blog post or something on your workflow, I and many others would be interested for sure"
  },
  {
    "poster": {
      "poster_name": "Vadim",
      "poster_handle": "bilyy"
    },
    "time_stamp": "2019-11-18 07:39:24",
    "text": "Of course, I will try )"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-11-18 09:49:28",
    "text": "gonna second the mjml workflow here. best thing i've come up against so far."
  }
]