[
  {
    "poster": {
      "poster_name": "Cecilia Martin",
      "poster_handle": "cecilia"
    },
    "time_stamp": "2025-02-24 00:11:10",
    "text": "Hi there! Below is a the summary of the work done so far, along with the complete project structure and a detailed breakdown of each file with its content. I need help because I've been trying for weeks to get it working. This is an app with an extension that displays a CRM card containing information from a custom object. I'm sure there are many errors since I'm new to this, so any guidance will be much appreciated.\n\n1. General Project Summary\n• *Objective:* Develop a custom application for HubSpot that integrates both a main interface and UI extensions which connect to HubSpot’s APIs and functionalities.\n• *Context:* I have been working on this project for several weeks without success. The app includes an extension that displays a CRM card with data from a custom object. As a beginner, I’m facing challenges and would appreciate any help to troubleshoot potential errors.\n• *Steps Accomplished:*\n    ◦ Established the basic project structure with essential directories and files.\n    ◦ Configured the manifest file (manifest.json) to define integration parameters and required permissions.\n    ◦ Implemented the main interface within the `src` folder (HTML, JavaScript, and CSS) which handles business logic and connects with HubSpot.\n    ◦ Created a UI extension located in the `extensions` folder, complete with its own files for structure, functionality, and styling.\n    ◦ Conducted preliminary tests to validate the integration and functionality of both the main application and the extension.\n2. Complete Project Structure\n```the name of the app and extension is not the real one because is a project for our client \n\nExtensionUI/\n├── manifest.json\n├── package.json\n├── src/\n│   ├── index.html\n│   ├── app.js\n│   └── styles.css\n└── extensions/\n    ├── extension.html\n    ├── extension.js\n    └── extension.css```\nThis structure separates the main application (in the `src` folder) from the UI extension (in the `extensions` folder), ensuring a clear organization of the project components.\nThanks for any idea or suggestion to solve this!",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-24 12:39:15"
      },
      {
        "time_stamp": "2025-02-24 12:40:03"
      },
      {
        "time_stamp": "2025-02-24 12:41:46"
      },
      {
        "time_stamp": "2025-02-24 21:05:49"
      }
    ]
  }
]