[
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-05-08 12:28:27",
    "edited": {
      "time_stamp": "2024-05-08 12:38:44"
    },
    "text": "As of right now it’s a limitation we have in place to prevent the cloning and redistribution of a module. When cloned, the clone would exist outside of the @marketplace folder which would allow for modification. It would *also* allow for a user to copy the module to other accounts and/or modify and break the module. The former presents a huge issue especially for paid modules, the latter could potentially increase the amount of support required for utilizing the module.\n\nAs a “work-around” if you have a customer that would like to make modifications to your module you can *at your discretion* request to be added to their account with access to the design manager and then copy the module from your account to theirs. This would place it into their account without any of the restrictions/limitations, but it would then be subject to the aforementioned _issues._\n\nWe can’t control what a customer will do with a module at that point, but with the limitation in place we can prevent cloning from the marketplace folder directly, as a redistribution vector.\n\nDefinitely appreciate the feedback here though! I’ll pass along the various ideas to the team and maybe we can look into clone-ability without the ability to copy as a future update!"
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-05-08 12:33:49",
    "edited": {
      "time_stamp": "2024-05-08 12:36:26"
    },
    "text": "> Modules in themes and entire themes can be cloned and modified, why not modules?\nThis is only somewhat true in that we don't support \"one-click\" cloning of a marketplace theme. Unfortunately there are a few \"work-arounds\" that I won't get into here, but its definitely more of a process :sweat_smile:\n\nAlso, more often than not the module or template has dependencies on other theme assets that would be a process to clone and redistribute, whereas a standalone module is (hopefully) designed to work as is out of the box"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-08 12:40:18",
    "text": "there are ways to \"download\" modules too, but...  I won't get into here lol :upside_down_face:"
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-05-08 12:41:29",
    "text": "Definitely one of those \"where theres a will theres a way\" situations"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-05-08 12:42:08",
    "text": "lol yep"
  }
]