[
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2023-02-02 04:12:14",
    "text": "I tested the validation using the CLI. From what I see now, it looks like the listed errors do not contain any blocker for our existing theme. At least technically.\nHowever, I am worried about what <@UATE4ATHP> stated. I cannot see this requirement when testing with the CLI. Was it removed?"
  },
  {
    "text": "I ran the validator in HubSpot and get this error. And now I see this in the requirements.",
    "time_stamp": "2023-02-02 05:50:21"
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2023-02-02 07:29:36",
    "edited": {
      "time_stamp": "2023-02-02 07:32:06"
    },
    "text": "Thank you for clarifying. It is missing for the CLI then.\nThe other fields are specific to the styles tab anyway. so no problem But for the color fields… This is indeed an issue for existing themes that need to stay downward compatible for any sites created with those themes."
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2023-02-02 07:32:21",
    "text": "Could we delay this particular requirement until there is a proper solution that allows us to restructure module fields?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-02-02 07:33:53",
    "text": "Existing themes have until May 1, 2023 to fully comply"
  },
  {
    "text": "I don't really want to restructure the fields.  It doesnt make sense\n\nExamples: Buttons, in our theme we allow them to choose Primary, Secondary, etc Which are set at the theme level\nBut we also give a custom options which then shows color fields...\n\nI cant replicate this with the style tab",
    "time_stamp": "2023-02-02 07:47:25"
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2023-02-02 08:13:37",
    "edited": {
      "time_stamp": "2023-02-02 08:34:02"
    },
    "text": "I don't really get why theme requirements are dictating how we set up our fields. It won't always make sense to keep those field types in the style tab.\n\nBradley's example being one and for another instance: I have a hero module that let's you choose a background type between Image, Gradient, Color, and Video. Video is not allowed in the Style tab but the other 3 are now ONLY allowed in the style tab. Separating them would be confusing to the end user. They choose video and the video options are right there but they choose any of the others and they're now forced to go to the Style tab to make the changes they want.\n\nAnd as Markus has stated moving fields around is going to cause breaking changes for those already using the themes. Are we just supposed to send out an email telling all of our downloaders \"Sorry, but you're going to have to go through every single one of your pages and re-make any edits you made to these specific fields\"."
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2023-02-02 08:36:45",
    "text": "Also want to mention that this really stunts the imagination that can go into building a theme and really limits the options theme users have when it comes to usability in a theme. Not every one finds the organization ya'll are now trying to enforce easy to use and understand. One of the things users look for in a theme is a field organization that works for _them_ and this limits one of the ways a builder can make their theme unique. This is really a step backwards."
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2023-02-02 09:00:31",
    "text": "We have the same issue as Alyssa describes. For our background settings we use file-pickers for *.mp4 videos and text/URL fields for e.g. Youtube/Vimeo videos. These are content fields and thus not allowed to be moved to the style tab. Currently, these are conditional fields depending on the background type selected. Not sure if it would make sense to have a visibility setting for those content fields at all. Because it would be controlled via fields from the style tab.\nThey could be shown permanently, but both options are a bit weird.\n\nFor Bradleys example. I think choice fields could also be moved to the style tab, so the context would not necessarily break?\n\nI guess my biggest concern is restructuring module fields without introducing breaking changes to existing customers. Even if there are technical possibilities to do so, it is a very delicate action. And with large number of fields it will also take time to assure nothing will break. And if we are taking on that challenge, we might as well rethink our whole module field structure.\nI am a bit worried that this might block us from releasing updates from May, because this can easily grow into a bigger Milestone."
  },
  {
    "poster": {
      "poster_name": "Alyssa Wilie",
      "poster_handle": "amwilie"
    },
    "time_stamp": "2023-02-02 09:08:12",
    "text": "Not only breaking changes but also confused users who now have to relearn where fields are. I don't even want to imagine the number of support tickets we'll get if we actually comply with these updates. :weary:"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-02-02 09:11:57",
    "text": "&gt; For Bradleys example. I think choice fields could also be moved to the style tab, so the context would not necessarily break?\nNo it wouldn't work the way our theme is built. CTAs are in a repeater"
  },
  {
    "poster": {
      "poster_name": "Markus Zweng",
      "poster_handle": "markus.kaskaden"
    },
    "time_stamp": "2023-02-02 09:35:35",
    "text": "Ah, now I get it. Thanks Bradley.\nActually, repeaters are a very good example. As of now I cannot imagine a way to move any color fields defined within a repeatable over to the style tab. That would be a breaking change. Also, how could those colors be configured otherwise? In another repeater? Please no :smile:\nEither it should be an exception within repeaters or colors should generally be allowed in both tabs.\n\nI find the new field types available in the style tab motivating enough to move fields over to the style tab on the long term. Not that we are not pleased with our current structure. We like it and our customers also like it. There are no real drawbacks with that solution. But, If we would make a fresh start, we would definitely leverage the style tab with its new UI elements."
  }
]