[
  {
    "text": "Hello, I'm having an issue when our sales estimates are download from HS as a PDF, the cookie banner is displayed on the actual PDF. This is a recent issue that seems to have come out of nowhere. Even after removing the cookie banner from the our HubSpot sites/pages, it still appears on PDF version of the estimates. Has anyone faced a similar issue? Any help or advice is greatly appreciated!",
    "time_stamp": "2023-03-09 02:04:32"
  },
  {
    "poster": {
      "poster_name": "Maxime Gourgues",
      "poster_handle": "maxime"
    },
    "time_stamp": "2023-03-09 07:31:24",
    "text": "Hey everyone!\n\nIs there any french :fr: :baguette_bread: HubSpot user to help me for a technical issue ?\n\nI cannot display any css changes in my web page…"
  },
  {
    "poster": {
      "poster_name": "Stan Gommans",
      "poster_handle": "gommans.stan"
    },
    "time_stamp": "2023-03-09 12:21:57",
    "text": "Probably a bit of a weird question, but does anyone know of a clever way to hide certain functionalities in the HubSpot CRM UI like the 'Sales' tab in the top menu? User permissions do not do the job for us.\nI found that these menu items have a specific ID, so i could hide them using CSS, but I am then looking for a clever way to link the file to the UI that is consequently used by my clients.\n\nBit of background: we work for a semi-governmental institution with a lot of less tech-savvy people. Therefore, I want to hide as much features as possible since they are not supposed to use them anyway.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-09 12:29:15"
      },
      {
        "time_stamp": "2023-03-09 13:17:02"
      },
      {
        "time_stamp": "2023-03-09 13:46:27"
      },
      {
        "time_stamp": "2023-03-10 08:18:08"
      },
      {
        "time_stamp": "2023-03-10 08:18:13"
      },
      {
        "time_stamp": "2023-03-10 08:20:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-09 12:29:15",
    "text": "You could definitely build a chrome extension for this but each user would need to install it"
  },
  {
    "poster": {
      "poster_name": "Stan Gommans",
      "poster_handle": "gommans.stan"
    },
    "time_stamp": "2023-03-09 13:17:02",
    "text": "That would not be too bad. I am training the group upcoming wednesday, so that would give me the posibility to have them install it. Do you have any resources on this?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-09 13:46:27",
    "edited": {
      "time_stamp": "2023-03-09 13:47:06"
    },
    "text": "Yeah not the worst idea, here's a link on creating a simple chrome extension like you need: <https://levelup.gitconnected.com/how-to-use-background-script-to-fetch-data-in-chrome-extension-ef9d7f69625d>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin.perolio"
    },
    "time_stamp": "2023-03-09 16:56:02",
    "edited": {
      "time_stamp": "2023-03-09 16:56:21"
    },
    "text": "What permission allows a user to view Content Staging pages? Not seeing one.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-03-09 17:48:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-03-09 17:48:18",
    "text": "If they are published anyone can view, otherwise the permissions for content Staging are the same as for website pages (view, edit, publish) plus the toggle for content Staging under Marketing &gt; Marketing Tools"
  }
]