[
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2023-03-24 01:33:16",
    "edited": {
      "time_stamp": "2023-03-24 01:34:27"
    },
    "text": "Interested in knowing this as well.\nAdding DnD to the template:\n```[ERROR] line 16: Blog Post templates cannot contain drag and drop areas. Template `templateType` must be one of [blog_listing, starter_landing_page, section, page]```\nShould be available though: <https://community.HubSpot.com/t5/HubSpot-Ideas/Drag-amp-Drop-functionality-for-Blog-Posts/idi-p/408909/page/2#comments>"
  },
  {
    "text": "Yes I believe so. I assume it was installed when I ran the \"hs init\" command.",
    "time_stamp": "2023-03-24 04:18:46"
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-03-24 04:50:19",
    "text": "There's no change needed to enable this, `{{ content.post_body }}` will automatically allow you to drag and drop modules in it"
  },
  {
    "poster": {
      "poster_name": "Bo Høirup Pedersen",
      "poster_handle": "bohoirup"
    },
    "time_stamp": "2023-03-24 06:35:21",
    "text": "Have you verified that you are using a valid SSL certificate, because HubSpot, from what I have read, requires the entire certificate chain (I am no expert on certificates). Try using <https://www.ssllabs.com/> to check your URL\n\nAnother option for you could be to try and set up the webhook trigger in a Workflow instead, here you get access to workflow log with a lot of information"
  },
  {
    "poster": {
      "poster_name": "Bo Høirup Pedersen",
      "poster_handle": "bohoirup"
    },
    "time_stamp": "2023-03-24 06:41:28",
    "text": "I would recommend you use WorkFlows to test the webhook functionality instead of using apps. This is way easier and have better logs\n\nBut if you want to use an app you use the install URL found in your app settings and run it in the HubSpot env. where you want to install the app.\n\nAfter you have approved installation your return URL will contain a code. You need to use this code in a post event to create the initial tokens for your app. You can follow this example\n<https://legacydocs.HubSpot.com/docs/methods/oauth2/get-access-and-refresh-tokens>\n\nYou can use postman or other to create the post, and remember to set the correct body-data-format"
  },
  {
    "poster": {
      "poster_name": "Wojciech Gwardjak",
      "poster_handle": "wojciechgwardjak"
    },
    "time_stamp": "2023-03-24 08:16:10",
    "edited": {
      "time_stamp": "2023-03-24 08:18:16"
    },
    "text": "Hi everyone! Have any of you had problems lately with SSL/TLS certificate on website hosted on HubSpot?\nI have TLS 1.2+ enabled but this report shows me bad grades, also TLS 1.0 enabled\n<https://www.ssllabs.com/ssltest/analyze.html?d=www.ziflow.com>"
  },
  {
    "text": "This name would appear in the connected apps section if you did everything correctly:",
    "time_stamp": "2023-03-24 08:31:07"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-24 08:31:25",
    "text": "Did you request a refresh token with oauth, that's usually what trips people up"
  },
  {
    "poster": {
      "poster_name": "James Sinnott",
      "poster_handle": "james.sinnott"
    },
    "time_stamp": "2023-03-24 09:06:32",
    "edited": {
      "time_stamp": "2023-03-24 09:06:48"
    },
    "text": "Ok I don't see that in the connect apps section in the Test account. I didn't request a refresh token either with oauth, where do I do so?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-24 09:07:19",
    "text": "<https://developers.HubSpot.com/docs/api/working-with-oauth>"
  },
  {
    "text": "",
    "time_stamp": "2023-03-24 09:07:31"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-24 09:07:56",
    "text": "HubSpot made a rule last june that you need to request at least one refresh token before the app will actually install on an account"
  },
  {
    "poster": {
      "poster_name": "Barry Grennan",
      "poster_handle": "barry"
    },
    "time_stamp": "2023-03-24 10:01:53",
    "text": "Where do I report issues with default modules?\nI've noticed that in pagination.module they have\n `&lt;a class=\"hs-pagination__link hs-pagination__link--first {{ \"hs-pagination__link--text-and-icon\" if show_first_and_last_arrows and show_first_and_last_labels }}\" href=\"{% if current_page_num == 2 %}{{ group.absolute_url }}{% else %}{{ blog_page_link(1) }}{% endif %}\"&gt;`\nfor the Prev link and use `{{ group.absolute_url }}`  in two other places where it depends on what page you're on (i.e. if I'm not on page one, it sets both \"Prev\" and \"1\" to go to the default blog url.\n\nThat's fine for pagination on the main blog listings page but it's not what the user would expect to happen on tag pages."
  },
  {
    "poster": {
      "poster_name": "Florian Magalhaes",
      "poster_handle": "florian694"
    },
    "time_stamp": "2023-03-24 10:09:11",
    "text": "Hello ! I have a simple question, is there a way to change Primary display property ? Because I know this is impossible to update Internal name of a property so I would like to make my primary display property a simple property and put another as Primary.\nThank you for those who know and will help me ! :)"
  },
  {
    "poster": {
      "poster_name": "Mariana Forteza",
      "poster_handle": "mariana"
    },
    "time_stamp": "2023-03-24 10:57:00",
    "text": "Hello everyone!!\nI’ve built a global module and I’ve edited the fields in the page editor. I would like get that input to add as default in my module fields.json so when I move it to another theme I get that info and I don’t have to re add. Is there an easy way t do this?\n<@U03H04WUZ41>"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2023-03-24 11:05:46",
    "edited": {
      "time_stamp": "2023-03-24 11:05:50"
    }
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-03-24 12:45:29",
    "text": "Hi everyone,\njust a quick question: is it possible to turn a coded template into a dnd area?\nLike, you have a coded template with several module_block modules in it and pages built with it having their content already been edited. I'd like to turn them into dnd areas so that our customer can add custom modules wherever they want, without losing the pages' current content.\nWrapping the entire HTML in dnd tags doesn't work because dnd areas don't accept module_block.\nI really don't want to assume that the only way to achieve this is creating a new template with dnd area and inserting manually all the current content after being turned into several custom modules, for all pages...\nIs there an easier way to accomplish that?",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-03-24 13:24:58"
      },
      {
        "time_stamp": "2023-03-24 13:51:21"
      },
      {
        "time_stamp": "2023-03-24 15:26:36"
      },
      {
        "time_stamp": "2023-03-24 15:56:30"
      },
      {
        "time_stamp": "2023-03-24 16:08:12"
      },
      {
        "time_stamp": "2023-03-24 16:11:32"
      },
      {
        "time_stamp": "2023-03-24 16:25:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2023-03-24 13:24:58",
    "edited": {
      "time_stamp": "2023-03-24 14:19:06"
    },
    "text": "Take a look at how the boilerplate theme is set up with section includes <https://github.com/HubSpot/cms-theme-boilerplate>\n\nWhat you described (I think?) is how the boilerplate theme is set up out of the gate, with dnd_modules added inside of drag and drop sections"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-03-24 13:51:21",
    "text": "You might be able to preserve module content by making sure the modules have the same names in the new and old templates? (ex. `{% module 'module_xyz' %}` -&gt; `{% dnd_module 'module_xyz' %}`) I haven’t personally tried it, but it’d be worth a shot."
  },
  {
    "text": "Hi all! Don't know where to post this but in need some help of triggering this error message to appear on the embedded HubSpot form. This is what i have so far and does not work with I enter a few numbers. I added a few keys to see what potentially could work but all failed(nothing appeared).Please &amp; thank you!",
    "time_stamp": "2023-03-24 14:23:03",
    "edited": {
      "time_stamp": "2023-03-24 15:42:56"
    }
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-03-24 15:26:36",
    "text": "Just to be clear, with module_block modules I mean these ones:\n```{% module_block module \"hero_lp_text\" path=\"@HubSpot/rich_text\", label=\"Hero LP Title\" %}\n  {% module_attribute \"html\" %}\n    &lt;h1 class=\"lato bold mb0\"&gt;Some text&lt;/h1&gt;\n  {% end_module_attribute %}\n{% end_module_block %}\n\n{% module_block module \"logo\" path=\"@HubSpot/image\", label=\"Logo\" %}\n{% end_module_block %}```\nthat is HS rich text, images ecc., not custom modules.\n<@U04AQA0QM8E> do you think that your idea of maintaining the same modules' names to keep the content unchanged could also apply to the transition module_block -&gt; dnd_module?\n\nOk, I gather there's no simple and direct way I could turn a standard HTML coded template into a dnd area, isn't it? Unless I place an empty dnd area in a specific point inside the coded template (limiting the customer to be able to add a custom module only there) I guess I'll have to create a new template, convert the present content to dnd modules and hope this will keep the current content intact, right? Gosh :see_no_evil:"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-03-24 15:56:30",
    "text": "You’ve basically got the gist of what I was suggesting. I can’t say I use the `module_block` syntax very often, but the module name/id *should* be serving the same purpose.\n\nBut yes, unfortunately, I think you’re right that there’s not going to be a good way around recreating the pages in the dnd editor. That’s what I’ve had to do in previous conversions."
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-03-24 16:08:12",
    "text": "That's unfortunate. Thank you for your suggestions.\nBy the way, just out of curiosity, you said that you don't use the module_block syntax that often, so I'm wondering what you usually use in coded templates to give customers the ability to edit content :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-03-24 16:11:32",
    "text": "Modules added via the `{% module %}` tag can be edited via the page editor interface! To my understanding, the `{% module_block %}` tag just allows the developer to use a different syntax to define the default property values."
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-03-24 16:25:21",
    "text": "I see. Maybe it's because I'm used to insert a block of HTML as the default content, especially for rich text modules, like &lt;h1&gt;, &lt;p&gt; ecc., not just a simple inline text value."
  }
]