[
  {
    "poster": {
      "poster_name": "Faith McQueen",
      "poster_handle": "fmcqueen"
    },
    "time_stamp": "2020-10-22 11:41:55",
    "text": "Hi all! I've run into a bit of a problem with our pop up form for gathering new blog subscriptions. I'm trying to do some styling through CSS on our website (we're not using the HubSpot CMS, just the Marketing tools) but I'm not able to actually change things like background colour because I can't overwrite HubSpot's generated !important; tags. I've tried searching for a solution and on the asking on the HubSpot forum but I come up to the same advice every time, which is \"don't use the important tags\" which obviously is a bit out of my control, as they're HS generated. Just wondering if anyone has succeeded in doing custom styling on these forms and/or has any suggestions? The defaults HubSpot gives for that pop up is really counter to our branding.\n(Also - if this is the wrong channel, apologies!)",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-10-22 13:09:15"
      },
      {
        "time_stamp": "2020-10-22 14:04:28"
      },
      {
        "time_stamp": "2020-10-22 14:25:43"
      },
      {
        "time_stamp": "2020-10-22 15:08:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Suyen Rojas",
      "poster_handle": "suyen.rojas"
    },
    "time_stamp": "2020-10-22 12:49:51",
    "text": "Hi, sorry, I haven´t read this message. I did it all finnally, but yes, I was having a success message."
  },
  {
    "poster": {
      "poster_name": "Shani",
      "poster_handle": "hsdeveloper6"
    },
    "time_stamp": "2020-10-22 13:09:15",
    "text": "please provide the link of the page."
  },
  {
    "poster": {
      "poster_name": "Faith McQueen",
      "poster_handle": "fmcqueen"
    },
    "time_stamp": "2020-10-22 14:04:28",
    "text": "It is the subscription form that comes up on this page, it's a slide in on the bottom left: <https://cetaris.com/>"
  },
  {
    "poster": {
      "poster_name": "Shani",
      "poster_handle": "hsdeveloper6"
    },
    "time_stamp": "2020-10-22 14:25:43",
    "text": "are you trying to change the submit button background color ?"
  },
  {
    "poster": {
      "poster_name": "Faith McQueen",
      "poster_handle": "fmcqueen"
    },
    "time_stamp": "2020-10-22 15:08:30",
    "text": "Yes, and the entire box background colour. I can change the button background colour, but that's the only thing my CSS files can change, everything else is stopped by HubSpot's important flags on their styles"
  }
]