[
  {
    "poster": {
      "poster_name": "Tumai",
      "poster_handle": "tumai"
    },
    "time_stamp": "2021-09-16 04:07:11",
    "text": "Hi <@U02BRFR003Z> and <@U020D3GKRSM> - thanks for getting back to me.\n\nI tried both and they work. Really appreciate both your expertise on this!"
  },
  {
    "poster": {
      "poster_name": "Lou Graziani",
      "poster_handle": "lou020"
    },
    "time_stamp": "2021-09-16 08:23:07",
    "text": "HI, I'm working on a drag-n-drop site for a client.   I'm using the default \"growth\" theme with a child theme.  All I'm trying to do is change the styles of the H1 and h2 tags.  But I can't FIND any of this in the theme's CSS.  And I don't see any useful documentation.  This should be simple, but has become overly complex.  I'm used to developing all sorts of websites, but this CMS is still frustrating me.  What am I missing here?  Is there a useful resource?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-09-16 08:40:11"
      },
      {
        "time_stamp": "2021-09-16 08:40:29"
      },
      {
        "time_stamp": "2021-09-16 08:42:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jake Lett",
      "poster_handle": "jacoblett"
    },
    "time_stamp": "2021-09-16 08:40:11",
    "text": "I am not seeing the growth theme listed as one of the default themes. Is it one of these? <https://developers.HubSpot.com/docs/cms/building-blocks/themes/default-themes>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-09-16 08:40:29",
    "text": "Depending on the styling you are trying to change, it may be a setting in the theme settings already: <https://knowledge.HubSpot.com/website-pages/edit-your-global-theme-settings>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-09-16 08:42:15",
    "text": "<@UG7S8J18D>, Growth theme was a theme that was released with CMS Starter."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-09-16 14:52:10",
    "edited": {
      "time_stamp": "2021-09-16 14:53:34"
    },
    "text": "Hey, HubSpot team, any chance of us being able to utilize style fields in the normal non-style groups in the future? When you’re dealing with something in a repeater, for instance, and want to give style options to each item (i.e. Spacing)."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2021-09-16 14:53:34",
    "text": "its designed for the module as a whole. I generally create my own fields if i want to adjust how an element of the module gets styled."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-09-16 14:54:33",
    "edited": {
      "time_stamp": "2021-09-16 15:02:02"
    },
    "text": "Yeah, that’s how I do it and seems to be the only way, but it’s pretty annoying making vertical and horizontal offset number fields and then unit fields, it would be great if we could just add a Spacing field like we can in style groups now. Obviously it would just appear normally on the normal tab like a normal field and not the style tab. But I feel there is definitely value in being able to utilize those fields in non-style groups, rather than hacking your way around a manual solution that is less intuitive, less clean, and 10x the work."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-16 15:08:26",
    "text": "We’ve intentionally kept style fields separated as it provides a more consistent experience for marketers.\n\nThere are also different ways you may organize a content field than you would style fields. We’ve outlined some best practices here.\n<https://developers.HubSpot.com/docs/cms/building-blocks/module-theme-fields/best-practices>"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-09-16 18:08:21",
    "edited": {
      "time_stamp": "2021-09-16 18:13:43"
    },
    "text": "Yes, those guidelines are very close to the way I write my modules, but my opinion still stands. I feel like it’s _less_ consistent, personally. For instance, I’ve done several modules where the client has wanted to be able to tweak an image’s position, so I have to create 2 number fields for horizontal and vertical offset and then 2 choice fields for the units of each and then I put them all in a Position field group or similar, and then I might need to add padding fields as well. So I end up having to write much more HubL for checks and fallbacks and create 5-9 fields which could have been accomplished with a single Spacing field which would also be much more consistent. The image in this case is a field in a repeater, and the client wants to be able to adjust the margin/padding for each image, so you can’t just use a style group field for it."
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-09-16 23:37:57",
    "text": "We have a dynamic product page that we pull data from HubDB. Is it possible to make a dynamic page template with Drag end drop areas so we can add content based on a particular product?"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-09-16 23:38:20",
    "text": "is it possible to change dynamic pages content with the content manager?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-09-17 14:51:34"
      },
      {
        "time_stamp": "2021-09-20 00:31:13"
      },
      {
        "time_stamp": "2021-09-20 04:51:07"
      },
      {
        "time_stamp": "2021-09-21 18:09:46"
      },
      {
        "time_stamp": "2021-09-22 00:49:58"
      }
    ]
  }
]