[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2025-01-07 08:52:00",
    "text": "It feels like CMS folks are left behind in some way. Definitely less focus on that part of the dev community\nWondering whether such priorities are going to remain this way :thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Robyn Naragon (HubSpot PM)",
      "poster_handle": "rnaragon"
    },
    "time_stamp": "2025-01-07 09:20:17",
    "text": "Hi All! For some background on the structure of the new Docs site:\n\nThe Docs IA has been structured to separate Guides and Reference doc material. Casey (my predecessor) found in his user calls that developers were expecting the content to be structured this way, and that other platforms typically follow this same approach of having Guide/Concept documentation and Reference documentation, not separating by product area (e.g. App vs. CMS development, with guides and reference docs within each).\n\nAs our developer platform continues to grow, we want to make sure that our Docs provide a holistic view and encompass all areas of development on HubSpot (App development, CMS development, CRM development and so on), without siloing each area off. E.g. 'Reference' is the central place for all reference material, including API and CMS reference docs.\n\nOut of curiosity, if 'API' was removed from the navigation heading for 'API &amp; Reference', would it make the Reference section feel more inclusive or intuitive?\n\nOf course, I'm also open to hearing feedback for the other case or any other structure if that's preferred, since we want the Docs to work for you, our developers :slightly_smiling_face: Please feel free to book some time with me <https://HubSpot.com/meetings/rnaragon1/developer-docs-feedback|here>!\n\n<@U3T21PDBK> I've brought up your note to the team to discuss, as I can see why the templates information may fall under Reference rather than Guide material. I will circle back on the thread in <#C06S581J2AZ|developer-docs-beta>!"
  }
]