[
  {
    "poster": {
      "poster_name": "Steph Strong",
      "poster_handle": "steph"
    },
    "time_stamp": "2019-09-25 09:59:02",
    "edited": {
      "time_stamp": "2019-09-25 09:59:38"
    },
    "text": "Hey guys! I have a question for setup. We are stalled in setting up properties because our CEO was using the free CRM for his initiatives, fast forward to us signing the contract for the company initiatives we now have his BD and our Subscriber initiatives in the same instance. Our issue, we are customizing the contact record and other custom records so that we can start sending email campaigns to our users, AND we want to keep the CEO's BD efforts outside of this enterprise instance. He's setup quite a few goals over the last 2 weeks and we dont want to lose that work. What is the best way to handle this? I'm thinking we want to move CEO's stuff to a different instance of the free CRM (He doesnt need any other functionality than that for now, thats what he has been operating off of previously.) But I am unsure how to \"migrate\" all of his contacts, deals, etc over....",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-09-25 10:03:57"
      },
      {
        "time_stamp": "2019-09-25 11:45:38"
      },
      {
        "time_stamp": "2019-09-25 14:19:12"
      },
      {
        "time_stamp": "2019-09-25 14:22:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-25 10:03:57",
    "text": "Hi Steph, I would direct this question to HubSpot Support, they will be better equipped to help you with this. This slack is a community run developer slack where developers building on the HubSpot CMS or using the APIs go to help eachother.\n<https://help.HubSpot.com>\n\nOtherwise I would say here is export instructions for the various parts of the HubSpot platform\n<https://knowledge.HubSpot.com/articles/kcs_article/account/export-your-content-and-data#crm-data>"
  },
  {
    "poster": {
      "poster_name": "Steph Strong",
      "poster_handle": "steph"
    },
    "time_stamp": "2019-09-25 11:45:38",
    "text": "Thank you! Super helpful!"
  },
  {
    "poster": {
      "poster_name": "Bob Walsh",
      "poster_handle": "bob.walsh"
    },
    "time_stamp": "2019-09-25 14:19:12",
    "text": "Hey <@UNKJWHCFP> - you're on the right track as far as using a separate instance in the short term. But down the road, you are going to want to have one instance, not two. Don't be afraid of having too many fields in your contact recordbase - the limit is 1,000."
  },
  {
    "poster": {
      "poster_name": "Steph Strong",
      "poster_handle": "steph"
    },
    "time_stamp": "2019-09-25 14:22:08",
    "text": "Thanks <@UH9CS1YG7> I definitely get that. Will make sure to include it in the conversation"
  }
]