[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-07-22 08:42:31",
    "text": "It could be a matter of the betas changing stage - going from beta to publicly released etc. If you’re someone who works in multiple HubSpot accounts I believe you would also see different things appear in the product-updates based on what functionality is actually available to your account.\n\nIt’s also possible - though I’m not sure it affects the visibility so much as the actual button to request access - that the team in charge of the feature is limiting access to their beta. This can be done for a lot of reasons but generally it’s to ensure that when folks get their hands on functionality it’s in the best state it can be in. If a team knows they need to make an important change to how functionality in a beta works based on the feedback they’ve received they might limit new accounts joining to limit negative impacts of having to change to the new way of doing things in the beta compared to the old way."
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2024-07-22 10:02:42",
    "edited": {
      "time_stamp": "2024-07-22 10:02:57"
    },
    "text": "Thank you so much for your explanations! I guessed it would be something similar and it makes sense. Would it be advisable to join a beta that you are interested in as soon as you see it (with the hope that you keep access to it even when the team decides to limit the running beta at some point)?\n\nEither way - thanks for the clarification <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-07-22 14:23:44",
    "text": "If you are interested in the beta and okay with using potentially buggy/incomplete software that is subject to change without significant advanced warning sure.\n\nI would not join a beta your team is not directly interested in participating in just to “get in”.\n\nA beta after-all is functionality that is still being worked on, may have bugs, and is subject to change. If your team is not okay with possible disruption to their work as a result of either bugs in the beta or a necessary change to how the feature in the beta functions - then you should not be in the beta.\n\nHubSpot engineers do their best to iron out bugs, test, and try to design things right the first time so they don’t need to make large breaking changes, but often you don’t know a change needs to be made until beta participants get their hands on the functionality and you see how they actually use it."
  }
]