[
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2024-01-18 05:44:34",
    "edited": {
      "time_stamp": "2024-01-18 05:45:17"
    },
    "text": "It really depends on the platform, whenever I import from say, Wordpress - I'll use the Wordpress connect tool (it uses the REST api I believe behind the scenes), if for some reason I cant do this, then I'll use an XML file (ensuring it's utf-8 encoded), CSV is always last. I've never used the \"smart copy\" tool. Theres a chunk of docs about it here: <https://community.HubSpot.com/t5/Blog-Website-Page-Publishing/Smart-Copy-and-CSS-Selectors/td-p/364148?_ga=2.55603500.667412825.1705533473-738633960.1705533473|https://community.HubSpot.com/t5/Blog-Website-Page-Publishing/Smart-Copy-and-CSS-Select[…]8?_ga=2.55603500.667412825.1705533473-738633960.1705533473> which to me, indicates that it should be used as the last option where you have no access to any export tool.\n\nThe main thing which exporting CSV's from platforms is ensuring they are saved as utf-8 at multiple stages, otherwise you'll get encoding issues."
  },
  {
    "poster": {
      "poster_name": "James H",
      "poster_handle": "jim834"
    },
    "time_stamp": "2024-01-18 06:02:44",
    "edited": {
      "time_stamp": "2024-01-18 06:03:11"
    },
    "text": "It depends on a lot of things but certainly that doesn’t stop a request for the feature HubSpot promote as the main import method to be improved. (smart copy is the first option on the import screen). \n\nThe WordPress connect feature isn't compatible with custom post types in WordPress. I don’t think I’ve ever created a WordPress site without CPTs. "
  },
  {
    "poster": {
      "poster_name": "Kieran",
      "poster_handle": "kieran073"
    },
    "time_stamp": "2024-01-18 06:14:39",
    "text": "Absolutely - That is what the feature request/idea forum is for! I feel like adding support for CPTs would be a good idea too :slightly_smiling_face:\n\nI do agree though - this needs to be pretty solid if presented as an option. If it isn't it shouldn't be the first item in the list."
  }
]