[
  {
    "text": "Hi, I'm trying to check this error in our Automation that kept on delaying some of the steps like email and texts being sent out and i just want to delete it completely. However this has been set by our old developer so I'm not certain what it is for or if it's necessary at this point. Not even sure how to determine which 3rd party app it is from\n\nThank you in advance!",
    "time_stamp": "2024-12-16 09:49:33",
    "edited": {
      "time_stamp": "2024-12-16 10:37:48"
    }
  },
  {
    "poster": {
      "poster_name": "Rasagnya",
      "poster_handle": "rasagnya"
    },
    "time_stamp": "2024-12-16 10:27:35",
    "text": "Hello!\nI am trying to develop a webhook to send data from HubSpot to Make, I have created an app, I gave the webhook url of Make in the redirect url for HubSpot and authorized the account, but it looks like the data is not been sent correctly. Can anyone please help me with this situation. Thank you so much in advance",
    "reply_count": 10,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-12-16 10:44:19"
      },
      {
        "time_stamp": "2024-12-16 12:02:56"
      },
      {
        "time_stamp": "2024-12-16 12:04:25"
      },
      {
        "time_stamp": "2024-12-16 12:32:58"
      },
      {
        "time_stamp": "2024-12-16 12:58:12"
      },
      {
        "time_stamp": "2024-12-16 13:14:10"
      },
      {
        "time_stamp": "2024-12-16 14:14:33"
      },
      {
        "time_stamp": "2024-12-16 14:27:04"
      },
      {
        "time_stamp": "2024-12-16 18:35:22"
      },
      {
        "time_stamp": "2024-12-17 08:22:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nik Patel",
      "poster_handle": "me1438"
    },
    "time_stamp": "2024-12-16 10:44:19",
    "text": "Few things to check.\n\n1. Make sure your subscriptions are active.\n2. If they are - Look at monitoring to ensure events are generated and sent\n3. You will also see the error if it's failing from HubSpot side. Like 404, 401 , 200 status code. etc.\n4. If everything looks good on HubSpot, check Make to make sure you are getting events."
  },
  {
    "text": "Hi Nik,\nThank you so much for your reply. Below is the screenshot of the error that I am getting for the HubSpot CRM module in the Make scenario. I am also attaching a screenshot of the scenario for your reference. Thank you once again for your help.",
    "time_stamp": "2024-12-16 12:02:56"
  },
  {
    "poster": {
      "poster_name": "Nik Patel",
      "poster_handle": "me1438"
    },
    "time_stamp": "2024-12-16 12:04:25",
    "text": "404 shows object not found. Can you run the API call from postman or somewhere else to make sure the object does exist?"
  },
  {
    "poster": {
      "poster_name": "Rasagnya",
      "poster_handle": "rasagnya"
    },
    "time_stamp": "2024-12-16 12:32:58",
    "text": "Thank you so much for your reply. Yeah when I process it through the Postman it's still giving me 404 error, I think I understand the problem, I used develop account and created the app, and I am trying to access data from different HubSpot account, I think that is the problem. However when I authenticated the OAuth URL, I used the account with data.\nPlease correct me if I am wrong"
  },
  {
    "poster": {
      "poster_name": "Nik Patel",
      "poster_handle": "me1438"
    },
    "time_stamp": "2024-12-16 12:58:12",
    "text": "Is the app installed in that HubSpot account?"
  },
  {
    "poster": {
      "poster_name": "Rasagnya",
      "poster_handle": "rasagnya"
    },
    "time_stamp": "2024-12-16 13:14:10",
    "text": "Yeah, now I have created the app in the right account and from HubSpot i am able to get data, tested it in the Postman"
  },
  {
    "poster": {
      "poster_name": "Nik Patel",
      "poster_handle": "me1438"
    },
    "time_stamp": "2024-12-16 14:14:33",
    "text": "Glad you were able to find a solution!"
  },
  {
    "poster": {
      "poster_name": "Rasagnya",
      "poster_handle": "rasagnya"
    },
    "time_stamp": "2024-12-16 14:27:04",
    "text": "Yeah, thank you so much Nik for your help\nBut there is still a problem with Make, all data is being captured individually, I am trying to fix it.\nThank you once again."
  },
  {
    "poster": {
      "poster_name": "Nik Patel",
      "poster_handle": "me1438"
    },
    "time_stamp": "2024-12-16 18:35:22",
    "text": "No worries. Feel free to reach out in future to the channel"
  }
]