[
  {
    "poster": {
      "poster_name": "Sourav Kundu",
      "poster_handle": "sourav.kundu"
    },
    "time_stamp": "2024-12-04 23:35:13",
    "text": "Hi everyone,\n\nI hope you are doing well. We need assistance with an issue that has come up after we transitioned from using Hapikey (v2 version) to a Private App (v3 version) for our API calls. Since this change, we've had trouble tracking Google and Facebook leads in our HubSpot contacts list.\n\nPreviously, using [specific code], tracking for Google contacts worked correctly with the v2 version. However, after switching to the v3 version, the tracking no longer differentiates properly between Google and Facebook leads. Instead, [specific code] seems to aggregate contacts from both sources under a single filter in the HubSpot contacts list, specifically under the \"Original source drill-down 2\" filter option.\n\nCould you help us resolve this issue so that we can correctly track and differentiate leads coming from Google and Facebook separately, as we did before?\n\nYour prompt attention to this matter would be greatly appreciated.\n\nThank you in advance for your help and support.",
    "reply_count": 8,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-08 23:58:24"
      },
      {
        "time_stamp": "2024-12-11 23:39:37"
      },
      {
        "time_stamp": "2024-12-15 23:45:17"
      },
      {
        "time_stamp": "2024-12-19 00:10:42"
      },
      {
        "time_stamp": "2024-12-23 23:20:19"
      },
      {
        "time_stamp": "2024-12-25 23:01:00"
      },
      {
        "time_stamp": "2024-12-30 00:00:31"
      },
      {
        "time_stamp": "2025-01-01 23:48:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Miteshkumar Padariya",
      "poster_handle": "mitesh"
    },
    "time_stamp": "2024-12-04 23:51:59",
    "edited": {
      "time_stamp": "2024-12-05 00:04:15"
    },
    "text": "Hi All, we are curious to set visibility options for specific modules (default/custom) at template level for responsive breakpoints. But we are not sure how can we apply that option to the modules? Any hints? <https://developers.HubSpot.com/beta-docs/guides/cms/content/themes/responsive-breakpoints#set-responsive-breakpoints-for-themes|Reference> link we are using for the same."
  }
]