[
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2022-12-15 03:02:13",
    "edited": {
      "time_stamp": "2022-12-15 05:23:37"
    },
    "text": "Hi Ben\n\nI’ve just been through the performance part of the new certification and have some feedback.\n\nThe example page is _extremely_ simple and will of course with very few adjustments fetch a 90+ score. That example doesn’t really represent the real world scenarios we are met with, when developing HubSpot CMS - where big hero images and videos are at the forefront.\n\nI’ve spent the last two days optimising every part of a client site (not a bought theme) and still we can’t push past 86. Why?\n\nWell, firstly because we have no control over JS files such as banner.js that will be added dynamically in the &lt;head&gt; section of the page regardless of the fact that the cookie banner is disabled in settings. Same goes with forms/v2.js which we can’t control the load method of. Add to that the portalid script which is added twice :/\n\nSecondly because the initial server response time is a whopping *1.14 seconds.* We’re located in Denmark and the site is hosted on (one of?) the european server(s).\n\nThirdly because the heavily modified bootstrap 2 engine used for sections etc. will output a ludicrous amount of HTML bloat on sites with 6+ sections.\n\nAlso I really felt that the presentation of resize_image_url was lackluster and should have had a more thorough walk-through with examples - based on it’s importance and impact on performance scores.\n\nA final note: You’re checking scores in the dev tools simulated Lighthouse tool. If you use the Lighthouse plugin for Chrome instead or <http://pagespeed.web.dev|pagespeed.web.dev> scores will often be lower (and presumably more correct). On the mentioned site we get 6 points lower in the Chrome plugin and pagespeed compared to the dev tool lighthouse test.\n\nHope it will inspire you to dive deeper in future courses."
  },
  {
    "text": "",
    "time_stamp": "2022-12-15 07:01:39"
  },
  {
    "poster": {
      "poster_name": "Ben Brophy",
      "poster_handle": "bbrophy"
    },
    "time_stamp": "2022-12-15 07:50:08",
    "text": "Hi <@U03MU3H35R6>! Thanks for writing this up – this is great feedback.\n\nI agree that in the real world, achieving a score of 90+ is going to be not as straightforward as presented in the course.\n\nThanks for the notes on the HS-loaded resources, and also the feedback on the coverage of the resize_image_url function.\n\nI agree that the lesson as a whole offers fairly shallow coverage of the topic, and performance is a topic that could be rightfully covered in additional videos or multiple lessons.\n\ncc: <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Ben Brophy",
      "poster_handle": "bbrophy"
    },
    "time_stamp": "2022-12-15 07:51:15",
    "text": "If you happen to take the course survey, we'd also welcome your feedback there – thank you again for taking the course and taking time to write this up :pray:"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2022-12-15 07:56:59",
    "text": "Thanks Ben. Appreciated. Believe me, I want HubSpot to win :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ben Brophy",
      "poster_handle": "bbrophy"
    },
    "time_stamp": "2022-12-15 08:02:09",
    "text": "Haha me too :raised_hands:"
  }
]