[
  {
    "poster": {
      "poster_name": "Philippe Greban",
      "poster_handle": "pg834"
    },
    "time_stamp": "2019-03-21 05:47:00",
    "text": "Hi. When I try to clone one of the template a client has, I get an error about standard_header_includes which must come only one time. Same for standard_footer_includes. When I check the html code there are 2 times the same variable {standard_header_includes} . The first is in the header and second is in a header section with is in the body section. :face_with_monocle: Do I miss something or is it wrong? I am not rly exeprienced with HubSpot but it looks weird to me atm."
  },
  {
    "poster": {
      "poster_name": "Eddy Vinck",
      "poster_handle": "eddy"
    },
    "time_stamp": "2019-03-21 07:41:10",
    "text": "Hey guys, I wrote a blog post on some technical issues I solved for a HubL email template. It explains why I needed a global scope within my email template, and how I managed to create one that the email author can influence. You can check it out here: <https://www.linkedin.com/feed/update/urn:li:activity:6514489929622519808>"
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 07:52:11",
    "text": "Has anyone else had any issues with images or files getting deleted randomly and showing as a 404? We had a couple images uploaded to the _Files_ area and then used in landing pages. The next day we noticed they were suddenly showing as broken images and had a 404, although they still showed up in the _Files_ section with the images broken there too; we never deleted them or touched them. I got a lackluster response from support after they investigated basically saying \"This is a very rare occurrence and is not expected behavior,\" but as relatively new HubSpot users this doesn't give us a lot of confidence in hosting our files in HubSpot."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-21 07:57:51",
    "text": "<@UEZ3125LL> Been building on HS for several years never seen that. I have seen clients basically fighting over files in the file manager by having multiple people trying to organize files a different way, and deleting eachothers files and moving them and whatnot without realizing both people were in there doing that.\n\nwas a funny discovery."
  },
  {
    "poster": {
      "poster_name": "Nishan Singh",
      "poster_handle": "nishan"
    },
    "time_stamp": "2019-03-21 07:59:52",
    "text": "@josh we had this issue with word document uploads last week. The reason was the naming of files. For some reason including numbers in the filename caused the error."
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 08:01:02",
    "text": "Haha, file battles huh? Well that's good to know at least. We didn't have any numbers in the file names. And the files worked for a while, before suddenly not working anymore."
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 08:02:14",
    "text": "Anyways, I'll chalk it up to random occurrence and hope it doesn't happen again. Wish I just got a little more comforting message from support that they were looking into it more. Here was the final full support response fyi:\n&gt;After checking in with our internal team it appears that these two file are showing in the file manager as well as our restore bin which is why it is displaying as a 404. I can see both images (same ID) within the the file manager as well as our restore folder on the back end. This is a very rare occurrence and is not expected behavior. Do you know if the image was every deleted and then re-uploaded, or possibly moved to one folder to another? This sometimes can cause this issue to happen- but again this is a one off issue and should not happen again.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-21 09:50:58"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 08:18:53",
    "text": "Different question, does anyone know how I can change the value of a hidden form field based on what page the form is on? Have 50 pages that need to use the same form, but need a hidden field to set a contact property based on what page they submit the form on. We're using the HubSpot CMS and I don't see anywhere in the form module or form embed code to change the hidden field. What's the easiest way to set a hidden form field? Or do I have to create a module to insert in all the pages and use HUBL and JS to build my own front-end form and POST it to the API? (I'm not even sure how or if you can make API requests in a HubSpot module). Any direction would be greatly appreciated!"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-21 08:35:18",
    "text": "I would use JS to populate the field though it may require you checking if the form loaded. Also, you can use the form embed code and then use the onFormReady to do it as well (<https://developers.HubSpot.com/docs/methods/forms/advanced_form_options>).\n\nAs far as using the API in a HubSpot Module, I would not recommend doing this as you would be exposing your API Key, another workaround for this though can be done using the method here: <https://www.kelp.agency/blog/how-to-enable-cors-ajax-requests-for-any-HubSpot-api> (from <@U7V9DQ31P>)"
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2019-03-21 08:44:02",
    "text": "you can also listen for the global form event if you don't want to use the embed code e.g.:\n```window.addEventListener('message', event =&gt; {\n   if(event.data.type === 'hsFormCallback' &amp;&amp; event.data.eventName === 'onFormReady') {\n       // the form is ready to manipulate!\n   }\n});```",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-21 10:01:01"
      },
      {
        "time_stamp": "2019-03-22 17:05:55"
      },
      {
        "time_stamp": "2019-03-23 08:31:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 09:11:31",
    "text": "Thanks <@U7V9DQ31P> and <@U2H3TT8F2> That's helpful, giving it a shot now."
  },
  {
    "poster": {
      "poster_name": "Josh Saunders",
      "poster_handle": "jsaunders"
    },
    "time_stamp": "2019-03-21 09:50:58",
    "text": "Just found two more PDF files that also disappeared (still exist in Files but return 404). These files were in a different folder and uploaded on a different date than my other two."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-21 10:01:01",
    "text": "pinning this so we dont lose it"
  },
  {
    "poster": {
      "poster_name": "Ben Fitzgerald",
      "poster_handle": "ben.f"
    },
    "time_stamp": "2019-03-21 11:43:58",
    "text": "Has anyone put a HubSpot site live with the DNS being in microsoft 365?"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-03-21 12:17:05",
    "text": "that doesnt seem possible"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-03-21 18:31:41",
    "text": "question for the crew: how do you set a page as your 404 page?! The instructions force me to use a drag and drop, not a coded template. can't I just create a page and use that?"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-03-21 18:31:57",
    "text": "<https://knowledge.HubSpot.com/articles/kcs_article/cos-general/use-system-templates-to-customize-error-subscription-and-password-prompt-pages>"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-03-21 18:38:07",
    "text": "nvm, I think I figured it out. I was cloning a previous template, not creating a new one in the DM",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-22 12:10:25"
      }
    ]
  }
]