[
  {
    "poster": {
      "poster_name": "Ludwig Meert",
      "poster_handle": "lm"
    },
    "time_stamp": "2023-05-31 03:35:28",
    "text": "Hi Anthony,\n\n1. Yes, if all your child pages have the same structure, you can easily use HubDB do dynamically generate the pages and then have a module for your main page that will get the url list from the same HubDB table. This way everytime you need to add a page, instead of using the content editor, you'll add a row to your table. <https://developers.HubSpot.com/docs/cms/guides/dynamic-pages/hubdb|Check this link>.\n2. You'll have to <https://community.HubSpot.com/t5/CMS-Development/Customize-Breadcrumb-output/m-p/359570|custom code your own breadcrumb> as a module and add it to your page templates if you want a specific behavior. Check out the community forums to find more examples and tips.\n3. You can, format your content on a page and then save the section. You can also <https://developers.HubSpot.com/docs/cms/building-blocks/templates/drag-and-drop-areas/sections|code your sections> and add them to your theme. Sections can be \"global content\" which means if you change it on one page, it updates on all pages. <https://www.youtube.com/watch?v=zKwnagd1kk0|Here is a nice youtube video showcasing your options>."
  },
  {
    "poster": {
      "poster_name": "Abdelrahman Khaled",
      "poster_handle": "bodyzolo149"
    },
    "time_stamp": "2023-05-31 03:39:26",
    "text": "Hello I am new to HubSpot but I am working on an integration project. I would like to ask about how to integrate between HubSpot and Skyvia using a Key not sure whether it is an API key or not? Would someone give me a hand? Thank you",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-31 06:52:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harshit Rawat",
      "poster_handle": "harshit.rawat"
    },
    "time_stamp": "2023-05-31 05:14:09",
    "text": "Hi Team,\n\nWe want to integrate our PHP website into HubSpot"
  },
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2023-05-31 06:05:36",
    "text": "I saw the beta of rendering React websites in HubSpot and fetching data with Graphql. Am I right to say that HubSpot will move towards a headless kinda approach to let us create more performant websites?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-06-02 01:41:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harun Kumar Siva",
      "poster_handle": "harun"
    },
    "time_stamp": "2023-05-31 06:52:02",
    "text": "you will need to create a <https://developers.HubSpot.com/docs/api/private-apps|private app>.\nbut read up on this first to confirm: <https://developers.HubSpot.com/blog/HubSpot-integration-choosing-private-public-HubSpot-apps>"
  },
  {
    "poster": {
      "poster_name": "Mark Chapman",
      "poster_handle": "mark.chapman"
    },
    "time_stamp": "2023-05-31 07:56:04",
    "text": "Hi, this is my first time on here.  I work on a website that has custom development elements in HubSpot CMS.\n\nI posted a query in <#CFPRTEGTX|modules> but not sure that is necessarily the right place. Could anyone advise about what slack channel is best to review this issue?\n <https://HubSpotdev.slack.com/archives/CFPRTEGTX/p1685534428608609>"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-05-31 09:55:42"
  },
  {
    "poster": {
      "poster_name": "Travis d",
      "poster_handle": "tdumont97566"
    },
    "time_stamp": "2023-05-31 10:26:25",
    "text": "Hello All! I'm new to the channel and to HubSpot in general.  I'm researching setting up a private app for a client that involves pulling data from a 3rd party api, processing the data, and posting it to the clients HubSpot account to be integrated into their workflow.  I am curious if this approach is off the mark and if anyone has a rough idea of the time it would take for someone new to HubSpot to spin this up.\n\nFrom the bit of research I have done, this seems (most likely naively I am sure) that it should involve the following:\n1. create the private app for this feature\n2. create a custom data type to store the data in HubSpot\n3. create a function that fetches and processes the data into that of the custom data type \n4. post that data to the customers existing HubSpot account.   \nAgain I'm very new to HS so I apologize if my terminology is off or there are glaring parts of this workflow I am missing.\n\nThanks!!!"
  },
  {
    "poster": {
      "poster_name": "Piotr Góra",
      "poster_handle": "p.gora"
    },
    "time_stamp": "2023-05-31 15:11:37",
    "text": "Is it possible to add drag&amp;drop to blog post template? supposedly from March 13, it should be works, but I can’t add {% widget_container %} to the blog post template",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-06-01 06:48:32"
      }
    ]
  }
]