[
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-05-11 02:28:57",
    "text": "Hello everyone,\nI was wondering if it is possible to style elements that belong to the HS portal UI itself. As a specific example, when you open a CRM card you see that the iframe which shows up has a quite thick border inside (defining the frame of your app). Is there a way to get rid of that border? Like, a configuration option somewhere in the portal or a place where to inject some custom CSS that will affect the appearance of the iframe?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-11 03:24:09"
      },
      {
        "time_stamp": "2023-05-11 04:58:33"
      },
      {
        "time_stamp": "2023-05-11 05:15:29"
      },
      {
        "time_stamp": "2023-05-11 06:15:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Didier Clapasson",
      "poster_handle": "clapasson"
    },
    "time_stamp": "2023-05-11 03:08:37",
    "edited": {
      "time_stamp": "2023-05-11 03:10:42"
    },
    "text": "Thank you <@UB690RZA7> for the great tip with the file field in the custom module. I just wondered if it would be possible. And boom, here is your answer! Just add a file-field to a custom module and implement it like this in the module's code:\n`&lt;lottie-player src=\"{{ module.solution_lottiefile_field }}\" background=\"transparent\" speed=\"1\" loop autoplay&gt;&lt;/lottie-player&gt;`\nDon't forget to add the lottie-player.js file to your site :grinning:"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-11 03:24:09",
    "text": "As far as I know this is not possible."
  },
  {
    "poster": {
      "poster_name": "Manjunath Arkasali",
      "poster_handle": "manjunath.c"
    },
    "time_stamp": "2023-05-11 04:24:55",
    "text": "Hi, can someone give me an input on how to get all the companies associated to a contact."
  },
  {
    "poster": {
      "poster_name": "Anamika Patel",
      "poster_handle": "anamika.p"
    },
    "time_stamp": "2023-05-11 04:48:20",
    "text": "Hello  all\nWe want to implement blog list with filter and search using of HubSpot as per below site <https://www.seoclarity.net/seo-content-learning-center?pageNumber=0&amp;search=google&amp;sortType=resource_title&amp;sortOrder=desc>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-11 15:00:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-05-11 04:58:33",
    "text": "Yeah, I was suspecting the same :sweat_smile: Still hoping I'm wrong and someone will tell me it's actually possible :see_no_evil:"
  },
  {
    "poster": {
      "poster_name": "Byron Pokorniecki",
      "poster_handle": "byron.pokorniecki.ext"
    },
    "time_stamp": "2023-05-11 05:15:29",
    "text": "Even in the new beta i dont see any options to update the visuals:\n<https://developers.HubSpot.com/docs/platform/create-custom-cards-with-projects>\n\nSo the only route that i see would be a custom chrome extension to adjust the visuals. However this cannot be bundled with an app so this is not an option for a public app on the marketplace."
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-05-11 06:15:25",
    "text": "I see. Thanks for having dug into it for me."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2023-05-11 08:46:22",
    "edited": {
      "time_stamp": "2023-05-11 08:47:18"
    },
    "text": "What Olia’s doing there is getting the HubSpot User’s profile picture, this is different than a contact.\n\nWith contacts I believe that photo is actually accessible I recall seeing the file URL when pretty printing the associated contact for a quote. Going off memory but the variable might be called something like “avatar”.\n\nFor a HubSpot user though I’m not sure that shows up in the data we return. We don’t really expose HubSpot User data to be operated on with HubL in the same way as contacts."
  },
  {
    "poster": {
      "poster_name": "Ai Kurashina",
      "poster_handle": "akurashina"
    },
    "time_stamp": "2023-05-11 14:18:17",
    "text": "Hello, My Data I'm importing /creating is not communicating with my webhook inside the app I made with my developer account. Can someone help?"
  },
  {
    "poster": {
      "poster_name": "chetan kumar",
      "poster_handle": "chetan.iosys"
    },
    "time_stamp": "2023-05-11 15:00:48",
    "text": "Hi <@U055SRMVDSB> I can help you in that, could you please tell me the basic of filtering blog posts (ex- HubSpot blog posts tags )."
  },
  {
    "poster": {
      "poster_name": "Michael Taggart",
      "poster_handle": "mtaggart"
    },
    "time_stamp": "2023-05-11 17:08:20",
    "text": "I am building a Drupal site (with an Opigno distribution) and I am running across a very similar issue.\n\nI added the drupal module HubSpot, and added my *HubSpot Portal ID*, and my Private App’s *Client ID, Client Secret, and Scope.* Enabled tracking code, and debugging.\n\nIt just worked! It was tracking all of the form submissions from the native drupal (or non-HubSpot forms): #user-pass, #user-form, #user-login-form, #user-register-form. (*As a side note I also see that it was tracking admin related submission on my Drupal site like: #smtp-admin-settings)\n\nMy Private App is a little older, and didn’t have a Redirect URLs as this wasn’t a requirement when the app was built.\n\nI ended up adding some Redirect URLs and additionally pushed up some new code and Drupal modules to my site, and this day is when some of the forms stopped logging user submissions. It started with: #user-register-form. But now I won’t find submissions from: #user-pass, #user-login-form, and #user-register-form.\n\nInitially I thought it was the code. Using Pantheon  I restored the database, code, files, and flushed all caches to a version of the website when the logging correctly worked. This still doesn’t log the form submissions in HubSpot.\n\nI created a basic version of the same website. With just the bare bones, and just adding the HubSpot module. Configured the Scope to the exact same as the live site. Same exact issue.\n\nAnd just to be clear: #user-login-form creates a contact in HubSpot, and adds all of the relevant information to the contact.\n\nWhat do you think I should do to try and get these form submissions being logged into HubSpot again?"
  },
  {
    "poster": {
      "poster_name": "Sushil Kumar",
      "poster_handle": "sushil.kumar"
    },
    "time_stamp": "2023-05-11 23:32:30",
    "text": "HI, HubSpot Team,"
  },
  {
    "poster": {
      "poster_name": "Sushil Kumar",
      "poster_handle": "sushil.kumar"
    },
    "time_stamp": "2023-05-11 23:32:35",
    "text": "Good morning,"
  },
  {
    "poster": {
      "poster_name": "Sushil Kumar",
      "poster_handle": "sushil.kumar"
    },
    "time_stamp": "2023-05-11 23:34:15",
    "text": "I am facing some issue to update form data after form submission, can any on suggent how to update form data after form submission via rest api."
  }
]