[
  {
    "poster": {
      "poster_name": "Dennis K",
      "poster_handle": "dennis579"
    },
    "time_stamp": "2023-05-01 06:07:14",
    "text": "When we use the date picker we will get internal values like 445959533000. Obviously this value will represent a date, but since we use this property value inside a Whatsapp message (Messagebird) we would like to convert it to a string (23-04-22 for example). How can we convert this value to a date?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-03 15:44:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Manda Ramakoti",
      "poster_handle": "ramakoti"
    },
    "time_stamp": "2023-05-01 10:09:41",
    "text": "HI team, i have integrated HubSpot Webhooks for property changes,\nWhen i do any changes for the multiple properties at a time like (city, state, zip) am receiving multiple webhook hits are receiving\nbecause of this, from my application end unable to get which data i need to follow\ncan any one suggest why webhooks are sending multiple times for different property changes",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-03 15:42:47"
      },
      {
        "time_stamp": "2023-05-03 15:43:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "RanJ",
      "poster_handle": "randy.okelly"
    },
    "time_stamp": "2023-05-01 13:33:39",
    "text": "Hi All. I have an email permissions question. I have a client that wants to send and email to a list of contacts from their CRM (not HubSpot). These contacts are net new to HubSpot and there’s no verifiable consent.\n\nI told the client these contacts cannot be sent marketing emails without it. Their follow up question asked if there was a way to obtain consent. From my understanding  there isn’t. I thought about a permission pass campaign where we could send an email requesting permission. Those who responded we could contact. But I don’t think this is within permissions compliance either.\n\nTypically, a permission email is verifying whether they’ve opted in or not. Any thoughts on this?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-03 15:40:19"
      },
      {
        "time_stamp": "2023-05-03 15:41:25"
      },
      {
        "time_stamp": "2023-05-03 15:41:47"
      },
      {
        "time_stamp": "2023-05-04 12:47:17"
      },
      {
        "time_stamp": "2023-05-04 12:48:16"
      }
    ]
  }
]