[
  {
    "text": "Hello everyone,\ndoes anybody know when HS released this new way to sign in?",
    "time_stamp": "2023-05-17 02:51:43",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-17 07:43:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tony Valkama",
      "poster_handle": "tony.valkama"
    },
    "time_stamp": "2023-05-17 04:13:59",
    "text": "Hi, we did notice this old update regarding redirect URLs: <https://developers.HubSpot.com/changelog/upcoming-public-apps-will-require-a-redirect-url-in-the-auth-settings>\n*Upcoming: Public apps will require a Redirect URL in the auth settings*\n\nThe documentation / guide regarding adding redirect URLs seems to have different menu/options structure than our HubSpot (I am at <http://app.HubSpot.com|app.HubSpot.com>) and I cannot find the redirect URLs page. How can I add redirect URL to *an existing HubSpot app?*",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-17 07:47:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-17 07:43:23",
    "text": "Like calling from the HubSpot app"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-17 07:43:36",
    "text": "I think it was thursday or friday of last week"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-05-17 07:47:20",
    "text": "While on your developer account, click manage apps =&gt; choose your app =&gt; click Auth =&gt; Scroll down to Redirect Urls =&gt; add your url"
  },
  {
    "poster": {
      "poster_name": "Sierra Howard",
      "poster_handle": "showard"
    },
    "time_stamp": "2023-05-17 08:40:53",
    "text": "Hey <@U04T2CUCP8T> I looked into this and the support ticket (Ticket #12534486) and they did confirm that the issue is because the incorrect  URL is entered in the identity provider as mentioned in your message above. You would need to update the value to be: <https://api-eu1.HubSpot.com/login-api/v1/saml/login?portalId=26892217>\n\nMegan (the support specialist) followed up with you via the ticket to have your team enter the correct one mentioned above as well. Support is the best route to get this resolved as they are have more resources and access to look into your portal than Megan and I would as we have very limited access to customer portals. I hope this helps but let me know if you need anything else!"
  },
  {
    "poster": {
      "poster_name": "Sierra Howard",
      "poster_handle": "showard"
    },
    "time_stamp": "2023-05-17 08:42:19",
    "edited": {
      "time_stamp": "2023-05-17 08:42:30"
    },
    "text": "Also, I'm happy to notify your CSM (Andrew Munnelly) as well if you would like!"
  },
  {
    "text": "Hi everyone!\n\nBy any chance, would anyone know how to include a variable in the URL field of a Webhook in a HubSpot automation flow?",
    "time_stamp": "2023-05-17 09:09:42"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2023-05-17 09:55:02"
  },
  {
    "poster": {
      "poster_name": "Thiago Valente",
      "poster_handle": "thiago.valente"
    },
    "time_stamp": "2023-05-17 11:35:35",
    "text": "Does anybody knows how to update the properties of a custom object in HubSpot via API?"
  },
  {
    "poster": {
      "poster_name": "Yaisah Granillo",
      "poster_handle": "ygranillo"
    },
    "time_stamp": "2023-05-17 14:36:13",
    "text": "Hi Vanessa, I don’t think this can be done unless you publish the blog posts and perhaps add “coming soon” in the blog post body but that won’t work if you’re using email to notify users of a new post for example because then the users won’t get the content of the blog. I’d like to understand more of your use case. Why do you want to display future posts?"
  },
  {
    "poster": {
      "poster_name": "Vanessa BT",
      "poster_handle": "vanessa"
    },
    "time_stamp": "2023-05-17 16:43:02",
    "text": "I want to use the blog feature to create and events calendar feed. I was thinking that maybe we can build a custom module in the post template that you can put the date of the event and then instead of the post listing page pulling by the published date it would pull based on the date of the event module in the post.\n\nWe originally were using HubDB to serve this purpose but the client has decided now that they want to be able to clone items instead of entering events into HubDB.\n\nThey would also like to have these be available to display in a calendar view. Not really sure how to tackle that one yet.\n\nWhat are you thoughts?"
  },
  {
    "poster": {
      "poster_name": "Vanessa BT",
      "poster_handle": "vanessa"
    },
    "time_stamp": "2023-05-17 16:43:41",
    "text": "Functionality best comparison I can think of is an events posting in wordpress instead of a blog post."
  },
  {
    "poster": {
      "poster_name": "Sharad Bhandari",
      "poster_handle": "sharad"
    },
    "time_stamp": "2023-05-17 20:21:40",
    "text": "yeah, i am stuck on customizing calling extension sdk by HubSpot."
  }
]