[
  {
    "poster": {
      "poster_name": "Sharad Bhandari",
      "poster_handle": "sharad"
    },
    "time_stamp": "2023-05-15 03:26:33",
    "text": "As it's my first time working with HubSpot, I am integrating HubSpot with my voip calling app(i have developed it myself) and i found some difficulties while integrating (in developing/making iframe for call widgets) . Is there anyone who have done this before or can help me out?"
  },
  {
    "poster": {
      "poster_name": "Gayane",
      "poster_handle": "garamian"
    },
    "time_stamp": "2023-05-15 06:25:00",
    "text": "Is it possible to sync HubSpot website page view activity to Salesforce? Or should I create a workflow for it (last page seen property value sync)?"
  },
  {
    "poster": {
      "poster_name": "Kirky",
      "poster_handle": "mcneillkirk9"
    },
    "time_stamp": "2023-05-15 11:24:45",
    "edited": {
      "time_stamp": "2023-05-15 11:26:09"
    },
    "text": "Hey everyone :wave: - An old co-worker and I just launched a series of courses on how to design accessibility friendly design system components. If there are any developers who are looking to up-skill themselves on how to design Figma components that can easily slot into a design system, give me a shout or react to this message and I can reach out!\n\nI used to work in a HubSpot agency, so I know how hard sometimes it can be to build something functional that also follows brand standards. Hence, here I am. It's been a passion project for a while.  We can offer some design/development support on components as well.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-05-15 12:19:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2023-05-15 12:19:13",
    "text": "Hey <@U0420CVEL3A>! This offer sounds awesome but I'd ask that you keep all such offers to our <#C0121KGC6RM|showcase> or <#CBNDYJJAZ|jobs> channel, as per our <https://developers.HubSpot.com/slack/code-of-conduct#unwanted-solicitation-of-services|Code of Conduct>"
  },
  {
    "poster": {
      "poster_name": "Selva D",
      "poster_handle": "selva"
    },
    "time_stamp": "2023-05-16 00:01:53",
    "text": "Hey All\nI am not able to put trial slash at the end of URL when pages are created as Dynamic HubDB Pages. Is there any work around for this?\n\nThanks"
  }
]