[
  {
    "poster": {
      "poster_name": "Ven Vadlamani",
      "poster_handle": "ven"
    },
    "time_stamp": "2023-05-08 03:46:09",
    "text": "Hi -  I am building an app using only deno.  does HubSpot have a library on deno.land ?"
  },
  {
    "poster": {
      "poster_name": "amiel arieti",
      "poster_handle": "aarieti28"
    },
    "time_stamp": "2023-05-08 09:02:13",
    "edited": {
      "time_stamp": "2023-05-08 09:03:11"
    },
    "text": "Good morning all. I am new to the community. Not sure exactly what Channel i need but I am having some issues with HUBDB Calling Child tables.\nThe problem I see and cant find any docs or info is that I noticed that When I am calling the hubdb_table_rows for the child tables it only iterates through the first 4 child tables.\nI was using the docs regarding nested tables and all works well but for some reason It does not loop through the rows of the 5th child table and beyond. Can some one help me shed some light on this?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-05-08 09:15:54"
      },
      {
        "time_stamp": "2023-05-08 09:16:58"
      },
      {
        "time_stamp": "2023-05-08 09:17:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "amiel arieti",
      "poster_handle": "aarieti28"
    },
    "time_stamp": "2023-05-08 09:02:58",
    "text": "I even created dummy tables with simple light rows to test it and it still would only fetch row content for the first 4 child tables"
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-05-08 09:15:54",
    "text": "it really depends how you're using the hubdb_table_row function, take into consideration that you can't call that funtion more than 10 times in a single page, I guess you're probably hitting that limit?"
  },
  {
    "poster": {
      "poster_name": "amiel arieti",
      "poster_handle": "aarieti28"
    },
    "time_stamp": "2023-05-08 09:16:58",
    "text": "That is what I was thinking"
  },
  {
    "poster": {
      "poster_name": "amiel arieti",
      "poster_handle": "aarieti28"
    },
    "time_stamp": "2023-05-08 09:17:36",
    "text": "So even if it iterates from 4 child tables it could still be using more than 10 calles limit?"
  },
  {
    "poster": {
      "poster_name": "Rafael",
      "poster_handle": "tauler"
    },
    "time_stamp": "2023-05-08 09:18:33",
    "text": "Hello, I am looking for the right place to ask the following question, I am integrating the HubSpot chat widget in my application, the api documentation shows the flow for the identification of an unknown visitor, but something is missing that the user still It shows as unknown visitor, my question before using the <https://api.HubSpot.com/conversations/v3/visitor-identification/tokens/create> endpoint, is it necessary to use any other endpoint to create contact?"
  }
]