[
  {
    "poster": {
      "poster_name": "Heitor Santos",
      "poster_handle": "heitorg33"
    },
    "time_stamp": "2023-01-30 05:33:01",
    "text": "<@U04C4CUC63W> I had to do exactly what you said and it worked. Thanks for the help!"
  },
  {
    "poster": {
      "poster_name": "Mark Tripoli",
      "poster_handle": "mtripoli"
    },
    "time_stamp": "2023-01-30 07:27:22",
    "text": "Good stuff! Glad it worked out"
  },
  {
    "poster": {
      "poster_name": "Jon DiVito",
      "poster_handle": "jdivito"
    },
    "time_stamp": "2023-01-30 13:33:10",
    "text": "Hi guys, I'm having issues with uploading a custom CRM card to a clients portal. We had everything working last week, but needed to change the url that the iframe pointed to in the crm card. We noticed none of our changes to our files in the design manager were showing up on the front end, so we decided to delete the files from the design manager and replicate our original steps to create a custom CRM card. We swapped out our URL's and reuploaded with all successful messages and 0 errors, however the files are not showing up in the design manager. We also now receive an error on the CRM card pointing us to the \"app's CRM card logs\", however these logs show no errors. when inspecting the deals tab where the CRM card lives we can see this error message in the network tab `\"The serverless function crm-card doesn't exist in this project. Go to the Activity tab for the project to check its deploy status.\"` Then when checking the activity tab for the project the deploy status is deployed. I have a current support ticket open with HS support that they are looking into, but I wanted to ask if anyone in here has ran into a similar issue? Any input is greatly appreciated!",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-01-30 13:41:57"
      },
      {
        "time_stamp": "2023-02-01 09:26:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Hazlewood",
      "poster_handle": "mhazlewood"
    },
    "time_stamp": "2023-01-30 13:41:57",
    "text": "Hi Jon, thanks for providing all this info. I’ve forwarded this along to the dev team. My initial thought is there may be some strange interactions happening between the CMS filesystem (in design manager) and the Projects files, but they’ll be able to dig into it more.\n\nCan you provide a link to the account / project build details?"
  }
]