[
  {
    "poster": {
      "poster_name": "Kishan Padhiyar",
      "poster_handle": "kishan720"
    },
    "time_stamp": "2025-02-19 09:49:25",
    "text": "Hi everyone, I'm transferring activities of contacts and deals from one portal to another by using <https://developers.HubSpot.com/docs/reference/api/crm/engagements/engagement-details/v1|engagement API>. I'm getting error like:\n`one or more associations are not valid`\nBecause activities like: call, meeting and email has more than one associations. Is it possible to transfer it?\nThanks...",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-02-19 16:17:32"
      }
    ]
  },
  {
    "text": "Hi there,\nCan anyone tell me why my `objectWriteTraceId` is giving me an error in this case? If I remove it, it works fine. It’s strictly equivalent to what’s shown in the documentation. I really don’t understant.\nMany thanks in advance !",
    "time_stamp": "2025-02-19 11:21:50",
    "reply_count": 20,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2025-02-19 13:52:10"
      },
      {
        "time_stamp": "2025-02-19 16:13:15"
      },
      {
        "time_stamp": "2025-02-20 00:26:09"
      },
      {
        "time_stamp": "2025-02-20 04:30:48"
      },
      {
        "time_stamp": "2025-02-20 06:11:41"
      },
      {
        "time_stamp": "2025-02-20 06:13:31"
      },
      {
        "time_stamp": "2025-02-20 07:50:57"
      },
      {
        "time_stamp": "2025-02-20 07:56:37"
      },
      {
        "time_stamp": "2025-02-20 08:01:14"
      },
      {
        "time_stamp": "2025-02-20 08:03:54"
      },
      {
        "time_stamp": "2025-02-20 08:39:18"
      },
      {
        "time_stamp": "2025-02-20 08:40:32"
      },
      {
        "time_stamp": "2025-02-20 08:45:00"
      },
      {
        "time_stamp": "2025-02-20 08:45:49"
      },
      {
        "time_stamp": "2025-02-20 08:46:11"
      },
      {
        "time_stamp": "2025-02-20 08:47:00"
      },
      {
        "time_stamp": "2025-02-20 08:47:26"
      },
      {
        "time_stamp": "2025-02-20 08:52:06"
      },
      {
        "time_stamp": "2025-02-20 09:37:02"
      },
      {
        "time_stamp": "2025-02-20 10:23:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Enoid",
      "poster_handle": "bonolo.kamolane"
    },
    "time_stamp": "2025-02-19 12:28:32",
    "text": "Hi guys,\n\nWhich API endpoint can I use to fetch the most recent email click event for a contact?\nNeed to use a custom code actions for my workflow."
  },
  {
    "poster": {
      "poster_name": "Collin Schindler",
      "poster_handle": "collin_schindler"
    },
    "time_stamp": "2025-02-19 13:52:10",
    "text": "I'm going to ask the dumbest question here, what is the `objectWriteTraceId` and what is it used for? My assumption is that it's a way to trace where the original contact came from, but it's not a field on the actual contact, so I'm probably wrong?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-02-19 16:13:15",
    "text": "Collin\ngenerally used for batches to supply some more details about the status of all the items (I believe) I believe it will also show up in api logs and you can search there. I have not used it but I’ve read a lot about it and still scratch my head. I could be saying all misinformation :confused:\n\nCamille\nIf you want to use the trace id I’m guessing you’ll have to look up the hs_object_id to get the ID — then do your batch stuff. I don’t know why they limit this"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2025-02-19 16:17:32",
    "text": "If you are using the old object and record ID, those are likely not the same IDs in the system.\n\nWhen I migrate to a new portal, I create a unique field Previous Portal Record ID (or something similar), and push the record IDs into those properties.\n\nThis allows you to either lookup by that unique field to get the proper ID you need, OR you can export that data out, load up the csv into your app, look it up via that way, and then have the correct ID. I’m sure there are more ways to accomplish this.\n\nIf you already are mapping this information or have done something like that --\nIf you want to debug your error further I’d suggest working on one of these at a time, adding one association at a time and seeing which ones work and which ones don’t — then going into HubSpot to verify if that record ID exists by looking up another record and updating the url with the ID you are looking into"
  },
  {
    "poster": {
      "poster_name": "aniket dubey",
      "poster_handle": "aniketdubey9616"
    },
    "time_stamp": "2025-02-19 22:49:29",
    "text": "hi guys can anyone share user mapping api"
  },
  {
    "text": "<@U08AVAYCZ63> `objectWriteTraceId` is used to handle multi-status errors on batch endpoints. it’s explained here : <https://developers.HubSpot.com/docs/reference/api/other-resources/error-handling#multi-status-errors>\n\n<@U25PYL3Q8> if you’re right, this means that it cannot be used with the batch upsert endpoint - bummer... And you might be right because it works fine when I use it in a batch CREATE endpoint...  :confounded:\n\nIt’s not the first time HubSpot’s docs is not right on this endpoint. It says we can add an association array, but last time I’ve tested, it didn’t work either.",
    "time_stamp": "2025-02-20 00:26:09"
  }
]