[
  {
    "poster": {
      "poster_name": "Karey Mitchell",
      "poster_handle": "kareybm"
    },
    "time_stamp": "2021-09-01 07:08:36",
    "text": "It doesn’t seem clear this is possibly, but figured i’d ask. Is there a way to lock the grid so content editors can’t drag a column width. Just wondering since these are custom. Trying to create childproof for content editors lol."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-01 07:26:09",
    "edited": {
      "time_stamp": "2021-09-01 07:26:24"
    },
    "text": "Not currently. We have discussed at some point in the future supporting something like an HTML section. Which would be like a normal template partial you could place inside a dnd_area. It would not have drag and drop within it. So you would be able to basically lock a design down.\n\nThat will be a lil ways off before we have that functionality or something similar"
  },
  {
    "poster": {
      "poster_name": "Karey Mitchell",
      "poster_handle": "kareybm"
    },
    "time_stamp": "2021-09-01 07:28:08",
    "text": "Awesome. You’ve been a big help. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2021-09-01 09:05:30",
    "text": "&gt; Trying to create childproof for content editors\nFirst time I’ve heard it explained with that analogy :laughing:"
  },
  {
    "poster": {
      "poster_name": "Lou Graziani",
      "poster_handle": "lou020"
    },
    "time_stamp": "2021-09-01 10:04:06",
    "edited": {
      "time_stamp": "2021-09-01 10:04:38"
    },
    "text": "Hi, I'm working on a site in the drag-n-drop editor for a client.  They'd like a *stock ticker* feature, to show their updated stock value for website visitors.  I couldn't find any modules like that in the free or paid HubSpot marketplace.  BUT I can find many plugins like this in wordpress.   Any ideas on how to proceed?  I'd rather not pay to have a developer code this from scratch as this is a small part of a large site.  But, maybe there is some way to put this in as shortcode or something like an iframe? Thanks!"
  }
]