[
  {
    "poster": {
      "poster_name": "Kristopher Combs",
      "poster_handle": "kcombs"
    },
    "time_stamp": "2021-09-09 07:19:20",
    "text": "DnD sections are valid in blog listing templates, but with them not editable (for clients) as a “page” in the CMS, I’m wondering how you’re using them?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-09 07:41:43",
    "text": "<@UNHFP62P4> listing pages are editable like a normal CMS page. Your account may not have the functionality rolled out to it just yet. For accounts that don’t have the functionality yet, it’s still a good idea to build with dnd areas in your templates because once that functionality rolls out to the account, you’ll be able to use it right away."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-09 07:42:45",
    "text": "The rollout is ongoing, If you are interested in opting into the beta for it send me your portal id."
  },
  {
    "poster": {
      "poster_name": "Kristopher Combs",
      "poster_handle": "kcombs"
    },
    "time_stamp": "2021-09-09 07:46:27",
    "edited": {
      "time_stamp": "2021-09-09 07:46:54"
    },
    "text": "Gotcha. This is something we’ve run up against for quite a while so I’m psyched it’s being added. If I could add it to my dev portal that would be great. 5812392\n\nAnd I’ll keep an eye out for it’s official release (I must have missed it’s beta notice)."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-09 07:48:54",
    "text": "Your account has been ungated for the feature <@UNHFP62P4> you should see it now when going to blog settings, and looking at the blog template selection area"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2021-09-09 09:20:43",
    "edited": {
      "time_stamp": "2021-09-09 10:49:33"
    },
    "text": "Disappointing, but understandable. Thanks for the info <@U7SL518D6>."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-09-09 09:25:15",
    "text": "<@U021H3TV338> stay tuned. We know folks want it, we just want to make sure we do a good job."
  }
]