[
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-08-20 13:36:49",
    "edited": {
      "time_stamp": "2021-08-20 13:37:12"
    },
    "text": "quick question to the channel… would you consider details/summary html elements a replacement for traditional button-based accordions? Or would you still enhance it with js?",
    "reply_count": 12,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-08-20 13:58:09"
      },
      {
        "time_stamp": "2021-08-20 14:09:14"
      },
      {
        "time_stamp": "2021-08-20 14:10:01"
      },
      {
        "time_stamp": "2021-08-20 14:13:03"
      },
      {
        "time_stamp": "2021-08-20 14:16:03"
      },
      {
        "time_stamp": "2021-08-20 15:06:37"
      },
      {
        "time_stamp": "2021-08-20 15:13:17"
      },
      {
        "time_stamp": "2021-09-18 09:35:51"
      },
      {
        "time_stamp": "2021-09-18 10:07:43"
      },
      {
        "time_stamp": "2021-09-18 10:33:36"
      },
      {
        "time_stamp": "2021-09-18 10:33:39"
      },
      {
        "time_stamp": "2021-09-18 10:33:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-20 13:58:09",
    "edited": {
      "time_stamp": "2021-08-20 13:58:31"
    },
    "text": "Yes, I would consider them a replacement. There are exceptions though. Details and summary unfortunately have some ugly sides. Specifically if you need your summary to also be a heading. Browsers treat summary as a button. Buttons’s are treated special by assistive tech for obvious reasons. If you place a heading inside of it, it loses the Heading special functionality.\n\nIf the design allows for you to use summary/details and the heading issue isn’t going to be a problem for your use-case. I recommend it.\n\nIf you do need to custom code your own (say for an aesthetic reason, or to solve for that headings issue) - make sure it’s fully keyboard accessible - you properly communicate aria states, and that the content of the accordion itself, is visible when the accordion is open - to screen readers."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-08-20 14:09:14",
    "text": "Have I been reading those articles incorrectly all these years? Are heading elements not visible to screen readers even when the summary/details is open?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-20 14:10:01",
    "edited": {
      "time_stamp": "2021-08-20 14:10:17"
    },
    "text": "to be clear I’m saying if you use the heading inside the summary part, not the expanded internal contents."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-08-20 14:13:03",
    "text": "I gotcha, I’ve never really understood what the big fuss was about with headings inside the summary being hidden from assistive tech. It’s hidden from everyone else too lol. I guess it loses some landmark functionality? I should probably stop being lazy and test now"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-20 14:16:03",
    "edited": {
      "time_stamp": "2021-08-20 14:16:37"
    },
    "text": "The summary part is the clickable always visible part of summary details. It’s effectively a button.\n\nThe issue is that if you make it also a heading - the heading isn’t going to show as a landmark, and will also not be communicated as a heading. IIRC In some odd situations the heading gets announced but the button toggle functionality isn’t - which then means the user doesn’t even know it’s interactive nor the state it’s in.\n\nThe landmarks are used by folks using screen readers to quickly navigate and understand the page."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-08-20 15:06:37",
    "text": "thanks jon!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-08-20 15:13:17",
    "edited": {
      "time_stamp": "2021-08-20 15:13:38"
    },
    "text": "Hopefully the browser vendors and w3c will ultimately rectify the issue themselves. The details/summary elements were almost a perfect win for accessibility. _almost._"
  }
]