[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-08-14 15:55:54",
    "text": "can anyone explain to me why I would want to build a theme using drag and drop sections/areas/etc instead of a theme with built modules that are 100% of the width of the container? I’m super curious and I think these sites are all trash. I see setting up drag and drop areas as using page builders in wordpress… they are just terrible and give marketers too many options.\n\nCan someone tell me I’m stupid/wrong? What are the use cases for using drag and drop areas and using atom type modules and giving a user that much flexibility (and pain) to make their website look and feel as designed.",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-08-14 16:28:46"
      },
      {
        "time_stamp": "2022-08-14 16:33:56"
      },
      {
        "time_stamp": "2022-08-14 16:33:59"
      },
      {
        "time_stamp": "2022-08-15 10:33:12"
      },
      {
        "time_stamp": "2022-08-17 09:32:05"
      },
      {
        "time_stamp": "2022-08-17 09:39:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-08-14 16:28:46",
    "edited": {
      "time_stamp": "2022-08-14 16:32:22"
    },
    "text": "I prefer drag and drop because, as is the point of them, it gives the page editor much more flexibility. Like you say though, that makes it easier to break the layout and requires some learning curve, though as you’re building your modules as a developer, you can create them in such a way that encourages that flexibility and makes it less likely to break the layout/design, but not entirely. So it's a trade off: do you want less flexibility and more fixed design with less of a learning curve and more straightforward options to control everything, then do fullwidth modules; if you want more flexibility and layout possibilities and possibly make more use of the common modules (meaning you may have to build less), you Amat want more flexible drag and drop style modules. Though, you may still need to be careful about how many modules you create. At least for marketplace themes, the limit is 50 modules, but I think all themes, regardless of being a marketplace theme or not, have this limit (don't quote me on this, and if someone knows otherwise please let me know). To me, it's just two different valid ways of developing. Or of course you can mix the styles. It just depends on what you need."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-08-14 16:33:56",
    "text": "Worth noting that ultimately you could even lessen the flexibility argument by simply building more options into your module to compensate, as well."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-08-14 16:33:59",
    "text": "I guess if I scoped a project out differently I could see this being a possibility. \n\nFo you find yourself making design compromises doing drag and drop? \n\nTo prevent this would you need to have a pretty decent understanding of how sections are set up and help guide/change design to accommodate?\n\nDo you get designs provided to you that are built for this type of setup with modules on a more atom level "
  }
]