[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-03-11 07:32:09",
    "text": "If you’re in the graphql beta you can actually use special comments atop your queries which can pull values from a module that you then use in your GraphQL query.\n<https://github.com/HubSpot/recruiting-agency-graphql-theme/blob/933f19a229bc1cdd615cfa6e57078310814e1dce/src/data-queries/featured_roles.graphql#L3>\n\nFor a video where I demonstrate how to use the field - with just plain HubL and demonstrate a use-case, check out:\n\n<https://www.linkedin.com/posts/mclarenjon_httpshubslaq015qljs0-activity-6908050648995373057-0D7o>"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-11 08:11:12",
    "text": "<@U7SL518D6> perfect. thank you"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-11 09:21:58",
    "text": "This really is interesting. Can you share more thoughts about the last part of the video where you talk about \"every interaction informs your business data\"?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-03-11 09:54:00",
    "edited": {
      "time_stamp": "2022-03-11 09:55:38"
    },
    "text": "Yeah, big topic with a lot going on but yes I can speak to it a bit.\n\nWith CMS Hub, your site visitors are directly interacting with the business’s CRM. Every page viewed, every form filled out every blog post viewed, it’s all tracked to the contact in the CRM. That means your sales, marketing, and service teams ALL have that data and can run automations off of it, create reports, use smart content to personalize marketing to those contacts. That’s just the beginning.\n\nOne example we’ve given in the past was a real estate company. That company would have a listing of all of the houses up for sale, that list is in their CRM as custom objects. You as the developer can render that whole listing on the site, creating dynamic pages for it for example.\n\nThe contact can fill out a simple form saying “Hey I’m interested in this house.” They’re now a contact in the CRM. A real estate agent can be automatically assigned based on which agent is associated to that home listing, An automatic email can be kicked out from that agent going “Hey thanks for letting me know you’re interested, here’s my meeting link, pick a time that works best for you and I’ll arrange a showing of the house. Additionally here are some homes nearby that have similar qualities that you might like: [list of homes that have same number of bedrooms, bathrooms etc]. Of course if you see any others on the website feel free to click the button to request to see it, or let me know.”\n\nYou can add memberships capability to that site - that person could log in and see a list of all the homes they’ve requested access to and an automatically generated list of homes based on the commonalities between the ones they’ve previously requested to see. Heck make it even simpler, have a form on the site that asks common questions to narrow down the needs/wants of the buyers. Because of that the real estate agent then also knows which homes the buyers have already looked at but didn’t add to their list and can make informed decisions based on that.\n\nWhere things get exciting is when you as a developer start adding some even more powerful interactivity. With serverless functions you as the developer can provide means for more than just analytics based site visitor interactions to impact business data. You can provide ways for the customer to directly interact with the business data that HubSpot doesn’t provide out of the box. You can interact with external APIs, and even use the results of those interactions to update data in the CRM. You can from a web page create a deal and associate it with that contact.\n\nThe CMS, it’s the way your customer sees and interacts with your CRM. Your CRM powers all of your business activities from sales, marketing, support, and power operations. All of those teams can report on the impact of that data, and create various types of automations that operate off that data to make their work easier."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-03-11 09:54:25",
    "text": "Sorry for the wall of text. I got excited. :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-11 10:06:09",
    "text": "lol, awesome. I'm excited too. Going to read and reread that"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2022-03-11 10:07:25",
    "text": "I am currently evaluating a rebuild of our \"knowledge center\" using graphql, custom objects, memberships, etc."
  }
]