[
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-03-11 02:58:29",
    "text": "The Adobe Marketing Cloud uses AI to instantly predict the open rate of the Email based of the subject line. So when you write the subject line it prints out something like \"x% open rate\" and when you change a word or even a character, it switches to \"y% open rate\". I really find that helpful."
  },
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2019-03-11 03:14:49",
    "text": "For media or website that want to be indexable by Google News they need to have a specific sitemap with specific rules... So a great feature would be adding the possibility to add custom sitemaps on HubSpot Websites. ( like Yoast plugin on WordPress for example)"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-03-11 07:56:48",
    "text": "Would it be useful for HS people to have a bug reporting channel? Ran into a 504 this morning but I didn't want to clog up any of the other channels with something that should be pretty minor.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-03-11 07:57:07"
      }
    ]
  },
  {
    "text": "Here's the error I got, for reference:",
    "time_stamp": "2019-03-11 07:57:07"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-11 10:08:20",
    "edited": {
      "time_stamp": "2019-03-11 10:09:05"
    },
    "text": ":bulb: In the Projects area: Allow for creation of Headings for the Checklists, helps to create a better project template as some of the projects will contains sub-sections (which you can do with task/sub-tasks, just seems more appropriate to use headings though. Also, some kind of stylizing of the project templates would be awesome as well."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-11 10:12:52",
    "edited": {
      "time_stamp": "2019-03-11 10:13:37"
    },
    "text": "I’m interested in seeing how that projects tool evolves.\nI’m obsessive when it comes to to-do list type tools."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-11 10:19:16",
    "text": "I would love to see this evolve as well, we currently use one note for alot of checklists and other stuff we do but the HS Projects tools is a perfect replacement for it if there were some tweaks to be made to it"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-11 10:20:25",
    "text": "for example:\n- Allow Headings\n- When you assign people, it looks like it's broken and doesnt show the right image for people\n- Show more info on the tasks line\n\nOverall, if anyone who is the PM at HubSpot for this has a moment, I would love to chat on making this tool better"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-11 10:31:39",
    "text": "the 3 most killer features of any todo list type tool for me -\n* Due dates(looks like the tool has that)\n* Priority levels\n* infinite nesting of todo’s or atleast something like 5 levels deep, where you really probably shouldn’t hit 5 levels normally but is easier to visually handle than infinite nesting"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-11 10:37:32",
    "text": "Agreed, priority would be awesome with the ability to color code or have an icon to signify high priority items."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-11 10:41:34",
    "text": "minor but would be nice - if the detail pane for the todos didn’t overlap the todo list. I get the need for it but it makes it painful to use if you’re trying to add a bunch of tasks then add details later."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-11 10:50:49",
    "edited": {
      "time_stamp": "2019-03-11 10:52:44"
    },
    "text": "Idea - would be nice if there was an easy way to display a normal Page at a blog’s root URL instead of it’s listing template.\n\nI realize that’s maybe not 90% of people’s situation. but here’s a common scenario.\n\nWe often use a blog for staff listings because the HubDB editor is a poor experience if you have a ton of content and formatting to do.\n\nWe build custom modules that allow the marketers to configure the listing of the people (group by category, list in bulk, sort by specific things, etc.)\nThey then want to be able to put content above and below the listing. If done with a blog template they can’t do this without going into the design manager, which they’re afraid of touching.\n\nSo we often will have the blog url be slightly different and try to redirect the listing url to the page version. It’s not a great setup but allows them to configure that page. Ideally though I want the same root slug for the page as the blog detail pages use.",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-19 15:54:21"
      },
      {
        "time_stamp": "2019-03-19 15:55:10"
      },
      {
        "time_stamp": "2019-03-19 15:55:24"
      },
      {
        "time_stamp": "2019-03-19 15:56:19"
      },
      {
        "time_stamp": "2019-03-19 15:57:17"
      },
      {
        "time_stamp": "2019-03-19 15:58:31"
      },
      {
        "time_stamp": "2019-03-19 16:01:06"
      }
    ]
  },
  {
    "text": "It would be really nice to have the filename of the currently selected image somewhere here for referencing purposes.",
    "time_stamp": "2019-03-11 14:23:00"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-11 14:37:20",
    "text": "I’d go so far as to say the whole file path"
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-03-11 15:19:21",
    "text": "Idea - a Slack channel for discussing multilingual development on HubSpot.  It would be nice to have a place to share tips and tricks or troubleshoot problems.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-11 17:52:53"
      },
      {
        "time_stamp": "2019-03-11 17:55:08"
      },
      {
        "time_stamp": "2019-03-12 07:42:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-03-11 17:52:53",
    "text": "I like this - give me a few minutes :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2019-03-11 17:55:08",
    "text": "<#CGVAY1VQU|multi-language> :smiley:"
  }
]