[
  {
    "poster": {
      "poster_name": "Sydney Hodges",
      "poster_handle": "sydney630"
    },
    "time_stamp": "2023-12-21 20:04:34",
    "text": "Hi! We are looking to automate the generation of a quote based upon a form submission on our website. One step in the quote is to calculate the tax, which is done with TaxJar. However, when I put the custom code into a workflow in HubSpot, I got an error saying I can't \"import taxjar\" library. Would a serverless function be a way around this? I'm new to them. Thank yoU!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-12-22 19:50:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brett Morris",
      "poster_handle": "brett.morris"
    },
    "time_stamp": "2023-12-21 20:21:41",
    "edited": {
      "time_stamp": "2023-12-21 20:25:03"
    },
    "text": "OK, I'm struggling to get this to work. I've been looking everywhere. Most of the demos around are old and not maintained. It's also confusing which \"serverless-functions\" to use!\n\nI am trying to implement a simple React App in a private content page that will send info to Xero. I've got the app and module going and my React app renders. I have 2 endpoints in my (CMS?) serverless-functions, one to retrieve more details about the logged in contact (from associated company) and the other will try and send an invoice to Xero.\n\nI've started writing these endpoints using plain javascript but would prefer it to be in TypeScript. The first one works just using the @HubSpot/api-client and process.env for secrets etc. But the second one needs to import the 'xero-node' node module. So now I'm looking at bundling these files with webpack. Now my first endpoint is failing (I suspect it can't get the process.env's but I'll circle back on this). I can't get the bundles to work. The endpoints fail giving cryptic messages that seem to indicate that it isn't interpreting the bundles correctly.\n\nI'm currently using:\nnode:18.18.1\nwebpack: 5.89.0\n@HubSpot/api-client:10.2.0\n\namong other things.\n\nIt would be good to know what versions are supported and what webpack output is required for everything to run. The examples I've found are all old with old/deprecated settings. Is the only supported versions webpack 4, node 16?\n\nAny help would be great.\nGetting some better, updated examples would be even better.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-01-10 16:20:09"
      }
    ]
  }
]