[
  {
    "poster": {
      "poster_name": "Kevin Santana",
      "poster_handle": "ksantana"
    },
    "time_stamp": "2017-12-02 15:40:34",
    "text": "Hi, I need some advice and help here... I have a protected section on my site but I would like to set multiple users account for that section using hubdb, nothing to complex is needed, I will assign the user names and passwords, the main reason for this is to know who is accessing the page because right now there's only one credential for all users. It is posible to do that?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2017-12-02 15:45:02",
    "text": "You could use a password protected page <@U88BQKDCK> -- You could have people fill out a form so that you have all of their information in the cookie data and then you would be able to see who is accessing it, when, etc"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2017-12-02 15:46:44",
    "text": "You could do some custom javascript on pages that allowed users to login // that will only prevent the most basic people from being able to access it if they want to"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2017-12-02 15:49:03",
    "text": "I feel your issue can be solved with the first solution -- Just making sure you have your ducks in a row to make sure you are checking for being a known user on the pages, and restricting access if they don't match with a user/email address you allow"
  },
  {
    "poster": {
      "poster_name": "Kevin Santana",
      "poster_handle": "ksantana"
    },
    "time_stamp": "2017-12-02 15:52:31",
    "text": "didn't thought about that, I will try it, thanks Nicholas"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2017-12-02 18:42:55",
    "text": "np, hope it works for ya"
  }
]