[
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2020-11-12 06:06:16",
    "text": "You guys should open a Canadian office :flag-ca:"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2020-11-12 10:44:18",
    "edited": {
      "time_stamp": "2020-11-12 11:29:50"
    },
    "text": "Hi All! I'm the CEO &amp; Founder at Osano, a popular data privacy platform used by more than 3.5 million websites. You've probably seen one our open source products, Cookie Consent. If you've ever seen a cookie popup on a website that says \"Got It\" on the button, that's ours.\n\nWe are hiring a Remote Growth Engineer! Osano is fully remote, venture backed, growing like crazy, and addressing the massive data privacy industry. We are *heavily* built on top of HubSpot using CMS, CRM, Service, Custom Objects, and usually are early adopters in beta of the new HubSpot tools. Check out the company at <https://www.osano.com>\n\nThe Growth Engineer is a hybrid role that would report to our marketing leader working in the CMS coding templates, optimizing pages for speed and performance, working with marketing to configure A/B tests and then even helping to analyze and come up with new experiments to run. So the perfect candidate has strong experience as a HubSpot developer with a lot of interest and some experience in the marketing side of things.\n\nIf you or anyone you know is interested, please:\n\n1. Learn about what it means to work at Osano. <https://www.osano.com/company/careers>\n2. Apply for the role at <https://careers.osano.com/jobs/FlRPfmx68Fre>\n3. DM me to tell me you applied so I can make sure you move to the top of the stack of resumes.\nI hope to hear from you and happy to answer any questions.\n\n*** NOTE - THIS ROLE IS ONLY AVAILABLE TO US RESIDENTS DUE TO TIME ZONE REQUIREMENTS ***",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-11-15 07:50:45"
      },
      {
        "time_stamp": "2020-11-19 19:14:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adam Munns",
      "poster_handle": "hello509"
    },
    "time_stamp": "2020-11-12 11:19:29",
    "text": "<@U01E3692GUF> Love the look and feel of the brand and website! :+1:"
  }
]