[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 07:24:46",
    "text": "no worries.\n\nI’ve got your theme added.\nI ended up doing it the way I originally talked about, where the css is triggered off a class that the javascript adds.\nThis is a temporary solution until we figure out how to get it to load the css conditionally.\nIt was an easy way of making the feature work right away. It’s still hidden in the right click options screen, but the option actually does control whether the theme is used or not. Thank you for doing that initial javascript with the syncing of the settings, that made it easy.\n\nThis version of the extension is on the branch “Dev-docs-link-feature”.  This branch also adds a way to quickly access the most commonly used sections of the HubL documentation."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 07:26:53",
    "text": "I’m not going to merge this branch until I have more work done on it. There are some improvements to the documentation links I think are kind of important."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 07:50:31",
    "text": "Oh also added on the right click Options page a section for listing contributors, I added all of us, and linked to our linkedIn profiles, and our company’s websites. If you’d like your info removed I can remove it. Just figured it makes all of us and our companies look good. For Gonzalo and I if someone sees our names on an extension like this, we’re likely to get clients as it looks good to clients if we’re more than just HS devs kinda thing. For Will, I think it’d just make you look good at HubSpot for encouraging developer engagement and tooling - going above and beyond the call of duty kind of think. Would also help you if you decided to leave HubSpot but later be a third party dev like us."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-06-19 10:11:13",
    "text": "Nice work guys, I wonder if we should create a channel for discussion on this, and people can join as they please to contribute"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 10:13:54",
    "text": "I do think having a better place to chat than this thread would be good.\n\nI’m slightly averse to having yet another slack “workspace”\n\nIf we had a channel in the HS slack, it probably should be one you have to browse for or get invited to (IE just not a default channel)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 10:14:37",
    "edited": {
      "time_stamp": "2018-06-19 10:15:01"
    },
    "text": "otherwise it might confuse people as they might think it’s for one of the official HubSpot owned extensions like the gmail one."
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-06-19 10:32:02",
    "text": "Yea we could make it private I think"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 10:33:07",
    "text": "not sure if slack has the option for it, just figure it would be better if it was discoverable when you click “channels” but not be a default kinda thing"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-06-19 10:33:38",
    "text": "I dont think public channels show up in your sidebar by default"
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-06-19 10:33:42",
    "text": "I think you need to join them"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 10:33:50",
    "text": "k"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-19 10:33:56",
    "text": "well I think that’d be fine"
  },
  null,
  null,
  null
]