[
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-08 09:00:39",
    "text": "Page Editor Recommendation: It would be cool if you could “duplicate” a module that’s on a page. In other words it would copy all of the settings and copy in that module. \n\nThe module would not be linked to the original, it would just be like as if you could copy and paste modules essentially.\n\nThis would be hugely useful for the initial build out of pages. \nUse Case:\nWe have very flexible custom modules that can do a lot of different layouts and things. a certain page may have multiple of the same module in the same layout, and and with most of the same settings. It would be a great time saver to be able to duplicate them so we’re able to start from an instance of the module that’s already on the page. This especially becomes useful for modules that have a lot of settings and fields.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-06-08 09:09:31"
      },
      {
        "time_stamp": "2018-06-08 09:11:54"
      },
      {
        "time_stamp": "2018-06-08 12:58:28"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2018-06-08 09:05:05",
    "text": "What we do is we build a “styles” page during development this page shows all of the classes used for buttons, all of the modules and sometimes the different states that the modules can be in.\n\nWe add instructions for particularly more complex modules.\nExample:\n<https://www.streamcreative.com/styles>\n\nThis page acts kind of as self documentation. We often publish the page to make it easy to get to, but have it set to be noindex,nofollow for robots."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-08 09:09:00",
    "text": "For us this page isn’t just a reference place. We have the designers design the page based on one of the main templates used in the site, then have them specify all of the typography styles and button styles here. Then when we’re building the site we mimic that in the styles page and then once all of that is set, then we have the designer review and check our work. If they’re happy with all of it they understand - those same visual styles will apply to all of the other pages. Makes the process of building out sites faster and Helps maintain quality."
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2018-06-08 09:09:31",
    "text": "I like that a lot. Where would you expect to be able to duplicate a module in the page editor?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-08 09:11:54",
    "text": "on next to change layout button on hover of module in page, and next to delete button on hover of module in edit modules.\n<https://spin.d.pr/azbhu5+>\n\nWould also be open to or cool with, a right click context menu but doesn’t seem like there are enough options yet to necessitate that."
  },
  null,
  {
    "poster": {
      "poster_name": "ΚΣΣGΛΠ ΒΓΘΨΠ",
      "poster_handle": "keegan"
    },
    "time_stamp": "2018-06-08 10:36:48",
    "text": "[feature request] add babel preprocessing to JS minification for assets on the HubSpot. It’d be really great to be able to use modern javascript within HubSpot. This ES5 stuff is dragging on me."
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2018-06-08 12:58:28",
    "text": "Nice, that makes total sense"
  },
  null,
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-06-08 13:20:56",
    "text": "Yea, we usually do this for sites we build on other CMS' and have it as a private page (where they need to login to view) and have it excluded in indexing as it contains other documented notes. I was trying to figure out a way to do it in HS without having to go through a bunch of stuff but I guess just making it a page on their site, removing it from sitemap and adding it to robots would work."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-08 13:26:46",
    "text": "Yea I mean you could even do it with password protection like you said.\n\nWe generally don’t, just because we never have confidential info on those pages, and who cares if someone figures out how to get to the page and sees a class name or something, none of it is a security issue."
  }
]