[
  null,
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2018-06-18 07:17:24",
    "text": "Just FYI you guys should feel free to merge anything, you guys own this as much as I and I do not ever want to hold you up! If I ever see anything after the fact we can always adjust :smile_cat:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-18 07:18:34",
    "text": "k, just didn’t want to move forward on an icon without you guys.\n\nwould you be interested in doing the submitting to the store?"
  },
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-06-18 13:50:06",
    "text": "<@U7ADCU3BM> I might merge in your theme tonight. I think a safe simple way to get it working off the bat is to basically make your theme opt-in through the right click settings menu initially.\n\nThen we can work on having the quick settings in the context menu after."
  },
  {
    "text": "On the \"Site page preview\" pane that slides out when you you click on a page in the website pages area, can we add the template its using to that area as well? Would save us dev's a click when someone's like \"Hey can you add something to X page\" without telling us a particular template.",
    "time_stamp": "2018-06-18 13:51:57"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-06-18 13:53:30",
    "text": "its not often it happens after a site is live, but during a build phase, it can happen alot"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-06-18 14:16:14",
    "text": "nice! Thanks :slightly_smiling_face:\nAnd sorry to be out in the last sprint before the publish but I am running out of time here with a deadline too :sweat_smile:"
  },
  null,
  null
]