[
  {
    "poster": {
      "poster_name": "Simon Gugala",
      "poster_handle": "simon722"
    },
    "time_stamp": "2021-02-10 14:17:12",
    "text": "Hello!  I am a new developer who is also new to the HubSpot CMS.  In the new boilerplate for themes, there isn't a CSS file for menu styling like the old boilerplate that I used for the CMS practicum certification.  It is my understanding that it is just \"baked in\" and by using Dev tools I can figure out the classes and overwrite them in my main CSS file (after the include statements).  Is this best practice?  After searching the documentation I'm not always sure it is updated.  Thanks all.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-02-10 14:36:11"
      },
      {
        "time_stamp": "2021-02-10 14:40:19"
      },
      {
        "time_stamp": "2021-02-10 14:42:50"
      },
      {
        "time_stamp": "2021-02-10 14:44:54"
      },
      {
        "time_stamp": "2021-02-10 14:46:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2021-02-10 14:36:11",
    "text": "Hey Simon :wave:  nice to meet you. The boilerplate menu styles are located within the `module.css` file of the menu module here (<https://github.com/HubSpot/cms-theme-boilerplate/tree/main/src/modules/menu-section.module>). Given boilerplate is intended to be a starting point for your project, feel free to edit any of the CSS, HTML, or JS that is provided there to make the menu what you want it to be. For more info on the HubL menu function that is being used you can reference our documentation here (<https://developers.HubSpot.com/docs/cms/hubl/functions#menu>)."
  },
  {
    "poster": {
      "poster_name": "Simon Gugala",
      "poster_handle": "simon722"
    },
    "time_stamp": "2021-02-10 14:40:19",
    "text": "Thanks so much!  I guess I was getting turned around because I was coding a website with the \"New Theme\" start and that file wasn't included the boilerplate that it created.  I'll grab it from there and load it into the theme via the main.css.  Thanks for the help!"
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2021-02-10 14:42:50",
    "edited": {
      "time_stamp": "2021-02-10 14:47:01"
    },
    "text": "Ahh got it - so within the theme folder you have there should be a `modules` folder. Within the `modules` folder there should be a module called `menu-section`. If you click on that it should bring you to the module editor which has three panels (one for HTML, one for CSS, and one for JS). You can edit the CSS referenced above in the CSS panel (so no need to duplicate the CSS unless you'd prefer to move it out of the module and into your main style-sheet)."
  },
  {
    "poster": {
      "poster_name": "Simon Gugala",
      "poster_handle": "simon722"
    },
    "time_stamp": "2021-02-10 14:44:54",
    "text": "Ha. I've looked for this so long!  This slack channel is so helpful.  Thanks!"
  },
  {
    "poster": {
      "poster_name": "Jason Rosa",
      "poster_handle": "jasonrosa"
    },
    "time_stamp": "2021-02-10 14:46:35",
    "text": "No problem at all :thumbsup:"
  }
]