[
  {
    "poster": {
      "poster_name": "Erik Rorstrom",
      "poster_handle": "erik.rorstrom"
    },
    "time_stamp": "2024-11-01 03:13:09",
    "text": "Hey,\n\nHas anyone figured out a way to fetch a list of conditional properties/required properties of a given pipeline or pipeline stage?\nCan’t seem to find any clues in the documentation."
  },
  {
    "poster": {
      "poster_name": "arundipchowdhury",
      "poster_handle": "arundipchowdhury.joov"
    },
    "time_stamp": "2024-11-01 03:46:12",
    "text": "Hi, everyone i need  trigger the sending of sales or conversation emails API"
  },
  {
    "poster": {
      "poster_name": "Adam Brown",
      "poster_handle": "abrown893"
    },
    "time_stamp": "2024-11-01 06:02:51",
    "text": "Thanks Ahmed"
  },
  {
    "poster": {
      "poster_name": "John Selnekovic",
      "poster_handle": "jselnekovic"
    },
    "time_stamp": "2024-11-01 07:03:23",
    "edited": {
      "time_stamp": "2024-11-01 07:08:40"
    },
    "text": "Hi all! I've searched the <#C2YHAHB6K|api> thread for direction, but I haven't found what I need yet. i created a custom Account object. i also created an association between Account and Deal. how can i delete the association between Account and Deal? i'm not looking to delete an association label or the an association between Deal and Account records. I want to delete the association altogether as Account should not be related to Deal. i believe i could do this by dropping/recreating my custom Account object, but this would require a great deal of work. also, i've been pointed to the developer api documentation as well but it is not sufficiently intelligible for me to know what to do. an example call that does what i'm looking for would be greatly appreciated. thanks in advance!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-01 10:42:12"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-11-01 07:17:49",
    "text": "Hello\n\nHappy Friday. We have tried invoking the API through Postman and it has worked, so we conclude that it is the HubSpot interpreter within the custom code in the Workflows.\n\nHas this type of event happened to anyone else?"
  },
  {
    "poster": {
      "poster_name": "Benoit Chabord",
      "poster_handle": "benoit.chabord"
    },
    "time_stamp": "2024-11-01 08:09:47",
    "text": "Wanted to report an issue with the catalog: <https://api.HubSpot.com/api-catalog-public/v1/apis> a few links are broken and returning 404 like <https://api.HubSpot.com/api-catalog-public/v1/apis/crm/v4/associations> or <https://api.HubSpot.com/api-catalog-public/v1/apis/extensions/sales-objects/v1/object-types>"
  },
  {
    "text": "Hello,\n\nI'm working on an API that would fetch a custom object with certain filter criteria, using Postman.\nI'm wondering why it is returning all the information even if I specified that role_status should only be active. Anything wrong with the code?\n\nThanks!",
    "time_stamp": "2024-11-01 10:18:26",
    "edited": {
      "time_stamp": "2024-11-01 10:18:55"
    },
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-11-02 08:18:12"
      },
      {
        "time_stamp": "2024-11-02 08:19:16"
      },
      {
        "time_stamp": "2024-11-02 15:19:50"
      },
      {
        "time_stamp": "2024-11-04 09:19:10"
      },
      {
        "time_stamp": "2024-11-04 13:31:37"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-11-01 10:42:12",
    "text": "I figured this out. I used Postman and the objectIds in the URL when viewing the association in HubSpot. I did a GET to find the typeId of the association then a DELETE using the object Ids and the association typeId."
  },
  {
    "poster": {
      "poster_name": "Austin RZ",
      "poster_handle": "austin101"
    },
    "time_stamp": "2024-11-01 13:38:17",
    "text": "<@U07SKR0FZNW> not quite sure what you mean but I assume you mean the docs that HubSpot has around the V2 sig auth? I'm just trying to run this through a middleware as per their documentation\n\nThe v2 sig auth is only used in the Custom Workflow Actions I believe, most other flows use the v3 sig auth which does utilize the timestamp at least, but the v2 is only Client Secret + HTTP method + URI + body then hashed"
  },
  {
    "poster": {
      "poster_name": "Tom",
      "poster_handle": "tommymartinez1363"
    },
    "time_stamp": "2024-11-01 13:48:47",
    "text": "Any updates on the endpoint documentation?"
  },
  {
    "poster": {
      "poster_name": "joe conery",
      "poster_handle": "joe277"
    },
    "time_stamp": "2024-11-01 13:52:42",
    "text": "this sounds like something that's totally the responsibility of the 3rd party app.\nDon't see how anything within HubSpot should be responsible for this.\nAnd not sure what you mean by \"disconnected\". The private app is using a rest api to make requests to HubSpot... There's no connection maintained."
  }
]