[
  {
    "poster": {
      "poster_name": "Julian",
      "poster_handle": "julian.torregrosa"
    },
    "time_stamp": "2024-11-21 03:04:05",
    "edited": {
      "time_stamp": "2024-11-21 06:11:46"
    },
    "text": "hi all!! <@US2SSCXL4>\n\nwe tried to solve this issue by using the support chat and they suggested to ask here. We need to *disable* the default tracking provided by HubSpot in the *static pages*, because it's being done out of the context of our Consent Banner. For this we tried to follow this docu: <https://8-04.na1.hs-sales-engage.com/Ctc/41+23284/8-04/JlY2-6qcW95jsWP6lZ3pcV8263c1h3cwDW6r2HGb3_QHjBW70Ql-q4sVBD8W4Jzd0s2w7QSkW1zLQBR8XyVPVW7ss6Ts9kqFlhW2QccPQ2y1WGCW5cx8x38Q8TT4W65YvWv5RpG8MW3mx1yN2QtmDNW8sxfgb9dd0-dW6sdXVJ8WNN6gW2dXybx62RNzYW7YVlvp6QRc48W7bZBY88kwvG5W6yjjPK6HbppZVxYRnQ4Ld6nwW3xXPDW2cqNdjW7v4qNH2BzVZcW4nl10_763VJCW9hy0zG5rvfP6W48HhqK6xYz58W6h0yrY8X-5H7W8fG58S6nKHyQW6hxkjw6dQ5DpW2JC6c12W2x35VhPBc78gq5v7W1v30rF1Vgb52W3F2Yqd7zRZ8hN8HClfSDt1dFf1mBzqR04|https://8-04.na1.hs-sales-engage.com/Ctc/41+23284/8-04/JlY2-6qcW95jsWP6lZ3pcV8263c1h3cwDW6r[…]78gq5v7W1v30rF1Vgb52W3F2Yqd7zRZ8hN8HClfSDt1dFf1mBzqR04> and we did many trials using what we found here and in other places, in the head we included all of these entries and none of them worked:\n\n```<script>\n  window.disableHubSpotCookieBanner = true;\n  window._hsp = window._hsp || [];\n  window._hsp.push([\n   'setHubSpotConsent',\n   {\n    analytics: false,\n    advertisement: false,\n    functionality: false,\n   },\n  ]);\n  window._hsq = (window._hsq = window._hsq || []);\n  _hsq.push(['doNotTrack']);\n _hsq.push(['revokeCookieConsent']);\n  window._hsq.push([\"setContent\", \"\"]);\n  window._hsq.push([\"disableTracking\"]);\n  var hsScript = document.querySelector('script[src*=\"hs-banner.com\"]');\n  if (hsScript) {\n    hsScript.remove();\n  }\n</script>```\nDo you have any suggestion to prevent this default tracking in our pages?"
  },
  {
    "poster": {
      "poster_name": "Kaviya Gopalakrishnan",
      "poster_handle": "kaviya"
    },
    "time_stamp": "2024-11-21 05:08:03",
    "text": "Anyone have any idea, how app settings component of public app works in UI extension? Instead of using third party url explicitly, i want to get it from the settings itself. Is it possible to achieve so?"
  },
  {
    "text": "Hi folks GM. Is there a way to receive events or at least notifications for when a custom object record is created/updated in HubSpot, or when custom properties of a standard object get created/updated? We are working in a HubSpot app that helps us integrate HubSpot with our platform, and we already configured webhooks at the app level. But since this configuration is at the app level, I understand it is not possible to make it work with every custom object of every instance that uses our app.",
    "time_stamp": "2024-11-21 05:51:54"
  },
  {
    "poster": {
      "poster_name": "swaroop",
      "poster_handle": "swaroop"
    },
    "time_stamp": "2024-11-21 06:43:20",
    "text": "*Question:*\nWe’re facing issues with HubSpot workflows when dealing with multiple updates or imports involving custom objects and associated contacts:\n1. When a contact is associated with two different custom object records and is used to trigger a workflow to send an email to the associated contact with the custom object record data, the system sends duplicate emails with the same content.\n    ◦ *Reason:* HubSpot workflows don’t run asynchronously, and we cannot directly pass data from the record to the email via workflows. To work around this, we implemented a custom module that pulls data from the most recently edited record. However, if a second record with the same contact associated is updated at the same time, the email includes incorrect or duplicate data.\n2. During bulk imports of custom object records with associated contacts, emails are sent with the same content if a contact is associated with multiple records.\n    ◦ *Reason:* Similar to the first issue, workflows use the most recently imported record’s data when sending emails, causing duplication when a contact is associated with more than one record.\nWe didn’t anticipate the non-asynchronous behavior of HubSpot workflows or the impact of bulk imports and fast updates when designing the system. Has anyone encountered similar issues, and if so, what approaches or workarounds have you implemented to ensure emails contain accurate data without duplication?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-21 06:58:20"
      },
      {
        "time_stamp": "2024-11-21 07:06:57"
      },
      {
        "time_stamp": "2024-11-21 07:08:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-11-21 06:58:20",
    "text": "Is there any way for you to change the workflow to be contact based instead of custom object based? You should still be able to set enrolment triggers as needed (depending on what they are) but an object (contact) cannot enter the same workflow twice if it is actively enrolled."
  },
  {
    "poster": {
      "poster_name": "Stacey Thomas",
      "poster_handle": "stacey.thomas"
    },
    "time_stamp": "2024-11-21 07:06:57",
    "text": "Sorry just realised it needs to contain the custom object data in the email, so i don't think that my suggestion will work..."
  },
  {
    "poster": {
      "poster_name": "swaroop",
      "poster_handle": "swaroop"
    },
    "time_stamp": "2024-11-21 07:08:05",
    "text": "Yep"
  },
  {
    "text": "Hi Guys, After migrating data hosting region there is this kind of tasks to do in HubSpots Account defaults. Can anyone explain what are those fields that have copy option? and how they supposed to be used after copy?",
    "time_stamp": "2024-11-21 07:36:06"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 08:37:31",
    "text": "Hello! Not sure which channel this belongs in, so I thought I'd put it here.\n\nDoes anyone know if there is a way categories to landing pages? Similar to how tags/topics work in blogs, my company wants to categorize landing pages like white papers/webinars/press releases, so then we can add a module that automatically pulls in the most recent published landing pages within that category to each of their respective templates.",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-11-21 08:51:25"
      },
      {
        "time_stamp": "2024-11-21 08:51:58"
      },
      {
        "time_stamp": "2024-11-21 08:54:22"
      },
      {
        "time_stamp": "2024-11-21 09:00:23"
      },
      {
        "time_stamp": "2024-11-21 09:09:15"
      },
      {
        "time_stamp": "2024-11-21 09:09:59"
      },
      {
        "time_stamp": "2024-11-21 09:12:07"
      },
      {
        "time_stamp": "2024-11-21 09:12:49"
      },
      {
        "time_stamp": "2024-11-21 09:14:33"
      },
      {
        "time_stamp": "2024-11-21 09:15:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-11-21 08:51:25",
    "text": "I guess HubSpot doesn’t natively offer a direct way to \"categorize\" landing pages like it does with blog tags or topics. You can use custom properties to accomplish this.\n\nTo pull the most recent LP into modules, you can work with a developer to create a custom module using HubL."
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-11-21 08:51:58",
    "text": "Feel free to ping if you need any further help with this."
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 08:54:22",
    "edited": {
      "time_stamp": "2024-11-21 08:54:28"
    },
    "text": "Thank you <@U07RCPSHPGU>!"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 09:00:23",
    "text": "Sorry, one question <@U07RCPSHPGU> - when you say to use custom properties, I'm familiar with how to create a custom property for contact records, but not for landing pages. I did some searching but couldn't find a link to documentation on this. Do you have a link?"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-11-21 09:09:15",
    "text": "For this you can create a module with a select field to configure your categories, then add the module to your landing pages (for this I would suggest at the template level so it is automatically applied to landing pages with that template)\n\nThen you would need a custom listing module, for listing recently published landing pages, and in the logic of that listing module, you can check for the category via content.widgets\n\nYou can read up on this in the <https://developers.HubSpot.com/beta-docs/reference/cms/modules/export-to-template-context#printing-hubl-module-info-on-blog-listing|docs here>."
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 09:09:59",
    "text": "Thank you <@U03KAK3R4GY>! Super helpful!"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-11-21 09:12:07",
    "text": "If you want to abstract the categories outside of the select field in the module, you could set up a HubDB to configure your categories (making them evergreen), and then use HubDB Row field in the module rather than select. This would ensure you only ever have to update the HubDB to add a new category later...\n\nthis implementation requires more code, obvs"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 09:12:49",
    "text": "True but it is nice to only have to update in the HubDB. I'll bring both of these options to my company. Thank you again!"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-11-21 09:14:33",
    "text": "Of course! <https://www.inveniv.com/|We've> done this type of thing for a number of clients so if you want some solutions consultation, I'd be happy to meet"
  },
  {
    "poster": {
      "poster_name": "Shiloh Paul",
      "poster_handle": "shilohpaul24"
    },
    "time_stamp": "2024-11-21 09:15:20",
    "text": "Thank you! I will let you know if they're interested!"
  },
  {
    "text": "Hi.  I’m not sure if this is the right place to drop this support question, but am hoping someone can help me.  I have just started a new HS account for a client, and still on freemium while I set up (then will upgrade).  I am loading a csv of 900 contacts into the import, and everytime I try it says I have exceeded 1000 contact limit?  I have checked and the other rows below 900 are all definitely empty.  Any help appreciated - I know this is not quite a development question!",
    "time_stamp": "2024-11-21 11:08:37",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-22 12:14:16"
      },
      {
        "time_stamp": "2024-11-25 04:36:39"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2024-11-21 12:34:40",
    "text": "For those interested, the HubSpot Developer HUG is currently live:\n<https://www.youtube.com/watch?v=O4pg7VBG3Zg>\n\nDrop on by and hear about *Developing Leaders: Building &amp; Managing Dev Teams. A Roundtable Discussion* featuring <@UJAPS2K4N>, <@UGDF9EBPW>, <@U03REFNRMB3>, <@U02JH23B6T1>, <@U26BLKGE4>, and our own <@UD53A9UUR> and <@U04DYGVLJPP>!"
  },
  {
    "text": "Hi team, I created a custom property called Net MRR (Minus Partner Payment).\n\nThe property is a calculation field. The property calculates a dollar amount based on the Amount property. For some reason, the property doesn't calculate anything until the deal closes. I want this property to populate no matter if it is closed won or not. Does anyone know why is this happening? Thanks in advance!",
    "time_stamp": "2024-11-21 20:06:07",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-21 21:30:07"
      },
      {
        "time_stamp": "2024-11-24 19:51:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-11-21 21:30:07",
    "text": "I think because the amount is unknown before deal is closed possibly."
  }
]