[
  {
    "poster": {
      "poster_name": "Daniel Westlake",
      "poster_handle": "daniel458"
    },
    "time_stamp": "2024-11-18 01:16:25",
    "edited": {
      "time_stamp": "2024-11-18 01:18:21"
    },
    "text": "Hello everyone, I’m Daniel from Cursor. I lead a 10 person team based in the UK specialising in bespoke HubSpot integrations for the Education sector. I’m new to this Slack but not new to HubSpot Development in general. Just wanted to say hello.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-18 08:20:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-11-18 08:20:38",
    "text": "Hey <@U081YEY3U8G> :wave:\nWelcome to the community! Nice to have you here!"
  },
  {
    "poster": {
      "poster_name": "David Lee",
      "poster_handle": "david060"
    },
    "time_stamp": "2024-11-18 09:40:53",
    "edited": {
      "time_stamp": "2024-11-18 10:11:26"
    },
    "text": "Hello,\n\nI'm David and I'm glad to join this slack, and learn from the experienced people on here.  We've been using HubSpot for about 4 years.  It's been a great experience, but recently I ran into an interesting issue with Oxygen Builder (a builder for WordPress).  The issue is a *known issue for them*, but they haven't been able to figure it out yet.\n\nI've been trying to help them get more information, but HS support hasn't been able to help.\n\nI wonder if anyone else has run into it already, or has any clever ideas?\n\n*The issue:*\n\nOne thing I can make with Oxygen is \"modal popups\" and can put whatever content I want on them. I'm pasting code for a HubSpot form.\n\nSO, they click a \"Get a Quote\" button, and the modal pops up showing the form.\n\nThey can fill it in, and submit it.\n\nHOWEVER, the issue is that I can click \"Get a Quote\" 2 times and the form shows fine each time. The 3rd time, and the form doesn't show - however it does show the top part of the web page, IN the modal (which is what makes us wonder about iframes from HS?.\n\nTheir Sr developer was able to reproduce it. She was wondering what exactly is PUT on THE PAGE BY the HubSpot code.\n\nLike does it use an iframe? I can't see that in the codebehind.\n\nShe wants to get if addressed, but if we could get info about what is actually displayed when we show a HubSpot form, it might help.\n\nHubSpot support has just kept giving me links to \"how to embed a form\" on a page.  I requested to chat with one of their developers, but they won't do that.\n\nI just want to know \"how\" the form elements are put on the page.  I know that it renders whatever textboxes, text areas, dropdown lists etc that you've picked when designing your form.  I also would like to know if it uses an iframe, or other \"container\" to show it?  Knowing the details of what elements go ON the page might help Oxygen.\n\nJust looking at the codebehind of course only shows the javascript that tells the form where to go.\n\nExample On Our Development Site:\n<https://newsite.optrics.com/partners/manageengine/servicedesk-plus/>\n\nPress \"try it free\" button. Works for 2, but not for a 3rd.\n\nIf anyone has any ideas I'd appreciate it.\n\nOtherwise, looking forward to reading the forums.\n\n\nthanks,\nDavid",
    "reply_count": 10,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-11-18 10:24:45"
      },
      {
        "time_stamp": "2024-11-18 10:28:38"
      },
      {
        "time_stamp": "2024-11-18 10:30:33"
      },
      {
        "time_stamp": "2024-11-18 11:30:59"
      },
      {
        "time_stamp": "2024-11-18 11:32:27"
      },
      {
        "time_stamp": "2024-11-18 11:33:04"
      },
      {
        "time_stamp": "2024-11-18 11:35:03"
      },
      {
        "time_stamp": "2024-11-18 11:37:49"
      },
      {
        "time_stamp": "2024-11-18 11:39:06"
      },
      {
        "time_stamp": "2024-11-18 15:59:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-11-18 10:24:45",
    "text": "just code your own form and handle form submissions with the HubSpots form submission API"
  },
  {
    "poster": {
      "poster_name": "David Lee",
      "poster_handle": "david060"
    },
    "time_stamp": "2024-11-18 10:28:38",
    "text": "Hi,  thanks for the note!  That's definitely one way around it, and I appreciate your suggestion.  I've actually been getting ready to implement that - but I've mostly been curious about why it happens.    (when things don't work I like to know why - one of those \"developer things\" : )"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-11-18 10:30:33",
    "text": "of course, happens to me a lot also :smile:\n\nthis is one of those scenarios where its pointless to look for solutions how to fix how to prevent etc. and is just simplier to implement it on your own, as there is not much effort required (time wise) for a form like this"
  },
  {
    "poster": {
      "poster_name": "Mario Sergio Araujo Dias",
      "poster_handle": "mario.dias"
    },
    "time_stamp": "2024-11-18 11:19:40",
    "text": "Hello :smile:\n\nIs there any way for my HubSpot form to make a GET to an external API to validate any fields that have been filled in? I have done several searches and unfortunately I have not been able to find answers to this question.\n\nThanks",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-18 11:53:57"
      },
      {
        "time_stamp": "2024-11-18 11:56:08"
      },
      {
        "time_stamp": "2024-11-18 13:20:53"
      },
      {
        "time_stamp": "2024-11-18 13:22:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:30:59",
    "text": "<@U081EHDJ9CL> - try editing the form embed code to include 2 particular configuration options:\n1.  a `target` option that takes the CSS identifier of an HTML element (i.e. an HTML ID that corresponds to the ID of the modal)\n2. a `formInstaceId` parameter \n <https://knowledge.HubSpot.com/forms/form-in-the-wrong-place-on-external-page>\n\n```hbspt.forms.create({\n  region: \"na1\",\n  portalId: \"20682923\",\n  formId: \"cb16411c-0296-4a8f-bb84-24708f5d970f\",\n  target: \"#some-div-id\",\n  formInstanceId: '1'\n});                        ```"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:32:27",
    "text": "`target` tells the embed code which specific HTML element to build the form in when the form embed JS runs, and the `formInstanceId` helps distinguish which specific instance of a form is rendering. It's likely that when you close and re-build the modal that the embed code is running a second time and it's finding an existing instance of  the form and then building it in the wrong place"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:33:04",
    "text": "Those edits should be simpler than building a form from the ground up :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:35:03",
    "text": "I'd give it a 90% chance that one of those 2 items will fix it"
  },
  {
    "poster": {
      "poster_name": "David Lee",
      "poster_handle": "david060"
    },
    "time_stamp": "2024-11-18 11:37:49",
    "text": "That sounds like an excellent option - thanks!   I'll give that a try.  Interestingly, in Oxygen for a modal, you put a specific class on the button, and the same one on the modal.  I'll let you know how that works."
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:39:06",
    "text": "Something else you might consider if this doesn't work (or, in replacement of the build experience of Oxygen) is using a HubSpot CTA embed - they can include form elements and give you a good design experience. In this builder, you build the button, the behavior and the form - <https://knowledge.HubSpot.com/ctas/create-calls-to-action>\n\nIn HubSpot you would go Marketing &gt; CTAs &gt; embed type"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-11-18 11:53:57",
    "text": "Not out of the box/directly, but you could make use of HubSpot's global form events to build a process and tie-in to the form build and submission lifecycle: <https://developers.HubSpot.com/beta-docs/reference/cms/forms#form-events>\n\nI wrote a script a while back that does something similar, except it presumes the data is already present (i.e. it doesn't handle getting the data, just mapping it properly to a form field):\n• Explainer: <https://gist.github.com/robertainslie/32d786d7254ec7bc6cbbff3d1e292cd4>\n• In action: <https://gist.github.com/robertainslie/b197e832879b29bf54883a776470bd00>"
  },
  {
    "text": "Not sure of your use case, but if you're looking for form shortening, HubSpot can do this with Breeze Intelligence features:  <https://www.HubSpot.com/products/artificial-intelligence-varb#breeze_feature_csol_multi_row_media_2>",
    "time_stamp": "2024-11-18 11:56:08"
  },
  {
    "poster": {
      "poster_name": "Mario Sergio Araujo Dias",
      "poster_handle": "mario.dias"
    },
    "time_stamp": "2024-11-18 13:20:53",
    "text": "Hi Robert,\n\nThank you very much for your reply, I will review and test the script :smiley:"
  },
  {
    "poster": {
      "poster_name": "Mario Sergio Araujo Dias",
      "poster_handle": "mario.dias"
    },
    "time_stamp": "2024-11-18 13:22:13",
    "text": ":coffee_parrot:"
  },
  {
    "poster": {
      "poster_name": "Mariel Gaetano",
      "poster_handle": "marielgaetano"
    },
    "time_stamp": "2024-11-18 14:45:23",
    "text": "Hi all! Question about HubSpot Custom Events. I have a resources page with a slew of links to Marketing Files (PDFs). I want to track these link clicks. How should I go about tackling this? I hear HubSpot Custom Events is the way to go. Should I set this up with a JavaScript code snippet? TYIA!",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-19 09:59:59"
      },
      {
        "time_stamp": "2024-11-19 10:01:05"
      },
      {
        "time_stamp": "2024-11-19 10:01:13"
      },
      {
        "time_stamp": "2024-11-26 14:50:12"
      },
      {
        "time_stamp": "2024-11-26 15:13:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "David Lee",
      "poster_handle": "david060"
    },
    "time_stamp": "2024-11-18 15:59:03",
    "text": "The first solution didn't work but the CTA one did.  A bit of a workaround, but solved - thanks!  I'll let the Oxgen people know that there is something they can suggest to any HS users that they talk with.   Thank you for the help Robert!"
  }
]