[
  {
    "poster": {
      "poster_name": "Ahmed Hassan",
      "poster_handle": "ahmed703"
    },
    "time_stamp": "2024-11-07 03:10:48",
    "text": "Hey <@U07V6UPK448>, check <https://knowledge.HubSpot.com/marketing-email/how-do-i-resend-an-email|this> and <https://knowledge.HubSpot.com/marketing-email/how-to-use-transactional-email-in-HubSpot|this> out.\n\nIt is just simply creating multiple lists and then using those lists to send out the emails."
  },
  {
    "poster": {
      "poster_name": "Nick Kalinin",
      "poster_handle": "n.kalinin"
    },
    "time_stamp": "2024-11-07 03:19:32",
    "text": "Thank you, Pooja, for the explanation :handshake:"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-11-07 04:34:51",
    "text": "Hey <@ULBP4M3LK>, the staging environment is completly seperated from the live environment. this is a key benefit of it. It's the way to go if you are migrating from one theme to another. The only thing to keep in mind is that modules of the old theme might not work properly if you change the theme of a page in the staging. Therefor I'd recommend to work like this: Create a staged version of the page and select \"Stage blank page\". This will create a page without any content of the original page and you can select a template from the new theme. To migrate the content from the original/unstaged page, simply open it in a new tab and work with copy/paste everything into the new page with the new theme modules. Doing so you won't mix \"old\" modules and new ones.\n\n\nAlso - if you can edit the \"old\" theme(i.e: You're working with a child-theme), open the theme.json file and change\n`\"is_available_for_new_content\": true`\nto\n`\"is_available_for_new_content\": false`\n\nThis will disable the theme for selection while creating new pages but it will still be working for existing pages#"
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2024-11-07 06:10:47",
    "text": ":point_up_2: this solve a super common issue. We do it all the time when we are working with new clients to make sure that they always, and only, use the new theme or child."
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2024-11-07 10:37:41",
    "text": "<@UJAPS2K4N> Thank you.  I'm a person who likes to triple check everything.\n\nFor context: we are migrating from a pre-themes era where we had custom modules and used the drag-drop editor to create \"templates\".  We now have a new custom theme with new modules and are ready to migrate the pages over.  I don't have to worry about page edits on the existing website because its just me and another person touching the website.\n\nI started with \"Stage Blank Page\" and am using the same URL as the old URL so we aren't having to do a bunch of redirects post publish. But - will this retain web page analytics (HubSpot sessions, etc)?  That was my concern with using \"new staged page\" versus putting an existing page into staging.\n\nThank you for your time!"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-11-07 10:45:51",
    "text": "Congrats on upgrading from \"templates\" to \"themes\".\nAnd triple check is also a good thing :slightly_smiling_face:\n\nAs of analytics - of course it depends on \"how many visitors\" you have on your page, but most times you'll see a (small) dip in the analytics after you publish pages. But after a few hours/days it should get back to normal"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2024-11-07 10:47:07",
    "text": "<@UJAPS2K4N> Its the history of web activity that I am worried about. If I Stage New Page, will we lose the past 5 years of web sessions, etc. for this page in HubSpot Website Pages?"
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2024-11-07 10:55:27",
    "text": "it depends on the font, if you upload a font that contains that, you have to can"
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2024-11-07 11:08:34",
    "text": "no, if you stage over an existing one, it will kept that info"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2024-11-07 11:13:40",
    "edited": {
      "time_stamp": "2024-11-07 11:14:46"
    },
    "text": "<@U0461MPNZTM>: I believe I need to select the live page, Stage Page and choose \"Stage Blank Page\" vs. \"Create a New Staged Page\" right?\n\nI was thinking I could just \"Create a New Staged Page\" and make sure the URL is the same and it would be all set, but now I'm second guessing that."
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2024-11-07 14:29:21",
    "text": "<https://www.loom.com/share/46c7b031bf774024a27ec3109775d139?sid=54543f23-47a1-4e36-b37d-5c8990b6a2a8>"
  }
]