[
  {
    "poster": {
      "poster_name": "Sarah Sutton",
      "poster_handle": "sarah299"
    },
    "time_stamp": "2024-11-25 04:36:39",
    "edited": {
      "time_stamp": "2024-11-25 04:36:58"
    },
    "text": "I tried but sadly no joy!  They answered but think they did not read my question properly, and so I replied but haven’t heard anything since"
  },
  {
    "text": "Hi! I'm seeing weird behaviour on a *ticket-based workflow*, which triggers a *webhook* event.\n\nAs part of the exported data I want to export the ticket owner. When I do this in the workflow builder, I can add the property (I've renamed it to `fae_name` - see first screenshot), and it shows up as a \"text\" property. However, when the workflow is activated, I receive a number (see second screenshot) - and this number doesn't even correspond to the HubSpot ID of any users, never mind the ticket owner. Has anyone come across this before or have any advice on this? Thanks.",
    "time_stamp": "2024-11-25 06:19:48"
  },
  {
    "poster": {
      "poster_name": "Cricket Kaya",
      "poster_handle": "cricketk"
    },
    "time_stamp": "2024-11-25 10:07:56",
    "text": "Hello everyone! I started my HubSpot journey a few months ago and have been having soooo much fun making custom properties, etc. Support led me here to try and find some feedback on a property I was building with the function codes. Their chat had helped me set it up initially, but I guess I hit a wall. I do not have much of coding background so if anyone could point me towards those learning resources, I'd be most thankful :)"
  },
  {
    "poster": {
      "poster_name": "Casey Grimes",
      "poster_handle": "casey856"
    },
    "time_stamp": "2024-11-25 11:24:40",
    "edited": {
      "time_stamp": "2024-11-25 11:26:06"
    },
    "text": "Hi there! I'm working on developing a HubSpot adapter for my software; however, while my understanding of CRM/marketing automation is pretty strong, I have some _very specific_ HubSpot questions. Knowing the answers to these will help me build better solutions for HS users. As such:\n\n• When using the Deals object, is it possible and/or common for users to use a field _other than the default Amount and/or Amount in company currency field_ for calculating Deal amounts?\n• Does HubSpot send out emails when an instance starts to reach its CRM Contacts limit? If so, what is the percentage/ratio that triggers this?"
  },
  {
    "poster": {
      "poster_name": "Abhinav Dixit",
      "poster_handle": "abhinav.dixit"
    },
    "time_stamp": "2024-11-25 11:56:19",
    "edited": {
      "time_stamp": "2024-11-25 11:56:29"
    },
    "text": "Hi everyone! I have a question,\n\nWe tried adding scope related to graphQL queries. However we are getting an error on authentication \"Authorization failed because you don't have permissions to authorize the scopes required by the app. Please contact your super admin to get the necessary permissions.\"\n\nWhat is the reason for this error? Does graphQL API require account to be enterprise account?"
  },
  {
    "poster": {
      "poster_name": "Ty Hudson",
      "poster_handle": "ty688"
    },
    "time_stamp": "2024-11-25 14:18:09",
    "text": "How do I get a referral link to get credit for people signing up?"
  }
]