[
  {
    "text": "Hello! Im about to finish my Certification Practicum for developers II and im having an issue with autogenerated id's that replicate. Im having that problem to pass the axeDevtools scan but i can't control those ids from being autogenerated. Any thoughts on how to fix this problem? Thanks! <@UQNEXHW14>",
    "time_stamp": "2023-05-08 08:55:51",
    "edited": {
      "time_stamp": "2023-05-08 12:36:47"
    },
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-05-08 14:07:33"
      },
      {
        "time_stamp": "2023-05-08 14:13:54"
      },
      {
        "time_stamp": "2023-05-31 14:22:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2023-05-08 14:07:33",
    "text": "Hello Juan, unfortunately, I am not sure of a fix for this, but because this is HubSpot-generated, we don't mark you off for this!"
  },
  {
    "poster": {
      "poster_name": "Juan Camilo Romero",
      "poster_handle": "juancamiloromero"
    },
    "time_stamp": "2023-05-08 14:13:54",
    "text": "Ok perfect! So i'm ready to submit the link then!! Thanks for you answer!"
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2023-05-08 14:41:10",
    "text": "World Certification Week is back! World Certification Week is returning  May 15-19, 2023. The week celebrates learning across the globe and features live sessions from your favorite HubSpot Academy  professors. For every certification earned, HubSpot will donate $5 to charity, up to $50,000! This week is a great chance to finally get HubSpot CMS for Developers certified, or take CMS for Developers II: Best Practices to upgrade your CMS skills. And, a very exciting new certification for developers is launching! Can't wait to see you all growing and learning with HubSpot Academy and World Certification Week! World Certification Week 2023 logo Learn more about WCW button"
  }
]