[
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2022-02-11 11:33:40",
    "edited": {
      "time_stamp": "2022-02-11 11:39:38"
    },
    "text": "Had an interesting interview with a recruiter looking for a HubSpot Engineer (can be fully remote). The job pays good (80k-90K) but they are looking for someone that can do 40 hours a week and I’m not looking to leave my current job (just contract work). I would be happy to pass a couple people along if you are interested DM me. Qualification they are looking for 1) US based. 2) 5+ as an engineer on a CRM platform (2 years of that HubSpot). 3) Extensive experience with HubSpot integration, Zapier a plus. 4) 5 years experience developing workflows and pipelines. If I get a lot of responses I will choose the best ones based on your linkedIn if you send me a link.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-11 12:04:01"
      },
      {
        "time_stamp": "2022-02-11 14:52:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Calvin Chan",
      "poster_handle": "calvin598"
    },
    "time_stamp": "2022-02-11 12:01:05",
    "text": "Hi! RevvGo is learning and professional development platform and we are looking for a mid-level Web Developer to help build out our HubSpot pages and integrate with our backend systems (Commerce, learning management system, Community, et al). If you have 3+ years of HubSpot experience and 5+ years of web development and integration experience, please respond to our job post on linkedin. <https://www.linkedin.com/jobs/view/2916027210/?refId=CSM07c%2FMRiSKGdMqbla1OA%3D%3D|RevvGo Job>"
  },
  {
    "poster": {
      "poster_name": "Calvin Chan",
      "poster_handle": "calvin598"
    },
    "time_stamp": "2022-02-11 12:04:01",
    "text": "Hi Thomas, I just happen to post a job that might be down your alley. It is a contract position and we are possibly open to part-time depending on how much time you have."
  },
  {
    "poster": {
      "poster_name": "Thomas Swisher",
      "poster_handle": "tswisher007"
    },
    "time_stamp": "2022-02-11 14:52:47",
    "text": "Thanks Calvin I will check it out."
  }
]