[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-02 07:06:04",
    "text": "window load is when ctas appear in the dom, if you want to target a cta you would need to do this on window load"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-02 07:06:26",
    "text": "I’ll also ask again: what is the use case for this? Why do you want to show someone a link and not allow them to click on it?"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 08:28:03",
    "text": "I already do some mutation observer stuff to prevent the CTAs from causing layout shifts on the page, and also adding icons to my CTAs"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 08:34:02",
    "text": "basically imediately I add the icons to the links and if there are any legacy CTA’s I stop those crappy images of text from loading replacing a load of the crappy awful bad performant issues creating nice CSS CTAs. I also set up mutation observers at this stage, because essentially when the CTAs load properly, they remove all the nice styling i’ve added so I do it all again, This prevents layout shifts and gives the user a much nicer experience and stops you from getting the errors in google page speed"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 08:35:44",
    "text": "However I worked out I can’t do what I want changing the hrefs because I can’t interogate what the CTA url will be on the new (non legacy CTAs) So unless I add another option to my modules it won’t really work"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 08:36:26",
    "text": "Realistically HubSpot need to do this\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Add-anchor-link-to-button/idi-p/420674/page/2#comments>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-02 09:09:59",
    "text": "Why would you use a cta for an anchor button? Wouldn’t you just use a button or some other element? It seems like you are doing a lot of work to work around CTAs. Are you using these ctas fro reporting purposes?\nNot saying that you all are doing this, but in my experience people are putting multiple ctas on a page, or have pages that are trying to get the user to go in multiple directions.\nI find ctas are best on a blog post. Most pages have too many paths a user can go…\n\nI think all the extra work around you are doing on a cta seems like more squeezing then the juice is worth.  I could be wrong, but funnel reports and page to page reports will get you the same reporting results without the work around."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-02 09:10:15",
    "text": "that being said, looks like you have it mostly figured out and seems like it is pretty solid at this point"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 09:21:30",
    "text": "Tracking CTAs gives incredibly useful metrics, and we can do AB testing to see which CTA people click the most, we also often put multiple of the “same” CTA on down the page (using different cta’s for tracking), and then we can figure out at what point people are converting, what content is useful etc"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 09:22:01",
    "text": "If I did do the whole prevent default I was going to test if I can ajax the original cta url to still track the clicks"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-02-02 09:24:39",
    "text": "I’ve attempted to create my own cta insertion tool using macros and hubl… that was a fun exercise in puloing out my hair"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-02-02 09:30:06",
    "edited": {
      "time_stamp": "2024-02-02 09:32:00"
    },
    "text": "haha yeah they’re so overly complicated!\nI’ve got a pretty nice macro, and multiple CTA fields in the form of a group that I add to my modules when I want to add CTAs, this allows people to choose from colours set in the theme, override the default colours, add icons to the CTAs (HubSpot or custom SVG) add a CTA group (side by side or on top of each other) Add non CTA buttons (what we usually use for anchors down the page)\n\nI think it’s about 50 lines of code…"
  }
]