[
  {
    "poster": {
      "poster_name": "Rohan Sootarsing",
      "poster_handle": "rohans"
    },
    "time_stamp": "2020-10-14 07:58:55",
    "text": "Would be great if in addition to being able to pick content for a CTA to link to you could link to a dynamic page, and then select a row to return from that dynamic page"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2020-10-14 16:40:21",
    "edited": {
      "time_stamp": "2020-10-14 16:40:46"
    },
    "text": "It would be nice to have a hubl command to test if a HubDB table exists, so that we can control how to handle that error instead of it breaking everything. Something like\n```{% if hubdb_table_exists('myTable') %}\n{% for row in hubdb_table_rows('myTable') %}\n...\n{% endfor %}\n{% endif %}```"
  },
  {
    "poster": {
      "poster_name": "Sara Randolph",
      "poster_handle": "sara.randolph222"
    },
    "time_stamp": "2020-10-14 16:57:35",
    "text": "Hi all! I'm new to HubSpot and I have a use case that I would appreciate (and welcome) any advice on. The use case is that my company has hired a 3rd party marketing team to create our home page in HubSpot however we want our company to have ownership over the header component. The reasoning behind this is twofold 1) the header has a login feature that we want to have control over so we can make changes more easily 2) we'd like to be able to reuse this header component as a HubSpot module AND in our own react app.\n\nMy first thought was to frankenstein the <https://github.com/HubSpot/cms-react-boilerplate> together with <https://github.com/facebook/create-react-app> but I don't think I have enough experience with HubSpot to know if this is a good path to go down. Does anyone have any ideas about this?"
  },
  {
    "poster": {
      "poster_name": "Darian Vretenar",
      "poster_handle": "darian.vretenar"
    },
    "time_stamp": "2020-10-15 00:59:14",
    "text": "<@UHPAA79B5> - So, open am numeric field, insert in WF an action to increase value for 1 for every enrolled contact. Put in triggers that this numeric field is a lover or equal to 500. Besides that, create a WF that will clear this property to every contact that has it at 00:01. And that should work."
  }
]