[
  {
    "poster": {
      "poster_name": "Wilbert Muza",
      "poster_handle": "titusmuza"
    },
    "time_stamp": "2024-03-27 02:30:19",
    "text": "You need to look at the engagements API where you can log some activities related to a particular contact. In your case you will be looking to something like the Notes <https://developers.HubSpot.com/docs/api/crm/notes>"
  },
  {
    "poster": {
      "poster_name": "Scott D. Rackliff",
      "poster_handle": "scottr"
    },
    "time_stamp": "2024-03-27 10:23:40",
    "edited": {
      "time_stamp": "2024-03-27 10:28:49"
    },
    "text": "Hello All, I'm working on creating a custom template for a landing page. I have set the templateType to \"page\" per the developer documentation for page and landing page templates, but the template only appears available for \"Website Pages\" and not for \"Landing Pages\". I talked to support and scoured the documentation and I can't seem to figure out why I can't select a custom template for a landing page. It appears that in the past there was a templateType option of landing-page, but that no longer functions and throws an error if I attempt to publish a template of that nature. Does anyone have any advice here? Could it be a subscription issue?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-03-27 10:52:04"
      },
      {
        "time_stamp": "2024-03-27 10:59:55"
      },
      {
        "time_stamp": "2024-03-27 11:00:37"
      },
      {
        "time_stamp": "2024-03-27 11:26:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2024-03-27 10:52:04",
    "text": "There should be no difference, you can try creating it in website pages and then click \"move to landing pages\" and see if that works"
  },
  {
    "poster": {
      "poster_name": "Scott D. Rackliff",
      "poster_handle": "scottr"
    },
    "time_stamp": "2024-03-27 10:59:55",
    "text": "Thanks for the reply. I wonder if this is a problem with my subscription level as I don't see a feature to move from website pages to landing pages anywhere. I assume it would be in the settings for the page?"
  },
  {
    "poster": {
      "poster_name": "Scott D. Rackliff",
      "poster_handle": "scottr"
    },
    "time_stamp": "2024-03-27 11:00:37",
    "text": "I'm on Marketing Hub Starter and CMS Hub Starter"
  },
  {
    "poster": {
      "poster_name": "Scott D. Rackliff",
      "poster_handle": "scottr"
    },
    "time_stamp": "2024-03-27 11:26:47",
    "text": "I think I may have answered my own question. I was looking at the marketing subscription but it appears that the CMS subscription needs to be pro in order to have anything more than simple templates for landing pages. Well, at least I hope that helps someone!"
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2024-03-27 17:26:42",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-03-28 08:06:58"
      }
    ]
  }
]