[
  {
    "poster": {
      "poster_name": "Pascal",
      "poster_handle": "pascal900"
    },
    "time_stamp": "2021-03-17 01:39:18",
    "text": "Hello everyone, thank you so much for all the Feedback. I reallly tried to get my head around it. I’m a Design focused Frontend-Designer. I can work pretty well on HubSpot-Themes but all these command Line Stuff and Shell Script is just something i have no clue. So my question, is there an easy way around this with a Software that helps me or is there any other solution to work on the same project as 2 developers?"
  },
  {
    "poster": {
      "poster_name": "Pascal",
      "poster_handle": "pascal900"
    },
    "time_stamp": "2021-03-17 01:40:12",
    "text": "Every help is really appreciated! Thank you so much!"
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-03-17 06:29:38",
    "text": "Is anybody else experiencing issues with hs watch? I’ve just setup another project locally, push up to HubSpot with hs upload but when running hs watch I get nothing. Just not watching for changes at all.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-03-17 07:40:37"
      },
      {
        "time_stamp": "2021-03-17 08:03:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-03-17 07:14:16",
    "text": "Generally working with a version control system like git is the best practice, and doing so somewhat requires you to have a local copy of the files.\n\nThat said you can work on the same site together with someone in the design manager, but be careful to make sure to not edit the same files at the same time. You could overwrite eachothers work.\n\nAdditionally if one user is working with the CLI tools, and another isn’t. The user with the CLI tools can accidentally overwrite any changes made to the files within the design manager if they’re not careful.\n\n\nIn general though I advise taking some time to learn the CLI tool. While it being a command line tool may make it sound intimidating. I think you’ll find it’s a little simpler to work with than you may have thought.\n\nThe main function of the CLI is to `fetch` files from your HubSpot developer file system to your computer. From there you can `upload` individual changes. If you want to make it so any of your changes that you make locally get automatically uploaded, you can `watch` a folder.\n\nThe words `highlighted` are the actual commands you run, and those 3 are the ones you will use probably 90% of the time.\n\nfor a full breakdown of every command available, we have this reference page: <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli>\n\nAdditionally when using the CLI you can always type `hs --help` or `hs &lt;any command&gt; --help` to a description of the commands and what they do"
  },
  {
    "poster": {
      "poster_name": "Andrew Jenkins",
      "poster_handle": "andrew.jenkins88"
    },
    "time_stamp": "2021-03-17 07:40:37",
    "edited": {
      "time_stamp": "2021-03-17 07:41:11"
    },
    "text": ":wave: Hey Scott.  I just checked and it seems to be working great for me.  Few questions for you.\n\n1. What version of the CLI are you on? (I’m running 3.0.4-beta.0)\n2. Are you doing `hs watch` on the directory that contains the files you were modifying?\n3. What types of files are you modifying?\n4. Are you specifying a remote folder to upload to?\n5. Is there any output at all when you save a watched file?"
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2021-03-17 08:03:35",
    "edited": {
      "time_stamp": "2021-03-17 08:04:08"
    },
    "text": "<@U016BS2GVDG> Hey it was the folder naming. Capital vs non-captial"
  },
  {
    "poster": {
      "poster_name": "Nathalie Nordström",
      "poster_handle": "nathalie-nordstrom"
    },
    "time_stamp": "2021-03-17 10:21:41",
    "text": "Hey! I have done a module and want to fetch it in to my local code.\n`hs fetch --portal=&lt;name&gt; &lt;src&gt; [dest]`\nI know that it is this command but i really don´t get what to replace ---portal=&lt;name&gt; &lt;src&gt; [dest]. I read the documention but don´t get the diffrent parts\n<https://developers.HubSpot.com/docs/cms/guides/getting-started-with-modules>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-03-17 10:51:50"
      }
    ]
  },
  {
    "text": "The green circle is where i want the red circle to fetch in",
    "time_stamp": "2021-03-17 10:36:06",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-03-17 10:53:34"
      },
      {
        "time_stamp": "2021-03-17 10:57:31"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-03-17 10:51:50",
    "text": "Hey Nathalie, I would recommend going through our local development getting started guide: <https://developers.HubSpot.com/docs/cms/guides/getting-started-with-local-development>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-03-17 10:53:34",
    "text": "so for adding to the developer file system you would want to  use the `upload` command locally. it would be something like:\n`hs upload \"Cutsom Module\" \"developer-coding-task/modules\"`"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2021-03-17 10:57:31",
    "text": "you can see a list of the commands here: <https://developers.HubSpot.com/docs/cms/developer-reference/local-development-cli#commands>"
  }
]