[
  {
    "poster": {
      "poster_name": "Pascal",
      "poster_handle": "pascal900"
    },
    "time_stamp": "2021-03-25 03:33:19",
    "text": "<@UD53A9UUR> Hey Denis, thank you so much. Now my question is how do i get my directory from github into the HubSpot Design MAnager. The GitHub Repository is in the end the central where all the work of my team is coming together"
  },
  {
    "poster": {
      "poster_name": "Pascal",
      "poster_handle": "pascal900"
    },
    "time_stamp": "2021-03-25 03:36:49",
    "text": "Hello HubSpot community, my colleague installed the HubSpot tools globally for like 15 times. After he installs it and uses commands like “hs help” the console is telling him that hs is not found: “zsh: command not found”. Do you have any idea what the problem could be or a workaround to solve it? Thank you so much for all your help!",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-03-25 03:52:10"
      },
      {
        "time_stamp": "2021-03-25 04:11:54"
      },
      {
        "time_stamp": "2021-03-28 18:09:24"
      },
      {
        "time_stamp": "2021-03-28 18:10:27"
      },
      {
        "time_stamp": "2021-03-28 18:10:34"
      }
    ]
  },
  {
    "text": "Even after installing it the hs command is not working",
    "time_stamp": "2021-03-25 03:52:10"
  },
  {
    "poster": {
      "poster_name": "Jaydip Suvagiya",
      "poster_handle": "jaydip"
    },
    "time_stamp": "2021-03-25 04:11:54",
    "text": "this might be help ??\n<https://stackoverflow.com/questions/18428374/commands-not-found-on-zsh>"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-03-25 05:45:36",
    "text": "There are multiple ways you can do it depending on how your team prefers to work.\n\nWhen ready to deploy you can switch to the main branch and use the hs upload command. That's an easy way.\n\nOr if you want to go a more automated route you can add a Github action to automatically deploy changes from your main branch to the HubSpot account. Read the github integration page linked earlier to see how to do that."
  }
]