[
  {
    "poster": {
      "poster_name": "Sjardo",
      "poster_handle": "sjardo"
    },
    "time_stamp": "2020-11-04 02:52:02",
    "text": "This was my backup, but bit more work than a “copy-paste” variant.\n\nThanks tho!"
  },
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2020-11-04 09:48:46",
    "edited": {
      "time_stamp": "2020-11-04 09:49:00"
    },
    "text": "<@U3T21PDBK> great... one question for me is how to set \"labels\" for those modules... tried doing something like label=\"label - {{ personalization.token }}\" but didnt work for me"
  },
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2020-11-04 11:07:33",
    "text": "<@U6GNQ7JBU> how would you go about doing this \"Have you tried incorporating the loop index into the name of the module?\" ... it didnt work forme"
  },
  {
    "poster": {
      "poster_name": "Sara Randolph",
      "poster_handle": "sara.randolph222"
    },
    "time_stamp": "2020-11-04 13:22:45",
    "text": "I'm having some issues with the HubSpotAutoUploadPlugin for a custom module I'm creating with cms-react-boilerplate. For some reason it seems like HubSpot is caching my main.js file to an earlier version. I have tried rebuilding my dist folder to rebuild main.js, deleting the folder in HubSpot and making a new folder, renaming the module in meta.json to something different, and I even tried restarting my computer. I can't view main.js in HubSpot because it's too large of a file but when I run `hs fetch /cms-react-boilerplate/main.js main.js` to view the file in my editor it IS the file I want. I should also note that the file that is building in my dist folder is correct and HubSpotAutoUploadPlugin says it uploads fine but somehow I'm getting an earlier version of my main.js. Has anyone experienced this before?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-11-05 08:33:58"
      }
    ]
  }
]