[
  {
    "poster": {
      "poster_name": "ZHITI Nicolas",
      "poster_handle": "nicolas.zhiti"
    },
    "time_stamp": "2022-09-08 01:01:21",
    "text": "Hello there,\n\nI'm really struggling with API rate limit, I can't interact with HubSpot.\nEverytime a deal is updated I've to fetch contact association + contact and line item + product.\n4 requests per deal with 300 workflow triggered at the same time, seems impossible to deal with.\n\nI tried to put custom code into workflow to do the requests but same result, even worse.\nAny Ideas how to make this thing works ?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-08 23:29:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Atiqah  Hafiz",
      "poster_handle": "atiqahhafiz"
    },
    "time_stamp": "2022-09-08 05:56:07",
    "edited": {
      "time_stamp": "2022-09-08 05:59:15"
    },
    "text": "Hey everyone!\nI'm moving from api key to private apps.\nCan't seem to find the get email in the current docs - /contacts/v1/contact/email/\n\nI've tested via postman it's able to pull with the private app access token.\nHowever when i do it in Java it's returning 404 Not Found.\nAny help would be appreciated!",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-09-08 11:59:24"
      },
      {
        "time_stamp": "2022-09-08 20:54:10"
      },
      {
        "time_stamp": "2022-09-08 23:31:31"
      },
      {
        "time_stamp": "2022-09-09 02:53:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Aldo Carrillo",
      "poster_handle": "aldo652"
    },
    "time_stamp": "2022-09-08 11:59:24",
    "edited": {
      "time_stamp": "2022-09-08 12:00:34"
    },
    "text": "According to <https://legacydocs.HubSpot.com/docs/methods/contacts/get_contact_by_email|this>  `Returns a 404 response if no contact with the requested email address exists in HubSpot.`"
  },
  {
    "poster": {
      "poster_name": "Aldo Carrillo",
      "poster_handle": "aldo652"
    },
    "time_stamp": "2022-09-08 12:10:29",
    "text": "The token is sent in a different way than an API key. Try <https://legacydocs.HubSpot.com/docs/methods/auth/oauth-overview|this>"
  },
  {
    "poster": {
      "poster_name": "Atiqah  Hafiz",
      "poster_handle": "atiqahhafiz"
    },
    "time_stamp": "2022-09-08 20:54:10",
    "edited": {
      "time_stamp": "2022-09-08 20:56:35"
    },
    "text": "oh but the email does exist.\nthat's why postman is able to return but not sure why we get 404 instead with the same email but via java HttpURLConnection"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 22:44:24",
    "text": "you can export data, you can go into lists and then determine what you are looking for and make that happen.\n\nThat is without the api. If you are looking to export via the api, then you’d need to determine what contact properties you’d like to see, and then make those queries. Per domain? Sure — but not 100% on what you mean, but you just change your query on what you are looking for to do that"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 22:46:00",
    "text": "Hi! Have you tried doing a curl request using the same data?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 22:48:48",
    "text": "a 500 error is a bit odd to receive in my experience, I know I’ve had them, but generally I’m really not doing something right.\n\nIf I were looking to debug this issue I would start off with the most basic way to make this work, and then add more variables to test out what doesn’t\nwork.\n\nexample: I’m trying to update a contact property, but I’m getting an error.\n\nSo I just use the email and one property that I know is a single text field, so that I know the api will accept the data."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 22:49:25",
    "text": "so, once that works, I add the next one, and figure out what is messing this up."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:10:30",
    "text": "none of the new api endpoints have this, the upsert ability. I see people complain about this — what apis allow this? The ones I work with mostly in my line of work (which may be sheltered) don’t have this — so am I sheltered?\n\n\nWhen you say things, I’m not sure what you are actually asking about, you seem to be saying things but you aren’t asking something directly. Are you complaining/venting or are you looking for a solution?\n\nYou mention the amount of verbose code you need for a search for a basic “email search” — and sure it takes more lines of code regardless if you do this in PHP, NODE, or just a regular request if you feel like digging into that —\n\nthe search is a bit more robust. They haven’t built the newer versions that have that basic functionality to have a separate api call.\n\nI realize you are disappointed — but I also think if you are at the level to be disappointed by this, you know how to make a basic api call in php without the wrapper and make this super simple\n\nHow can I help? Your post is like my wife “venting” and when I try to solve the problem, she tells me that she was venting and didn’t ask\n\nSO — how can I help with this?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:11:22",
    "text": "Hey carlos, you need a lot more context to your question before someone can really try to answer it. I’d love to understand more about your situation, but I need you to tell me more!"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:12:49",
    "text": "The error that is showing is likely by the app, so if it is a scope thing, I think ti would be important to be clear about this so that we can address this — <@UD53A9UUR> did <@UKJSMBW6A> contact you in a dm about this?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:13:42",
    "text": "are you looking for a link to the documentation? Are you a developer? What kind of guidance are you looking for?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:18:20",
    "text": "you have a menu on HubSpot and want to replicate it where? on an external site? There are 100 different solutions out there — depending on how you want to bring this in (real time vs cached) menus aren’t going to solve\n\nhubdb is an avenue to look into.\n\nJSON in the file manager\n\nthere are a hundred different ways to set this up and have one feed the other.\n\nwhat have you tried so far and what do you need help with?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:19:35",
    "text": "<https://developers.HubSpot.com/changelog/upcoming-api-key-sunset>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:20:37",
    "text": "<https://developers.HubSpot.com/changelog/upcoming-api-key-sunset>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:21:03",
    "text": "<https://share.getcloudapp.com/GGuzNlW6>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:21:17",
    "text": "james that should get you there"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:23:43",
    "text": "I’m having a hard time understanding context here — do you have a way of getting into more details about your issue and what you’ve tried?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:26:36",
    "text": "hey <@U026FNBKXBM> did you resolve this issue? I’m not able to determine what you are sending to the api because you didn’t show us what you are sending, just the response."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:29:36",
    "text": "are you over your head in what you are doing? What are you looking for help on? It would seem that if you are doing THAT many api calls that you don’t have the right architecture set up.\n\nevery time a deal is updated WHY do you meed to check all those things? Are they updated like that every time?"
  },
  {
    "poster": {
      "poster_name": "Lukas Kahwe Smith",
      "poster_handle": "lukas.smith"
    },
    "time_stamp": "2022-09-08 23:30:15",
    "text": "thx for responding. yeah it is just me venting. I did some more searching and it doesn’t seem like someone has built a wrapper around the v3 php api yet. so it goes. "
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-08 23:31:31",
    "text": "so you do a request in postman, and that works, and then now you are using some other… what? java wrapper?"
  }
]