[
  {
    "poster": {
      "poster_name": "Radek Molenda",
      "poster_handle": "radek"
    },
    "time_stamp": "2022-09-13 02:51:52",
    "text": "Hi! any chance you got this sorted out? I’m stuck with similar error"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 04:36:11",
    "text": "did this start happenign after removing the hutk? when did this start happening, always?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 04:40:20",
    "text": "I don’t know why this is happening, I’ve never seen it — but there are some items I see that I would fix before I think about your current issue which could be related?\n\ndon’t send the hutk if it is empty, remove it from being in the payload if you don’t have a value for it, as well as everything else. Anytime you have empty/null/blank values in there, just remove them from being in the item.\n\nLook to move your api key to a private app and use that authentication\n\nI’ve also never used the api form submission endpoint from a page that didn’t have the tracking code on it.\n\nIf there is some connection between urls/domains that you are sending from, and that are in your HubSpot account OR being used on a domain, this could very well be from this. again, I’m not sure when your issue started to occur, but the tracking code and empty hutk could be the major issues here"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 04:42:36",
    "text": "<@U01QVR44MEY> this is what I was looking for last night and couldn’t find it… pains me to think if I was in the slack channel last night BEFORE finishing my work that I would have had the answer :woman-shrugging:"
  },
  {
    "poster": {
      "poster_name": "Jos Verra",
      "poster_handle": "tunderbird1"
    },
    "time_stamp": "2022-09-13 05:23:35",
    "text": "Goodafternoon all. An customer of ours manages their blog posts (news) using HubSpot.\n\nWe made an app for them and they want us to load their blog posts into the app.\n\nThe only way i found so far is using the RSS feed. Because the API suggests its only for managing and publishing blog posts.\n\nAnyone got any experience with this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-13 18:29:46"
      }
    ]
  },
  {
    "text": "Hey <#C2YHAHB6K|api>,\n\nI'm looking for the correct API call to retrieve the following form stats:\n• Conversion pages: views / submissions per conversion page for each form. \n• Submissions by source for each form\nBoth can be found in the HubSpot portal (for marketeers, see impage). But I'm not able to retrieve the correct data with the <https://legacydocs.HubSpot.com/docs/methods/analytics/get-analytics-data-by-object?hsLang=en|Get analytics data for specific objects api calls>, or I don't know how to create the correct call.\n\nFor submissions by source I tried: <https://api.hubapi.com/analytics/v2/reports/forms/total?start={stardate}&amp;end={enddate}&amp;f={guid}&amp;d1=sources> but the return is empty.\n\nReally hope someone can help.\nCheers! Minke",
    "time_stamp": "2022-09-13 06:08:37",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-13 18:32:28"
      },
      {
        "time_stamp": "2022-09-14 06:26:34"
      },
      {
        "time_stamp": "2022-09-14 11:05:00"
      },
      {
        "time_stamp": "2022-09-15 02:21:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jos Verra",
      "poster_handle": "tunderbird1"
    },
    "time_stamp": "2022-09-13 06:41:08",
    "text": "I can find ways how to sort the blog posts on certain values but not change the order ASC / DESC am I missing something? :slightly_smiling_face:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-09-13 18:33:10"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kathryn Carter",
      "poster_handle": "kathryn.carter"
    },
    "time_stamp": "2022-09-13 06:56:08",
    "text": "Hi there, <#C2YHAHB6K|api>! Going to add one more to the giant list of questions. Hopefully it's simple.\n\nI'm in need of implementing a search function on my company's website and I found the lovely Content Search API here: <https://legacydocs.HubSpot.com/docs/methods/content/search-for-content>\n\nHowever, I'm afraid I don't know how to go about implementing it and I haven't been able to uncover any step-by-step articles online. Could someone point me in the right direction, please?\n\nThank you!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-13 07:28:02"
      },
      {
        "time_stamp": "2022-09-13 08:13:43"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Abdur",
      "poster_handle": "info248"
    },
    "time_stamp": "2022-09-13 07:14:57",
    "text": "Hi, Is it possible to update “company currency exchange rate” via API?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-09-13 07:26:07",
    "text": "<@U25PYL3Q8> That's has happened to me a couple of times."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-09-13 07:28:02",
    "text": "Hey <@U03GQJ0N2SD> Site search is a included module I think this is what you're looking for. <https://www.HubSpot.com/products/marketing/site-search>"
  },
  {
    "poster": {
      "poster_name": "Kathryn Carter",
      "poster_handle": "kathryn.carter"
    },
    "time_stamp": "2022-09-13 08:13:43",
    "text": "<@U01QVR44MEY>, thank you for this! I was able to find the instructions <https://knowledge.HubSpot.com/design-manager/set-up-a-results-page-to-use-a-search-field-on-your-site|here> based on what you had provided. I appreciate you taking the time to answer my question!"
  },
  {
    "poster": {
      "poster_name": "Qwame",
      "poster_handle": "poitierkay45"
    },
    "time_stamp": "2022-09-13 13:05:56",
    "text": "Hello, I have a Yes or No contact property field in HubSpot. I want to clear the field value via API. When I send this:\n```properties = {'has_email': None}```\nIt doesn't update the field. However, when I send this\n```properties = {'has_email': ''}```\nIt clears the field. This would have been okay but when I pull the data from the API, the field value is an empty string. I want it to be `None`. I would like to distinguish between `''` and `None` or `Null`\nHow do I do this?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-13 18:36:26"
      },
      {
        "time_stamp": "2022-09-13 18:36:30"
      },
      {
        "time_stamp": "2022-09-13 18:37:03"
      },
      {
        "time_stamp": "2022-09-13 19:06:54"
      },
      {
        "time_stamp": "2022-09-13 19:07:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Creveling",
      "poster_handle": "ryancreveling"
    },
    "time_stamp": "2022-09-13 18:11:40",
    "text": "Hey <@U25PYL3Q8> - thanks for the reply! Just so you know, you are able to make Forms API calls from a page without the tracking code installed without any issues (as long as it's made from the page / at the application-level); the issue here was where my client was making the call.\n\nI got in touch with the PE team at HubSpot, and as it turns out my client's developer had set up the API call via their Kubernetes setup on Microsoft AKS. So the IP address the API call was made from  was in one of Microsoft's IP ranges HubSpot has filtered as bot activity.\n\nEither way, glad we know what the issue is, and I appreciate your input here - thanks again :thumbsup:"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:14:35",
    "text": "AHH okay — I had gone back and forth in my mind on this today if you can do this or not and I had this vague recollection that I had done it before on a very simple one pager that we didn’t bother with for like a trade show and we didn’t want the code because it was just going to be setup on a laptop and filled out over and over again."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:14:55",
    "text": "Glad you got it sorted — and yah, that makes sense why that got flagged"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:15:31",
    "text": "they they jsut allow you to trust the traffic or did they make you change it so it originates from the actual page? <@U0421G0CE1G>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:26:36",
    "text": "are you having errors and it was workign before? you are asking if it is down? If not, cna you provide more details on what you are doing so we can help?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:29:46",
    "text": "There are a bunch of other ways to do that, but that is a good starting point. The rss feed will only show how many posts are set up in your blog to show, so if your blog is set to show like 9 posts, your rss feed will only have the last 9\n\nIf you want to do somethign ilke this your best bet is to create a custom module that pulls in 200 blog posts and outputs them as like json data, and save the page and don’t index it. Use your app to call to that page.\n\nALL OF THOSE THINGS BEING SAID — The idea of your customer thinking that they should have blogs inside an app is not a bright idea. The purpose of a blog and your website is for visitors to get on there and read things. The longer they are on pages the better your rankings are. You want them on the website..\n\nI’d tell your customer that having maybe three recent blog posts with links to the blog is good…\n\nof course I don’t know what the app is for so maybe I’m wrong"
  },
  {
    "poster": {
      "poster_name": "Ryan Creveling",
      "poster_handle": "ryancreveling"
    },
    "time_stamp": "2022-09-13 18:30:30",
    "text": "Haha, well glad I could close the loop for you! We plan to keep the bot filtering functionality on for now, and don't think we can choose to trust the traffic through HubSpot (even if we did, it may open the door for actual bot activity, so I'd opt not to).\n\nWe haven't made any updates to the app yet because the actual consequences of the submissions being tagged as bot activity are fairly minimal - namely that we can't see the number of submissions for that specific form at a glance from the _Marketing &gt; Lead Capture &gt; Forms_ view.\n\nCurrently waiting on the client's Marketing leadership to let me know if they' like to spend more time fixing it or if they'd like to leave it as is, as it'd take some dev resources &amp; time to restructure the process for a what amounts to a pretty minimal improvement in functionality/experience"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:32:28",
    "text": "It isn’t the best api. This is just going to take a lot of hard work and playing with it.\n\nIf I would start out with the least amount of criteria so that you know you are making the call correctly, then add filters/criteria one by one as you slim them down"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:33:10",
    "text": "are you using the api? What api call? Do you want to provide some more information, I’m having a hard time seeing what is on your screen right now and I’m way too tired to read your mind!@"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:36:26",
    "text": "my solution might not be the best answer, so someone check me if I’m incorrect — you setting it to “” is correct to clear the property.\n\nYou need to check it different to determine if it has a value.. if you have an empty string and you know an empty string is the “none” values you are looking for — then check the string length, if the string has no length, then it is your “none” value"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:36:30",
    "text": "does that make sense?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:37:03",
    "text": "I did a quick google search and found this that other HubSpotters were saying this is the correct way\n<https://community.HubSpot.com/t5/APIs-Integrations/How-to-unset-a-property/m-p/226613>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:43:01",
    "text": "I imagine most companies would leave it…"
  },
  {
    "poster": {
      "poster_name": "Ryan Creveling",
      "poster_handle": "ryancreveling"
    },
    "time_stamp": "2022-09-13 18:47:02",
    "text": "Yeah that's 100% my expectation (and recommendation) at this point, but I've seen stranger decisions from leadership before so you never know"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:48:41",
    "text": "I tell people, if this is my personal project, I’m fixing — but 10 out of 10 business owners will see this as a waste of money"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 18:48:47",
    "text": "and that is why i’m not rich"
  },
  {
    "poster": {
      "poster_name": "Qwame",
      "poster_handle": "poitierkay45"
    },
    "time_stamp": "2022-09-13 19:06:54",
    "text": "Thanks <@U25PYL3Q8>  I'll continue using the empty string."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-09-13 19:07:47",
    "text": "you can’t send in null, it spits it back at you, so I guess this is best.."
  },
  {
    "poster": {
      "poster_name": "Abdur",
      "poster_handle": "info248"
    },
    "time_stamp": "2022-09-13 23:54:31",
    "text": ""
  }
]