[
  {
    "text": "I am working with some DND areas and wanted to know where the 1000 default is coming from seen in the screenshots. I have defined the max-width to be 1170 in HubL and it works great. However, if someone is to change to the “full width” template option for the section and then switches back to “center content” it doesn’t return to the 1170 that was defined in the HubL code, it returns to 1000 I mentioned above. I could see this becoming an issue if people are not paying attention or unaware of the change in pixels. I looked around help articles and Google but couldn’t find much. Any thoughts on where to control this number? Fingers crossed I am overlooking something simple.",
    "time_stamp": "2020-06-09 09:28:59",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-06-09 10:04:45"
      },
      {
        "time_stamp": "2020-06-09 10:17:59"
      },
      {
        "time_stamp": "2020-06-16 14:45:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brian Doherty",
      "poster_handle": "bdoherty"
    },
    "time_stamp": "2020-06-09 10:04:45",
    "text": "That may or may not but totally _is_ set in the page editor code as:\n\n`const ARBITRARY_DEFAULT_MAX_WIDTH_VALUE = 1000;`\n\nWhen coming up with the default value to set there we look for a computed max width on the element, and if there is none, we fall back to the arbritray default.\n\nIt sounds like what you’d be looking for is a way to reset back to the template defined value, instead of the computed css value on the page, does that sound about right?"
  },
  {
    "poster": {
      "poster_name": "Brendan Gilbert",
      "poster_handle": "brendan251"
    },
    "time_stamp": "2020-06-09 10:17:59",
    "edited": {
      "time_stamp": "2020-06-09 10:18:16"
    },
    "text": "Yes, I simply want to be able to control the default that it reverts to. However that can be best accomplished with CSS, or otherwise, would be fine I believe."
  }
]