[
  {
    "poster": {
      "poster_name": "Kyle Parker",
      "poster_handle": "kyle.parker"
    },
    "time_stamp": "2022-01-05 06:59:31",
    "edited": {
      "time_stamp": "2022-01-05 08:34:42"
    },
    "text": "Hi - I feel like I'm missing something pretty simple here, but I'm trying to set up the HubSpot Linked Service in Azure Data Factory. Here's what I've done so far:\n\n• Created a new OAuth app in our developer account\nI supplied the proper app credentials, assigned scopes (content, automation, oauth, forms, crm.objects.contacts.read, crm.schemas.contacts.read) and created the Install URL\n• Using the Install URL, I authorize the app against our sandbox environment and then pull the \"code\" from the query string of the redirect url\n• In Postman, I hit the <https://api.hubapi.com/oauth/v1/token> endpoint, passing the grant_type, client_id, client_secret, redirect_uri, and code\n• Postman returns the referesh_token and access_token\n• Using Postman, hit the <https://api.hubapi.com/oauth/v1/token?grant_type=refresh_token> endpoint, passing the refresh_token from the previous result\n• Using this information, I populate the Linked Service definition in Azure Data Factory\nWhen I \"test connection\" it fails with the following error:\n\n`ERROR [HY000] [Microsoft][HubSpot] (60) API Connection Failed (Unauthorized Access). Check credentials. HTTP Response code: 403 ERROR [HY000] [Microsoft][HubSpot] (60) API Connection Failed (Unauthorized Access). Check credentials. HTTP Response code: 403 Activity ID: f7a61219-7655-4275-b9f8-a1fb14230606.`\n\nAny ideas what I've done wrong? Thanks for the help."
  },
  {
    "poster": {
      "poster_name": "Juhyeon Kim",
      "poster_handle": "juhyeon.kim"
    },
    "time_stamp": "2022-01-05 08:39:52",
    "text": "Hello, Devs.\nI have some questions. Please reply my questions.\n( My english is so bad.. so, please understand my bad english..:sweat_smile:)\nI want to know the best practice or api to manage the \"contact us\" thing. This is something like categorized article or categorized conversation.\n\nIn this situation, what kind of API do I have to use? or what is the best practice to manage categorized articles.\n\nThe categories might be \"billing issues\", \"bug report\" and  so on.\nThank you :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jose Nunez",
      "poster_handle": "joseenrique0595"
    },
    "time_stamp": "2022-01-05 08:56:30",
    "edited": {
      "time_stamp": "2022-01-05 08:56:48"
    },
    "text": "Hi!\nI’m trying to “clone” marketing emails to another account to avoid “re-do” those emails using the marketing emails API. I did it using “Drag and Drop”. I did it but I cannot find the base template. Does anyone know how to accomplish?"
  },
  {
    "text": "I am trying to create a module that pulls in some data from the Snowflake API, but I am stuck. I have been working through<https://docs.snowflake.com/en/developer-guide/sql-api/guide.html#using-key-pair-authentication| these instructions> and I have the keys generated, but I don't know how to generate the token in the next step. Could anyone advise? Here's what I need:",
    "time_stamp": "2022-01-05 09:54:44",
    "edited": {
      "time_stamp": "2022-01-05 10:04:08"
    }
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2022-01-05 16:18:11",
    "edited": {
      "time_stamp": "2022-01-05 16:20:34"
    },
    "text": "hi there, i have a client who has marketing pro-they are switching from sharpspring, when in the SS forms tool it allows under settings them to postdata back via a webhook based on form submission. This is critial to the client as they are a workflow automation company and they need to spin up a trial portal from their internal software using this webhook data first name, last name, email. It needs to be real time, and it needs to be simple like they have it set up now. in working with my CAM we were told the workflow extensions API does this functionality....but the CTO is saying it doesn't. please see the exchange below: The feedback I received on this was:\n\n_Whether you use custom coded actions with Operations Hub or Workflow Extension that is built with our API they do the same thing, send data somewhere else when Workflow enrollment is met. The only difference is how they're implemented and where the actual logic to handle data resides._\n\nFor context, I explained the situation as follows (apologies if I misrepresented their process): _The customer wants users to be able to complete a form to trigger setting up a trial of their software. The trial is handled through an external system. Hypothetically, if completion of form enrolled the contact into a HubSpot contact based workflow, then the workflow extensions api could send a webhook to their external system to set up the trial as soon as the form is complete?_\n\nand was advised: That is exactly correct, the only thing is that they need to have logic in place to handle what we send them.    THE CLIENTS REPLY WAS: I tried this, doesn’t work, submitted the form few times, workflow did not get kicked off, and no webhook either. I tested the webhook manually using POSTMAN tool it works fine.-.............ANY IDEAS how to solve so we can mirror what sharpspring forms tool is doing without using ops webhook functionality which is more investment?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-05 17:03:20"
      },
      {
        "time_stamp": "2022-01-05 17:22:21"
      },
      {
        "time_stamp": "2022-01-05 17:23:40"
      },
      {
        "time_stamp": "2022-01-05 17:24:24"
      },
      {
        "time_stamp": "2022-01-05 17:24:49"
      },
      {
        "time_stamp": "2022-01-06 07:43:57"
      },
      {
        "time_stamp": "2022-01-06 10:12:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Angus Gibbs",
      "poster_handle": "agibbs"
    },
    "time_stamp": "2022-01-05 17:03:20",
    "text": "If no contacts enrolled into the workflow, this sounds like it was a problem with the enrollment criteria of the workflow, not a problem with the workflow extension. This part sounds right to me\n\n&gt; Whether you use custom coded actions with Operations Hub or Workflow Extension that is built with our API they do the same thing, send data somewhere else when Workflow enrollment is met. The only difference is how they’re implemented and where the actual logic to handle data resides.\nSo I think you should figure out why the workflow isn’t enrolling. Workflow extensions just make a webhook call; they’re more work to set up but once set up they function very similar to webhook actions."
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2022-01-05 17:22:21",
    "text": "is their documentation o how to set them up?"
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2022-01-05 17:23:40",
    "text": "i created a workflow that is new and trying to get the CTO to understand how this can work-do they have to write a custom code? i looked at knowledge center it just keeps pointing me to the HubSpot article here: <https://knowledge.HubSpot.com/workflows/how-do-i-use-webhooks-with-HubSpot-workflows?KBOpenTab>"
  },
  {
    "poster": {
      "poster_name": "Tara Gearhart",
      "poster_handle": "tara210"
    },
    "time_stamp": "2022-01-05 17:24:24",
    "text": "the trigger criteria is simply form submission \"trial\" on any page on the website"
  },
  {
    "text": "see screenshot here",
    "time_stamp": "2022-01-05 17:24:49"
  }
]