[
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-06-13 08:27:06",
    "text": "Anyone know of a way to get the language selector to show up on HubDB Dynamic pages when they have multi-lang enabled?\n\nThis seems like a bit of a fringe case — but i’ve got a product page that is in both German and English. They pull from a Germain and English hubDB table respectfully and the page itself is set as a multi-lang page. Is it possible to get the lang-selector to show up on that page? The `hs_path` column is the same on both product tables.\n\nIm wondering if it’s because it’s set up as a dynamic page that maybe the Language variants don’t connect the same way that they do with normal pages? <@U7SL518D6> <@UBT0AHWLD> <@U26BLKGE4> Any thoughts?",
    "reply_count": 9,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2022-06-13 08:28:14"
      },
      {
        "time_stamp": "2022-06-13 09:02:22"
      },
      {
        "time_stamp": "2022-06-13 09:31:04"
      },
      {
        "time_stamp": "2022-06-14 07:56:50"
      },
      {
        "time_stamp": "2022-06-14 07:57:41"
      },
      {
        "time_stamp": "2022-06-14 08:01:56"
      },
      {
        "time_stamp": "2022-06-14 08:06:17"
      },
      {
        "time_stamp": "2022-06-14 08:37:58"
      },
      {
        "time_stamp": "2022-06-15 14:28:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-06-13 08:28:14",
    "text": "Have not run into this before, unfortunately :confused:"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2022-06-13 09:02:22",
    "edited": {
      "time_stamp": "2022-06-13 09:02:43"
    },
    "text": "Hi BJ, unfotunately i haven´t run into this as well, though i had the same thought, its probably different than normal pages"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-06-13 09:31:04",
    "text": "Right now there isn’t a standard way to do multi-lingual hubdb dynamic pages. The way most folks are doing it is either using a copy of their HubDB table per language, or adding language columns for every string in the HubDB table.\n\nThe team is aware that there’s some work to be figured out in how to make it easier to multi-language HubDB based dynamic pages. As you can imagine there’s a lot of trade offs to figure out in how to design that to work easily for both developers and less technical folks."
  }
]