[
  {
    "poster": {
      "poster_name": "Lauren Kennedy",
      "poster_handle": "lauren852"
    },
    "time_stamp": "2021-09-13 10:41:09",
    "edited": {
      "time_stamp": "2021-09-13 10:41:26"
    },
    "text": "Hi! *I’m hiring a <https://www.linkedin.com/jobs/view/2677280471/|HubSpot + Salesforce Solutions Architect> to join my growing team.* :slightly_smiling_face: We’re a people-first agency helping companies master the HubSpot + Salesforce integration. We’re also a Gold-Level HubSpot Solutions Partner.\n\n:briefcase: *Job Title:* <https://www.linkedin.com/jobs/view/2677280471/|HubSpot + Salesforce Solutions Architect>\n:office: *Company Name:* <https://www.coastalconsulting.co/|Coastal Consulting>\n:round_pushpin: *Location:* Remote\n:computer:_ _*Tech Stack:* HubSpot, Google Suite, Asana, Slack, Gusto, Clockify\n\n*About*\nWe’re a people-first leadership organization invested in the value HubSpot and Salesforce provide. As marketers turned marketing automation nerds, we’re focused on helping B2B Enterprise organizations develop processes, implement thoughtful automation, and personalize communications at scale leveraging HubSpot and Salesforce.\n\n*Culture*\nWe’re focused on exceeding client expectations and continuous improvement. Our culture is incredibly collaborative and anti-corporate. Meaning, we have fun, work together, and have a flat organizational structure. The door’s always open, and we encourage challenging leadership to justify their decisions, make changes, and work better to meet your needs. \n\nTo summarize, we’ve created an environment where...\n\n• Family, self-care, soccer games, and birthday dinners come first (we’re people, not machines)\n• Constructive conflict is encouraged\n• Micromanagement is nonexistent\n• Personal accountability is encouraged (and somewhat required)\n• Learning is mandatory (certifications, conferences, courses, you name it!)\n\n*Benefits*\n• Unlimited PTO\n• People-first culture\n• 99% Employer Paid Medical, Dental, and Vision Insurance through UnitedHealthcare\n• 401K with a 4% Match\n• Employer Paid Life Insurance\n• Monthly Education Allowance (Certifications, Courses, Etc.)\n• Fully remote team\n• Parent-friendly workplace"
  }
]