[
  {
    "poster": {
      "poster_name": "Adam Leach",
      "poster_handle": "adam879"
    },
    "time_stamp": "2021-09-09 03:01:37",
    "text": "Hey All! We have a HubSpot Solutions Consultant role live at our agency, if anyone would be interested please get in touch! <https://hubs.ly/H0WXl5Q0>"
  },
  {
    "poster": {
      "poster_name": "Syeda Nabeela Fatima",
      "poster_handle": "syedanabeelafatima"
    },
    "time_stamp": "2021-09-09 06:05:33",
    "edited": {
      "time_stamp": "2021-09-09 06:06:59"
    },
    "text": "Hi <@UETV43QNL>\n\nThanks for sharing this opportunity.\n\nI wanted to first introduce <https://cedcommerce.com/|CedCommerce>. CedCommerce is an eCommerce extension and website development company incepted in 2010. We have a<https://bit.ly/3by1cWV| HubSpot Magento Integration> / <https://cedcommerce.com/magento-2-extensions/HubSpot-guest-user-syncing|Addons>, and In short, and wanted to be a part of you.\n\nWe are <https://solutionpartners.adobe.com/s/directory/|Adobe Solution Partner.> The Marketing, Selling, and Promotion strategy for us has shown immense results out. You can even see that we are in the Deloitte Technology Fast 50 Award Winner List for consecutive 5 years.\nWe are now looking for Strategic Partnership with organizations like yours to help each other where we could both help each other grow through Referrals, social media promotions, and recommendations. We could explore more about how we can make this partnership more successful while our further discussion if it interests you.\n\nTherefore, we would appreciate it if you could spare a few minutes to <https://calendly.com/syedanabeelafatima/15min|discuss this opportunity> and get on a call with us."
  },
  {
    "poster": {
      "poster_name": "Stephen Wood",
      "poster_handle": "stephen187"
    },
    "time_stamp": "2021-09-09 06:35:53",
    "text": "Hi all! 3Play Media is looking for a <https://www.3playmedia.com/company/jobs-post/?gh_jid=4629776003|Marketing Operations Specialist> who isn't afraid to work with some scripts or mess with the HubSpot APIs. Please reach out if you or anyone you know might be interested!"
  }
]