[
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 07:03:50",
    "text": "Hi,\nI created a Template Pack for HubSpot marketplace , few of the templates are approved and rest are unapproved,i would like to know when i send the rest of the templates for approval which were'nt approved, do i have to resubmit the  approved templates from the pack again, as it is a template pack.Also i would like to know if i can change the name of the templates which are already approved, if yes then what is the process for that.",
    "reply_count": 8,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-12-20 07:14:07"
      },
      {
        "time_stamp": "2018-12-20 07:21:40"
      },
      {
        "time_stamp": "2018-12-20 07:23:37"
      },
      {
        "time_stamp": "2018-12-20 07:26:28"
      },
      {
        "time_stamp": "2018-12-20 08:35:17"
      },
      {
        "time_stamp": "2018-12-20 08:41:50"
      },
      {
        "time_stamp": "2018-12-20 09:18:40"
      },
      {
        "time_stamp": "2018-12-20 22:04:56"
      }
    ]
  },
  null,
  null,
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2018-12-20 07:14:07",
    "text": "HubSpot sends an email once each submission is reviewed to indicate whether it has been approved or unapproved. Emails indicating that a submission was unapproved give the reason(s) why the submission was unapproved. You can make the required changes and resubmit the unapproved templates by navigating to your Marketplace listings manager and selecting the unapproved template.\nAll listings in a pack must be approved in order for the pack to be approved. If you make all required updates to all templates in the pack you can simply resubmit the pack, which will resubmit any unapproved templates as well as any approved templates that have new updates."
  },
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 07:21:40",
    "text": "so, i would like to know if i have to change the approved template name,how can i do that,will submitting it again with correct name solve the problem,or i'll have to follow some other process, i really have this confusion please help me out"
  },
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 07:23:37",
    "text": "<@U22PWJ41G>"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2018-12-20 07:26:28",
    "text": "You can update the template name in the design manager. Unfortunately there is an issue on our end in which the listing name will not update until you resubmit. Once you resubmit the listing name will update to the template name in the design manager"
  },
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 08:35:17",
    "text": "Ok thanks, I'm also concerned if I update the template name and resubmit it is there any possiblity that it will create a replica as there is a same template with different name on the marketplace"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2018-12-20 08:41:50",
    "edited": {
      "time_stamp": "2018-12-20 09:00:09"
    },
    "text": "No, the marketplace listing is tied to the template id, not the name"
  },
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 09:18:40",
    "text": "Ok <@U22PWJ41G>  thanks"
  },
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Ankita Yadav",
      "poster_handle": "ankitayadav"
    },
    "time_stamp": "2018-12-20 22:04:56",
    "text": "Hi <@U22PWJ41G>\none more thing, i got this message\n*OwlSlider js isn't loading causing logo slider not to load.* in one of my templates, i checked it everywhere the slider is working, i'm not able to get the issue so that i can fix it asap\nHere is the link\n<https://preview.hs-sites.com/_hcms/preview/template/multi?is_buffered_template_layout=true&amp;portalId=4921395&amp;tc_deviceCategory=undefined&amp;template_layout_id=6688375701&amp;updated=1543989199354>\nit would be great if you could help me"
  },
  null
]