[
  {
    "poster": {
      "poster_name": "Mohesh Borah",
      "poster_handle": "mohesh.borah"
    },
    "time_stamp": "2020-12-01 02:00:35",
    "text": "Is this possible to create a twitter-feed-widget along with autoplay capabilities in HubSpot ?\nI have tried but all the given length of tweets coming in a list view, and to make that sliding things work, unable to append an ID dynamically into the source elements came from the -<https://platform.twitter.com/widgets.js> .\nSo if anyone of you have achieved something like this, could you please help me out ?"
  },
  {
    "poster": {
      "poster_name": "Brian Maier",
      "poster_handle": "brian806"
    },
    "time_stamp": "2020-12-01 07:59:18",
    "text": "I think we were having this issue recently as well. Are you using the integrated analytics within HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Aaron Dadap",
      "poster_handle": "wesleyadwebster"
    },
    "time_stamp": "2020-12-01 10:35:00",
    "text": "Has there been any update to the React CLI HubSpot? There is a boilerplate available, but it was very buggy (slider didn't change the state) and had trouble implementing adding customizing it. WIlling to take another stab at it. Also what is the best CSS to use with it? I typically use modules but it didn't work. Trying to expand. <https://github.com/HubSpot/cms-react-boilerplate>"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-12-01 13:21:58",
    "text": "Hi there! I work on smart content and wanted to get this group’s thoughts on something. We are making some updates to the way smart content is edited in the page editor.\n\nIf you or your company uses smart content, do you typically change _many_ modules on a page when they use smart content? Or just 1 or 2?",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-12-01 14:22:38"
      },
      {
        "time_stamp": "2020-12-02 08:44:24"
      },
      {
        "time_stamp": "2020-12-02 12:55:17"
      },
      {
        "time_stamp": "2020-12-02 12:55:29"
      },
      {
        "time_stamp": "2020-12-02 12:56:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Remington Begg",
      "poster_handle": "remingtonbegg"
    },
    "time_stamp": "2020-12-01 14:22:38",
    "text": "Depends on the use case. I feel like we either are changing a rich text or cta individually or changing an entire section/row of content (all items in the section). IE Image, text and links based on persona for instance"
  }
]