[
  {
    "poster": {
      "poster_name": "Super Elte",
      "poster_handle": "tonylobbin7712"
    },
    "time_stamp": "2022-11-03 09:15:02",
    "text": "Hi. I am Full Stack Developer.\nMy name is Tony Lobbin, I am from Germany.\n Over 6 years of professional exposure in JavaScript technology such as ReactJs, Vue.Js, MongoDB, Express.js and Node.Js.\n4+ years of strong experience in building ecommerce application using JavaScript MERN Stack and MEVN Stack using Redux, Flux, Babel+Es6 and WebPack for Single Page Application development.\nExpertise in developing web pages using HTML5, CSS3, MVC, SASS, LESS, Object Oriented Java script, ES6, TypeScript, Jquery, Ajax, Json, Xml. Good understanding of Document Object Model(DOM) and DOM Functions.\n\nGood Experience in developing web applications implementing Model View Control architecture using Django, Flask and spring web application frameworks\nKnowledge about setting up Python REST API Frame work using Django.\n\nGood working experience in designing and implementing various web applications in both LAMP Linux, Apache, MySQL, PHP and WAMP Windows, Apache, MySQL, PHP Environments\n\n*TECHNICAL SKILL*\n\n*UI Web Technologies :* HTML/HTML5, CSS/CSS3, SASS, LESS, XHTML, XML, JavaScript, PHP, ES6, AJAX, JQuery, Typescript, JSON, BootStrap, React.js, Vue.js, Node.js\n*IDE Editor*: Notepad++, WebStorm, Visual Studio Code, Atom\n*Databases*: MySQL Server, Mongo DB\n*Version Controls*: Git, Github, Bit Bucket\n*Frameworks:* Laravel, Vue, Django, Node JS\n*Other Languages:* C++, C#, JAVA, Python\n\nPlease contact me if someone is interested.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-03 09:15:25"
      },
      {
        "time_stamp": "2022-11-03 09:15:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-03 09:15:25",
    "edited": {
      "time_stamp": "2022-11-03 09:15:47"
    },
    "text": "The fact that you use Notepad++ is a win in my book"
  },
  {
    "poster": {
      "poster_name": "Super Elte",
      "poster_handle": "tonylobbin7712"
    },
    "time_stamp": "2022-11-03 09:15:40",
    "text": "hi"
  },
  {
    "poster": {
      "poster_name": "Garrett Massey",
      "poster_handle": "garrett"
    },
    "time_stamp": "2022-11-03 11:02:07",
    "text": "Hi all!\n\nMy USA-based development team has wrapped a project early (yay!) and has bandwidth to the tune of 2-3 FTEs through the end of the year. They have in-depth proficiency in HubSpot development. If anyone needs a hand kicking off a project, wrapping one up, or just general service stuff, let me know!"
  }
]