[
  {
    "poster": {
      "poster_name": "Vladimir Ivanchenko",
      "poster_handle": "ivanchenko"
    },
    "time_stamp": "2024-12-02 07:08:00",
    "text": "Sure, that's all makes sense, I've saw that features, and I think we will use it. But email it's not a best channel of communication for our customers. I think it works well for serving enterprise customers and our user base are small and medium business."
  },
  {
    "poster": {
      "poster_name": "Vladimir Ivanchenko",
      "poster_handle": "ivanchenko"
    },
    "time_stamp": "2024-12-02 07:08:25",
    "text": "But anyway, thanks for help and looking forward to an updates of conversationStart API"
  },
  {
    "poster": {
      "poster_name": "Vladimir Ivanchenko",
      "poster_handle": "ivanchenko"
    },
    "time_stamp": "2024-12-02 08:15:04",
    "text": "I’m encountering the same issue. From what I understand, integrationThreadId refers to the ID of a conversation in an external system. However, in my case, I’m integrating with Telegram, which doesn’t have the concept of threads. Instead, I need a way to tell HubSpot that all messages are being written to a single channel.\n\nIdeally, it would be great if I could use conversationsThreadId (the HubSpot thread ID), which is received on the first post message, and then use it for all subsequent messages when sending to /conversations/v3/custom-channels/{channelId}/messages instead of integrationThreadId.\n\n<@U04B32JHTUZ> could you please help with that?"
  },
  {
    "poster": {
      "poster_name": "Eric Hirsh",
      "poster_handle": "ehirsh"
    },
    "time_stamp": "2024-12-02 10:23:55",
    "text": "Hi there! I think some of our documentation is confusing about the default of HubSpot's threading model vs supplying your own. Chatting internally and will respond when we have an update."
  },
  {
    "poster": {
      "poster_name": "Eric Hirsh",
      "poster_handle": "ehirsh"
    },
    "time_stamp": "2024-12-02 12:53:01",
    "text": "<@U07L87JHRHB> and I are giving a <https://www.youtube.com/watch?v=XjZ6kxHNkUI|DHUG live webinar> about the Custom Channels API this Thursday December 5th at 2pm EST. We'll cover\n• the big omnichannel opportunity that partners can now solve for their customers with this API\n• live demo of a working custom channel app\n• intuitively explaining concepts like 'channel' 'channel account' 'thread' 'actor' \n• best practices for mapping your channel onto HubSpot's model\n• live technical Q&amp;A\n*Click '<https://www.youtube.com/live/XjZ6kxHNkUI?si=GIg1t0hRy4AkvhfR|Subscribe>' to be reminded when the webinar goes live.* See you in the comments section!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-12-03 05:57:15"
      }
    ]
  }
]