[
  {
    "poster": {
      "poster_name": "Raghav Aggarwal",
      "poster_handle": "raghav.aggarwal"
    },
    "time_stamp": "2024-10-08 04:57:21",
    "text": "Hello Everyone,\nI have created meetings and contact notes via API but I am not able to view it unless associating with a contact, Is there a way possible to see it in the app without associating it with a contact."
  },
  {
    "poster": {
      "poster_name": "James Hooks",
      "poster_handle": "james.hooks"
    },
    "time_stamp": "2024-10-08 08:26:39",
    "text": "Hi folks, I was sent here from HubSpot support and hoping someone may be able to help me solve an issue with email links page view tracking.\n\nI cannot get the page view tracking to work through email links to cross domain sites. Even when tracking works in a other contexts e.g. submitting a form we have hooked up through the api and associating the user with _hsq.push(['identify', {email}]).\n\nI have whittled my test page on my external site down to a simple single html file with the HubSpot script embedded and I have verified\n• External domain is part of \"Additional Site Domains\" in the tracking settings\n• The HubSpot tracking script and all subsequent scripts load correctly and are visible in the &lt;head&gt;\n• Cookie banner shows and cookies are accepted\n• The HubSpotutk and other HubSpot tracking cookies are  set\n• The tracking parameters exist in the redirect url from the email i.e. _hsenc, _hsmi, utm_medium, utm_content, utm_source\n• A request to <https://track.HubSpot.com/__ptq.gif>.... appears in the network traffic and is successful\n• No settings or extensions are blocking tracking\nGiven all this, I get no page view entries in the contact associated with the email links. What might be wrong here?"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-10-08 09:00:07",
    "edited": {
      "time_stamp": "2024-10-08 09:00:20"
    }
  },
  {
    "poster": {
      "poster_name": "Gianfranco Siguas",
      "poster_handle": "gianfraoficial"
    },
    "time_stamp": "2024-10-08 11:23:57",
    "text": "Hi,\nI want to know if I can track the videos in my websites. I was reviewing the documentation but the text is reference to landings. Someone have an idea how track these? Maybe with a class in the default video component?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-09 10:53:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefan Quaadgras",
      "poster_handle": "squaadgras"
    },
    "time_stamp": "2024-10-08 13:50:05",
    "text": "Hello, our team has gotten a free developer account to build an integration natively between our software and HubSpot. We want to use the HubSpot logo to identify this integration in our UI - does anyone know if this is allowed/what guidelines might cover it (we're not trying to list on the App Marketplace, so not sure hif the App Partner Program <https://www.HubSpot.com/partners/app/branding-guidelines?_gl=1*1dlhwvy*_gcl_au*MTk3MzI0MDA1OS4xNzI1OTAwMTYy*_ga*OTMyODc4NDU3LjE3MjU5NDAyMDQ.*_ga_LXTM6CQ0XK*MTcyNjg1NTM4Ny4zLjAuMTcyNjg1NTM4Ny42MC4wLjA.#integration|guidelines> apply)"
  }
]