[
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-17 01:45:40",
    "text": "Hi Community!I need to group Products (Sales Hub) into categories of failures.\n\n\"Fault A\" can have \"Product A, Product B and Product C\"\n\"Fault B\" can have \"Product B, Product D and Product E\"\n\"Fault C\" can have \"Product A, Product C and Product E\"\n\nI need to associate failures with products, I was thinking of using a custom object but I can't create associations with Products. Is there any possibility in your opinion?\n\nTo date I have used a select where \"Faults\" are the label and the Product IDs are the internal value, but it is not changeable in the future.\n\nAny ideas?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-17 20:58:37"
      },
      {
        "time_stamp": "2024-10-18 06:36:48"
      },
      {
        "time_stamp": "2024-10-18 06:37:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "ANMOL MATHUR",
      "poster_handle": "mathur.anmol"
    },
    "time_stamp": "2024-10-17 02:55:16",
    "text": "Hello Everyone,\n\nI have an interesting case in HubSpot. I am adding call records using the POST Call API and associating them with contacts. However, the associated records are also visible in the deals section. From the API, I am only creating associations between the calls and contacts, not with deals. I want to prevent these records from being seen in the deals section and from being associated with deals. How can I achieve this?"
  },
  {
    "poster": {
      "poster_name": "Abhinav Dixit",
      "poster_handle": "abhinav.dixit"
    },
    "time_stamp": "2024-10-17 06:09:16",
    "text": "Hey everyone,\nwe integrated our GTM platform with HubSpot, but recently found out that HubSpot sunset their v1 APIs for account and contact owners without us knowing. We had to do a lot of digging before realizing we need to switch to the new API endpoints. I know we should be checking developer changelogs, but it’s tough to go through old posts without filters. Does anyone have tips for simplifying this process and staying updated on API sunsets and future changes?"
  },
  {
    "poster": {
      "poster_name": "Andrez Romero",
      "poster_handle": "andrez.romero"
    },
    "time_stamp": "2024-10-17 06:19:18",
    "text": "On our old WordPress website, when a customer submitted a form, the email notification sent to our team allowed us to simply hit “reply” and respond directly to the customer, as the email appeared to come from their address. For example, this is possible with Gravity Forms on WordPress.\n\nCurrently, with HubSpot, we cannot directly reply to a customer via form submission notification emails. Does anyone know a workaround for this? *Are there alternative form tools we could integrate with HubSpot?*"
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2024-10-17 06:28:07",
    "text": "Hi <@U07NSHMCAG5>,\n\nI have already worked with a couple of nonprofit organizations with their blog and HubSpot website <https://www.lovejustice.ngo/>\nI can help you with your blog speed issue."
  },
  {
    "poster": {
      "poster_name": "Sivachandran Krishnamoorthy",
      "poster_handle": "sivachandran"
    },
    "time_stamp": "2024-10-17 07:49:10",
    "text": "Hi everyone,\nAny possibilities to customize multiple select  blog tag name in Rss listing module.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-17 09:16:44"
      },
      {
        "time_stamp": "2024-10-17 09:26:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joceline Perez Hernandez",
      "poster_handle": "joceline"
    },
    "time_stamp": "2024-10-17 09:07:38",
    "text": "Hi everyone! We are trying to integrate HubSpot with Salesforce Data Cloud, we have created the public app, but we are having trouble installing it in the org. We left the redirect URL as localhost to try to install the app, but then we get an error saying that localhost cannot be accessed. We try to use the callback URL from the Auth provider we set up on Salesforce to install the app, and then we get an Oauth no state sent back error. Has anyone ever encountered this?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-17 09:28:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Miteshkumar Padariya",
      "poster_handle": "mitesh"
    },
    "time_stamp": "2024-10-17 09:16:44",
    "text": "Can you please add more information and context?"
  },
  {
    "poster": {
      "poster_name": "Sivachandran Krishnamoorthy",
      "poster_handle": "sivachandran"
    },
    "time_stamp": "2024-10-17 09:26:56",
    "text": "Hi mithesh,\nThanks for your reply.\nWe have use default rss listing module in website page that module select  one tag name only our requirement is select multiple tag name show relevant blogs."
  },
  {
    "poster": {
      "poster_name": "Ramandeep Singh",
      "poster_handle": "ramandeep.singh2"
    },
    "time_stamp": "2024-10-17 09:28:14",
    "text": "Hey <@U07SBRDEWE6>! I am happy to help you let me know how you would like to proceed with discussion."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-10-17 09:30:21",
    "text": "<@U7SL518D6> Then is there some other way that anonymous tracking is linked to a user in the end? I know that when someone submits a form in HubSpot the contact shows activity from before they submitted the form. Is that only the case when that user had cookies enabled? Is there an official description of how that works? I have the question here too so that we can better keep track: <https://community.HubSpot.com/t5/GDPR/Blocking-the-ptq-gif-tracking-pixel-from-track-HubSpot-com-until/m-p/1052552>"
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2024-10-17 09:48:17",
    "text": "Hello everyone,\nis this a real thing? I'm looking for a HS cookie scan functionality as well, can anyone provide some useful info / links?\nThank you.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-23 00:28:08"
      },
      {
        "time_stamp": "2024-10-23 13:45:33"
      },
      {
        "time_stamp": "2024-10-23 13:56:27"
      }
    ]
  },
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2024-10-17 10:27:36",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-17 16:30:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Laura Alonso",
      "poster_handle": "laura.alonso"
    },
    "time_stamp": "2024-10-17 13:16:43",
    "text": "Hi team,\nI hope you’re all doing well! I'm looking for a way to automate the process of updating HubSpot meeting outcomes based on the status of Calendly meetings. I’ve tried several options without success. Currently, I’m using Zapier to update a custom property with the invite status, but I’d like to explore any other potential workarounds you might suggest.\nDo you have any ideas or solutions for creating this workflow?\nThanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-17 14:49:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-10-17 14:41:44",
    "edited": {
      "time_stamp": "2024-10-17 14:43:43"
    },
    "text": "> I know that when someone submits a form in HubSpot the contact shows activity from before they submitted the form.\nIf they have cookies disabled I don’t believe we can provide that activity information because we wouldn’t have a reliable way to even associate that information with the person (aside from for example logging that the person went to the page that the form was on, because we know they filled out the form on that page). As much as HubSpot can feel magic, it’s not magic.\n\nSomething I’m not sure about is if a user changes their cookie preference. So lets say they opted in, then later opted out. I would assume we would have their analytics for while they were opted in but as soon as they opt out we no longer log things that would require cookies, a form submission and the page they filled out that form on would still be able to be inferred because they willingly filled out the form, no cookie required."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:44:08",
    "text": "<@U7SL518D6> the response in the forum post from @kennedyp suggests that \"views/activity\" will be associated with a record once they accept cookies or fill out a form"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:44:44",
    "text": "it's unclear how that anonymous activity is associated with the contact in the end. If it's something like IP address that might have GDPR concerns"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-10-17 14:45:38",
    "text": "&gt; Hey <https://community.HubSpot.com/t5/user/viewprofilepage/user-id/294|@theAndreyK>! Great questions. If the visitor declines cookies, the anonymized views will never be associated with their record in HubSpot."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:47:21",
    "text": "maybe I misinterpreted that response? it sounds like anonymous views/activity does get recorded and then gets associated with a record if they submit a form (the second sentence)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-10-17 14:49:10",
    "text": "In the second sentence I believe he’s meaning only if you accept cookies can we associate your analytics with your record. We do not magically de-anonymize your history at the moment you opt into cookies."
  },
  {
    "poster": {
      "poster_name": "Ramandeep Singh",
      "poster_handle": "ramandeep.singh2"
    },
    "time_stamp": "2024-10-17 14:49:24",
    "text": "Hey <@U07RY5CTJFQ> I think a custom script would be an effective solution to periodically check Calendly and sync any changes to HubSpot. Essentially, we could set up something like webhooks or a cron job for this.\n\nI have few more thoughts that we can discuss let me know how would you like to proceed further."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:50:08",
    "text": "ok, that's good to know. It would be great if HubSpot could officially document exactly how all of that works."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2024-10-17 14:52:13",
    "text": "I think it’s a situation of - it’d likely be more confusing if we _did_ document that we don’t do that."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:53:46",
    "edited": {
      "time_stamp": "2024-10-17 15:03:14"
    },
    "text": "~maybe~, I think a disclosure of how (and what) anonymous data is tracked would be helpful at least. I don't think the documentation ever mentions the `ptq.gif` or that the form script tracks anonymous views"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:54:57",
    "text": "in any case, I appreciate your insights and confirmation here. thank you"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-17 14:58:43",
    "text": "also, <@U7SL518D6>, just for feedback you can maybe pass along, on our international teams there are concerns about both the naming and existence of analytics scripts before cookies are accepted. (the tracking pixel, <http://hs-analytics.net|hs-analytics.net>, <http://hsleadflows.net|hsleadflows.net>). I've explained that they either track anonymous data or relate to controlling future consent but there is some pushback)"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-10-17 16:30:36",
    "text": "Hi <@U02HB4R2FCM>, congrats on your launch! Self promotion is only permitted in <#C0121KGC6RM|showcase>, as per our <https://developers.HubSpot.com/slack/code-of-conduct#unwanted-solicitation-of-services|Code of Conduct>. I'd kindly ask you to delete this post from here and move it to that channel. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Melissa Smith",
      "poster_handle": "msmith"
    },
    "time_stamp": "2024-10-17 19:46:00",
    "text": "I know Multi-Step Forms is still in Beta, do we know when it will be available as a field in custom modules?"
  },
  {
    "poster": {
      "poster_name": "Erick Barrantes",
      "poster_handle": "erick769"
    },
    "time_stamp": "2024-10-17 20:58:37",
    "text": "Hey Pietro, a custom object cannot associate to the Products object. This is currently not possible. You would need to create the functionality based on what your requitements are and where you need to display the data. You might be able to use HubDB to create the categories and associate the Products, but this is all a manual process. If you need to automate things, you may need to use an external service or even something like a Serverless function that's trigger on each product update which automates updating your HubDB."
  }
]