[
  {
    "text": "Hi\n\nI wanted to know that why are we experiencing a high number of connection denials when calling webhooks for task status change events? this was working fine before 2 days and all of sudden its giving error.\nJust for info i am using Beta.\n\ncan anyone help on this please.",
    "time_stamp": "2024-10-07 01:35:36"
  },
  {
    "poster": {
      "poster_name": "Paul Sullivan",
      "poster_handle": "paul126"
    },
    "time_stamp": "2024-10-07 07:12:39",
    "text": "Hi Guys, does anyone know if the CRM content api allows smart content updates?"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-07 08:49:21",
    "text": "Is there anybody on the HS cookie scanner team that clarify how the NID cookie added by Google works? It shows up in the cookie scanner as a necessary cookie but it's unclear what is adding it or if our website is somehow responsible for it because it shows up in the scanner?"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-10-07 09:17:26",
    "text": "it also looks like twitter cookies are being added but it's unclear where they are coming from. Does having twitter connected in HubSpot settings automatically load twitter cookies on the blog?"
  },
  {
    "poster": {
      "poster_name": "Stephanie Serrano",
      "poster_handle": "sserrano"
    },
    "time_stamp": "2024-10-07 10:14:44",
    "text": "*Hey everyone!* :raised_hands:\nWe’re trying to improve our CMS Developer Experience :tada: :HubSpot: If you use or have used our CMS ( in the HubSpot App or code)\nCan you help us by taking 2 minutes to share your honest feedback? :bulb:\n\nYour input will make a BIG difference in fixing the issues and improving the CMS development experience!\n :boom::point_down:\n*<https://www.surveymonkey.com/r/MMD5GXX|Start the survey>* \n\nThanks a ton! :pray: Let’s make our developer experience better!\nIf you have completed the survey, please give a thumbs up in this Slack message."
  },
  {
    "poster": {
      "poster_name": "Carolyn Davidson",
      "poster_handle": "cdavidson"
    },
    "time_stamp": "2024-10-07 12:32:47",
    "text": "Hi Jolly. I'm sorry I haven't been able to figure this one out. <@UJJ239SC9>, here's a link to Jolly's <https://app.HubSpot.com/workflows/22804032/platform/flow/604983680/edit|Merge Contact Duplicate workflow> if you have time to take a look. She's trying to use the Deduplicate Contact code from the <https://www.HubSpot.com/programmable-automation-use-cases|automations use case library>. <@U07JDBX6LS2> do you have a test contact we can review/try to merge? The test contact should be a contact that has a matching phone number with one other contact in your CRM and that you're ok with merging."
  },
  {
    "text": "Hi, my team is currently integrating the HubSpot UI as an embedded component in AXP, but the menus are not showing. Does anyone have any idea why this might be happening? Could it be due to some kind of restriction or security setting in HubSpot?",
    "time_stamp": "2024-10-07 16:40:19"
  }
]