[
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:04:02",
    "text": "you dont have anything to fix if you havent done anything"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:05:57",
    "edited": {
      "time_stamp": "2024-10-26 01:06:31"
    },
    "text": "I done that design but problem is i am not getting the file name using jquery and HubSpot adding automatic class in file input and i am trying to get file name using that class.\nCan you suggest me please i can share with you the code using jquery"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:07:03",
    "text": "sorry I dont understand your issue at all"
  },
  {
    "text": "I mean this design i did done using HubSpot rich text in HubSpot form but how i can get file name when uploading using there drag and drop file upload button i did hide that",
    "time_stamp": "2024-10-26 01:08:39"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:09:40",
    "text": "doesnt the file name already show on the bottom left of your screenshot?"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:10:41",
    "text": "No its another site design i did copy the select files button layout"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:12:40",
    "text": "<@U07TCB5LBDF> <https://46793903.hs-sites.com/refer-a-patientrefer-a-patient|https://46793903.hs-sites.com/refer-a-patientrefer-a-patient>\nHere in this link you can go and see"
  },
  {
    "text": "",
    "time_stamp": "2024-10-26 01:13:01"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:13:01",
    "text": "so where does your current file get uploaded? Or is it just the normal file input from html at the moment?"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:13:28",
    "text": "I cant access your page, it’s not public"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:14:16",
    "text": "Current file using HubSpot choose fiile i did made 0 opacity of that button and increase hieght and width"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:15:19",
    "text": "Then i did design a layout using rich text after that i added there z-index-1 so that choose upload file will be upper of that layout and can trigger to choose file"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:15:25",
    "text": "Can you send me the screenshot of the element after you select a file (inspect the element)"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:17:51",
    "text": "But in theory you can retrieve the file name using jQuery like so :\n\n`$(document).ready(function(){`\n    `$('#idOfFileInput').on('change', function() {`\n        `var fileName = $(this).val().split('\\\\').pop();`\n        `$('#idOfTextElement').text(fileName);`\n    `});`\n`});`"
  },
  {
    "text": "",
    "time_stamp": "2024-10-26 01:18:58"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:19:50",
    "text": "can we do a google meeting if you want to?"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:21:02",
    "text": "use the code snippet I provided above and modify it based on the input element when its uploaded"
  },
  {
    "text": "this the input for file of HubSpot that provide using drag and drop problem there have no unique id or class how can i take this specific in jquery?",
    "time_stamp": "2024-10-26 01:23:40",
    "edited": {
      "time_stamp": "2024-10-26 01:24:07"
    }
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:25:50",
    "text": "just use hs-input class as well ass the file input "
  },
  {
    "text": "i used that but still same thing",
    "time_stamp": "2024-10-26 01:28:06"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:28:16",
    "text": "could you please help me out"
  },
  {
    "poster": {
      "poster_name": "habibur rahman",
      "poster_handle": "habiburdeveloper7"
    },
    "time_stamp": "2024-10-26 01:40:17",
    "text": "<@U07TCB5LBDF> thank you so much its working now this code:\n&lt;script&gt;\n$(document).ready(function(){\n    // Attach event to all potential file input changes dynamically to account for HubSpot changes\n    $(document).on('change', '.hs_file_upload input[type=\"file\"]', function() {\n        var fileName = $(this).val().split('\\\\').pop();\n        $('#file-upload-info').html(fileName); // Ensure element with this ID exists\n    });\n});\n&lt;/script&gt;"
  },
  {
    "poster": {
      "poster_name": "Kilian Trunk",
      "poster_handle": "kilian"
    },
    "time_stamp": "2024-10-26 01:49:46",
    "text": "perfect <@U07TMEJC4LU> :raised_hands: "
  },
  {
    "poster": {
      "poster_name": "Derik Savage",
      "poster_handle": "derik770"
    },
    "time_stamp": "2024-10-26 08:05:39",
    "text": "<@UATE4ATHP> Thank you for the reply! I actually met with Daniel Bird about the agency program from SR. I may have misunderstood part of the demo he provided of the SR app in that I was under the impression that we could use the app to store existing sites as templates to be re-used on future projects or in other portals. \n\nAfter researching a bit further, what I’ve described above doesn’t seem to be the intended use-case or even possible with the app. It seems like it’s more geared towards rapid layout development and ultimately, designing sites using the Figma toolset. This feels like a great system for the way most agencies approach web design projects, but for our use-case it may be a bit more than we need. \n\nMany of the sites we build are on the starter end of the spectrum when it comes to complexity and budget, so our ideal situation is to have a few ready-made templates to start from that would get us 70-80% of the way there for what we’re initially building, but to also have these sites built on a theme that we can use to expand upon as each site grows. \n\nThe clients for these are super small startups, and they’re looking for a fast / inexpensive solution. Our strategy is to provide this, while also giving them a clear path and framework for growth as they begin to have success in their business. This is why being able to save existing sites or designs for re-use is attractive to us, and we also feel like the SR theme has a good logic and overall philosophy to the way it works within the HubSpot CMS builder. \n\nIf we can find a good way to get the best of all worlds for our use-case, I’d be thrilled. Happy to hear your thoughts and discuss any possible directions we could take this. "
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-10-26 10:56:42",
    "text": "Ah gotcha, yeah sounds like our free product would be sufficient for your needs. Your best bet would be set up our free theme exactly how you want it, with all your templates and any customizations. Then you can use the HubSpot CLI to copy it to any other account"
  },
  {
    "poster": {
      "poster_name": "Derik Savage",
      "poster_handle": "derik770"
    },
    "time_stamp": "2024-10-26 11:06:31",
    "text": "<@UATE4ATHP> Okay, perfect. Thank you. Just so I’m clear, there are no limitations from SR on using the free version of the theme this way? Also, for our purposes, having several different templates built out in our demo account using SR Free should allow us to do what I’m describing here while using the HubSpot CLI to push instances of each demo site/template to client portals as needed, correct? \nThank you again, and ideally this would end up with clients on an upgrade path to SR Core / Pro, so a win-win for all involved. "
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-10-26 12:31:23",
    "text": "Yeah you can have everything on a demo account and treat that as the \"master\" theme I guess :sweat_smile:There are no limitations, the only real difference between free core and pro is the number of modules you get. If you are ever planning to upgrade a client from free to core or pro, make sure you are using our app. This will ensure a smooth upgrade, there is no way to upgrade themes on the marketplace."
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-10-26 12:31:53",
    "text": "If you ever have questions or need a hand just reach out or book a call here if you like. <https://www.sprocketrocket.co/bradley|https://www.sprocketrocket.co/bradley>"
  }
]