[
  {
    "poster": {
      "poster_name": "Stefan Kovacic",
      "poster_handle": "stefan.kovacic"
    },
    "time_stamp": "2024-10-23 04:04:03",
    "text": "Hi everyone,\n\nWe have recently encountered an issue that is affecting the redirects across several of our portals within the HubSpot environment. Since this morning, we have noticed disruptions in the functioning of these redirects, which is impacting the overall performance of our websites.\n\nGiven that we have not implemented any major changes or updates to our portals in recent times, we are trying to determine the root cause of the problem. Could you kindly confirm if there have been any significant updates or changes on HubSpot's end that might be affecting the redirect functionality? Does anyone else have a similar problem?\n\nWe would greatly appreciate any guidance or insights you can provide to help us resolve this issue as swiftly as possible."
  },
  {
    "poster": {
      "poster_name": "Clàudia Huguet",
      "poster_handle": "chuguet"
    },
    "time_stamp": "2024-10-23 08:58:50",
    "edited": {
      "time_stamp": "2024-10-23 09:06:48"
    },
    "text": "Hello! I'm new here and I wonder if anyone could help with this:\n\nWe are using a landing page and we share it via a QR code to our clients.\n\nWhen opening the URL in preview mode the content is updated but it is not updated in the published URL. In other words, what we are editing in HubSpot is not reflected in the link. Since we have already share the code with our clients, we cannot clone it or change the URL.\nThis has never happened with other landing pages, and I am not sure if this is a special case. We want to continue editing te landing page for the next edition while keeping the same URL. Is there any way to maintain the URL and ensure it updates every time we modify it?\n\nI've already checked it with the HubSpot Support but they told me it seems a problem in the code... We would appreciate any help to solve this problem! thank you :raised_hands:",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-10-23 09:05:15"
      },
      {
        "time_stamp": "2024-10-23 21:00:48"
      },
      {
        "time_stamp": "2024-10-24 02:20:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ramandeep Singh",
      "poster_handle": "ramandeep.singh2"
    },
    "time_stamp": "2024-10-23 09:05:15",
    "text": "Hello <@U07T8QF7TBN>! Yes I agree this seems to be issue in the code. Troubleshooting and code review needs to be done.\n\nSending you a DM to connect."
  },
  {
    "poster": {
      "poster_name": "Amit",
      "poster_handle": "agoala"
    },
    "time_stamp": "2024-10-23 09:19:30",
    "text": "Hello there!, our team is encountering an issue.\nWe're using the HubSpot API on our website's form to create contacts/leads in HubSpot. However, when the same email address is submitted, it's not generating two leads in HubSpot and only the first lead is showing. Could this be because HubSpot doesn't allow duplicate emails?\nIf that's the case, how can we modify it to meet our requirements?"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-10-23 10:55:02"
  },
  {
    "text": "I haven’t personally worked with it, but I’ve got colleagues who’ve implemented the feature in client accounts. The beta might not currently be accepting new applicants, but on portals with active consent management tools, I’m seeing a promo banner at *Settings &gt; Account Management &gt; Privacy &amp; Consent &gt; Cookies*.",
    "time_stamp": "2024-10-23 13:45:33"
  },
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2024-10-23 13:56:27",
    "text": "Mmm... I've checked some of the portals I'm working on but I can't see that banner. Maybe the beta is indeed not currently accepting new applicants.\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Tim Somero",
      "poster_handle": "tsomero"
    },
    "time_stamp": "2024-10-23 14:11:24",
    "text": "I started a new Customer Success gig recently and my new manager and I were wondering if there are any pre-built integrations between O365 and HubSpot that we can use for our Customer Success program\nI'm looking here: <https://app.HubSpot.com/ecosystem/1850012/marketplace/apps/page/2?eco_search=ms%20project>\nand the tools that we started with are Sharepoint and MS Planner and unfortunately, I don't see anything pre-built\nany guidance would be appreciated",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-23 14:56:10"
      }
    ]
  },
  {
    "text": "Hey guys - i am getting an error when listing my app that says we are missing the required scope for oauth within the features of our app listing, but \"oauth\" is not an option available within the dropdowns in any of the existing or new features. See photos below. Could someone please help me?",
    "time_stamp": "2024-10-23 14:12:44",
    "edited": {
      "time_stamp": "2024-10-23 14:12:56"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-23 15:14:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ramandeep Singh",
      "poster_handle": "ramandeep.singh2"
    },
    "time_stamp": "2024-10-23 14:56:10",
    "text": "Hey <@U07TLPQFYD7>! If you have already tried Sharepoint and Planner then Zapier an be used. Though it is not direct integration you can use Zapier to create workflows that connect HubSpot with Office 365 tools.\n\nThe ideal approach would be Custom API Integration. Sending you a DM to discuss more on it."
  },
  {
    "text": "I have it in my `public-app.json` file and when I upload it then it shows.\n\nthese two links may be helpful:\n\n<https://developers.HubSpot.com/changelog/advanced-auth-and-scope-settings-for-public-apps>\n\n<https://developers.HubSpot.com/docs/api/creating-an-app#configure-scopes>",
    "time_stamp": "2024-10-23 15:14:15"
  },
  {
    "poster": {
      "poster_name": "Robert Ainslie",
      "poster_handle": "rainslie"
    },
    "time_stamp": "2024-10-23 21:00:48",
    "text": "<@U07T8QF7TBN> can you share the QR code image or a link where the QR code is linked?"
  }
]