[
  {
    "poster": {
      "poster_name": "Carlos Claro",
      "poster_handle": "carlos.claro"
    },
    "time_stamp": "2024-10-01 01:09:28",
    "text": "Hi all, what would be the process in the HubSpot CMS to make an HTTP request to an external API? Do I need to create a private app first, can it be done in a module itself, or it would need to use a serveless function? Or none of these options? Thanks in advance.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-01 08:01:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Tarang Mehta",
      "poster_handle": "tarang"
    },
    "time_stamp": "2024-10-01 04:19:00",
    "text": "Hi All,\nHope you all doing good. I just wanted to know that using the Laravel technology can i customise in the HubSpot it self."
  },
  {
    "poster": {
      "poster_name": "Rahul Sharma",
      "poster_handle": "rkbagra0490"
    },
    "time_stamp": "2024-10-01 07:23:57",
    "text": "Hi all, How can we modify our HubSpot form implementation to work with Firefox's strict protection mode? Currently, the form fails to load due to Cross-Origin Request Blocking when Firefox's Enhanced Tracking Protection is set to strict."
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-10-01 07:36:49",
    "edited": {
      "time_stamp": "2024-10-01 07:37:20"
    },
    "text": "Hey all,\n\nWhat's the recommended call centre / calling app for HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Satyam Chaudhary",
      "poster_handle": "satyamc.wot2022"
    },
    "time_stamp": "2024-10-01 07:45:29",
    "text": "Thanks <@UJAPS2K4N>,\nI used to make custom multi-step forms in Module but thought of giving multistep inbuilt a try but stumbled upon this - wanted to know if it is not possible or if I'm missing something out."
  },
  {
    "poster": {
      "poster_name": "Muhammad",
      "poster_handle": "muhammad"
    },
    "time_stamp": "2024-10-01 08:01:17",
    "text": "If you just need to hit an External API you don’t need to create the Private App. The Serverless functions would be required if the external API is private and can only be accessed via API Key/Secret. If it’s public and you don’t need to hide where you are getting this data you can directly call it from frontend using JS"
  },
  {
    "subtype": "bot_message",
    "text": ":orange_heart:*Please take a moment to review our Code of Conduct*:orange_heart:\n\nWe want the HubSpot Developer community to be inclusive and welcoming. By following our Code of Conduct, you can help ensure that's the case.\n\nTL;DR:\n• Be respectful\n• Be inclusive (try not to say, \"Hey guys, hey boys, hey [any specific group]\")\n• No self promotion, except for <#C0121KGC6RM|showcase> and <#CBNDYJJAZ|jobs> \n• No unsolicited DMs\nRead the <https://developers.HubSpot.com/slack/code-of-conduct|whole thing here> - and thanks for being a part of the HubSpot Developer Community!\n\nWant to report a violation? DM <@UQNEXHW14> or fill out the <https://form.asana.com/?k=p7aM0fpd3G4JGETDL_nYXg&amp;d=8587152060687|anonymous form here>.",
    "username": "Code of Conduct Reminder",
    "time_stamp": "2024-10-01 09:00:11",
    "edited": {
      "time_stamp": "2024-10-01 09:00:22"
    }
  },
  {
    "poster": {
      "poster_name": "Sasika Nagaraj",
      "poster_handle": "sasika"
    },
    "time_stamp": "2024-10-02 00:38:11",
    "text": "I'm currently using the Engagements API in HubSpot to retrieve emails sent through the HubSpot contact page and within the HubSpot account. However, I’ve noticed that replies sent by contacts from their mobile devices or external email accounts are not being fetched.\nIs there a way to capture these replies in HubSpot? If so, could you please share the approach or API endpoints that can help in retrieving those replies?"
  }
]