[
  {
    "poster": {
      "poster_name": "Bálint Sipos",
      "poster_handle": "sbi85g"
    },
    "time_stamp": "2024-10-21 03:34:28",
    "text": "Anyone can share some insights how you handle dynamic content on landing pages?\nSpecifically, if you have landing page set up where you personalise based on a previous page visit how are you doing that?\n\nWe have new product pages where we are linking to a Book a demo HS landing page with a form and I would like to reference the product where they came from. Even submit a datapoint on this demo booking were coming off a certain product.\nHow are you setting these up in general? Any tips?"
  },
  {
    "poster": {
      "poster_name": "Namratha Manjunath",
      "poster_handle": "nmanjunath"
    },
    "time_stamp": "2024-10-21 12:28:12",
    "text": "Hi app partners, we're looking to build out HubSpot's observability capabilities and would love to hear from you --\n1. What kind of observability do you use for UIE?\n2. What other observability capabilities can we provide to better help you?\"\n"
  },
  {
    "poster": {
      "poster_name": "Sneh Shah",
      "poster_handle": "sneh.shah"
    },
    "time_stamp": "2024-10-21 12:55:23",
    "text": "Hi Everyone, Does anyone know how can I use a video player pop-up in HubSpot webpage?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-21 14:24:08"
      }
    ]
  },
  {
    "text": "Does anyone know what determines the order of the tags on a blog post, stored in `content.topic_list`? Is it when the tag was created? I added the tags in the order of `home` `home-top` `Featured`, but it puts `Featured` before `home-top`. Not really understanding why.",
    "time_stamp": "2024-10-21 14:15:59",
    "edited": {
      "time_stamp": "2024-10-21 14:19:56"
    }
  },
  {
    "poster": {
      "poster_name": "bspaulding",
      "poster_handle": "bspaulding"
    },
    "time_stamp": "2024-10-21 14:24:08",
    "edited": {
      "time_stamp": "2024-10-21 14:24:24"
    },
    "text": "Make a module using a popup with a video player and then add it to your page"
  },
  {
    "poster": {
      "poster_name": "Amit Das",
      "poster_handle": "adas"
    },
    "time_stamp": "2024-10-21 15:57:38",
    "text": "Hi everyone, I have a thank you landing page which displays the FirstName of the Contact who submitted a HubSpot Form. The form to landing page redirect happens on form submit. Although when the Thankyou page loads it does not display the personalization. If I wait a few seconds and refresh the landing page then the personalization appears. Anyone has had this roadblock? I think adding a timer module might help here but would like to know any other solution to this is problem?"
  }
]