[
  {
    "poster": {
      "poster_name": "Nur Uddin Shahed",
      "poster_handle": "shahed"
    },
    "time_stamp": "2024-10-10 05:07:56",
    "text": "Hi, I'm integrating HubSpot with my Laravel Apps. When trying to create an Order Object it throws this error message \"_Currency Code must be predefined_\". I searched on internet, but no solution over there. Will you guys help me to solve this issue? #help <#C04A3FUK8HK|crm-development-beta>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-10 05:26:18"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Nur Uddin Shahed",
      "poster_handle": "shahed"
    },
    "time_stamp": "2024-10-10 05:26:18",
    "text": "@everyone"
  },
  {
    "poster": {
      "poster_name": "Bianca",
      "poster_handle": "bianca"
    },
    "time_stamp": "2024-10-10 07:07:17",
    "text": "Hi all! Does anyone have any experience making multi level dynamic pages using content from CRM?\nI'm having an issue with HubSpot where I want to set up a dynamic page that handles two different CRM object types (brands and models) under the same base URL structure (`/car/:brand/:model`). HubSpot dynamic pages seem to only support a single object type and URL pattern, so when I try to access a deeper path like `/car/volvo/ec40`, it results in a 404 error because the dynamic page setup only recognizes the first dynamic object (`:brand`).\nI’m trying to find a solution that allows me to display both brand and model information under the same dynamic page structure without having to create separate dynamic pages or use workarounds that could negatively affect SEO or usability. Any advice on how I can achieve this?"
  },
  {
    "poster": {
      "poster_name": "David Boyd",
      "poster_handle": "dboyd"
    },
    "time_stamp": "2024-10-10 08:56:53",
    "text": "Hi\n\nIn the process of starting a POC on the capabilities of CMS in a eCommerce Headless Architecture pattern.  We will have a webserver running angular, which will fetch page templates from CMS along with and data or interactions with our ecommerce platform.\n\nLooking for verification that I should be able to use the CMS Sandbox - in that the API to pull these templates will be exposed and working or do I need to create a new account just for this POC under our current business unit?\n\nWe are live with the Marketing website and don’t want to cause any issues with that"
  },
  {
    "poster": {
      "poster_name": "Jacob Reynolds",
      "poster_handle": "jgreynolds22"
    },
    "time_stamp": "2024-10-10 21:07:45",
    "text": "Hello,\nI’m interested in pulling information from ERP into HubSpot. Only one way sync. I’ve searched and searched and there is no native app or integration to help. So I’m trying to explore ways to pull data out and push into HubSpot. For someone that has experience with this, I’d love to talk with you. Just trying to understand the best path forward and the structure needed before doing the work. \n\nMy idea is to connect the two through visual studio code but a little confused of where to start.  I have no development background so be prepared to talk to me like you’d try to explain to a 5 year old. ",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-11 01:29:07"
      },
      {
        "time_stamp": "2024-10-11 03:51:57"
      }
    ]
  }
]