[
  {
    "poster": {
      "poster_name": "km pooja kala",
      "poster_handle": "kmpoojakala"
    },
    "time_stamp": "2024-10-11 01:29:07",
    "text": "Hey <@U07392CHZ52>\n\nPlease check your DM."
  },
  {
    "poster": {
      "poster_name": "Anthony Perez",
      "poster_handle": "anthony249"
    },
    "time_stamp": "2024-10-11 02:12:33",
    "text": "Hi all, is there a Hubl tag/function available to load in the new HubSpot multistep forms. similar to how we now have\n```{% form\nform_to_use=\"{{ module.form.form_id }}\"\nresponse_response_type=\"{{ module.form.response_type }}\"\nresponse_message=\"{{ module.form.message }}\"\nresponse_redirect_id=\"{{ module.form.redirect_id }}\"\nresponse_redirect_url=\"{{module.form.redirect_url}}\"\ngotowebinar_webinar_key=\"{{ module.form.gotowebinar_webinar_key }}\"\n%}```"
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-10-11 03:51:57",
    "text": "Hi <@U07392CHZ52>,\n\nI understand the challenges you're facing, as I've encountered similar hurdles before. Here are a few suggestions to help you navigate this process smoothly:\n\n*Option 1: API Integration (typically easier for most use cases)*\n\nIf your ERP system has an API, you can use it to extract data. HubSpot offers APIs for contacts, deals, and other custom objects, allowing you to push this data into HubSpot. You can also use middleware tools like Zapier, MuleSoft, or a custom solution to bridge the ERP and HubSpot, handling data transformation and mapping before syncing it into HubSpot.\n\n*Option 2: Custom ETL Process through Visual Studio Code.*\n\nYou can build a custom ETL process to handle the sync:\n1. *Extract*: Pull data from your ERP system using its export features or API.\n2. *Transform*: Clean and format the data to fit HubSpot’s structure (e.g., map ERP customer records to HubSpot contacts).\n3. *Load*: Use HubSpot’s APIs to load the transformed data into HubSpot.\nThings to keep in mind when doing this are:\n• Ensure fields between ERP and HubSpot are well-mapped.\n• Be aware of HubSpot API limits.\n• Determine how often you need to sync the data—real-time, daily, or less frequently.\nSince you are not from a development background. I am happy to help if you need to discuss it more. Thanks!"
  },
  {
    "poster": {
      "poster_name": "Hardik Metha",
      "poster_handle": "hardik978"
    },
    "time_stamp": "2024-10-11 05:07:02",
    "text": "Hello\n\nI have setup Sandbox in my HubSpot and copy all content from production to sandbox except pages and blogs.\n\ncan some one guide me how can I copy pages to sandbox.\n\nI checked content staging but that is not feasiable option to go with."
  },
  {
    "poster": {
      "poster_name": "Zach Foster",
      "poster_handle": "notzachfoster"
    },
    "time_stamp": "2024-10-11 08:43:51",
    "text": "is there a way to see archived currencies in HS? or to identify they are archived in some API? i'm seeing archived currencies when fetching the account details via the API, unsure if I can identify archived ones"
  },
  {
    "text": "Hello - I am having trouble \"Previewing\" my marketplace listing in HubSpot. I am getting the following error.  What is the proper procedure for opening a TT with HubSpot?",
    "time_stamp": "2024-10-11 09:38:19"
  },
  {
    "poster": {
      "poster_name": "Tom Wright",
      "poster_handle": "tom210"
    },
    "time_stamp": "2024-10-11 09:45:42",
    "text": "Hey everyone, have any of you guys used a solution for reporting on profit? My idea here is taking the deal products and calculating the profits based on the products unit price vs the sale price. I asked HubSpot AI and it said it can be done in the custom report builder but this was wrong. Has anyone used something in the app marketplace or thought of a workaround that might work to report on profit?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-11 10:12:16"
      },
      {
        "time_stamp": "2024-10-14 06:08:08"
      },
      {
        "time_stamp": "2024-10-14 06:36:24"
      },
      {
        "time_stamp": "2024-10-14 07:33:39"
      },
      {
        "time_stamp": "2024-10-14 07:45:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-10-11 10:12:16",
    "text": "Hey <@U02052679KJ>\n\nI guess HubSpot’s default reporting tools might not be sufficient for calculating profit because they don't automatically account for product cost.\n\nYou can explore HubSpot-integrated BI tools (such as Databox or Grow) from the app marketplace. They allow for more advanced calculations and custom reports outside of HubSpot's native capabilities.\n\nFeel free to reach out if need to discuss it further. Thanks!"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-10-11 12:05:01",
    "edited": {
      "time_stamp": "2024-10-11 12:05:06"
    }
  },
  {
    "poster": {
      "poster_name": "Enielys Hernández",
      "poster_handle": "enielys"
    },
    "time_stamp": "2024-10-11 14:34:56",
    "text": "Hi community, i have a question about native objects (Contacts, Deals, Companies, etc) and menu items (Marketing, Content, Automation, etc) in HubSpot\n\nI need to know if there's a way to hide the left sidebar menus, for example Marketing in its entirety, and i would also like to know if I can change the name and api name of native objects?\n\nthanks :raised_hands:",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-14 14:15:17"
      },
      {
        "time_stamp": "2024-10-14 14:36:23"
      },
      {
        "time_stamp": "2024-10-14 14:38:21"
      },
      {
        "time_stamp": "2024-10-14 14:40:49"
      }
    ]
  }
]