[
  {
    "poster": {
      "poster_name": "Sahai",
      "poster_handle": "abhinav"
    },
    "time_stamp": "2024-10-16 02:18:21",
    "text": "hi everyone, we're building a new public app and were hoping to use App Cards, the question is, if we build it, will the customer who installs the app also needs to request to the early access?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-16 06:49:13"
      },
      {
        "time_stamp": "2024-10-16 06:49:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kiara Munz",
      "poster_handle": "kimunz"
    },
    "time_stamp": "2024-10-16 06:49:13",
    "text": "They will not!"
  },
  {
    "poster": {
      "poster_name": "Sahai",
      "poster_handle": "abhinav"
    },
    "time_stamp": "2024-10-16 06:49:44",
    "text": "Thanks Kiara!"
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-10-16 10:55:03"
  },
  {
    "poster": {
      "poster_name": "Max Addison",
      "poster_handle": "max.addison"
    },
    "time_stamp": "2024-10-16 10:55:43",
    "text": "*Missing Page Visit Tracking After Cookie Consent and Before Form Submission in HubSpot*\n\nHey HubSpot Devs,\n\nWe are facing a significant issue on our WordPress website, where *page visits after cookie consent is given but before form submission are not being tracked properly in HubSpot*. This is also negatively impacting the tracking of ads we’re running.\n\n*Key Problem:*\nWhen a user visits our site, clicks on an ad, then navigates through multiple pages (e.g., from a pricing page to a “How It Works” page), and finally submits a form on the “Contact Us” page, HubSpot is only capturing the contact creation event as direct traffic from the final page where the form was submitted. *We’re losing the entire page visit history leading up to the form submission.*\n\n*For example, we only see:*\n• “This contact was created from Direct Traffic from www.blah/contact-us”\n• No data about visits to previous pages (like pricing, how it works, etc.) or the ad click that brought them to the site.\n*Current Setup:*\n1. WordPress: We’re using the HubSpot WordPress plugin.\n2. CookieYes: We use CookieYes for cookie consent, with HubSpot’s `setHubSpotConsent` function invoked once consent is granted.\n*Issue:*\n• Page Visits Not Tracked After Consent: Despite consent being granted via CookieYes, page views after consent are not logged in HubSpot before a form submission.\n• No Pre-Form Data: As a result, all page visits leading up to a form submission are missing in the HubSpot contact timeline.\n• Ad Tracking is Affected: This is also impacting our Google Ads tracking, as the only source information we see is the contact creation event, without any data linking the user’s journey from ad click to form submission.\nQuestion:\n• How can we ensure that page visits after cookie consent but before form submission are tracked in HubSpot?\n• Are there any known conflicts between CookieYes, GTM, and the HubSpot WordPress plugin that could be causing this? (maybe we should swap to using the HubSpot consent banner?)\n• What’s the best way to track the entire user journey from ad click through multiple page views, leading up to form submission in HubSpot?\nIve been in touch with HubSpot support for a while but they’ve said this community is our best bet - so I’m hopeful for some advice!\n\nThanks in advance :pray:"
  },
  {
    "text": "Hi!, how can i hide objects from users' view? It won't let me hide them completely, but instead limits them to seeing their own object\n\n<#C22PU4LV8|general>",
    "time_stamp": "2024-10-16 11:19:26"
  },
  {
    "poster": {
      "poster_name": "Team Assuaged",
      "poster_handle": "hello435"
    },
    "time_stamp": "2024-10-16 12:46:51",
    "text": "We urgently need a specialist in HubSpot Blog Optimization. Our blogs are loading extremely slow and lag significantly when editing, impacting our nonprofit's digital outreach efforts. Our students at our 501(c)(3) nonprofit are working hard within the software to create these blogs, but the technical issues are holding them back. While our budget is limited, we can offer Catchafire credits in addition to some form of compensation or valuable offerings. Any support in speeding up and optimizing these blogs would be greatly appreciated! TYSM for your kindness and help! <http://assuaged.com|assuaged.com> and <http://assuagedfoundation.org|assuagedfoundation.org>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-16 14:16:37"
      },
      {
        "time_stamp": "2024-10-17 06:28:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brandon Williams",
      "poster_handle": "brandon.williams"
    },
    "time_stamp": "2024-10-16 13:18:15",
    "text": "Hello everyone, I'm new here so please let me know if this is not the correct place to put this..\n\nI was accepted into the UI Extensions BETA but I am receiving the following error when trying to deploy to my developer account:\n```[ERROR] Couldn't create a React extension with your file `/app/extensions/example-card.json` because you don't have access to this beta. To learn more and sign up for the beta, visit <https://app.HubSpot.com/l/whats-new/all?update=13899236>```\nWhen I look up that BETA ID I don't find anything, yesterday that ID was taking me to the BETA that I was accepted into today. Is there any advice on what Im doing wrong here? TIA",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-16 13:49:34"
      },
      {
        "time_stamp": "2024-10-16 13:50:13"
      },
      {
        "time_stamp": "2024-10-16 15:51:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2024-10-16 13:49:34",
    "text": "Can you check your email for anything similar to \"waiting for approval\"?"
  },
  {
    "poster": {
      "poster_name": "Ben Anderson",
      "poster_handle": "banderson"
    },
    "time_stamp": "2024-10-16 13:50:13",
    "text": "I believe there's another step before your portal is totally unlocked, and if so there should've been an email sent out with more info"
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-10-16 14:16:37",
    "text": "Hi <@U07NSHMCAG5> \n\nI am happy to help! Some of the possible solutions I can think of are that you need to:\n\n1. Analyze the plugins and scripts that are possibly causing load issues\n2. Use compression tools to optimise the images \n3. Caching and CDN Implementation\nI am happy to discuss the details on how to improve the overall experience as there are other key factors to look as well. Thanks! "
  },
  {
    "text": "Hey Ben! I do not have a waiting for approval. I have this:\n",
    "time_stamp": "2024-10-16 15:51:23"
  }
]