[
  {
    "poster": {
      "poster_name": "Pietro Poli",
      "poster_handle": "pietro.poli"
    },
    "time_stamp": "2024-10-18 06:36:48",
    "text": "Thanks <@U07PJ1E62V6>, I cannot use HubDB but I've created a new object that gets on a multiple checkbox (all Products) via API =)"
  },
  {
    "poster": {
      "poster_name": "Erick Barrantes",
      "poster_handle": "erick769"
    },
    "time_stamp": "2024-10-18 06:37:25",
    "text": "Awesome, great work around"
  },
  {
    "poster": {
      "poster_name": "Max Addison",
      "poster_handle": "max.addison"
    },
    "time_stamp": "2024-10-18 08:24:59",
    "text": "Does any one have a solution when it comes to implementing the HubSpot chat on a button click rather than a page load?\n\n(this is not for a HubSpot landing page and is for our internal react app)",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-10-18 09:30:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harpreet Singh",
      "poster_handle": "harpreet.singh1"
    },
    "time_stamp": "2024-10-18 09:30:45",
    "text": "Hi <@U07RRAFDNJK>\n\nLooks like this should be easy. Here is what I will do:\n\n*First*, configure the chat settings in HubSpot to not show the chat automatically (via HubSpot settings). I hope it is available there. If not, you can prevent the widget from showing up initially by using JavaScript to control when the chat script initializes.\n\nOnce the HubSpot chat widget is set to not show automatically, make sure the chat script is fully loaded before triggering the widget.\n\n*Second*, create a button in your app that users can click to open the chat widget. Instead of loading the chat automatically, you'll use HubSpot's JavaScript API to open the chat manually when the button is clicked.\n\nHopefully this works for you. Thanks!"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-10-18 12:05:01",
    "edited": {
      "time_stamp": "2024-10-18 12:05:05"
    }
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-10-18 14:46:39",
    "text": "Is it possible to display a list of  \"most popular pages\" that dynamically populates based on what pages get the most visits on a domain?"
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-10-18 14:54:49",
    "text": "I'm looking for the Custom Coded Actions PM.  Here are my feature requests....\n\n1.) Allow for a Custom Coded Action to be managed by a Github repo - similar to that of UI extensions.\n2.) Code editor improvements - improved syntax errors, undefined variables, etc.\n3.) Ability to import third-party libraries - I'd like to use Stripe library but instead I use requests library and it just makes things more challenging\n4.) Additional \"save\" button within the code editor as opposed to saving the whole action and then having to re-enter the action\n5.) AI CoPilot built into the code editor"
  }
]