[
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2024-04-02 08:06:48",
    "text": "Are we meant to still get \"update available\" notifications for uninstalled marketplace themes? anyone know how to disable this?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-04-02 08:19:06"
      },
      {
        "time_stamp": "2024-04-02 09:20:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-04-02 08:19:06",
    "text": ":upside_down_face:"
  },
  {
    "text": "An idea's been submitted on this that I'd recommend giving an upvote to. Going to flag this internally as well\n<https://community.HubSpot.com/t5/HubSpot-Ideas/Stop-receiving-update-emails-for-uninstalled-themes/idi-p/802175>\n\nYou _can_ disable update notifications but that would disable them for all marketplace assets (not just uninstalled ones)\n\n*Settings &gt; Notifications &gt; Email &gt; Marketplace Accordion*",
    "time_stamp": "2024-04-02 09:20:23"
  },
  {
    "poster": {
      "poster_name": "Maxwell Brosofsky",
      "poster_handle": "mbrosofsky"
    },
    "time_stamp": "2024-04-02 09:34:37",
    "edited": {
      "time_stamp": "2024-04-02 09:35:04"
    },
    "text": ":rotating_light: *Hey Everyone, quick heads up regarding submitting updates for marketplace modules.* :rotating_light: \n\nWe've been looking into some odd behavior when an update is submitted for standalone modules. When the update is sent it, the paths for the module's files (fields.json, meta.json, module.html, module.js and module.css) are uploaded outside of their appropriate file structure, so the module shows up in customer accounts with an incorrect name directly in the @marketplace folder instead of the correct name in the folders its supposed to be in. It also doesn't effectively update the module they've already installed.\n\nThis only seems to happen when the CLI is used exclusively for updating these files. Said another way, we believe the order of operations that leads to this is as follows. Provider edits module locally, uploads the module to HS using the CLI, immediately creates and validates the update within the marketplace tab of the HubSpot App, entirely circumventing the design manager. Our thoughts here are this should be completely acceptable, but we're noticing that it occasionally results in the aforementioned behavior.\n\nWe've been rejecting these updates before they're approved to prevent issues in customer accounts and reaching out to providers on a 1 to 1 basis, but I believe it's worth flagging to everyone here.\n\nMy ask here is that after you upload via the CLI, make a benign edit in the design manager for the module (like an extra blank line in the module.html), which should trigger the publish button to become available > publish said edit > and then validate/submit the update. This should allow for the updates to come through correctly.\n\nWe're working on tracking this down and providing a fix asap, and I'll update here when these additional steps are no longer required. Thank you all!"
  }
]