[
  {
    "poster": {
      "poster_name": "Amalia Monroy",
      "poster_handle": "amonroy"
    },
    "time_stamp": "2019-03-08 12:31:22",
    "text": "Hello there, working off of a folium style template for a landing page. I added a social media module, when I hit preview in design manager, the social media icons show up a gray color.  Which is not the color I want, i added custom color codes but does not seem to pick up. When i hit preview on the actual landing page, the icons are blue... does any one have any idea on how to fix this?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 13:08:06",
    "text": "<@UGSHUDEAC> do you have a preview link we could use as reference?",
    "reply_count": 23,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-08 17:41:07"
      },
      {
        "time_stamp": "2019-03-08 17:41:30"
      },
      {
        "time_stamp": "2019-03-12 12:43:07"
      },
      {
        "time_stamp": "2019-03-12 12:43:08"
      },
      {
        "time_stamp": "2019-03-12 12:57:06"
      },
      {
        "time_stamp": "2019-03-12 12:57:20"
      },
      {
        "time_stamp": "2019-03-12 12:57:32"
      },
      {
        "time_stamp": "2019-03-12 13:10:52"
      },
      {
        "time_stamp": "2019-03-12 13:10:53"
      },
      {
        "time_stamp": "2019-03-12 13:11:00"
      },
      {
        "time_stamp": "2019-03-12 13:11:02"
      },
      {
        "time_stamp": "2019-03-12 13:13:21"
      },
      {
        "time_stamp": "2019-03-12 13:13:33"
      },
      {
        "time_stamp": "2019-03-12 13:16:01"
      },
      {
        "time_stamp": "2019-03-12 13:17:30"
      },
      {
        "time_stamp": "2019-03-12 13:30:29"
      },
      {
        "time_stamp": "2019-03-12 13:35:32"
      },
      {
        "time_stamp": "2019-03-12 13:48:46"
      },
      {
        "time_stamp": "2019-03-12 13:49:12"
      },
      {
        "time_stamp": "2019-03-12 13:49:37"
      },
      {
        "time_stamp": "2019-03-12 13:49:50"
      },
      {
        "time_stamp": "2019-03-12 13:52:10"
      },
      {
        "time_stamp": "2019-03-12 15:27:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael F.",
      "poster_handle": "mfields11"
    },
    "time_stamp": "2019-03-08 14:11:41",
    "text": "Hello all. This may be a stupid question, but I will ask it for clarity. In one of the videos, the presenter talks about disabling the float of the bootstrap grid, in order to place a class on the main content body and center it within the page.. He goes on to declare a max-width on that main content body and centers it with \"margin: 0 auto\". The last two steps are pretty common. I am confused as to when your'e supposed to disable the grid floats like this. Do you do this just for centering main content areas? Are you supposed to disable the float on every element you place on the drag and drop? I am just wondering about the extent to which you disable the floats for grids. Thanks in advance.."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 14:17:45",
    "text": "Hey <@UG25DLETZ> just curious as to what video you are looking at and what you are trying to accomplish overall? I would imagine, you wouldnt have to play with the main bootstrap grid any to do what you are looking to do. You could always wrap your module in a div with a class and assign a `max-width` with `margin: 0 auto` to that."
  },
  {
    "poster": {
      "poster_name": "Michael F.",
      "poster_handle": "mfields11"
    },
    "time_stamp": "2019-03-08 14:21:42",
    "text": "Hello <@U2H3TT8F2>.. I was looking at the \"Adding CSS to a template\". It is the last video in the second module \"Building HubSpot CMS templates\""
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 14:51:46",
    "text": "Ah ok, yea, he is just showing an example of what you can do with centering content, you dont have to do this if you dont want to <@UG25DLETZ>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 14:54:04",
    "text": "for example, say you want your content on the page to never exceed 1100px in width, you can do as he is showing and then group all the content inside the header, body, and footer and it will keep all the elements in the center of the page"
  },
  {
    "text": "as a better example, look at HubSpots blog, if you do find in the source for `hsg-page-width-normal` you'll see this class is applied to the header. In this, they are setting a max-width on their content so the header size never exceed 1080px. If this wasnt set, then if you were to zoom out of the page (faking to be a larger widescreen monitor) you would see it appear as this.",
    "time_stamp": "2019-03-08 15:00:06"
  },
  {
    "text": "notice how that top portion is floated all the way to the right yet the other elements are crazy large and it breaks the visual flow of the page. By keep this at a 1080 max-width and doing the margin 0 auto, you can see that it will keep our content to a desired size and will always keep it visually appealing and not an eyesore",
    "time_stamp": "2019-03-08 15:01:33"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 15:01:47",
    "edited": {
      "time_stamp": "2019-03-08 15:04:50"
    },
    "text": "That is what he is referring too when saying to use that particular CSS in his use case."
  },
  {
    "poster": {
      "poster_name": "Michael F.",
      "poster_handle": "mfields11"
    },
    "time_stamp": "2019-03-08 15:06:02",
    "text": "Thank you so much for this helpful information! <@U2H3TT8F2> This definitely gives me a more thorough understanding.. I will check out the blog. This clears up a lot of the confusion I had with this topic.."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-03-08 15:06:56",
    "text": "yea, its not to say you cant do this on a per module basis but that would cause alot of confusion when doing that. It would only be under a certain design style that you would to do that"
  },
  {
    "poster": {
      "poster_name": "Michael F.",
      "poster_handle": "mfields11"
    },
    "time_stamp": "2019-03-08 15:09:48",
    "text": "Yes.. it had led me to believe that you are always clearing the floats for areas where you want to place content..  I found myself thinking.. then what is the point of the drag and drop working with the grid system.. if you have to disable it all of the time"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-03-08 15:10:24",
    "text": "yeah, nah you don’t have to. It’s just 1 of many ways to solve a problem"
  },
  {
    "poster": {
      "poster_name": "Michael F.",
      "poster_handle": "mfields11"
    },
    "time_stamp": "2019-03-08 15:11:56",
    "text": "Thanks! <@U7SL518D6>"
  },
  {
    "poster": {
      "poster_name": "Amalia Monroy",
      "poster_handle": "amonroy"
    },
    "time_stamp": "2019-03-08 17:41:07",
    "text": "<https://e.bettertogether.tv/welcome>"
  },
  {
    "poster": {
      "poster_name": "Amalia Monroy",
      "poster_handle": "amonroy"
    },
    "time_stamp": "2019-03-08 17:41:30",
    "text": "Hey <@U2H3TT8F2> here is the link to the published page, the social icons are all the way to the bottom."
  },
  {
    "poster": {
      "poster_name": "Maisam Abbas",
      "poster_handle": "maisam.abbas"
    },
    "time_stamp": "2019-03-09 00:56:52",
    "text": "Hi friends, I am stuck in adding target=\"_blank\" property into HubSpot RSS feeds' &lt;anchor&gt; tag, I tried using jquery too, but not able to achieve this, please help me in this regard."
  }
]