[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 10:26:23",
    "text": "Not product news, but wanted to share this anyways, I’ve posted a developer blog post on how to use web components in CMS Hub. Web components can be an awesome way to make your code more DRY and fill some gaps in your design system.  You don’t need to have prior knowledge of web components to understand the article. <https://developers.HubSpot.com/blog/use-web-components-in-HubSpot-cms-development>",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-05-20 10:36:59"
      },
      {
        "time_stamp": "2022-05-20 10:42:51"
      },
      {
        "time_stamp": "2022-05-20 10:43:33"
      },
      {
        "time_stamp": "2022-05-20 10:46:15"
      },
      {
        "time_stamp": "2022-05-20 11:15:21"
      },
      {
        "time_stamp": "2022-05-20 11:16:23"
      },
      {
        "time_stamp": "2022-05-20 11:18:33"
      },
      {
        "time_stamp": "2022-05-24 08:21:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2022-05-20 10:36:59",
    "text": "Pertty kewl ideerrrs — Any idea on how much web components affect page performance?\n\nAlso — I understand the article is non-platform/framework specific, but is this a method you would recommend using on HS sites? Or would you rely mainly on macros to achieve the same effect?\n\nI personally feel like going the macro route on HS sites would be more efficient as there isn’t any scripting involved at all client side? Nothing to block page rendering etc.\n\nThoughts?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 10:42:51",
    "text": "&gt; Pertty kewl ideerrrs — Any idea on how much web components affect page performance?\nThey’re typically faster than using JS frameworks like React.\n<https://medium.com/@spkamboj/web-components-basics-and-performance-benefits-f7537c908075>\n\nAn advantage with web components too is that because they’re built on the same web standards as normal HTML elements, they automatically tend to just work with existing JavaScript frameworks like :reactjs: :vuejs: :svelte: etc.\n\nAs far as the trade off of doing things client side vs serverside. It’s a balance.\n\nIf you need to use JavaScript to make something function anyways like say an image gallery or interactive features then using a web component could be more efficient.\n\nThe neat part is the browser can do some interesting performance enhancements because it already knows how the web components are consistently supposed to be have."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 10:43:33",
    "text": "While I haven’t played with it a ton just yet, combining web components with CSS containment could also yield some interesting performance benefits at the paint level."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 10:46:15",
    "text": "So to doubleback to your question on when to use web components vs doing it serverside with macros and imports.\n\nIt’s complicated and typically the performance difference is negligible. For some use-cases fully server side rendering will be better. For cases where there’s a fair amount of interactivity anyways, that’s probably when you’ll see the most benefit."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-05-20 11:15:21",
    "text": "Noice. I’ve been going this route with newly built modules as of late.\nIt’s been fun and it keeps things clean. It definitely forces the dev to think Object Oriented with javascript… for better or for worse. 70% of the time I think for better"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2022-05-20 11:16:23",
    "text": "I don’t scope my css to the shadowRoot mainly because I use BEM and it was too complicated to quickly understand and hit the ground running :rolling_on_the_floor_laughing:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-05-20 11:18:33",
    "text": "It’s certainly a different way of thinking but can reduce the complexity of code in your modules drastically.\n\nHaha I hear you about the CSS. There are several different ways to do CSS in web components, you can actually use an external stylesheet that the JS file loads as well.\n\nI’m excited to show ya’ll something I’ve been working on with web components on HubSpot. This article is a teaser :wink:"
  }
]