[
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2019-08-06 09:51:42",
    "edited": {
      "time_stamp": "2019-08-06 09:52:57"
    },
    "text": "<@UDP810G8L> You can use the number field and display it as a slider option 0 - 100. Group together and call the module something like Section Padding."
  },
  {
    "poster": {
      "poster_name": "Scott Brown",
      "poster_handle": "scott.brown"
    },
    "time_stamp": "2019-08-06 09:52:19",
    "text": "So you’d have padding-top: 0px - 100px, padding-bottom: 0px - 100px, padding-left: 0px - 100px, padding-right: 0px - 100px"
  },
  {
    "poster": {
      "poster_name": "Brandon Eccles",
      "poster_handle": "brandoneccles"
    },
    "time_stamp": "2019-08-06 10:29:40",
    "text": "<@U3ND6HWQZ> Sorry for the late response. I’ve just realized that on almost all of the custom modules I build that I end up needing to adjust basic styling options for each instance like padding, margin, background colors, etc.. It would just be nice to have a dropdown for different sections of the module where I can apply specific styling, much like the default form module that allows me to select the form, the button, and the fields. It’s just much cleaner than adding a bunch of custom fields for every editable aspect of the module.\n\nI guess another way to explain it would be that I’d like to differentiate between the fields that control the content of the module and the fields that control the style of the module instead of lumping all of those together.\n\nEven if the default style tab isn’t an option, it would be nice to have the ability to create my own custom tabs to differentiate field groupings within my custom modules."
  },
  {
    "poster": {
      "poster_name": "Brandon Eccles",
      "poster_handle": "brandoneccles"
    },
    "time_stamp": "2019-08-06 10:33:09",
    "text": "<@UGMGP7A72> Thanks for the suggestions. This is what I am currently doing. It’s just kind of a pain since I usually end up needing to do this for each module I build. It would be nice to have an option to just include a style tab that would allow for all of this automatically."
  }
]