[
  {
    "poster": {
      "poster_name": "Joey van Gessel",
      "poster_handle": "joey"
    },
    "time_stamp": "2019-08-01 09:20:57",
    "text": "Wow. I just tried this but the things I tried (like cloning the horizontal space module for this) didn’t work."
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2019-08-01 10:32:24",
    "text": "You could build out all of those fields into custom modules. It would be a pain but you could do it and then use that module as a template to make all future templates."
  },
  {
    "text": "anybody else seeing these issues today?",
    "time_stamp": "2019-08-01 12:14:27",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-08-01 12:49:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefen Phelps",
      "poster_handle": "stefen"
    },
    "time_stamp": "2019-08-01 12:49:52",
    "text": "clearing cache fixed the issue"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-08-01 13:27:48",
    "text": "Ran into a funny workflow thing today that I am hoping ya'lls have some thoughts on. Wanted to replace our old homepage hero module with a new one, but publishing the module and the template that included it pushed it live without giving me a chance to go into the page editor and update the content. Is there a workflow where you can publish a template with new modules without publishing them to the live page? Or is it a matter of creating a new template or a new page and then pushing that page live? I am a little confused on a clean deployment process for this.",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-08-01 15:30:53"
      },
      {
        "time_stamp": "2019-08-02 07:56:26"
      },
      {
        "time_stamp": "2019-08-02 13:37:25"
      },
      {
        "time_stamp": "2019-08-02 13:37:52"
      },
      {
        "time_stamp": "2019-08-02 15:08:04"
      },
      {
        "time_stamp": "2019-08-02 15:09:47"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2019-08-01 13:28:24",
    "edited": {
      "time_stamp": "2019-08-01 13:28:34"
    },
    "text": "(I ended up just putting all the content as the default in the module so there was no downtime of the page)"
  },
  {
    "poster": {
      "poster_name": "Adam Shrum",
      "poster_handle": "adam043"
    },
    "time_stamp": "2019-08-01 14:31:29",
    "text": "Does anyone know how I can add a cta or button to my template that triggers a pop-up form for someone to subscribe to the blog?"
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-08-01 14:54:50",
    "text": "<@UCV0BC2A3> "
  },
  {
    "poster": {
      "poster_name": "Clare",
      "poster_handle": "cpak"
    },
    "time_stamp": "2019-08-01 15:05:02",
    "text": "Hey folks! We recently made the push to show modules are set to `overrideable=false` because we noticed that customers were confused when they saw modules in the editor, but couldn’t find them in the “Edit Modules” section because they’re uneditable. Though these modules are visible in the sidebar, they are not editable on the page level.\n\nLet me know if you have any feedback on this!"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-08-01 15:23:00",
    "text": "This was confusing to some clients as they were now seeing modules that weren't there before. Personally, from a dev perspective, there are often times that pieces are built inside of customers sites (especially when using coded templates) that are meant to be static and non-editable. This now causes visual clutter on the page editor with alot of modules showing with names like `module_1894038362` as this module was never meant to be accessed from the start."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2019-08-01 15:24:50",
    "text": "An example of this is <http://www.wearediagram.com|www.wearediagram.com> there are 3 modules that were built and then included in the base template by default. Now, when a page goes to get added, they see always see 3 modules with a nonsense name because they were never meant to be shown to editors. (If that makes sense)"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2019-08-01 15:30:53",
    "text": "Content Staging?"
  }
]