[
  {
    "poster": {
      "poster_name": "Neha Mehta",
      "poster_handle": "neha568"
    },
    "time_stamp": "2022-12-01 02:38:57",
    "text": "Hi Everyone,\n\nI'm currently working on a usecase wherein I need to associate custom object records with their respective companies. In order to achieve this, I have created a workflow with Custom Code action added in it. I need to execute this workflow on daily basis as new records of custom object are pushed daily.\n\nThere is a field org_id , association is done on the basis of org_id .If org_id of a custom object record matches with a companies org_id then association between the 2 records take place.\n\nCustom code action is responsible for following actions:\n1. Get a list of all companies(around 23k+)\n2. Loop over the custom object records to find matching org_ids\n3. Finally associate all records with matching org_id\nAfter scheduling the workflow to execute daily , I'm facing following issue:\n1. The custom code does not execute fully , it shows \"*error*\" in the logs stating \"*Task timed out after 20.03 seconds*\"\n\nNote: If I test the custom code action on my sandbox account , it works perfectly fine .(It has less data as compared to my production account).\n\n*Any leads on resolving these issues would be very helpful.  Thank you in advance.*",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-01 07:49:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-12-01 07:49:26",
    "text": "<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1669887553898049>"
  },
  {
    "poster": {
      "poster_name": "Ronald Mannak",
      "poster_handle": "ronald"
    },
    "time_stamp": "2022-12-01 12:39:38",
    "text": "Hi everyone,\n\nI'd like to port our SendGrid plug-in to HubSpot. Our plug-in adds a blue checkmark (a digital signature) to each outgoing email to protect or customers' users from phishing scams. However, I haven't found a way to make it work with HubSpot.\n\nThere are two ways we can sign bulk emails:\n1. Have our plug-in add the signature to each email after the mail merge / personalization and before it is send\n2. Have our plug-in fetch the template and the user database and let our plug-in handle the mail merge / personalization and have the plug-in send the emails to the HubSpot smtp server\nDoes either way seem feasible to build on HubSpot?"
  }
]