[
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-12-22 01:13:37",
    "text": "Hi everyone, I’m unsure on how to add error/exception logging in the custom code blocks of workflows. I am relatively new to coding and this is my first custom code in HubSpot, so this might be a stupid question. However, if I add logging, where does this logging show up? Where can I see it? Thanks a lot in advance",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-22 01:49:47"
      },
      {
        "time_stamp": "2022-12-22 01:53:12"
      },
      {
        "time_stamp": "2022-12-27 07:11:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Johan L",
      "poster_handle": "bnjl"
    },
    "time_stamp": "2022-12-22 01:49:47",
    "text": "Hi Stan. If you click \"Details\" right under \"Back to workflows\" in the top left corner you get to the summary of enrollments etc.\n\nClicking \"Action logs\" there will show you which actions have been triggered and next to each of them (when hovering at least) you get a button to see details.\n\nThat's where any logs will show, as well as the output fields. I usually keep some logs in different parts of my code, at least when my workflow is new, to make it easier to backtrack when something went wrong."
  },
  {
    "poster": {
      "poster_name": "Johan L",
      "poster_handle": "bnjl"
    },
    "time_stamp": "2022-12-22 01:53:12",
    "text": "<https://knowledge.HubSpot.com/workflows/understand-your-workflow-details-page>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-12-22 08:34:46",
    "text": "So meetings are an engagement tied to a contact, you would need to pull in all associate meetings and then lookup the properties for those meeting. Or you can do this in one call using graphql"
  },
  {
    "poster": {
      "poster_name": "Richard Owens",
      "poster_handle": "rich151"
    },
    "time_stamp": "2022-12-22 18:34:40",
    "text": "Does anyone have a good solution for updating line items on existing deals when a product is updated?"
  }
]