[
  {
    "text": "Hi! I am using HTML for an email that was developed in Dreamweaver (or similar). It's responsive and looks great in DW and when viewed in a browser. HubSpot's Design Manager's Preview destroys some sizing and the width of the email. Customer Support could only tell me I need to add CAN SPAM info. :upside_down_face:",
    "time_stamp": "2023-11-15 06:16:52",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-11-15 16:38:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-11-15 13:15:15",
    "text": "is there a way to modify the emails for dark mode?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-15 16:37:52"
      },
      {
        "time_stamp": "2023-11-15 19:11:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-11-15 16:37:52",
    "text": "Not with the DnD editor. Only way really is to consider the colours being used, making sure there's enough contrast, and get creative with how images are exported (i.e. includes background vs. transparent, hidden outlines around logos, etc.). Otherwise the only way to control for it is coded emails, and even then not all dark modes across email clients can completely be controlled."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-11-15 16:38:46",
    "edited": {
      "time_stamp": "2023-11-15 16:38:59"
    },
    "text": "Are you able to share the full code?"
  },
  {
    "poster": {
      "poster_name": "Angela Sze",
      "poster_handle": "angela.sze"
    },
    "time_stamp": "2023-11-15 17:48:21",
    "text": "We've just started developing a HubSpot app (initially building a private app as it seems most straightforward) and trying to test sending emails using Single-Send API. Ultimately, we're building this app for a customer who has their own HubSpot account with transactional email add-on.\n\nIs there any way we can get developer access to Single Send API to validate that our app is working as expected? Understand if it's a trial basis / very limited usage, we're looking more so we can test it. So far, we've only seen the ability to purchase a full annual Professional license + add-on to get this feature which seems unreasonable to validate this feature for a few weeks."
  },
  {
    "poster": {
      "poster_name": "Alana Caporale",
      "poster_handle": "alana"
    },
    "time_stamp": "2023-11-15 19:11:33",
    "text": "thank you!!!"
  }
]