[
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2019-10-04 10:57:11",
    "edited": {
      "time_stamp": "2019-10-04 11:58:58"
    },
    "text": "We have a potential client looking at multi-lingual website with Chinese being one of the languages. Has anyone experienced issues with a HubSpot website not rendering well or being slow within China?. I believe HubSpot uses AWS servers based out of North America and Europe? Is there any reason why a translated website would have performance issues within China that is hosted on HubSpot? For their current website setup they actually have the chinese portion of their website hosted within China on servers to avoid issues.",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2019-10-04 11:55:32"
      },
      {
        "time_stamp": "2019-10-04 11:58:26"
      },
      {
        "time_stamp": "2019-10-04 12:01:46"
      },
      {
        "time_stamp": "2019-10-04 12:09:12"
      },
      {
        "time_stamp": "2019-10-04 16:04:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-10-04 11:55:32",
    "text": "so it shows rendering issues? what kind?"
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2019-10-04 11:58:26",
    "text": "I believe performance issues is the correct term, I’ve edited for clarity. "
  },
  {
    "poster": {
      "poster_name": "Reg Desgroseilliers",
      "poster_handle": "reg"
    },
    "time_stamp": "2019-10-04 12:01:46",
    "text": "I did some digging and found a blog article that states the following for anyone else interested in the issue with hosting content outside of China. “The HubSpot CMS will not function as smoothly in China. HubSpot uses global CDN (Content Delivery Network)  servers to ensure that websites hosted with HubSpot load quickly no matter where the website is being loaded. However, this doesn’t apply to China as HubSpot do not have servers in China.\n\nWhile HubSpot CMS sites will load, any website hosted outside of China will face difficulties with loading speeds in China, and this will be a major barrier for any company seeking to start or continue marketing within China. Websites hosted outside of China are also penalised by Baidu (the main Chinese search engine) for being ‘foreign’, which can hurt organic traffic.\""
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-10-04 12:09:12",
    "text": "there is also this trade war going on. it might be the case that your issues are also a victim to those tentions"
  },
  {
    "poster": {
      "poster_name": "Snaedis Valsdottir",
      "poster_handle": "svalsdottir"
    },
    "time_stamp": "2019-10-04 16:04:29",
    "text": "Very interesting, I’d not come across this before. Thanks for sharing, <@U2H1Q3F8R>! I’d be interested in hearing how this turns out with your potential client."
  }
]