[
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2021-05-10 00:38:34",
    "text": "<@U01T4LC601X> You need the JS from the search_results module. But some parts you have to replace. For example the line 148 to 158. It’s to initialize the script with the DOM ready event. You have to trigger the script with your form submission. As well, you have to customize the search request URL, by replacing the searchParams variable with your own search query. The rest is very usefully, like the pagination with previous and next button, or the fallback if the search has no result and the micro-template for parsing and appending the result data."
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-10 00:50:05",
    "text": "Key <@UK9BKNBD5> i was trying to modify it but i have no idea why nothing was working (maybe i don't have that much experience with js), but i managed to do the feature with a different approach. i used filters upon the HubDB i pass a query param\n```{% if request.query_dict.category in regions|map('id','') %}\n        {% set queryparam = queryparam ~ \"&amp;category=\"~request.query_dict.category|urlencode %}\n      {% endif %}```\nand then i iterate the table\n```  {% set table = hubdb_table_rows(3407123, queryparam) %}\n                      {% for row in table %}```\nthis way i am getting the results form db based on column name. i don't know if this approach is a good one, but it works at the moment with minor issues :smile:"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-10 00:50:47",
    "edited": {
      "time_stamp": "2021-05-10 00:50:58"
    },
    "text": "basically i am using filters to do the search in a particular table"
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2021-05-10 00:56:03",
    "text": "Ahh, Okay, so you search your database. That is greatly done with HubL and HubDB, like your example. I thought you looking for a site-search, that’s something different."
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-05-10 00:59:20",
    "text": " I thought that i need that to lol. i am new in HubSpot and still learning. Thank you very much for the support I really appreciate it!!!"
  }
]