[
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 01:01:55",
    "text": "Hello, I left a comment in the Ideas forum describing a potential solution that’s been held in moderation since Saturday. \n\nDoes anyone know how long it typically takes to be approved?"
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-07-30 01:04:16",
    "text": "Same here. Nothing really happens",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-07-30 16:39:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ace Hedger",
      "poster_handle": "ace"
    },
    "time_stamp": "2024-07-30 04:43:02",
    "edited": {
      "time_stamp": "2024-07-30 04:54:34"
    },
    "text": "<@U03REFNRMB3> Sorry about the delay in response. I've been moved into more urgent projects for a bit and have also been traveling.\nIt seems there is a large learning surface for developers. It would be nice to have opportunity to get a broad view of it, and then deep dive into the main areas. For instance, Cards and Custom UI Extensions, Custom Code Workflow Actions, Serverless Functions and Webhooks, Programmable Email Content, Building Custom Quote Templates, the use of HubSpot's Postman Collection, etc. as an overview of the different things that can be developed on in HubSpot, then deep diving into each area. HubL, HubSpot's React Components, limitations of Custom Code Workflow Actions, etc. should all be covered.\nAlso, understanding the differences between how HubL can be used regularly vs within Programmable Email Content.\nProgramming Abandoned Cart Emails (the docs and community have had a lot of outdated ways to do this)...\nI can come up with quite a number of things. I notice that on a couple of docs for Programmable Email Content, there are videos explaining them. That would be something really helpful for the main parts or a HubSpot Academy certification that covers more... In any case, whatever it is should be consistent, broad but in-depth, and up-to-date.\nEven though I've already done many of these things, I would 100% take the classes so I understood more. Also, networking with other developers in the same community would be really useful for a lot of us, I believe."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-30 05:53:11",
    "text": "There has been an influx of spam activity in the community, so pre-moderation has been added to ideas - this is relatively new, I can check with the community managers on the queue, but based on experience, there are a lot of replies to get through from the weekend and they only work M-F so it's usually Tuesday before they get to everything.",
    "reply_count": 15,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-07-30 05:54:59"
      },
      {
        "time_stamp": "2024-07-30 06:03:36"
      },
      {
        "time_stamp": "2024-07-30 06:07:49"
      },
      {
        "time_stamp": "2024-07-30 16:40:48"
      },
      {
        "time_stamp": "2024-07-30 18:20:28"
      },
      {
        "time_stamp": "2024-07-30 18:42:48"
      },
      {
        "time_stamp": "2024-07-30 18:43:42"
      },
      {
        "time_stamp": "2024-07-30 18:44:51"
      },
      {
        "time_stamp": "2024-07-30 18:45:52"
      },
      {
        "time_stamp": "2024-07-30 18:52:48"
      },
      {
        "time_stamp": "2024-07-31 17:40:31"
      },
      {
        "time_stamp": "2024-08-01 04:21:29"
      },
      {
        "time_stamp": "2024-08-01 10:39:55"
      },
      {
        "time_stamp": "2024-08-01 10:51:19"
      },
      {
        "time_stamp": "2024-08-01 11:12:12"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-07-30 05:54:59",
    "edited": {
      "time_stamp": "2024-07-30 05:56:17"
    },
    "text": "Thanks. It affects normal forum comments as well. Waiting potential 4 days for replies to a post or question seems counter productive.\n\nCan’t you use an AI to flag posts instead?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-30 06:03:36",
    "text": "I'll pass this on to the community team, they've done a lot to counter the spam already, this is a temporary solution while the engineers work on a permanent fix. I'm a Community Champion (I don't work for HubSpot) so I don't have insight to how long it takes."
  },
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2024-07-30 06:07:49",
    "text": "Thanks Jennifer"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-30 07:45:15",
    "text": "There’s an awesome <https://events.HubSpot.com/developer/|Developer HUG (HubSpot User Group)> that covers topics both in-depth and high level. Lead by some of the best developers in the HubSpot community (<@UGDF9EBPW>, <@UJAPS2K4N>, <@UD53A9UUR>)\n\nThat would be my first recommendation, join that group!\n\nI also saw Dennis respond with an emoji! So you’re requests have gotten in the right hands!"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-07-30 07:45:38",
    "text": "Second, go through all their past events, that is some GOLD in there!"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-30 08:04:20",
    "edited": {
      "time_stamp": "2024-07-30 08:05:23"
    },
    "text": "Thank you for the very kind words <@U03REFNRMB3>!\n\n<@U05A5G5QVP1>. Those are great points. Thank you for bringing them up.\nIndeed - learning Hubl can be quite some thing, if you're new to it. The dev docs are constantly changing (and updating) since HubSpot is evolving at an extrem high pace. This can be a challenge for advanced devs as well :wink:\n\nI'd say- it like this: we, the Developer HUG, are trying to provide as much interesting content as possible but it's also quite a challenge to make everybody happy. Things that are interesting and new to Person A might be super boring and \"outdated\" to Person B...\nAs Justin mentioned, we got quite a few interesting topics already covered. You can watch them all here: <https://www.youtube.com/@HubSpotDevelopers/streams>\n\nAlso - I might do something in the near future that might help you (and everybody else) with \"How to get started with Hubl\" in a more detailed way. But for now: :no_mouth:"
  },
  {
    "poster": {
      "poster_name": "Ace Hedger",
      "poster_handle": "ace"
    },
    "time_stamp": "2024-07-30 08:06:05",
    "text": "Thank you all! Looking forward to learning more."
  },
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 16:39:51",
    "text": "Interesting, I guess were all in limbo. Thanks for sharing your experience as well."
  },
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 16:40:48",
    "edited": {
      "time_stamp": "2024-07-30 17:14:03"
    },
    "text": "This is the most helpful answer I've heard so far, thank you Jennifer. It's understandable that there's a spam backup after starting work monday. I'll just sit tight and see how it goes."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-30 18:20:28",
    "text": "I've also shared this thread with the community team to see if there's anything else they can do in the interim."
  },
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 18:42:48",
    "text": "Thank you very much Jennifer. No hurry, it sounds like the team has it's hands full. :sweat_smile:"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-30 18:43:42",
    "text": "You're welcome, and happy to help anytime! If you are active in the community, it might be worth applying to become a community champion"
  },
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 18:44:51",
    "text": "Oh interesting, I'm new to the forums so wasn't aware of this. I will look into it. :reading-face:"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-30 18:45:52",
    "text": "Let me know if you can't find it and I can grab the link"
  },
  {
    "poster": {
      "poster_name": "Ken Fisher",
      "poster_handle": "wd"
    },
    "time_stamp": "2024-07-30 18:52:48",
    "text": "Found it! Applied here <https://offers.HubSpot.com/community-champions> :white_check_mark:"
  }
]