[
  {
    "poster": {
      "poster_name": "Mark Lerner",
      "poster_handle": "mark595"
    },
    "time_stamp": "2022-03-03 08:02:49",
    "text": "Hey folks, we have a webinar coming up with the HubSpot community. If you or your colleagues are a HubSpot admin, there will be some great insights in this one <https://offers.HubSpot.com/how-to-build-a-modern-deal-desk-in-HubSpot>"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-03-03 10:38:49",
    "text": "So <@U7SL518D6> <@UD53A9UUR> and I were having a discussion around previous jobs we have had and one of the topics came up of graphic design. We’ve all had experience with having to take pictures of people and products and we wanted to share this question out to you all as something fun to discuss.\n\nOur question to you: “What is the oddest request you have gotten when being asked to touch up photos?” Our answers are in the thread :thread:",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-03-03 10:40:31"
      },
      {
        "time_stamp": "2022-03-03 10:44:04"
      },
      {
        "time_stamp": "2022-03-03 10:45:41"
      },
      {
        "time_stamp": "2022-03-03 10:48:55"
      },
      {
        "time_stamp": "2022-03-03 10:51:57"
      },
      {
        "time_stamp": "2022-03-03 11:02:24"
      },
      {
        "time_stamp": "2022-03-03 11:57:24"
      },
      {
        "time_stamp": "2022-03-03 11:57:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-03-03 10:40:31",
    "text": "mine is:\n&gt; Hey this looks great, but can you take this person here and rotate them so they are looking more towards this item.\nSure, let me just time travel to when this photo was taken and then ask the person “can you turn left a little more”"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-03-03 10:44:04",
    "text": "I used to do photography for a sleepwear and lingerie company in NYC.\n\nNot sure if it is the oddest as it is pretty standard in this world, but if you arent in this word, it might make you a little uncomfortable as a retoucher.\nI had never heard of \"pasties\" before, but i after doing a bra shoot, i would have retouch out the unmentionables :blush: which the pasties were supposed to help with hiding.\n\nImagine a large display zoomed in on that area"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2022-03-03 10:45:41",
    "edited": {
      "time_stamp": "2022-03-03 10:46:38"
    },
    "text": "Haven’t quite had that significant of an odd photo retouching request, but I did have someone send me hours of handheld footage from 1 angle for a video ad that was going to be condensed down to about 4 minutes, and the whole time a logo for their competitor product was in the shot  and took up more than 20% of the shot and occasionally was moved around. Also the actors walked in front of it and even moved it a few times (to get at different other props)\n\nThey asked me to remove that item from the video footage without so much as a photo of the scene without the logo in it.\n\nThat was rough."
  },
  {
    "text": "on the plus side to this job, i did get to bring my dog to work :slightly_smiling_face:\nhe got to be in some shoots which reminds me of something else on him that i had to edit out....",
    "time_stamp": "2022-03-03 10:48:55"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-03-03 10:51:57",
    "text": "somehow, i feel like <@U26BLKGE4> has a story"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-03-03 11:02:24",
    "text": "I’ve honestly mostly had positive experiences actually doing photo work, thankfully. One experience that does comes to mind, though, is at a former agency we worked with a plumbing company, and when one of my coworkers wives accidentally lost a “shower shroom” down the drain, we found ourselves doing a last-minute plumbing photoshoot in their en suite. The irony of bringing a bunch of equipment to film a plumber next to their bedroom was not lost.\n\nOn a related note, plastic surgery website design is in a category all its own. You never quite look at “before and after” slider modules quite the same way…"
  },
  {
    "time_stamp": "2022-03-03 11:57:24",
    "text": "plumber's butt"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2022-03-03 11:57:37",
    "text": "now i know what you had to retouch"
  },
  {
    "poster": {
      "poster_name": "Brandon Matthews",
      "poster_handle": "bmatthews"
    },
    "time_stamp": "2022-03-03 12:25:04",
    "text": "Bummer, but ok. Thanks."
  }
]