[
  {
    "poster": {
      "poster_name": "Nick Verwymeren",
      "poster_handle": "nick759"
    },
    "time_stamp": "2022-03-18 07:35:51",
    "text": "When requesting access to the GraphQL beta, should I be testing this out on a developer test account? Or is it fine to request access on a production account? I’d rather use it on real data, but the beta label has me a bit reluctant to activate it on a production account.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-18 08:17:45"
      },
      {
        "time_stamp": "2022-03-18 08:45:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-03-18 08:17:45",
    "edited": {
      "time_stamp": "2022-03-18 08:25:59"
    },
    "text": "Turning it on in your production account will not impact your account in any way. You can play around with it in test files and in the GraphiQL explorer without impacting your production files/website."
  },
  {
    "poster": {
      "poster_name": "Nick Verwymeren",
      "poster_handle": "nick759"
    },
    "time_stamp": "2022-03-18 08:45:25",
    "text": "Great thanks!"
  },
  {
    "poster": {
      "poster_name": "Nick Verwymeren",
      "poster_handle": "nick759"
    },
    "time_stamp": "2022-03-18 09:00:47",
    "text": "Also, just wondering about GraphQL and why it’s tied to CMS hub? I would like to just start using Graphql instead of rest for general api queries. Is there a reason this feature is tied to CMS pro and enterprise users? Maybe I’m misunderstanding its use case.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-03-18 13:13:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "William Spiro",
      "poster_handle": "wspiro"
    },
    "time_stamp": "2022-03-18 13:13:36",
    "text": "Great question! The primary use case we are focusing on right now is for using any of your data in CMS content/emails, or for using HubSpot as a headless datastore. Obviously, a GraphQL API can be useful for many other applications, and we may open it up to more Hubs/tiers in the future, but for now, we are focusing on the CMS use case."
  }
]