[
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2022-03-08 02:51:12",
    "text": "dear <@U6W3H6YN8> and community I'm using *crm_object* to get a Rich Text property but when I'm getting this property HTML is not rendering. Is it a limit of HubSpot right now ? because I know that Rich Text property is quite new",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-03-08 03:03:18"
      },
      {
        "time_stamp": "2022-03-08 03:07:21"
      },
      {
        "time_stamp": "2022-03-08 06:14:19"
      },
      {
        "time_stamp": "2022-03-14 08:25:37"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-03-08 03:03:18",
    "text": "Are you retrieving this in a page or an email?"
  },
  {
    "poster": {
      "poster_name": "LOIC BURDET",
      "poster_handle": "loic_burdet"
    },
    "time_stamp": "2022-03-08 03:07:21",
    "text": "In a page\n\nif I'm getting the Custom Object in JS i've my property *with* HTML\n\nbut if I'm getting the Custom Object in HubL i've my property *wihtout* HTML"
  },
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-03-08 06:14:19",
    "text": "I’m not familiar with that area but is there an option to disable formatting when retrieving the object? That may have an impact"
  },
  {
    "poster": {
      "poster_name": "Benjamin Jaffe-Talberg",
      "poster_handle": "ben.talberg"
    },
    "time_stamp": "2022-03-08 09:08:44",
    "text": "Hello y'all. I'm trying to design a multi-tenancy like experience within HubSpot. We support a large network of micro-schools, and I'd like to allow each school team to be able to log into HubSpot to update/design their own website. Part of my design concept is to allow them to use HubDB to input teacher profiles, board profiles, default school info, etc which the shared site modules I create could pull from. I know that Teams can be used to allow/restrict access to specific HubDB tables. But what I'd really like is the ability to limit the data each team can access to just the data they've created. One way I might do this in other tools (think Postgres) would be to use table inheritance or row level security. Is something like this possible in HubDB? (Note, I've considered creating separate HubDB tables for every school, but that's less than ideal for a number of reasons, e.g. schema updates, module design, querying all records, etc.)"
  }
]