[
  {
    "poster": {
      "poster_name": "Daniel Hardy",
      "poster_handle": "daniel071"
    },
    "time_stamp": "2022-04-04 10:01:51",
    "edited": {
      "time_stamp": "2022-04-04 10:03:44"
    },
    "text": "Hi. I'm probably not the first person to join the slack and ask this, but from a search I can't find any previous examples. I'm doing my CMS for Developers Practicum and i'm stuck on this section....\n\n_Drag and drop area_\n• _Must have two columns with an image module and a rich text module._\n• _These modules must have default content set inside the template_\n... it appears to want me to set-up a basic two column layout in my template, so that I can set the default content, but it's also showing the accompanying gif use of the content editor to change the column widths dynamically, which as far as I was aware wasn't something that could be done if I've setup the layout in the template already. Am I missing something?\n\nThanks in advance.",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2022-04-04 10:05:26"
      },
      {
        "time_stamp": "2022-04-04 14:43:35"
      },
      {
        "time_stamp": "2022-04-05 02:50:13"
      },
      {
        "time_stamp": "2022-04-05 12:46:25"
      },
      {
        "time_stamp": "2022-04-06 02:35:11"
      },
      {
        "time_stamp": "2022-04-07 17:55:52"
      },
      {
        "time_stamp": "2022-04-08 05:29:28"
      },
      {
        "time_stamp": "2022-04-08 10:51:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Bradon Gamor",
      "poster_handle": "bradongarley"
    },
    "time_stamp": "2022-04-04 10:05:26",
    "text": "Hey Daniel, once you setup the template with the correct DND code, you’ll be able to adjust column widths in the editor. What’s the part you’re having issues with?"
  },
  {
    "poster": {
      "poster_name": "Brooke Bond",
      "poster_handle": "bfisher815"
    },
    "time_stamp": "2022-04-04 14:43:35",
    "text": "Hi <@U03A2BZ3REG>, when you set up CSS, you can use the layout.css from the CMS boilerplate. That will set up columns to shrink/grow like they do in the gif you're talking about"
  }
]