[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-16 04:12:03",
    "edited": {
      "time_stamp": "2018-07-16 04:24:19"
    },
    "text": "<@U26B530N6>, <@U22PNRAJD>?\n\nsomeone else I can ask to?"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2018-07-16 04:24:54",
    "text": "and another question:\nIs it possible to swap the template with the API?\n(published pages, or content staging if we have that API available)"
  },
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-07-16 12:22:32",
    "edited": {
      "time_stamp": "2018-07-16 12:25:15"
    },
    "text": "Anyone messed around with any of the Sales APIs, specifically maybe with Zapier? Got asked to try and set up a workflow or other type of automation to duplicate a deal across multiple contacts (so the sales team knows who within a company is most likely to eventually close). I'll be honest, haven't worked much with the sales side of HS much so I'm not as familiar with how things work. The person on the account tried to use a trigger of setting a \"duplicate deal\" ~contact~  property (EDIT: looks like this property was on the deal, not the contact) to create a new deal, which worked, but it didn't copy the fields of the original trigger deal. I then swapped out the \"create new deal\" action with a Zapier webhook, but the payload was all contact info and I didn't see a property that might have a key to the original Deal ID. Anyone have any leads?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-07-16 13:09:06",
    "text": "sales :shrug:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-07-16 13:40:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-07-16 13:40:15",
    "text": "Amen."
  },
  null,
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-07-16 14:54:35",
    "text": "For those interested, I think I found a workaround. Rather than using the HS Workflows tool to create a webhook, I created a \"duplicate\" deal stage in the pipeline editor and used the built-in Zapier trigger for \"when deal enters new stage, ____.\" This gave me a payload for the deal rather than the contact, along with the associated HS VID and associated company for the contact. I think this should get me close enough."
  },
  null
]