[
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 10:08:12",
    "text": "This bug has been here awhile: <https://spin.d.pr/aNCmbc+>\n\nWhen typing in the help text field text gets deleted as you’re typing. It appears to happen when a custom module autosaves.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-09-11 12:34:01"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 10:18:18",
    "edited": {
      "time_stamp": "2018-09-11 10:22:54"
    },
    "text": "I realize this is a really advanced thing but I’d love it if we could have AND OR conditions for conditionally displaying fields.\n\nExample: I have a UI where if a certain field is filled in another field becomes pointless. I can’t hide it however as I have a different conditional set to hide it because the field is dependant on another field being filled in. Both conditions are needed to be right for this field to actually be useful.\n\nAdding this would allow for significantly more powerful modules while preserving easy editing for editors as we could add all the options needed but keep the options minimal making it feel less daunting.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-09-11 12:48:14"
      },
      {
        "time_stamp": "2018-09-11 12:48:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 10:31:58",
    "edited": {
      "time_stamp": "2018-09-11 10:32:36"
    },
    "text": "I think this has also been suggested before: would be awesome to be able to set individual field groups to be expanded or collapsed by default.",
    "reply_count": 12,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-09-11 12:49:47"
      },
      {
        "time_stamp": "2018-09-11 13:01:25"
      },
      {
        "time_stamp": "2018-09-11 16:14:35"
      },
      {
        "time_stamp": "2018-09-11 16:16:42"
      },
      {
        "time_stamp": "2018-09-11 16:31:55"
      },
      {
        "time_stamp": "2018-09-11 19:21:04"
      },
      {
        "time_stamp": "2018-09-11 19:26:39"
      },
      {
        "time_stamp": "2018-09-12 07:44:34"
      },
      {
        "time_stamp": "2018-09-12 07:48:03"
      },
      {
        "time_stamp": "2018-09-12 07:50:37"
      },
      {
        "time_stamp": "2018-09-12 16:59:07"
      },
      {
        "time_stamp": "2018-09-12 17:56:44"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-11 12:34:01",
    "text": "Thanks for reporting, I can (sometimes) reproduce this. Opening an issue!"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-11 12:48:14",
    "text": "We've been wanting to support multiple display conditions for a while, it will be tricky to add because we'd need to change the schema for fields to support multiple conditions but there are already a bunch of existing fields out there with the current single-condition schema. I will still open an issue for this but can't promise that this could be done any time soon"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 12:48:56",
    "text": "understood, love that you guys have been thinking about it"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-11 12:49:47",
    "text": "Funny you should mention it because we've been thinking about adding this for a while, but also we just recently changed how field groups render. In fact if you look at a group now in a module form it should not be using the accordions - we've still been thinking about adding the ability for devs to control how their groups display"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 13:01:25",
    "text": "Related - it’d be nice if devs could add a “Help rich text” field that’s not a user facing field, it’d be a way for developers to add text information inline to explain things to marketers.\n\nHelp text as you have it is fabulous, it’s just once you get to more complex stuffit’d be nice to be able to do that."
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-11 16:14:35",
    "text": "Interesting, I could see wanting to put in more sophisticated help text - what do you mean \"not user facing\"?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 16:16:42",
    "text": "Not editable in the page editor only readable. Sorry poor choice of words"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 16:31:55",
    "text": "So basically a rich text field in the design manager but where that field is in the page editor is just the output. Formatting options and ability to have links would be important"
  },
  null,
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-11 19:21:04",
    "text": "Ahh I see, so like a paragraph with your module form that is just static text to the marketer. I can talk it over with Shawn and co, curious to get their thoughts. Thanks for the suggestion!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-11 19:26:39",
    "text": "Correct. And i think itd be nice for it to also be able to be conditionally shown and placeable in groups like normal fields."
  }
]