[
  null,
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 07:44:34",
    "text": "Also <@U7P6G42AX> on the groups collapsing and whatnot, I think giving developers the ability to set whether it’s visually shown like they currently are vs collapsible is honestly a great idea.\n\nHere’s a use-case:\nMy team builds modules and our modules often have “advanced settings” ones that not every marketer is going to use. These settings basically give finer tune control over aspects of the modules. We like having these settings collapsed by default as it makes the modules feel easier to use and less daunting to marketers."
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-12 07:48:03",
    "text": "Sure - one of the reasons we moved away from accordions was to make modules less daunting to marketers by cutting down on the vertical height. But yeah I definitely understand wanting that power to control whether or not to show the group's children inline or \"collapsed\" with that button. We are still actively discussing the grouping pattern (and the ability to control how groups display) so there could definitely be some updates there soon. I will link to your feedback here in that discussion"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 07:50:37",
    "text": "Yea, completely understand that rationale, still 100% in love with the way you guys are doing fields and groups and stuff, giving us that kind of control over the UI for marketers is immensely helpful. The marketing teams I work with love the simpler and more useful UI’s we can give them."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2018-09-12 08:07:17",
    "text": "for custom modules, is it possible to use regular expressions _in the html+ hubl_ section? I know we can in the fields, but I am interested in using it in the actual edit pane."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-12 09:02:41",
    "edited": {
      "time_stamp": "2018-09-12 09:03:08"
    },
    "text": "<@U7P6G42AX> Was talking through doing a common UI for our modules and we all kinda had the same feedback on the slider input: We love the UX of a slider, but having the number field above increases the height of the field, resulting in more scrolling in the edit modules pane. Also visually making things seem more complicated than they are.\n\nAnother way this could be displayed is to have the current value in the sliders handle, and on drag that handle grows to make it easier to see the number. if say a user wants to type a specific number, perhaps they could click right on the handle and not drag. that would allow typing\n\nDoing away with the need for the text field alltogether.\n<https://spin.d.pr/qTuQcH+>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-09-12 14:08:59"
      }
    ]
  },
  null,
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-12 14:08:59",
    "text": "Gotcha - yeah I think we played with the idea of putting the number input to the right of the slider so it was one line but that was a little smushed. I could open an issue and have one of our designers take a look when he is back from vacation"
  },
  {
    "poster": {
      "poster_name": "Josh Ames",
      "poster_handle": "josh.ames"
    },
    "time_stamp": "2018-09-12 16:59:07",
    "text": "<@U7P6G42AX> Is any of this actively being looked into? I was working through some previously built custom modules today and I see that some have now been grouped into an extra clickable section (which I actually really like!) but then others are still in the \"older\" format of being displayed with the rest of the modules. And I can't seem to find any option to choose which of them I want. Happy to provide screenshots if needed of the 2 versions I'm seeing."
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2018-09-12 17:56:44",
    "text": "Yes please provide screenshots, no one should be seeing accordions"
  }
]