[
  {
    "text": "Would be cool to have an edit button on the page, that would bring you to the module in the IDE",
    "time_stamp": "2018-09-27 08:55:03",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-09-27 08:58:08"
      },
      {
        "time_stamp": "2018-09-27 09:01:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Parag Jagdale",
      "poster_handle": "parag"
    },
    "time_stamp": "2018-09-27 08:57:14",
    "text": "^ but it should be permissioned so that a non-developer  won’t see the button. I wouldn’t want people playing around in there that shouldn’t be :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-27 08:58:08",
    "text": "Actually for global modules it’d be better if they went back to having a marketer focused interface for editing them.\n\nIn the old days they were available in a special location for marketers to be able to easily edit.\n\nNow you have to go into the design manager which makes the marketers go “oh gawd, there’s like, code and stuff over here, I’m bailing”"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-27 09:01:02",
    "edited": {
      "time_stamp": "2018-09-27 09:01:44"
    },
    "text": "Been discussing with Talia on the page editor team adding something that would enable us through the chrome extension to enable a button on all modules in the page editor that would take you to the module in the design manager.\n\nThis is more likely to happen as they’re starting to realize there are different roles and giving marketers too easy of access to the design manager can scare them AND allow them to break things.\n\nHS doesn’t have a system that makes sense yet for this(even through permissions) so there is a possibility they will give us the info we need to be able to do this through the extension before they make a major user role type change to allow this on their end.\n\nIt’s been discussed internally at HS but I don’t have any news beyond that."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2018-09-27 11:38:15",
    "text": "ISSUE: `control/cmd z` is not working in the *additional &lt;head&gt; markup* field"
  }
]