[
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-02-21 06:26:13",
    "edited": {
      "time_stamp": "2025-02-21 06:28:12"
    },
    "text": "anyone else having problems with the CLI this morning.  Everything has been running fine up until this morning when I started seeing weird behavior when trying to run hs project dev.  It would load and then immediately do a cleanup and exit.  Before that happened, it was telling me my account didn't have the App Functions scope and that new functionalty may not work.  So I deleted my personal access key and created a new one that includes the scope.  That is when everything got worse.  So I deleted my project and tried to reupload.  Now I am getting the following error when I run hs project upload:\n\n _A HubSpotAuthError has occurred. Error while retrieving new access token: Couldn't find a refresh token for user nnnnnnn. Generate a new token and make sure the request is coming from an authorized user of account nnnnnnnn, then try again._\n\nThis is happening in a developer test account.\n\nI have regenerated my personal access key again (multiple times).  And I downgraded the CLI back to version 6 from 7.  Still getting the errors.  Any suggestions?  <@U01QVR44MEY> <@U03REFNRMB3>",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2025-02-21 06:48:38"
      },
      {
        "time_stamp": "2025-02-21 07:53:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2025-02-21 06:48:38",
    "text": "Ok, this seems to be an issue only with this particular test account.  Other projects in other test accounts work fine.  Very strange how this might have happened though."
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2025-02-21 07:53:52",
    "text": "yea that’s very odd. When I get token issue, I run `hs auth` again and make sure it’s up to date within HubSpot.config.yml file."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2025-02-21 10:44:50",
    "edited": {
      "time_stamp": "2025-02-21 10:45:10"
    },
    "text": "Hey all. sorry for slow response here. Support ticket was a good way to approach this, so persuing that is not a bad approach, another way though to get it in front of the team. File a GH issue <https://github.com/HubSpot/cms-react/issues>\n\nI realize that the code for the server bit isn’t technically in that repo as far as I can see but I don’t see the repo publicly visible just what shows on npm.\n\nThen for everyone else who’s also experiencing this, upvote it with emojis to help communicate how many folks are seeing it/demand"
  }
]