[
  {
    "poster": {
      "poster_name": "Bernardo Salazar",
      "poster_handle": "bernardo"
    },
    "time_stamp": "2022-02-11 10:38:27",
    "text": "Hi <@U2H3TT8F2>, there are still many in the review queue and the dates on DevPost remain the same. Any good news?"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2022-02-11 13:11:08",
    "text": "We will be sending out an update via devpost today on this. Please make sure to be on the lookout :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Bernardo Salazar",
      "poster_handle": "bernardo"
    },
    "time_stamp": "2022-02-11 13:13:43",
    "text": "Yeah :sunglasses: thanks <@U2H3TT8F2> "
  },
  {
    "poster": {
      "poster_name": "Bernardo Salazar",
      "poster_handle": "bernardo"
    },
    "time_stamp": "2022-02-11 13:14:36",
    "text": "Update Devpost: Hi all,\nWe’ve received feedback about confusion regarding the “Marketplace submission” period in the rules, and thus we’ve made the following clarifying updates to the rules and schedule:\n\nThe judging period will encompass all of February, and we’re eliminating the Marketplace Approval period as a standalone phase.\nWe’re reminding all participants that submissions are being judged on their state according to the contest close date, January 31st. Some modifications may be required for final acceptance of submissions into the marketplace. More details are in the “Modifications after the Submission Period” section of the rules.\nWe’ll announce semi-finalists on February 28th, and prize winners on March 8th, per the challenge schedule.\n\nWhile not all of you can be prize winners of the challenge, we’d love to get as many themes submitted into the HubSpot Asset Marketplace as possible, so be sure to review any feedback provided in the coming weeks and understand if your theme is missing requirements or elements which prevent it from being accepted into the marketplace.\n\nQuestions?\n\nIf you have any questions about the hackathon, please post on the discussion forum."
  }
]