[
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2023-02-02 05:01:25",
    "text": "Working on adding a router for \"internal\" routes in kind of an App style. In localhost when I load the single module that is my entire app, the route is `/module/App` which makes sense in this dev context. When I try to move to production I think that route needs to be `/`? Do I use an environment check or something along those lines for that?",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-02-02 06:49:27"
      },
      {
        "time_stamp": "2023-02-02 06:54:20"
      },
      {
        "time_stamp": "2023-02-03 08:57:22"
      },
      {
        "time_stamp": "2023-02-03 09:03:35"
      },
      {
        "time_stamp": "2023-02-03 09:03:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2023-02-02 06:32:42",
    "text": "using routes definitely introduces a few issues, I assume I'm doing some key thing wrong. Is react router-6 supported server side? Do I need to use hash or one of the others?"
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-02-02 06:49:27",
    "text": "Good morning Andrey .. there's a bunch to unpack here\n\n• How to handle client side routing in the dev server\n• How to handle client side routing on a page\n• How to handle \"Server Side\" routing in those contexts as well\nWhile there _may_ be some way you could work around these various contexts to achieve the kind of \"SPA\" style routing I think you are after ... The current world partial/module building blocks in this beta are intentionally not a Single Page App. There are various reasons for this approach.\n\nFor your specific use case, I would recommend client only routing which is based on a Hash. The biggest reason is because if you were doing client side routing without a hash, and then hit that url as a page refresh our rendering infrastructure wouldn't understand that route."
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2023-02-02 06:54:20",
    "text": "alright, I'll give that a shot. thanks"
  }
]