[
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-02-14 07:41:31",
    "text": "We do not have any solid plans to support other frameworks at this time. However, we certainly are interested in feedback around what frameworks/use cases you might have in mind."
  },
  {
    "poster": {
      "poster_name": "Matthew James",
      "poster_handle": "matthew929"
    },
    "time_stamp": "2023-02-14 07:42:40",
    "text": "Vue js is a big one. It’s very large in a lot of developing communities"
  },
  {
    "poster": {
      "poster_name": "Byron Matto",
      "poster_handle": "bmatto"
    },
    "time_stamp": "2023-02-14 07:48:56",
    "edited": {
      "time_stamp": "2023-02-14 07:48:59"
    },
    "text": "For the Client Side Rendering (CSR) cases - yes."
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-02-14 08:03:21",
    "text": "+1 for vue"
  },
  {
    "poster": {
      "poster_name": "Jerred Hurst",
      "poster_handle": "jerred"
    },
    "time_stamp": "2023-02-14 08:22:25",
    "text": "+1 for vue"
  },
  {
    "poster": {
      "poster_name": "Timothy Finley",
      "poster_handle": "tfinley"
    },
    "time_stamp": "2023-02-14 08:43:40",
    "text": "Thanks for the feedback. We’re aware of Vue and its growth of the years, though I will say that our perspective now is to go _deep_ instead of _broad_. From purely a single dev’s view, there understandably is a desire for “just let me build with the tools I want”. And that is totally reasonable! \n\nHowever, our choice of focusing on a single framework is more than about developer preference, it is about the whole HubSpot ecosystem and all our of various customers and roles. In some cases we have customers that have their website entirely built and customized by single developer or agency. But we also have non-developers that build some of their website and then get some help from the marketplace or partners later. Or those that start one way and switch to another years later.\n\nAnd one of the costs of an open ended ecosystem (beyond the multiplicative effort to build it) is that the ecosystem is fragmented. Our internal and default components will be built on framework X, some devs will build with Y, some customers will bring existing content with framework Z to the table, and then later others will want to add new features with framework J. And on the web, there is serious performance and maintenance cost to all of that layering of frameworks. Especially for our customers that can’t afford the time or energy to refactor and rebuild their website again and again over the years. And our hope is that focusing primarily on a single framework will make our ecosystem more cohesive and make our customers websites faster &amp; more adaptable in the future.\n\nSo apologies for the long-winded explanation. I’m definitely not trying to say you are wrong. And I’m not trying to say Vue is bad or that you can never use it. We definitely want devs to be able to control their HTML and kick off any client side code they’d like. However, we’re focused first on getting to a deep and rich experience and server+island+client component system to power the HubSpot CMS, give our devs a better choice than HubL, and enable our customers to have quality, performant websites. And we think the best route for that is for us to focus on React for the foreseeable future. \n\nHopefully that gives you some context where we’re coming from. And thanks again for giving this private beta a shot! :HubSpotheart: "
  },
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Colby Schneider",
      "poster_handle": "colbyschneider"
    },
    "time_stamp": "2023-02-14 12:50:08",
    "text": "Thanks for the add <@UCBDLK6SU>",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-02-14 12:52:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Charles Boamah",
      "poster_handle": "cboamah"
    },
    "time_stamp": "2023-02-14 12:52:34",
    "text": ":wave: Colby, I added you into the channel and the JS Rendering private beta. I sent you an email with setup instructions but they’re also pinned to this channel.\n\nLet me know if you have questions getting set up."
  },
  null,
  {
    "poster": {
      "poster_name": "Matias Vad",
      "poster_handle": "matias618"
    },
    "time_stamp": "2023-02-14 14:54:49",
    "text": "I’m also a +1 for Vue, but this is a great answer me explanation about the reasoning behind.\nI’m overly excited that this is happening, regardless of framework.\nGreat work!"
  }
]