[
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2023-04-25 06:41:55",
    "text": "Hi Ankit Rana, The most important details in this text are the steps to troubleshoot the issue of \"There was a problem loading the page. Please try again later\" when uploading a theme to the HubSpot Marketplace. These steps include 1. Checking your internet connection, 2. Clearing your browser cache and cookies, 3. Ensuring that your theme meets the HubSpot Marketplace requirements, 4. Accessing the Marketplace from a different browser or device, 5. Recording a screencast of the issue occurring with the Chrome Network tab open in your browser, and 6. Connecting with HubSpot Technical Support for real-time assistance. These steps can help identify and resolve the issue causing the error message."
  },
  {
    "poster": {
      "poster_name": "Ankit Rana",
      "poster_handle": "ankitankirana243"
    },
    "time_stamp": "2023-04-25 06:42:57",
    "text": "Okay <@U0133LK9GP9> Thanks!"
  },
  {
    "poster": {
      "poster_name": "Ankit Parmar",
      "poster_handle": "ankit897"
    },
    "time_stamp": "2023-04-25 06:44:20",
    "text": "Welcome! <@U054RM9GRFV>"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2023-04-25 09:35:57",
    "text": "<https://HubSpotdev.slack.com/archives/C2YH119N2/p1682429507792679|cross posting here>"
  },
  {
    "poster": {
      "poster_name": "Michael Brumm",
      "poster_handle": "michael.j.brumm"
    },
    "time_stamp": "2023-04-25 11:31:11",
    "text": "Hello all,\n\nNeed some quick assistance, if possible. I'm jumping on a call in 15 minutes to talk to a client who will be asking about 3 customized HS landing page templates for the following: eBooks, Getting Started and Contact Us. It's been years since I worked with HS landing pages.\n\nIs it still possible to create separate 1 header module and 1 footer module that match their Wordpress site that can be placed in the above templates and any future implementations?\n\nUpdates made to the either module will automatically be applied on any landing page.\n\nNormally, I'd dig into this, but timing is short. If you have any links that would be helpful.\n\nThanks in advance.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-04-25 11:40:47"
      },
      {
        "time_stamp": "2023-04-25 14:55:42"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michael Brumm",
      "poster_handle": "michael.j.brumm"
    },
    "time_stamp": "2023-04-25 11:40:47",
    "text": "Digging around.\n\nI think I found a possible solution.\n\nTo build the individual Header and Footer files\n\n1. Marketing &gt; Files and Tempaltes &gt; Design Tools\n2. File &gt; NEW\n3. HTML + HubL\n4. What are you building?  Select 'Template Partial'\n5. Type: Select 'Global Partial'\nThe header file currently uses Vue to handle the different states. I can convert this to vanilla javascript for this implementation. Any advice/tips for inclusion of JS?"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2023-04-25 14:55:42",
    "text": "I would do it as a global mode, not a partial"
  }
]