[
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-03-03 11:43:11",
    "text": "We have GDPR and Double Opt-In Features enabled for our website/marketing. When a customer receives the confirmation email it requests they click the Confirm button. After they click this I would like them to see their email preferences. What is the best way to take them to manage their preferences? The system module is not available as a web page which is what the confirmation page has to be.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-03-03 13:32:33"
      },
      {
        "time_stamp": "2020-03-03 13:35:01"
      },
      {
        "time_stamp": "2020-03-03 14:03:26"
      },
      {
        "time_stamp": "2020-03-03 14:14:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2020-03-03 13:32:33",
    "text": "Where does the confirm button currently take them?"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-03-03 13:35:01",
    "text": "You are required to create a web page before you can turn that on.  Right now I just have a basic thank you for confirming your subscription."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2020-03-03 14:03:26",
    "text": "Gotcha! And you want to show them their email preferences, as in the subscription types to opt in/out?"
  },
  {
    "poster": {
      "poster_name": "Jayme Welch",
      "poster_handle": "jayme.mcclellan"
    },
    "time_stamp": "2020-03-03 14:14:17",
    "text": "For GDPR Compliance, when a user fills out any form on the website, they are sent an email to confirm that we may store their data and interact with them via email.\n\nOnce they click the confirm button, I would ideally like them to see their email subscription preferences so they see they are subscribed to receive Sales Emails about their request and also select other emails they may be interested in (this is a typical process of most email programs).\n\nIt would just be ideal if the confirm button could confirm their initial subscription and take them to the system page for Manage Preferences."
  }
]