[
  {
    "text": "Having issues trying to re submit my theme. Says there is an error in my css file, but when I click through there is nothing....",
    "time_stamp": "2020-08-21 12:26:34",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-08-24 09:41:28"
      },
      {
        "time_stamp": "2020-08-24 10:19:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2020-08-21 13:14:59",
    "text": "Thanks <@U3T21PDBK>! The way HubSpot handles images makes them frequently blurry, so I was trying to avoid that if at all possible. I wish we had more control over how we load images, the automatic thing isn’t great when it doesn’t work right."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2020-08-21 13:16:03",
    "text": "FWIW, we use custom image modules in our theme and we take complete control over it"
  },
  {
    "poster": {
      "poster_name": "David Roma",
      "poster_handle": "droma"
    },
    "time_stamp": "2020-08-21 15:17:40",
    "text": "Thanks yup ended up adding the button code directly into the Theme module. A slight bummer the code will have to maintained in 2 places but hey it could be worse."
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2020-08-21 16:43:37",
    "text": "Not sure if you're using the boilerplate or if you added fields to the theme settings. The theme settings data still has to be incorporated into a CSS file. with the boilerplate, the theme-overrides.css file is a good place to start. 2) Theme changes made in the theme editor have to be published. Did you click the publish button in the top right?"
  },
  {
    "poster": {
      "poster_name": "Noel Williams",
      "poster_handle": "noel.williams"
    },
    "time_stamp": "2020-08-21 21:28:06",
    "text": "While I like aspects of the new Theme system, code duplication seems to be a challenge.  Making things easier for Marketers in the page editor leads to duplication of modules if you have multiple themes. I added an Idea to the community for sub-themes. Help get it moving by giving it a vote. <https://community.HubSpot.com/t5/HubSpot-Ideas/Sub-Themes-as-a-way-to-share-assets/idi-p/359420>"
  }
]