[
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2020-08-31 08:55:27",
    "edited": {
      "time_stamp": "2020-08-31 09:01:36"
    },
    "text": "I love HubSpot Themes and the potential they have for the future! That said, there are a lot of good suggestions for HubSpot Theme Improvements and here are my TOP 4 right now that (I think) need to be addressed sooner rather than later…\n\n1. *Add custom classes and Custom ID’s as an option for ALL dnd elements, modules, etc. -* Right now you can’t target anything except an “area.” It’s forcing us to go around the intended theme experience and build through custom modules or lengthy overwrites.\n2. *Fix the Fonts* - Right now only Google Font Set is allowed and if you’re using custom fonts, you have to overwrite the system in very unsexy ways to get it to work. \n3. *Mobile Responsive Options in Defaults* - The JSON markup allows inline padding on dnd column, section, etc. The problem is that it’s *very hard to overwrite* when you you want to tighten things up for tablet and mobile. We gotta code around it, which is further exacerbated by my TOP 1 issue (above). I’d consider adding default tablet and mobile JSON options for “Spacing” to your boilerplate theme, out-of-the-box, as a universal starting point for all dnd areas, sections, columns, etc, just as a starting point.\n4. *Add Staging/Unpublished mode to Themes* - We need to be able to work on themes without people trying to use them. Because you really need to test everything in HubSpot with the Jinja, etc, we can’t be completely local and just upload it all at once. We have to test in an actual portal at some point and doing it in a separate HubSpot sandbox Portal is not always an option for clients.",
    "reply_count": 7,
    "reply_users_count": 6,
    "replies": [
      {
        "time_stamp": "2020-08-31 09:59:01"
      },
      {
        "time_stamp": "2020-08-31 11:57:57"
      },
      {
        "time_stamp": "2020-08-31 12:06:20"
      },
      {
        "time_stamp": "2020-09-01 11:52:32"
      },
      {
        "time_stamp": "2020-09-12 01:19:12"
      },
      {
        "time_stamp": "2020-09-14 07:59:37"
      },
      {
        "time_stamp": "2020-10-17 15:55:04"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Melinda Green",
      "poster_handle": "melinda.green"
    },
    "time_stamp": "2020-08-31 09:59:01",
    "text": "TWELVE HUNDRED PERCENT for point one"
  },
  {
    "poster": {
      "poster_name": "Katie Tade",
      "poster_handle": "ktade"
    },
    "time_stamp": "2020-08-31 11:57:57",
    "text": "Thanks for this write up <@U25C6PU56>! This is so valuable. We have concrete plans on items 2 and 3, and some options we’re going to provide to devs that get at option 1, so stay tuned!"
  },
  {
    "poster": {
      "poster_name": "jessebeginbound",
      "poster_handle": "jessebeginbound"
    },
    "time_stamp": "2020-08-31 12:06:20",
    "text": "Thanks! That would be amazing!"
  }
]