[
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-01-08 08:17:48",
    "text": "happy holidays <@U24GZQ3GF>! Hubdb dynamic does get added I just confirmed, can’t remmeber right now if I have any pages using custom objects at the moment"
  },
  {
    "poster": {
      "poster_name": "Naomi Mackenzie",
      "poster_handle": "naomi.mackenzie"
    },
    "time_stamp": "2024-01-08 08:25:34",
    "text": "Hi Everyone :wave:\nAnyone know of a good ERP system that integrates with HubSpot?"
  },
  {
    "poster": {
      "poster_name": "ANMOL MATHUR",
      "poster_handle": "mathur.anmol"
    },
    "time_stamp": "2024-01-08 08:36:51",
    "edited": {
      "time_stamp": "2024-01-08 08:37:31"
    },
    "text": "Hello <@U02UNS6B1TR>  we have experience  to developed a similar app previously which shows all the available stock of the products in the custom card in deal section. From the deal section using custom cards we can open the custom window which shows the list of all the available products and also add then to the deal line items … we can manage this using the custom properties and coded workflows "
  },
  {
    "poster": {
      "poster_name": "Jota Hurtado",
      "poster_handle": "jota"
    },
    "time_stamp": "2024-01-08 09:40:14",
    "text": "Hi <@U26BLKGE4>! Yes, I was a bit confused, but at least for us is not a deal breaker for now, is just annoying so we decided to leave it as it is for now. But when I have some spare time I'll go ahead with <@U0466HLJ3AM> suggestion and see what happens, but foe now, thanks both of you! :blush:"
  },
  {
    "poster": {
      "poster_name": "Gabriel Carter",
      "poster_handle": "gabriel.carter"
    },
    "time_stamp": "2024-01-08 09:53:48",
    "text": "Hi all! I am working on creating a live updating scoreboard for our sales team in office, and was sent to this for ideas and help. any ideas on where to start?\nthese are the criteria that im working on displaying:\nLeft hand side team members names\nTotal completed demos\nCurrent week completed\nMtd complete\nAnd same week of previous month\nAccumulated 2 weeks vs same 2 weeks previous month",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-08 09:55:15"
      },
      {
        "time_stamp": "2024-01-08 09:56:18"
      },
      {
        "time_stamp": "2024-01-08 09:59:16"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2024-01-08 09:55:15",
    "text": "Are you sure that is a good idea? I mean, there is a lot of pressure on each team member when everything is so transparent, right?"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2024-01-08 09:56:18",
    "text": "maybe Databox could be a good solution for a live Dashboard"
  },
  {
    "poster": {
      "poster_name": "Gabriel Carter",
      "poster_handle": "gabriel.carter"
    },
    "time_stamp": "2024-01-08 09:59:16",
    "text": "the reports are already open for everyone to view, its just creating a walk by visual now"
  },
  {
    "poster": {
      "poster_name": "Parker Swanson",
      "poster_handle": "parker195"
    },
    "time_stamp": "2024-01-08 11:02:46",
    "text": "Hi everyone, I am trying to create a collections process via HubSpot.\n\nI need to send whatsapp and emails to clients every month automatically to ensure our collections process runs smoothly. However, I can only send whatsapp messages via a workflow that is contact level. The issue with this is, once the contact enrolls in the contact once, then I will have to manually re-add them every time in order for them to then again receive the same messages the next month.\n\nRight now, my only solution is to make an workflow that is invoice level- however that restricts me to only sending emails - which are definitely not as effective for collectioins.\n\nLet me know your guys thoughts here or if you have any solutions!"
  },
  {
    "poster": {
      "poster_name": "Parker Swanson",
      "poster_handle": "parker195"
    },
    "time_stamp": "2024-01-08 11:03:13",
    "text": "I have already went to support which directed me here to try to solve this issue"
  },
  {
    "poster": {
      "poster_name": "Dario",
      "poster_handle": "dario"
    },
    "time_stamp": "2024-01-08 11:29:21",
    "text": "Hello guys\nLooking for a way to add  a ticket id reference in an email and  associate the reply to that mail  with an existing ticket"
  },
  {
    "poster": {
      "poster_name": "Christopher Mathieu",
      "poster_handle": "christopher.mathieu"
    },
    "time_stamp": "2024-01-08 11:38:34",
    "edited": {
      "time_stamp": "2024-01-08 11:38:49"
    },
    "text": "Yup I know HubDB dynamic pages add to sitemap.xml but it doesn't look like pages made from custom objects currently do. They'll need to address this at some point as it looks like HubSpot wants us to be using custom objects for dynamic content moving forward."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-01-08 17:37:21",
    "text": "The new nav seems to be popping up for people that are creating new HubSpot accounts. <https://www.reddit.com/r/HubSpot/comments/191t60i/setting_up_HubSpot_for_a_new_company_anyone_else/>"
  },
  {
    "poster": {
      "poster_name": "Daniela Arceo",
      "poster_handle": "danielaarceoherrera"
    },
    "time_stamp": "2024-01-08 18:45:35",
    "text": "Does anyone know if it's possible to use a different property that is not a primary display property as the Unique value/deduplication mechanism for custom objects? for example an ID ?"
  }
]