[
  {
    "text": "Hello all! :wave:\nIs there a way to customize this error message in default HubSpot form email field?\nIdeally, I don't want to develop custom validation field, nor frontend solution but want to change that in HubSpot form editing itself or whatever else. Thank you for the answer in advance!",
    "time_stamp": "2024-01-03 05:43:45",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-01-03 18:38:43"
      },
      {
        "time_stamp": "2024-01-03 18:38:45"
      },
      {
        "time_stamp": "2024-01-04 01:28:27"
      },
      {
        "time_stamp": "2024-01-04 06:48:35"
      },
      {
        "time_stamp": "2024-01-04 06:50:09"
      },
      {
        "time_stamp": "2024-01-04 06:51:12"
      }
    ]
  },
  {
    "text": "Hello everyone!\nI'm developing a custom quote template and I'm wondering how to deal with translations. I can see this line in the base.html layout\n```{# Retrieve translations for the template #}\n{% set template_translations = load_translations('../_locales', html_lang, 'en') %}```\nbut then I can't figure out how to use the different locales in the quote template.\nI trivially tried `{% set template_translations = load_translations('../_locales', 'fr', 'en') %}` just to verify if it would load French translations but to no avail.\nAlso, in the quote editor \"quote language\" is grayed out (see attached image), so it doesn't seem possible to change the language.\n\nAccording to the following\n<https://community.HubSpot.com/t5/CRM/Custom-quote-template-translation/m-p/547822>\n<https://community.HubSpot.com/t5/Custom-Quote-Template-Beta/Change-languange-when-creating-a-quote/m-p/436761>\nit seems this feature is not implemented yet, is this the case? If so, I'm guessing that currently the only solution is to create different coded templates for the various languages, create the corresponding customized quote template and select the appropriate one in the quote wizard (see \"quote template\" in the attached image).\nIs this the right approach? <@U01QVR44MEY> do you have any advice or personal experience on this by chance?\nOr maybe, one has to create different custom coded quote templates and hardcode the various labels and stuff for the different languages, ignoring the locales folder. It feels a bit intricate though.\nThank you.",
    "time_stamp": "2024-01-03 08:53:08",
    "edited": {
      "time_stamp": "2024-01-03 09:10:04"
    },
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-01-03 14:44:36"
      }
    ]
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-01-03 10:55:04"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-01-03 14:44:36",
    "text": "It's a little bit of a strange one, when you're setting up the templates in the editor in settings you have to select a language, but the default templates can use any language and you can select it from the quote builder. I think you might have to create a new template (use the same coded quote template though) for the different languages, unless anyone else has any better ideas."
  },
  {
    "text": "You could customize the embed code to do this:",
    "time_stamp": "2024-01-03 18:38:43"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2024-01-03 18:38:45",
    "text": "<https://legacydocs.HubSpot.com/docs/methods/forms/advanced_form_options>"
  },
  {
    "poster": {
      "poster_name": "gina a",
      "poster_handle": "giannaann"
    },
    "time_stamp": "2024-01-03 22:09:46",
    "text": "Hi. Can someone please direct me where I should be asking this question. I am not a developer. I only want to know if it's possible to integrate tools with HubSpot that are not currently listed in the App Marketplace. I am interested in using editing tools like Jumpchart, Writemaps, Slickplan, and Ruttl. I appreciate any thoughts or direction on this. Thank you."
  },
  {
    "poster": {
      "poster_name": "gina a",
      "poster_handle": "giannaann"
    },
    "time_stamp": "2024-01-03 22:14:40",
    "text": "p.s. If it's too complicated for a non-developer like me, I will not bother with it. Thank you."
  }
]