[
  {
    "time_stamp": "2024-01-29 08:00:28",
    "text": "Reminder: Did you know you can message <@U02162GK9SP|sprocky> at any time to get HubSpot development questions answered? It’s an experimental chat bot built to tackle developer questions. It won’t read your code, but can answer a lot of questions about building on the HubSpot platform."
  },
  {
    "text": "Hi everyone! I apologize in advance as I do not have a technical background, but I’d genuinely appreciate any insight or advice into my predicament.\n\nI have set up a one-way HubSpot to Zendesk integration for HubSpot Companies and HubSpot Contacts.\n\nFor a little bit of context - Our sales team uses HubSpot and our support team uses Zendesk. The goal is to have the company and its associated contacts automatically created in Zendesk when the HubSpot deal is marked live. If possible, I’d like to avoid flooding the support team’s Zendesk with prospects, pending deals, etc. So we only want the company/contacts that are associated with a “Live” deal. I should also note, that syncing companies/contacts on our previous “Live &amp; Installed” deals isn’t required - if I can get it to set up to sync/trigger future ones only, that would be optimal.\n\nSo the sync is set up to trigger when a HubSpot Deal is set to the “Live &amp; Installed” stage - the goal is for it to only look at the company &amp; contacts associated with that HubSpot Deal and then create that company in Zendesk (Zendesk refers to them as Orgs) and create any associated contacts into Zendesk from the HubSpot deal.\n\nThe company sync is working great and they are successfully being created in Zendesk when the deal is marked “Live”. However, I’m seeing that associated contacts from that HubSpot deal aren’t always being created because of the @gmail.com email domain duplicates. I am receiving the sync error: “This record didn’t sync because of Record validation errors. External “<http://gmail.com|gmail.com>” has already been taken”. I imagine this is due to already having another Zendesk contact as @gmail.com and it’s getting thrown off by the duplicates.\n\nWe love the idea of using the email domain association because, for example, we would like for all future “@testcompanydomain.com” emails that come in to be automatically be associated to the Test Company Domain company record in Zendesk, but unfortunately, a lot of our clients use Gmail and I’m not sure how to best navigate that.\n\nIs it possible to set up the sync to where if it’s @gmail.com it ignores the associated domain rule and just creates whatever company &amp; contact is on the HubSpot deal into Zendesk? So for example - the Justin <mailto:Pelham/Justin962@gmail.com|Pelham/><mailto:Justin962@gmail.com|Justin962@gmail.com> contact record from the HubSpot deal (screenshot) will be associated to the Justin962 Company in Zendesk and not worry about matching the @gmail.com email domain to an existing company/contact? Or worst case, is it possible to still set this sync up without it trying to match/associate any domains, public or private? Just have it only read/write what’s on that HubSpot deal?\n\nHere are 3 screenshots of 1) the test company and contact inside the deal, 2) the sync error, and 3) the company correctly being created in Zendesk, but the Justin Pelham contact is not syncing because of the @gmail.com domain error.\n\nThank you so much!",
    "time_stamp": "2024-01-29 12:40:56"
  }
]