[
  {
    "poster": {
      "poster_name": "Katrina Marschner",
      "poster_handle": "katrina"
    },
    "time_stamp": "2025-02-12 07:58:07",
    "edited": {
      "time_stamp": "2025-02-12 08:00:52"
    },
    "text": "Hi everyone! Baby coder here who knows enough to be dangerous but nowhere near enough to build an API :melting_face:\n\nWe're about to launch our HubSpot website, which uses a custom object to create data-driven dynamic \"profiles\" for 200+ vendors on our site. We have a ton of webforms that we use to collect information for these profiles to make sure we have the most up-to-date info. Based on our scope, our 3rd party developer built workflows that push data from contact records --> custom object rather than having a 2-way sync for all these 700+ properties (as one company could have multiple products to submit info on and update).\n\nUnfortunately, our 3rd party developer built our environment & workflows from forms --> custom object in such a way that it's seamless to *create* a new record, but no guardrails in place to prevent dupes and *updated* a record instead. And naturally, HubSpot workflows work great for *creating a new record* with mass properties being updated at once, but *updating an existing record in bulk* is not possible with the current workflow functionality and the *merge function* doesn't truly combine records in a way that we need to.\n\nMy questions:\n1. Is there a way to do some kind of vlookup within our custom objects by record name, company name, etc. AND do a mass update of multiple properties if an existing record is found?\n2. HubSpot support said we may need an API to be able to both mass update records and/or push data back from our custom objects --> contact properties if edits are made to the data within the custom object for the dynamic website \"profiles\".\nAny guidance would be very much appreciated!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2025-02-17 06:02:29"
      }
    ]
  }
]