[
  {
    "poster": {
      "poster_name": "Ibrahim Elsanosi",
      "poster_handle": "ibrahimsabat"
    },
    "time_stamp": "2023-04-27 03:23:55",
    "text": "Hello,\n\nI am trying to implement Call-to-action in my react website, it just simple download button. I got the embed code from the HubSpot (I have not changed it) and I added to the react component as following:\n\n `const cta = \"&lt;!--HubSpot Call-to-Action Code --&gt; &lt;span&gt; embed code here&lt;/span&gt; &lt;!-- end HubSpot Call-to-Action Code --&gt;\"  ;`\n\n Then I use dangerouslySetInnerHTML attribute on an HTML element to add an CTA HTML string inside its content as follow:\n\n `&lt;div`\n      `dangerouslySetInnerHTML={{__html: cta}}`\n`&gt;&lt;/div&gt;`\n\nI can see the CTA button in the page and when I click on it, first it takes me to this url <http://cta-redirect.HubSpot.com|cta-redirect.HubSpot.com>......, then redirect the user to download a file. It seems the user interaction does work fine but there is no things has been tracking in HubSpot Call-to-action page.\n\nI used the call-to-action in our WordPress site and used to work before, now the call-to-action does not work in our WordPress and React sites as well!\n\nI checked the HTML code for both site (WordPress and React app), it seems the call-to-action embed code is rendered successfully.\n\nAny though why the call-to-action does not work? do you think I need to do somethings in HubSpot call-to-action setting?"
  },
  {
    "poster": {
      "poster_name": "sasha g",
      "poster_handle": "gensa9"
    },
    "time_stamp": "2023-04-27 08:28:12",
    "text": "hi guys I have set a window pop up of email capture on my shopify account using hub spot.\n\ncan you please help me to make the window appear any time  a visitor refreshes a store?"
  },
  {
    "poster": {
      "poster_name": "sasha g",
      "poster_handle": "gensa9"
    },
    "time_stamp": "2023-04-27 08:28:50",
    "text": "&lt;!-- Start of HubSpot Embed Code --&gt;\n&lt;script type=\"text/javascript\" id=\"hs-script-loader\" async defer src=\"&lt;//js-eu1.hs-scripts.com/222222222.js&gt;\"&gt;&lt;/script&gt;\n&lt;!-- End of HubSpot Embed Code --&gt; i made up a code for security reasons"
  }
]