[
  {
    "poster": {
      "poster_name": "Michael Wallis",
      "poster_handle": "michaelchezwallis"
    },
    "time_stamp": "2020-12-01 04:43:19",
    "edited": {
      "time_stamp": "2020-12-01 04:43:35"
    },
    "text": "Hi everyone\n\nWe received this feedback on our theme submission:\n```Please update your CSS and JS files to come from one folder each as per the theme requirements.```\nNowhere in the theme submission docs is anything regarding folder structures mentioned, so I'm not really sure how to action this. Has anyone dealt with this issue before or know what is expected here?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2020-12-01 05:47:07"
      },
      {
        "time_stamp": "2020-12-01 06:08:03"
      },
      {
        "time_stamp": "2020-12-01 08:29:36"
      },
      {
        "time_stamp": "2020-12-01 11:38:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2020-12-01 05:47:07",
    "edited": {
      "time_stamp": "2020-12-01 08:49:59"
    },
    "text": "I have to infer just from what your telling us. You likely are not providing relative paths to your assets and may have references to files outside of your theme. Themes are made to be a portable package of assets you can place into a portal and use.\n\nIf your referencing files outside of your theme or not using relative paths then someone could only use your theme of they had the other assets organized the exact same way. (Which can’t really happen since the theme will appear in their marketplace folder, meaning its going to have a different root)"
  },
  {
    "poster": {
      "poster_name": "Michael Wallis",
      "poster_handle": "michaelchezwallis"
    },
    "time_stamp": "2020-12-01 06:08:03",
    "text": "<@U7SL518D6> Thanks Jon. The full message said\n```There is complex folder structure. Please update your CSS and JS files to come from one folder each as per the theme requirements.```\n so there isn't much to tell or any info given to go on.\n\nOur assets are using\n```get_asset_url('/theme-name/assets/dist/img/img.jpg)' ```\nto pull things in, would that need to be\n```get_asset_url('../assets/dist/img/img.jpg)' ```\nrather to qualify as relative?"
  },
  {
    "poster": {
      "poster_name": "Chris Conant",
      "poster_handle": "conant_chris"
    },
    "time_stamp": "2020-12-01 08:29:36",
    "text": "Hi Michael, just to follow up with what Jon said - as long as the files are contained within the theme folder you should be all set. I’ll pass a note along to the rest of the team reviewing the themes to make sure that everyone is aware that the files can be placed anywhere *within* the theme.\n\nAs for relative paths, they depend on the file structure and the path to which file you’re referencing, but what you have above should work in theory."
  },
  {
    "poster": {
      "poster_name": "Michael Wallis",
      "poster_handle": "michaelchezwallis"
    },
    "time_stamp": "2020-12-01 11:38:57",
    "text": "<@U22PWJ41G> Thanks Chris. In my mind both of the above would examples be relative, but I've changed all of them to the second variation so that it pulls from within the folder structure rather than the theme root folder just to be safe."
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-12-01 14:22:34",
    "text": "Hi Everyone! Can I create a module that pulls info from HubDB in a theme? Not for the marketplace, but just in general. I have a theme on a portal. I copied an existing module and added in some hubl to pull from HubDB, and the content pane says that module ‘has no editable options’. What am I missing?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-12-01 14:29:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sam McKinney",
      "poster_handle": "sam"
    },
    "time_stamp": "2020-12-01 14:29:05",
    "text": "and nevermind. I found my issue :smile:"
  }
]