[
  {
    "poster": {
      "poster_name": "Jamie Jackson",
      "poster_handle": "jamie340"
    },
    "time_stamp": "2021-07-15 02:49:33",
    "text": "I just ended up putting everything in a &lt;script&gt; tag in the html"
  },
  {
    "poster": {
      "poster_name": "Chris Robock",
      "poster_handle": "crobock"
    },
    "time_stamp": "2021-07-15 07:48:39",
    "text": "I could do that, but I’m using a fetch call to pull data with my private API key and would like to not expose that to the world"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-07-15 10:20:18",
    "edited": {
      "time_stamp": "2021-07-15 10:20:30"
    },
    "text": "Hey Chris. You should not use private api keys on the front end like this. It will always be exposed whether or not it’s in the js section. \n\nThat js section just gets bundled and included in a script file so it’s still visible. I would just write all your script in the js section of the module. "
  },
  {
    "poster": {
      "poster_name": "Chris Robock",
      "poster_handle": "crobock"
    },
    "time_stamp": "2021-07-15 10:54:08",
    "text": "ok.  so if that’s the case, how would I use my API if I can’t use the API key?  I’m new to javascript must be missing something"
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-07-15 11:33:56",
    "text": "Is there some kind of rate limit on your api key that would bump you up into a paid category or is it always free? If its free it’s not really a big deal. A lot of times you can also toggle your settings around and set it so that the api request must be coming from a certain domain. If that is a setting then it again doesnt matter much. My guess is that if it’s a geolocator it’s likely not a big deal to keep it public."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-07-15 11:35:05",
    "text": "Your other route to go would be to use a serverless function or host the api request at a backend server of your own and make a call to that endpoint that you would create which would fire off the api call to the geolocating service"
  },
  {
    "poster": {
      "poster_name": "Chris Robock",
      "poster_handle": "crobock"
    },
    "time_stamp": "2021-07-15 11:53:42",
    "text": "with the free Mapquest API, I get 15,000 calls a month, then have to move to paid"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2021-07-15 14:02:13",
    "text": "It’s not possible as far as I know… we ended up creating another “control” choice field, and then based all the variable options on the value of that single field."
  }
]