[
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2021-07-29 08:24:11",
    "text": ":wave: I'll be taking a look at this today! There are definitely some discrepancies between how repeater data is treated on the frontend vs in the rendered output, so I might talk to our backend team that handles HubL rendering"
  },
  {
    "poster": {
      "poster_name": "Sue Fisher",
      "poster_handle": "suefisherfl"
    },
    "time_stamp": "2021-07-29 09:05:41",
    "text": "Hi all!  I'm new to building modules and wondered if there are out of the box modules to display all contact data for an owner?  The use case is a membership page for a partner/referrer who owns contacts in our company HubSpot CRM and we want to display a list of them on the webpage they registered with!  Any help or link be great!  TY!"
  },
  {
    "poster": {
      "poster_name": "Talia Swartz",
      "poster_handle": "tswartz"
    },
    "time_stamp": "2021-07-29 09:11:58",
    "text": "<@U01U201MTQF> can you please provide a design manager link to that module? (feel free to DM it to me if you'd prefer)"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-07-29 10:20:33",
    "text": "Hey there!\nSome modules with image fields are showing now `eager`option in the loading selectors, but not all of them. Is it something will eventually roll-out as a general thing? should I get someone to look in to it?\nBoth modules are in the same portal\nany idea <@U7SL518D6> ?",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-07-29 10:32:23"
      },
      {
        "time_stamp": "2021-07-29 14:28:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-07-29 10:32:23",
    "edited": {
      "time_stamp": "2021-07-29 10:33:26"
    },
    "text": "I have to doublecheck on how this is being executed.\n\nWe’re being cautious in the way we’re handling the lazy loading options. There are times where Eager is appropriate and a good thing to use. There are times where using eager may be detrimental. We understand that marketers may not fully understand what they are doing when setting the options so we’re trying to both empower folks and help to prevent accidental missuse.\n\nleaving the image to the default will use the browser’s default loading (IE not setting eager or lazy). That is better in many cases than adding `eager`"
  },
  {
    "poster": {
      "poster_name": "Melissa Fairbourn",
      "poster_handle": "mfairbourn"
    },
    "time_stamp": "2021-07-29 10:46:27",
    "text": "I have a question concerning cookies. I have a module that utilizes cookies to create a floating footer on my company's website.\nI'm now trying to implement a form on the website that would need to utilize these same cookies, but it wouldn't be part of the footer.\nI'm running into some trouble because the cookie creation is all within a script tag that generates the html for the footer, but the form also has a script tag as part of it. I'm unable to insert the form div/script into the script-generated html because it's then nesting script tags which from what I hear doesn't work.\nIs there a way that I can have the form code in a separate module, but it would be able to connect to or pull from the cookie information in the footer module?"
  },
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2021-07-29 14:28:59",
    "text": "Yup!\nI understand, just curious because a client asked why not showing up everywhere"
  },
  {
    "poster": {
      "poster_name": "Jim Johnson",
      "poster_handle": "jim.johnson"
    },
    "time_stamp": "2021-07-29 15:17:15",
    "text": "I'm bumping into this same issue, and the 10 call limit for that function is giving me headaches. Did you ever get to the bottom of this?"
  },
  {
    "poster": {
      "poster_name": "Matthew Fall",
      "poster_handle": "matthew506"
    },
    "time_stamp": "2021-07-29 17:43:51",
    "text": "How might I be able to reference the path/url of a module's css section, aside from finding it via the Network traffic in my browser's inspector tools? Are there hubl vars/functions that can be used to dynamically build that path/url?"
  }
]