[
  {
    "poster": {
      "poster_name": "Anish Mandal",
      "poster_handle": "anishmandal240289"
    },
    "time_stamp": "2021-07-14 01:47:07",
    "text": "Thanks <@U7SL518D6> .Got it"
  },
  {
    "poster": {
      "poster_name": "Håvard Bartnes",
      "poster_handle": "bartnes"
    },
    "time_stamp": "2021-07-14 03:10:05",
    "text": "What is the correct formatting of the `validation_regex` parameter for the text field? I haven’t found any examples."
  },
  {
    "poster": {
      "poster_name": "Ignacio García Giménez",
      "poster_handle": "ignacio.garcia"
    },
    "time_stamp": "2021-07-14 09:28:57",
    "text": "Hello everyone, I'm new to HubSpot CMS Modules and I'd like to know if what I want to achieve is possible. I need to create a custom form module that let's users, during Landing Page creation, the ability to fill a hidden field of the form with a default value. The idea is to take the default value from a module field and populate the hidden field of a form with that value. I think this can be achieved through a &lt;script&gt; tag inside the HTML of the module and, through DOM manipulation with JS, modify the value of the hidden field using HubL. Is this possible? is this the only way? what is the best way to achieve this?"
  },
  {
    "text": "how do i stop my menu being wrapped in this div class",
    "time_stamp": "2021-07-14 09:45:42"
  },
  {
    "text": "Hey all. Just joined here and am trying to understand how to access functions I create in the module.js.  I’ve created a function, and when I try to reference that function in a &lt;script&gt; in the HTML, it doesn’t recognize the function.  I’m just learning javascript so this may be a basic thing, but I’ve been banging my head against the wall for quite some time now",
    "time_stamp": "2021-07-14 15:45:19",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2021-07-15 02:49:33"
      },
      {
        "time_stamp": "2021-07-15 07:48:39"
      },
      {
        "time_stamp": "2021-07-15 10:20:18"
      },
      {
        "time_stamp": "2021-07-15 10:54:08"
      },
      {
        "time_stamp": "2021-07-15 11:33:56"
      },
      {
        "time_stamp": "2021-07-15 11:35:05"
      },
      {
        "time_stamp": "2021-07-15 11:53:42"
      }
    ]
  }
]