[
  {
    "poster": {
      "poster_name": "Jeppe Wienziers Stenbæk",
      "poster_handle": "jeppe.stenbaek"
    },
    "time_stamp": "2023-06-20 02:16:46",
    "text": "Seeking a freelancer (maybe fixed employment long-term) if interested, DM me :)\n\n*Job Description:*\nWe are seeking a highly skilled and experienced Senior Developer with expertise in JavaScript (Node.js and React), HubL, HTML, Webhooks, and API integration to join our dynamic team. As a Senior Developer, you will play a crucial role in developing and maintaining our HubSpot-powered applications and integrations, ensuring seamless workflows and exceptional user experiences. You will collaborate closely with cross-functional teams, including designers, product managers, and other developers, to implement innovative solutions that enhance our marketing and sales initiatives.\n\n*Responsibilities:*\n• Design, develop, and maintain high-quality, scalable applications and integrations on the HubSpot platform.\n• Collaborate with internal teams to understand business requirements and translate them into technical specifications.\n• Implement custom functionality using JavaScript (Node.js and React), HubL, HTML, and CSS to enhance user experiences and optimize marketing automation processes.\n• Integrate third-party systems, APIs, and Webhooks to enable data synchronization and streamline workflows.\n• Troubleshoot and resolve issues related to HubSpot configuration, customization, and API integrations.\n• Optimize performance and scalability of HubSpot applications through code refactoring and infrastructure improvements.\n• Stay up-to-date with the latest trends and advancements in the HubSpot ecosystem and web development technologies.\n• Mentor and provide guidance to junior developers, fostering a collaborative and knowledge-sharing environment.\n*Requirements:*\n• Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\n• Minimum of 5 years of professional experience as a software developer, with a focus on JavaScript, Node.js, and React.\n• Strong knowledge and hands-on experience with HubSpot development, including custom modules, templates, and API integrations.\n• Proficiency in HubL templating language and experience with HTML, CSS, and responsive web design principles.\n• Solid understanding of API integration methodologies, Webhooks, and RESTful APIs.\n• Experience with version control systems (e.g., Git) and code collaboration tools.\n• Familiarity with Agile development methodologies and tools (e.g., Asana, JIRA, Scrum).\n• Ability to work independently and manage multiple projects simultaneously, delivering high-quality results within deadlines.\n• Excellent problem-solving skills and the ability to debug and resolve complex technical issues efficiently.\n• Strong communication skills, both written and verbal, with the ability to effectively collaborate with cross-functional teams.\n*Preferred Qualifications:*\n• HubSpot Certifications, such as HubSpot CMS Developer Certification.\n• Experience with HubDB, the HubSpot API, and advanced HubSpot CMS functionality.\n• Familiarity with database systems (e.g., BigQuery, PostgreSQL) and server-side development.\n• Experience with Serverless setups.\n• Knowledge of frontend frameworks and libraries (e.g., Vue.js, AngularJS) and build tools (e.g., Webpack, Gulp).\n• If you are a highly motivated individual with a passion for developing cutting-edge applications within the HubSpot ecosystem, along with extensive experience in JavaScript (Node.js and React) and related technologies, we would love to hear from you. Join our team and contribute to the success of our marketing and sales initiatives through innovative and impactful development solutions.\n",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-06-20 02:56:37"
      },
      {
        "time_stamp": "2023-06-20 04:16:18"
      },
      {
        "time_stamp": "2023-06-21 19:31:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Martin",
      "poster_handle": "as20190101"
    },
    "time_stamp": "2023-06-20 02:56:37",
    "text": "DMed <@U02BWQ90E48>"
  },
  {
    "poster": {
      "poster_name": "Jaivardhan Dalal",
      "poster_handle": "jai.palmspire"
    },
    "time_stamp": "2023-06-20 04:16:18",
    "text": "Hey <@U02BWQ90E48>, Please check your DM."
  }
]