[
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-03-08 09:37:12",
    "edited": {
      "time_stamp": "2019-03-08 09:54:42"
    },
    "text": "Bit frustrated with the Drag-n-Drop email builder...\n1. Sending test emails and Images are not loading in gmail, just shows the Alt text (they're `png` types) and have tried with multiple different images. I have a support ticket #2314159 that's been open for 4 days but supposedly will get some information by tomorrow (hopefully). I should note that Gmail settings is enabled to display external images.\n2. To try and fix a blurry rendering issue, was going to try inlining an image in a Rich Text module, with its src appending `?noresize` cause the serverside image minification gave a really blurry result. However, i found that I can't add an image through a Rich Text Module. No *insert image* button, nor can I inline it through the source code (the `&lt;img&gt;` tag gets stripped out). I'm assuming it's intended to use the *Image* module instead. Just curious as to why if there's another reason.\n\nI know the tool is still in beta, but we already have a client that's gone from very excited to disappointed, and haven't been able to give much more insight than \"HubSpot is looking into it.\"",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-22 13:02:06"
      },
      {
        "time_stamp": "2019-03-22 13:02:13"
      },
      {
        "time_stamp": "2019-03-22 13:03:01"
      },
      {
        "time_stamp": "2019-03-22 13:04:17"
      },
      {
        "time_stamp": "2019-03-22 13:05:52"
      },
      {
        "time_stamp": "2019-03-22 13:07:29"
      },
      {
        "time_stamp": "2019-03-25 08:02:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-03-08 10:06:41",
    "text": "The only solution i've come across so far for my issue #1 above is to use an *HTML* block instead and place the `&lt;img&gt;` tag inside that.\nHowever, this method isn't very friendly for an end user that might not know HTML too well"
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2019-03-08 10:21:54",
    "text": "`&lt;img&gt;` tag in an *HTML* block will not render in a test email if it has the `width` attribute inlined on the tag..."
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2019-03-08 11:32:27",
    "text": "will there be a way for devs to add media queries to a drag’n drop email? For example, text set at 60px looks fine on desktop, but mobile it blows up the screen.\n\nI’ve seen other email providers that wrap text in a class like `p60` and then use media queries to target that class on mobile.",
    "reply_count": 5,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-03-22 13:08:33"
      },
      {
        "time_stamp": "2019-03-22 13:27:57"
      },
      {
        "time_stamp": "2019-03-22 13:29:24"
      },
      {
        "time_stamp": "2019-03-22 13:29:37"
      },
      {
        "time_stamp": "2019-03-22 13:39:35"
      }
    ]
  }
]