[
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-12 10:33:28",
    "text": "I am new to the HubSpot SEO tool and I have been working through some of the recommendations. However, one of them is baffling me. It has flagged 147 pages on my website with:\nPages that contain a \"noindex\" meta tag or return a \"noindex\" directive in the HTTP response won't appear in search results. Review the list of pages you're blocking from being found. If you intend to block these pages from search engines, no change is necessary.\n\nWhen I look at the source to these pages, I don't see any noindex meta tags, I don't see any .htaccess issues on the pages at fault, and when I use other tools like Google Search Console they seem to have no problem indexing the pages which are flagged. I have tried a bunch of other free tools on the internet, and none of them show this issue. I also signed up for Semrush to validate this there, and their tool does not see these flagged as noindex. It makes no sense. It does see the two pages I actually DO want to mark noindex.  Has anyone else seen this problem?",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-12 17:12:01"
      },
      {
        "time_stamp": "2024-08-13 13:53:32"
      },
      {
        "time_stamp": "2024-08-13 13:53:48"
      },
      {
        "time_stamp": "2024-08-13 13:54:45"
      },
      {
        "time_stamp": "2024-08-13 13:54:46"
      },
      {
        "time_stamp": "2024-08-22 15:27:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-12 10:35:42",
    "text": "I tried to open a support case about this and the support people told me I have to ask here."
  },
  {
    "poster": {
      "poster_name": "Nick Laporte",
      "poster_handle": "nlaporte"
    },
    "time_stamp": "2024-08-12 17:12:01",
    "text": "Just to eliminate all the usual suspects, is there anything being blocked in your robots.txt file?"
  },
  {
    "poster": {
      "poster_name": "Adam Abrons",
      "poster_handle": "adam159"
    },
    "time_stamp": "2024-08-12 18:03:13",
    "text": "hi folks, we're using HubSpot with a reverse proxy, to nest HubSpot Blog content inside our main site. We're having an issue where the generated pages are being served with a canonical link that's `http` instead of `https` . That link redirects to the `https` page but the loop seems to be hurting us. Has anyone else run into and solved this?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-08-12 18:04:04"
      },
      {
        "time_stamp": "2024-08-13 13:51:39"
      },
      {
        "time_stamp": "2024-08-13 13:52:05"
      },
      {
        "time_stamp": "2024-08-13 15:52:33"
      },
      {
        "time_stamp": "2024-08-14 10:55:23"
      },
      {
        "time_stamp": "2024-08-14 10:56:48"
      },
      {
        "time_stamp": "2024-09-05 13:50:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Adam Abrons",
      "poster_handle": "adam159"
    },
    "time_stamp": "2024-08-12 18:04:04",
    "text": "here's an example: <https://www.withroam.com/blog/roam-boost>"
  }
]