[
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:51:39",
    "text": "Can you make it a rewrite rule on the server end instead of a redirect?  Then it won't ever be a non-https, and you won't get penalized with the mixed content."
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:52:05",
    "text": "If you are on Wordpress there is a plug in you can use that just does this automatically."
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:53:32",
    "text": "No - definitely not - checked that first.  What is so weird is that the HubSpot SEO tool is the ONLY tool which sees this issue.  Google Search Console doesn't see the problem, SEMRush doesn't see the problem....I tried a few free tools as well."
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:53:48",
    "text": "I am suspect there is a bug in the HubSpot SEO tool."
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:54:45",
    "text": "Here is a page that HubSpot SEO is complaining about....it's one of many, but here is a nice example one."
  },
  {
    "poster": {
      "poster_name": "Ted Larson",
      "poster_handle": "ted676"
    },
    "time_stamp": "2024-08-13 13:54:46",
    "text": "<https://ologicinc.com/about/>"
  },
  {
    "poster": {
      "poster_name": "Adam Abrons",
      "poster_handle": "adam159"
    },
    "time_stamp": "2024-08-13 15:52:33",
    "text": "thanks <@U07GN0H4N6Q>! It's our own codebase (elixir and phoenix) running the main site which has the HubSpot blog embedded.  IIUC your suggestion is to rewrite those http: urls to https: as we're proxying the response from HubSpot to the browser? That's a good idea, it will work but I was hoping there was HubSpot configuration that I had missed, that would fix the problem without code on my side."
  }
]