[
  {
    "poster": {
      "poster_name": "Mehdi Louraoui",
      "poster_handle": "med.louraoui"
    },
    "time_stamp": "2024-09-23 02:30:45",
    "text": "hello, to benefit this feature we need to install HubSpot package?"
  },
  {
    "poster": {
      "poster_name": "Mehdi Louraoui",
      "poster_handle": "med.louraoui"
    },
    "time_stamp": "2024-09-23 02:33:51",
    "text": "if we use this package, do we have to add the script ?"
  },
  {
    "poster": {
      "poster_name": "Scott Marion",
      "poster_handle": "scott943"
    },
    "time_stamp": "2024-09-23 07:06:06",
    "text": "We have a client that we wanted to bring in historical sales data for reporting and we did just that, gave that data it's own sales pipeline.  Now we don't update any deals to change the pipeline but in your case you could do that so your approach sounds doable to me.."
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-09-23 07:48:20",
    "edited": {
      "time_stamp": "2024-09-23 07:56:48"
    },
    "text": "If you place a third party analytics script on your site, the script provided from that service will set non-essential cookies regardless of the user's HubSpot cookie banner preference.\n\nThis is why to properly manage third-party cookies within HubSpot, you need to conditionally load the scripts which set those cookies in the browser.\n\nThis means you can't implement typical instructions received from Third-party analytics/marketing service integrations. Do NOT simply place the <script> embed code they provide within the code of your site, because this is not conditional loading.\n\nYou can use the <https://developers.HubSpot.com/docs/api/events/cookie-banner|HubSpot Cookie Banner API> to develop a javascript file for your site, which can conditionally load your third party scripts based on the user's HubSpot cookie preferences.\n\nBy conditionally loading your third-party scripts that set marketing cookies, you can successfully achieve what you described: \"decide in the code at which point the system can begin to collect marketing cookies\""
  },
  {
    "poster": {
      "poster_name": "Michael Shepherd",
      "poster_handle": "michael.shepherd"
    },
    "time_stamp": "2024-09-23 08:34:42",
    "text": "This one is still an issue after quite a while. Have you had any fixes for this <@U079JDB5PLN>?"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-23 09:14:40",
    "text": "I shot you a DM about this."
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-23 09:20:05",
    "text": "what soft phone are you using? <https://developers.HubSpot.com/docs/api/crm/extensions/calling-sdk> might be a good place to start if you have to build one out."
  },
  {
    "poster": {
      "poster_name": "Arthur Pereira Ramos Amaral",
      "poster_handle": "arthur.amaral"
    },
    "time_stamp": "2024-09-23 11:38:54",
    "text": "Hi guys, I need to configure my company's cache policy (flash), is it possible to do this configuration within HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Muhammad Ammar",
      "poster_handle": "malik.ammar"
    },
    "time_stamp": "2024-09-23 11:44:54",
    "text": "is there any softphone that is built in HubSpot, i follow all the steps of above documentation, but in this when we click on the customer contact, then iframe has been open but my requirement is when the crm has been loaded, the softphone has been also loaded automatically as well. so can you please guide me on this?"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-23 12:40:03",
    "text": "What softphone are you using?"
  },
  {
    "poster": {
      "poster_name": "Viviana Cardenas",
      "poster_handle": "vcardenas"
    },
    "time_stamp": "2024-09-23 20:04:17",
    "text": "Hi team, do you know if it is possible to embed a video hosted in HubSpot onto another website, such as our WordPress site, and include lead generation within the video?\n\nI want to use HubSpot's \"in-video forms\" to capture leads directly within the video, where a form appears to collect viewer information while they're watching. <https://www.HubSpot.com/products/video-hosting>\n\nHow can I implement this? Is it an option only available on Hubpost landing pages?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-23 20:10:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2024-09-23 20:10:06",
    "text": "There is this new feature that I have not tried but it might work. Content embed - <https://www.HubSpot.com/products/content/embedabble-content-blocks>\n\nYou need Content Hub Pro to use it."
  }
]