[
  {
    "poster": {
      "poster_name": "Fredrikke Eriksson",
      "poster_handle": "fredrikke.eriksson"
    },
    "time_stamp": "2024-09-20 03:03:24",
    "text": "Hi All :smile: Is it possible to programmaticaly ask HubSpot script to set or not set cookies in categories - in cases when you use an external cookie banner? Example: u are using a third party cookie management system, and u want to decide in the code at which point the system can begin to collect marketing cookies?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-23 07:48:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sonia Onyinyechi Kanu",
      "poster_handle": "sonityworld222"
    },
    "time_stamp": "2024-09-20 04:58:42",
    "text": "<@U057ZHLNCKD>  Yes, it is possible to programmatically control cookie settings in HubSpot using an external cookie banner. HubSpot provides APIs and script hooks to manage cookie consent.\n\n\n*HubSpot Cookie Management API:*\n\n1. `HubSpot.cookieManager.setConsent()` - Sets cookie consent for a specific category.\n2. `HubSpot.cookieManager.getConsent()` - Retrieves current cookie consent status.\n3. `HubSpot.cookieManager.onConsentChange()` - Listens for consent changes.\n\n\n*Controlling Cookie Collection with External Cookie Banner:*\n\n1. Integrate your third-party cookie management system with HubSpot.\n2. Use JavaScript to detect user consent and trigger HubSpot's cookie management API.\n\n\n*Example Code Snippet:*\n```\n// Assuming your external cookie banner sets a 'cookieConsent' variable\nif (cookieConsent === 'marketing_cookies_accepted') {\n  // Set HubSpot marketing cookie consent\n  HubSpot.cookieManager.setConsent('marketing', true);\n} else {\n  // Disable HubSpot marketing cookie collection\n  HubSpot.cookieManager.setConsent('marketing', false);\n}\n```\n*Additional Considerations:*\n\n1. Ensure your external cookie banner is GDPR/CCPA compliant.\n2. Configure HubSpot's cookie categories to match your external banner.\n3. Test thoroughly to ensure seamless integration.\n\n\n*HubSpot Documentation:*\n\n1. HubSpot Cookie Management API [1]\n2. HubSpot Cookie Consent [2]\n3. HubSpot JavaScript API [3]\n\n\n*Third-Party Cookie Management Systems:*\n\n1. OneTrust\n2. Cookiebot\n3. iubenda",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-23 02:30:45"
      },
      {
        "time_stamp": "2024-09-23 02:33:51"
      },
      {
        "time_stamp": "2024-09-26 04:21:34"
      }
    ]
  },
  {
    "text": "Hey everyone\nWhere can we report bugs ?",
    "time_stamp": "2024-09-20 05:42:15"
  },
  {
    "text": "Hello. i make a developer account and test account, now i want to run my app in softphone, so how i can run my app on sofphone? and other question is in the top navigation bar there is a telephone and that icon is locked. how that phone is open? and is that phone icon is open, should i run third party app in that phone?",
    "time_stamp": "2024-09-20 06:49:36"
  },
  {
    "poster": {
      "poster_name": "Pratik Bhatt",
      "poster_handle": "pratik095"
    },
    "time_stamp": "2024-09-20 07:05:58",
    "text": "Anyone can know about this?\n<https://HubSpotdev.slack.com/archives/C22PU4LV8/p1726654739569199>"
  },
  {
    "subtype": "bot_message",
    "text": ":sparkles:Slack Tips and Best Practices:sparkles:\n\nTo get the most out the HubSpot Developer Slack, follow these best practices:\n\n• Will your post/question potentially help more than one person? Ask in a public channel instead of 1:1 DMs to help as many folks as possible. \n• Thread all replies to keep topics organized and searchable\n• Thread followup questions/comments to your original post\n• Don't post the same question in multiple channels. If you must, link to your original question in new channels.\nMore <https://slack.com/blog/collaboration/etiquette-tips-in-slack|great tips here>. Thanks for making the HubSpot Developer Slack easier to use for everyone!",
    "username": "Slack Best Practices",
    "time_stamp": "2024-09-20 12:05:00",
    "edited": {
      "time_stamp": "2024-09-20 12:05:04"
    }
  },
  {
    "poster": {
      "poster_name": "Logan Merkle",
      "poster_handle": "lmerkle02"
    },
    "time_stamp": "2024-09-20 20:18:18",
    "text": "Looking for the best way to integrate a 3rd party app with HubSpot that doesn't have native integration built. There are a few zaps available to push customer data, but we're looking to integrate our quoting tool directly into HubSpot so that we don't have to enter customer information multiple times and can just submit the quote. Looked into building an iframe that sends the information entered via API, Zaps, or UI-Extensions. What is the best way to do this?",
    "reply_count": 7,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-20 20:46:07"
      },
      {
        "time_stamp": "2024-09-20 20:57:55"
      },
      {
        "time_stamp": "2024-09-20 21:07:01"
      },
      {
        "time_stamp": "2024-09-20 21:15:41"
      },
      {
        "time_stamp": "2024-09-20 21:27:20"
      },
      {
        "time_stamp": "2024-09-20 21:39:02"
      },
      {
        "time_stamp": "2024-09-23 09:14:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-20 20:46:07",
    "text": "Hey <@U07NEKCNEQJ> A few ways this could be done. We use a UI-extension working with our custom quote tool like a web app that just does some API work back and forth.\n\nDepending how complex you could do it all in a card.\n\nIs this a custom quote tool or an external software that you need to push and pull data from? \n"
  },
  {
    "poster": {
      "poster_name": "Logan Merkle",
      "poster_handle": "lmerkle02"
    },
    "time_stamp": "2024-09-20 20:57:55",
    "text": "Thanks for the reply. The tool is called B2B Ninja, 1-page quoting tool for BigCommerce. Ideally, I'm looking for a way to publish the quotes from within HubSpot to B2B Ninja to be able to take advantage of all of the customer info already being inside of HubSpot, our product library being synced to HubSpot, and to save guys time between having to copy customer data from HubSpot to b2b ninja in order to make a quote."
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-20 21:07:01",
    "text": "So just a one way sync? That could be done a few different ways. \n\nHow much data goes over? Does customer or contact in HubSpot change often enough to need an on update sync as well? "
  },
  {
    "poster": {
      "poster_name": "Logan Merkle",
      "poster_handle": "lmerkle02"
    },
    "time_stamp": "2024-09-20 21:15:41",
    "text": "customer doesn't change often. But it could be a newly entered customer. It would just be contact fields such as first name, last name, shipping info, billing info, customer notes, staff notes, product id.\n\nWe'd need a 2 way sync as we'd like to make the quote from HubSpot but like tracking on if the customer purchased through the quote into HubSpot as well - ideally allowing us to see quotes sent vs quotes completed/purchased in the reports dashboard"
  },
  {
    "poster": {
      "poster_name": "Colin Johnson",
      "poster_handle": "colin776"
    },
    "time_stamp": "2024-09-20 21:27:20",
    "text": "Cool that gives me enough to poke around b2bninja api and see if that can be solved easily. I’ll check it this weekend but for HubSpot to b2bninja no problem. I’ll have to check on the info back in. "
  },
  {
    "poster": {
      "poster_name": "Logan Merkle",
      "poster_handle": "lmerkle02"
    },
    "time_stamp": "2024-09-20 21:39:02",
    "text": "Awesome, thanks a ton. I'm thinking we could use the standard cards to display the information, it should just be pulling the information from HubSpot records such as contact, company, and products, and then sending them via API to B2B Ninja, which should have everything needed, as I see it, to submit a quote programmatically. Then would just need to update the card in HubSpot on status change events in B2B Ninja such as a change from new to opened to purchased. Here's a link to the documentation:\n<https://docs.b2bninja.com/>\n\nLooking forward to seeing what you find"
  }
]