[
  {
    "poster": {
      "poster_name": "Satyam Chaudhary",
      "poster_handle": "satyamc.wot2022"
    },
    "time_stamp": "2024-09-26 04:15:11",
    "text": "Hi everyone,\nHow can I implement the MultiStep Form of HubSpot in the page, So that it does not add as an Iframe and as a normal form, I want to implement styling to the multi-step form but not from the in-built setup given in HubSpot rather my own via CSS or this is something not possible at the moment.",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-09-26 07:46:37"
      },
      {
        "time_stamp": "2024-10-01 07:45:29"
      },
      {
        "time_stamp": "2024-10-04 08:19:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Fredrikke Eriksson",
      "poster_handle": "fredrikke.eriksson"
    },
    "time_stamp": "2024-09-26 04:21:34",
    "text": "<@U02PJ44GW5B> did you see this?"
  },
  {
    "poster": {
      "poster_name": "Paweł Czarnecki",
      "poster_handle": "p.czarnecki"
    },
    "time_stamp": "2024-09-26 06:58:10",
    "text": "For anyone else wondering - enabling bubbles for the change event solved issue"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-09-26 07:46:37",
    "text": "If you're using the build-in multi-step-form functionality - it's not possible to remove the iframe for now.\n\nMy recommendations are\n1. create a module that will display a form as multi-step form or let's you create your own multi-step form\n2. create a multistep with a 3rd-party addon like typeform\n\nPersonally I've created several custom multi-step modules that don't rely on the multi-step functionality and also I don't like the fact that the new multi-step builder has dropped a lot of functionalities that are/were supported by the old form builder. But it's nothing anyone from outside HubSpot can change..."
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-09-26 08:52:04",
    "text": ":wave:\nI'm not sure where to ask this, so leaving my question here.\n\nEven though I've been building themes for HubSpot CMS for a while and working with websites on HubSpot CMS, I have never used the staging feature.\n\nCould someone explain the benefits of staging vs local development? Or describe a use case why one would need to use staging.\n\nThanks a lot!",
    "reply_count": 14,
    "reply_users_count": 5,
    "replies": [
      {
        "time_stamp": "2024-09-26 09:00:35"
      },
      {
        "time_stamp": "2024-09-26 09:21:17"
      },
      {
        "time_stamp": "2024-09-26 09:56:54"
      },
      {
        "time_stamp": "2024-09-26 12:23:22"
      },
      {
        "time_stamp": "2024-09-26 12:55:28"
      },
      {
        "time_stamp": "2024-11-06 11:00:21"
      },
      {
        "time_stamp": "2024-11-07 04:34:51"
      },
      {
        "time_stamp": "2024-11-07 06:10:47"
      },
      {
        "time_stamp": "2024-11-07 10:37:41"
      },
      {
        "time_stamp": "2024-11-07 10:45:51"
      },
      {
        "time_stamp": "2024-11-07 10:47:07"
      },
      {
        "time_stamp": "2024-11-07 11:08:34"
      },
      {
        "time_stamp": "2024-11-07 11:13:40"
      },
      {
        "time_stamp": "2024-11-07 14:29:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-09-26 09:00:35",
    "text": "<@UJAPS2K4N> maybe you can share some of your experience on the topic :relaxed:"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-09-26 09:21:17",
    "text": "Hey <@UMZFZHVUJ>, sure thing.\n\nThe staging is an extremly powerful tool.\nOne of the many usecases is to rework all existing pages without worrying about something going downhill on the live pages.\n\nLet's put it that way:\nSomebody has built a website on Growth(just to name a theme that everybody knows) and at some point this person buys a theme from you. Now - the person is in the position to rebuilt everything on your theme. There are a few options how to migrate:\n• clone the pages and apply all changes to the cloned one\n• simply change the template in the page-builder\nThose options can lead to a lot of problems since\n• cloning the page will result in a new URL. Since you can't have several pages with the same URL, you'll potentially end up in a redirect solution/rabithole. \n• your theme might be more advanced than growth and utilize custom modules. Therefore changing just the template will lead to the result that the content most likely won't be transferred automatically. \nThis is where staging comes into play.\nYou can simply clone the existing page to staging, apply all changes, even publish it in staging and share the staging links with stakeholders. After successful approval, you can replace all published pages that were staged with a click of a button.\n\nA few more benefits of staging:\n• the URL stays the same after replacing live pages with staged pages. This means you don't have to think about redirects and such.\n• Staged pages are completely seperated from live pages during the staging process. You can change content, templates, links... everything\n• You can push X pages to live at once. Great for a website relaunch where you want to relaunch all pages at once\n• ...\n"
  },
  {
    "poster": {
      "poster_name": "Roberto Pacheco",
      "poster_handle": "roberto476"
    },
    "time_stamp": "2024-09-26 09:56:54",
    "text": ":point_up:best explanation"
  },
  {
    "poster": {
      "poster_name": "Bradley",
      "poster_handle": "bradley554"
    },
    "time_stamp": "2024-09-26 12:23:22",
    "text": ":point_up_2: Yepp. This. I use staging for literally everything, even if it's just a single new page. A lot easier than working with draft pages"
  },
  {
    "poster": {
      "poster_name": "Alexis Eduardo Rodriguez Bastidas",
      "poster_handle": "alexisrod1997"
    },
    "time_stamp": "2024-09-26 12:26:58",
    "edited": {
      "time_stamp": "2024-09-26 12:28:08"
    },
    "text": "Hello, I was wondering where to post this question! It's regarding Stripe's integration as a payment processor. We have a custom-built website with custom code that integrates Stripe natively through iframes. We want to activate the integration of Stripe as a payment processor in HubSpot to import data from our clients' subscriptions to HubSpot. I want to confirm if this would not affect at any time the development that we had already done and at the same time, thus continue allowing customers to continue paying in our website as they always have. We only want to use the integration to be able to bring data from our clients' subscriptions, not to charge from HubSpot. Greeting!"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-09-26 12:55:28",
    "text": "Wow <@UJAPS2K4N>\nThis is the most profound answer I could have expected!!! You should turn it into a blog post or something\n\nThanks so much :orange_heart:"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2024-09-26 15:08:42",
    "text": ":rocket: Level Up Your HubSpot Development Skills: Join the CRM Customization Bootcamp! :desktop_computer:\n\nAre you ready to master UI extensions and take your HubSpot development to the next level? :fire:\n\n:male-technologist: Starting October 16th, join Justin Givens and Carter McKay for a 6-week intensive bootcamp that will transform your HubSpot development skills!\n\n:dart: Who’s it for?\n• Developers with JavaScript experience (2+ years recommended)\n• HubSpot admins or public app owners\n• Those ready to dive deep into React, GraphQL, and serverless functions\n:key: What you’ll learn:\n• Build custom UI extensions and CRM cards\n• Create powerful integrations using the HubSpot CLI\n• Master the new frontier of HubSpot development\n:bulb: Why now? Public cards for public apps are now in beta! Be at the forefront of this game-changing feature for the HubSpot ecosystem.\n\n:trophy: By the end, you’ll have built real-world extensions for our fictional company, Riley Rentals. Show off your skills and see what your fellow developers create!\n\nDon’t miss this chance to learn from industry experts and join a community of innovative HubSpot developers.\n\n:point_right: <https://events.academy.HubSpot.com/events/details/HubSpot-academy-crm-customization-bootcamp-for-developers-october-2024-presents-HubSpot-academy-crm-customization-bootcamp-for-developers-october-2024-2024-10-16/|Register now>\n\nSpots are limited and filling up fast. See you on October 16th!",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-09-27 07:43:26"
      },
      {
        "time_stamp": "2024-11-06 08:40:48"
      },
      {
        "time_stamp": "2024-11-06 08:42:39"
      },
      {
        "time_stamp": "2024-11-06 08:43:09"
      }
    ]
  }
]