[
  {
    "poster": {
      "poster_name": "Simon Harvey",
      "poster_handle": "sharvey"
    },
    "time_stamp": "2024-09-16 05:38:37",
    "text": "Does anyone have any experience moving objects between HS instances? I have a customer who is looking to split their HubSpot instance and we need to be able to export objects and associations and then re-import all the data into the second HS instance. For example, export Deals with Contacts, Companies, Line Items, Notes, Emails, etc. I can’t see how to do this using regular Export / Import. Is is possible? If so, where should I start?",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-16 07:58:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ryan Ginsberg",
      "poster_handle": "ryan294"
    },
    "time_stamp": "2024-09-16 07:58:45",
    "text": "Interested in writing a custom script which can handle this via API?"
  },
  {
    "poster": {
      "poster_name": "Andrey Kondratyuk",
      "poster_handle": "andrey"
    },
    "time_stamp": "2024-09-16 09:36:34",
    "edited": {
      "time_stamp": "2024-09-16 09:36:46"
    },
    "text": "can someone on the HS cookie banner team please reach out to me? I'm running into an issue where replacing the `src` attribute of a video with `hs-saved-src` breaks styles and autoplay"
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-09-16 11:46:14",
    "text": ":alert: *IT'S INBOUND WEEK* :alert: \n\n:sprocket-dance: Hey HubSpot Dev Community! :sprocket-dance:  This week is our annual sales, marketing, and product conference  - <https://www.inbound.com/|INBOUND>. Many of our helpful community devs will be in attendance. Many HubSpotters will be in attendance as well. You may see a drop in community responses this week, and any beta channels will be quieter than usual as well.\n\nAs always, please push Support to open a ticket on your behalf for any crucial issues, even if they say they cannot assist with technical issues and refer you here. *This is not a support space*, it's a peer-to-peer collaboration space. You may also like to try posting in the <https://community.HubSpot.com/t5/HubSpot-Developers/ct-p/developers|HubSpot Developer Community Forums> for any issues you are stuck on or aren't getting replies to in here.\n\nLooking forward to connecting to any of you that will be at INBOUND! If you haven't already, please join us in <#C072R3E9FM4|inbound24>. :sprocky:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-17 08:21:45"
      }
    ]
  },
  {
    "subtype": "channel_topic",
    "topic": "General HubSpot developer discussion, collaboration and fun.\n\n:rotating_light:Not a HubSpot support channel :rotating_light:\n\nFor support, go to <https://help.HubSpot.com/> or post in our Developer Community Forums <http://bit.ly/HubSpotdevform>",
    "text": "set the channel topic: General HubSpot developer discussion, collaboration and fun.\n\n:rotating_light:Not a HubSpot support channel :rotating_light:\n\nFor support, go to <https://help.HubSpot.com/> or post in our Developer Community Forums <http://bit.ly/HubSpotdevform>",
    "time_stamp": "2024-09-16 11:47:03"
  },
  {
    "poster": {
      "poster_name": "Rakel Fairfull",
      "poster_handle": "rfairfull"
    },
    "time_stamp": "2024-09-16 12:22:31",
    "text": "Hi! I'm trying to do this, how did you get the quiz results to show up on the confirmation message?"
  },
  {
    "poster": {
      "poster_name": "Nich Mueller",
      "poster_handle": "nich"
    },
    "time_stamp": "2024-09-16 12:31:58",
    "edited": {
      "time_stamp": "2024-09-16 12:32:27"
    },
    "text": "HubSpot form can't do any calculations for a quiz result... so depending on your implementation, showing a confirmation message will likely have to come from some JS calculation to produce the result and DOM manipulation"
  },
  {
    "poster": {
      "poster_name": "Ariel - www.outsourceHubSpot.com",
      "poster_handle": "ariel.rajmaliuk603"
    },
    "time_stamp": "2024-09-16 15:33:39",
    "text": "Hi all, I’ve made it to Boston! Let me know if you’re around and want to meet up.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-16 15:40:00"
      },
      {
        "time_stamp": "2024-09-16 15:40:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "SJ Morris (she/her)",
      "poster_handle": "sjmorris"
    },
    "time_stamp": "2024-09-16 15:40:00",
    "text": "Hey <@U013W6S0669>! Posting in <#C072R3E9FM4|inbound24> and not general will probably yield more targeted results :) see you soon! "
  },
  {
    "poster": {
      "poster_name": "Ariel - www.outsourceHubSpot.com",
      "poster_handle": "ariel.rajmaliuk603"
    },
    "time_stamp": "2024-09-16 15:40:38",
    "text": "You are right, I will post it there "
  },
  {
    "poster": {
      "poster_name": "Viviana Cardenas",
      "poster_handle": "vcardenas"
    },
    "time_stamp": "2024-09-16 15:57:58",
    "text": "Hi team,\n\nWe use custom user properties on companies in HubSpot to store important user-ownership information. This information is in use by some integrated tools (6sense), and it recently starting throwing errors despite nothing in our configuration changing.\n\nWhen troubleshooting with the third-party vendor, they informed us of the following:\n\n--\n\"For the fields that you have mentioned - ae_owner (AE Owner) and bdr_owner (BDR Owner) - I see that these fields are now Reference fields, with the reference type as {\"reference\": [\"OWNER\"]}.\n\n\"Please note that we only display reference type fields for User and RecordType objects in the UI, owing to which the reference type as \"OWNER\" is not supported.\n\n\"The solution for this would be to update the reference type from OWNER to USER, which would in turn link the field to the USER object within HubSpot, and then pull the data.\"\n--\n\nCan you please confirm if the custom field type for HubSpot user has recently changed in your backend settings to be of a different  type as described above?  I've confirmed with 6sense that other customers besides just us who are integrated with HubSpot are receiving this error now for any synced User fields. Their engineering team is also investigating, but all signs are pointing to that HubSpot data architecture for Owner properties changed recently. Is that true? This is what I am trying to confirm. They were previously reference type fields for User, not Owner.\n\nThank you"
  }
]