[
  {
    "poster": {
      "poster_name": "Ben Newport",
      "poster_handle": "ben.newport"
    },
    "time_stamp": "2024-09-04 02:02:10",
    "text": "Hi Guys, MY developers are having trouble with a HubSpot #non-form. We are adhearing to the guides in the knowledge base...\n\nFirstly, is there a better slack channel to ask a question about non-forms?"
  },
  {
    "text": "Anyone else getting featured images returning 0 width and height?\nOn a blog post page using the content variable",
    "time_stamp": "2024-09-04 05:30:58",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-09-04 05:42:20"
      },
      {
        "time_stamp": "2024-09-04 05:55:21"
      }
    ]
  },
  {
    "text": "That’s weird using get content by id get’s it but the default content does not, Feel like I don’t want to add this but might have to",
    "time_stamp": "2024-09-04 05:42:20"
  },
  {
    "poster": {
      "poster_name": "Matt Scott",
      "poster_handle": "mscott"
    },
    "time_stamp": "2024-09-04 05:55:21",
    "text": "Not a fan of the fix…\n```{% set content = content_by_id(content.id) if content.featuredImageWidth == 0 %} ```"
  },
  {
    "poster": {
      "poster_name": "Andi Abode",
      "poster_handle": "andi.abode"
    },
    "time_stamp": "2024-09-04 07:29:48",
    "text": "Thanks Danielle! There's not necessarily a concern in running them, we just want to make sure we are classifying them correctly so we aren't allowing unnecessary scripts when our users change their privacy preferences. Is there any specifics info about what these scripts are doing exactly that you can give?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 08:03:59",
    "text": "Hey everyone :wave: \n\nI'm looking to find some cool examples / use cases for CRM customization, like CRM Cards.\n\nIf you're open to sharing with me (and maybe be featured at INBOUND), please DM me and I'll share more details."
  },
  {
    "poster": {
      "poster_name": "Danielle Urban",
      "poster_handle": "danielle844"
    },
    "time_stamp": "2024-09-04 09:14:54",
    "text": "Ahh ok. Do you have 2 HubSpot accounts tracking the same website? maybe a sandbox + production? those two <http://js.hs-scripts.com/XXXX|js.hs-scripts.com/XXXX> are usually your script loader for your account and the numbers are your HubID.\nI know analytics is behavior tracking.\nCollected forms is essential if you're relying on it to capture non-HubSpot form fills.\nEvents visualizer is the no-code tool that lets you set up custom event tracking on specific elements."
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2024-09-04 09:17:42",
    "text": "Any help here would be GREATLY appreciated. Thanks so much in advance."
  },
  {
    "subtype": "bot_message",
    "text": ":HubSpotheart:*Help your fellow HubSpot Developers!*:HubSpotheart:\n\nThis Slack lives and breathes by its community. If you're posting a question, take a moment and click around a few channels to see if there are any questions you can help answer. Instant karma!",
    "username": "Help the Community",
    "time_stamp": "2024-09-04 10:55:02"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 11:47:31",
    "text": "Do you have GDPR check boxes and text that aren't showing? Can you share a link to the page?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 11:52:58",
    "text": "To clarify, you have Sales Pro, but marketing Free and you want to create a marketing form with conditional logic? \n\nWhat are the form fields? One multi choice question with five answers? Each routed to a different next question?"
  },
  {
    "poster": {
      "poster_name": "Adrian Colon",
      "poster_handle": "acolon"
    },
    "time_stamp": "2024-09-04 12:04:48",
    "text": "<@U03AKL6Q1B2> We do not. The website page is currently on our staging site. Here's a direct link to the form itself: <https://share.hsforms.com/1AlDYxOAkTIWYDzUiUylbqwd1vkl>"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 12:11:09",
    "text": "Without the page link, I can't do much to help. You'll need to inspect the code, find the color for the error, and add an overwrite to your theme.\n\nThe form link only produces the error once, not sure why it's showing twice on your screenshot from the staged page without being able to test it."
  },
  {
    "poster": {
      "poster_name": "Nenad Kostic",
      "poster_handle": "nenad"
    },
    "time_stamp": "2024-09-04 13:26:12",
    "text": "Yes, Sales Pro and nothing else (don't know why).\nI have 4 (yes/no) questions with 2 conditions, but only 1 route to different next question.\nIf answer = YES then continue\nIf answer = NO then open question X before continue."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 13:31:45",
    "text": "ok, there isn't going to be a way to build that on HubSpot without changing your subscription. Even a custom coded multi-step form with logic would require marketing/content hub starter at minimum. Where are you going to host it? on an existing website page or a landing page?\n\nYou could create each question as a separate form, then have a developer code those questions/answers into your external site. All of the questions/answers would be captured by the code and associated to the original contact as long as you capture who they are first."
  },
  {
    "poster": {
      "poster_name": "Nenad Kostic",
      "poster_handle": "nenad"
    },
    "time_stamp": "2024-09-04 13:39:13",
    "text": "So far the form was suposed to be standalone. But, next option would be a landing page.\nOK, thanks for making me steps. I have no experience with developer code. Is somewhere a starting point where can I learn?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-09-04 13:44:27",
    "text": "To do a standalone form, you'd have to have marketing hub pro for conditional logic.\n\nCreating a multi step form isn't where I would start with learning code, it would be a lot easier/less time to hire a dev to help you."
  },
  {
    "poster": {
      "poster_name": "Joachim Almeke",
      "poster_handle": "joachim.almeke"
    },
    "time_stamp": "2024-09-05 00:49:18",
    "text": "Is it possible to add the `data-consent=\"analytics\"` attribute to the HubSpot analytics script tag to ensure it only runs after the user has given explicit consent for analytics tracking, in line with GDPR compliance?\n```What I want to achieve is transforming this: &lt;script type=\"text/javascript\" id=\"hs-script-loader\" async defer src=\"js-eu1.hs-scripts.com/139607942.js\"&gt;&lt;/script&gt; into this: &lt;script type=\"text/javascript\" id=\"hs-script-loader\" data-consent=\"analytics\" async defer src=\"js-eu1.hs-scripts.com/139607942.js\"&gt;&lt;/script&gt;```",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-09-05 04:49:32"
      },
      {
        "time_stamp": "2024-09-05 05:39:28"
      }
    ]
  }
]