[
  {
    "poster": {
      "poster_name": "Sandipan Saha",
      "poster_handle": "sandipan.s"
    },
    "time_stamp": "2020-07-29 03:35:07",
    "text": "Hi all, I have a doubt... may seem very silly, but here is my situation:\n\nI had recently migrated a template designed by my developer from my HubSpot dev account to my HubSpot main account. But for some reason I need to remove it again completely from my main account. So, if I delete the folder from design tools, will that be enough to delete the template folder and all its details completely from the main account ? Or do I need to remove it in any other way ?\n\n(P.S. that template isn't being used anywhere, its just got recently migrated to the main account and lying there with no dependencies...)",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2020-07-29 08:56:59"
      },
      {
        "time_stamp": "2020-07-30 02:47:00"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-07-29 08:55:16",
    "text": "<@UEC65BQV8> So youre likely talking about choosing a Theme template vs a “legacy DND page builder template” — There currently isnt a way to migrate content between the two styles of content which is why if you choose a theme template you are stuck with that style of template and vice-a-versa."
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2020-07-29 08:56:59",
    "text": "<@UMWRTGBMZ> Deleting the folder from design tools should remove it entirely from HubSpot"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2020-07-29 09:06:34",
    "text": "Hrm, well, they are actually just both html locally-deved custom coded templates. All I did was add a &lt;dnd area&gt; to a new one to give it whirl. In my scenario I am not really sure that either qualify as the legacy dnd (as in the one you would create in the DM )"
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2020-07-29 09:07:05",
    "text": "Seems strange that by adding a DND area suddenly puts it in a different category"
  },
  {
    "poster": {
      "poster_name": "Victoria Elliott",
      "poster_handle": "velliott"
    },
    "time_stamp": "2020-07-29 09:25:14",
    "text": "We are currently working on adding this ability to the template swap tool where you can swap from to the legacy dnd templates to the new coded files. It is in an early beta now but would happy to add you to it if you wanted to try it out. Do you foresee a need to swap from a coded file to legacy dnd templates? We haven't built that functionality yet."
  },
  {
    "poster": {
      "poster_name": "Douglas Welcome",
      "poster_handle": "dwelcome"
    },
    "time_stamp": "2020-07-29 15:15:55",
    "text": "Sorry, <@ULCSUPTGU> I am a little confused. All I did was add a &lt;dnd area&gt; to a coded template. Does this then make it legacy?"
  }
]