[
  {
    "poster": {
      "poster_name": "Andres Gutierrez",
      "poster_handle": "andres121"
    },
    "time_stamp": "2023-03-29 08:33:13",
    "text": "hi guys, i am starting as a developer in HubSpot cms and i have some doubts when i want to develop an email template, i wanted to know if inside the content module for email i can use the repeater option to add the amount of items that the user wants. the other thing is how can i make the width and height of a dynamic image in my html + hubl template. for example if i insert an image for the logo and the user wants to change the size?\nThank you for your support to this channel.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-29 19:22:20"
      },
      {
        "time_stamp": "2023-03-30 06:06:21"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dylan Brown",
      "poster_handle": "dylan536"
    },
    "time_stamp": "2023-03-29 11:46:36",
    "text": "Hi there, I have an email with two images that use personalization tokens / HubSpot Properties as links. However, in the email analytics, it comes up as 0% in the HTML click map. How can I track the clicks of a link that's not directly in an email but in a personalization token in the email?",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-30 12:09:25"
      },
      {
        "time_stamp": "2023-03-31 05:11:28"
      },
      {
        "time_stamp": "2023-03-31 05:13:02"
      },
      {
        "time_stamp": "2023-03-31 05:13:08"
      },
      {
        "time_stamp": "2023-04-12 11:28:19"
      },
      {
        "time_stamp": "2023-04-12 11:29:40"
      },
      {
        "time_stamp": "2023-04-12 23:56:52"
      },
      {
        "time_stamp": "2023-04-12 23:58:17"
      },
      {
        "time_stamp": "2023-04-18 10:44:26"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-03-29 19:22:20",
    "text": "Yes you can use the repeater option. I <https://www.courtneyfantinato.com/custom-HubSpot-email-template/|wrote something up> using it as a way to provide flexible content blocks that you may find helpful.\n\nAs for the image, you could allow the end user to upload/choose an image with the image field, and then use the number field to choose a width to display the image at, providing the min and max. Or there’s other options like the select dropdown if you want to provide pre-defined sizes. It all depends on what you need. But I would only do image width, and set the height to auto."
  }
]