[
  {
    "text": "let me elaborate on what I’m trying to do\n\nI’m creating modules to be used by marketers that don’t know code.\n\nlet’s say it’s something like this (got this image from the webs), with custom css\n\nI create a module, and without any further work from my side, I want marketing to be able to use this module in various emails with custom content (fields for img, title, text, …)\n\nwhen the columns have the `column` class set, they wrap into a single column when using this module within a dnd template, but not when using the dnd email editor. is it possible to create a responsive module that would wrap not only when used within a dnd template, but also when used in the dnd email builder?",
    "time_stamp": "2023-03-21 03:46:17"
  },
  {
    "poster": {
      "poster_name": "Emil",
      "poster_handle": "hi926"
    },
    "time_stamp": "2023-03-21 03:46:58",
    "text": "I hope that makes sense\nI guess it’s not possible to achieve that, is it?"
  },
  {
    "poster": {
      "poster_name": "Chris Barry",
      "poster_handle": "cbarry"
    },
    "time_stamp": "2023-03-21 06:28:38",
    "text": "is there anyway to get these metrics without creating a HubSpot email template?"
  },
  {
    "poster": {
      "poster_name": "Krista Triviso",
      "poster_handle": "krista661"
    },
    "time_stamp": "2023-03-21 08:12:15",
    "text": "Hi, I am trying to send a transactional email with my private app API key. I have checked that the API key's scopes has \"transactional-email\" enabled. But every time I send a post to <https://api.hubapi.com/marketing/v3/transactional/single-email/send>, I get an error \"\"The API key provided is invalid\".\n\nI am able to use this API key for other things such as sending a CBE so I know it is valid. Does anyone know what's going on here?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-21 08:13:00"
      },
      {
        "time_stamp": "2023-03-22 01:41:16"
      },
      {
        "time_stamp": "2023-03-22 07:22:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-21 08:13:00",
    "text": "<https://HubSpotdev.slack.com/archives/C2YHAHB6K/p1679407759685299>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-21 08:22:05",
    "text": "Well currently no, this is because each tracking pixel is unique to that email and the contact it's going to. HubSpot also converts the links to that they can be tracked. I'm interested in the use case though, would custom properties on templates work? <https://community.HubSpot.com/t5/Gmail-Sales-Extension/Manually-adding-email-tracker/td-p/278000>"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-03-21 14:39:43",
    "text": "No, if you search in this Slack people have asked similar. I believe HubSpot is working on making the DnD editor more flexible in this regard but I don’t know details or timelines."
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2023-03-21 14:40:52",
    "text": "Do you have a code example you can share?"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-03-21 16:08:37",
    "text": "Unfortunately, personalization tokens seem to work differently in emails than they do elsewhere, and you can’t do much with them from a logical standpoint. For example, <https://developers.HubSpot.com/docs/cms/hubl/filters|you can’t use filters to transform them> (see the callout box at the end of the intro).\n\nYour experience not being able to use their values with logical operators also reflects what I’ve experienced, even with the Fully Programmable Emails beta being enabled.\n\nThe most reliable workaround that I’ve found so far is to create a membership list based on the contact property that you want to serve as the switch, then use Smart Content to serve that content based on list membership. It’s a bit of a cumbersome workaround and requires you to clean up after the fact, but it gets the job done when you need it to be done."
  }
]