[
  {
    "poster": {
      "poster_name": "Pramod Ch",
      "poster_handle": "pramod231193"
    },
    "time_stamp": "2022-03-08 05:47:32",
    "text": "Hello everyone! I'm trying to A/B/n test an email using HubSpot right now? I have two open questions\n1. HubSpot seems to support A/B testing for emails for only 2 versions, however I have four versions that I want to test simultaneously, does anyone know what's a good way to do this?\n2. Also, it seems like HubSpot does the splitting of the list automatically based on the percentage we set, ex - for a list of 1000 contacts, if the split percent is 50-50 for an a/b test, HubSpot sends an email of version 1 to 500 contacts and another version to other 5000 contacts, does anyone know the criteria involved in HubSpot on how it splits the list? ",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-03-08 07:10:57"
      },
      {
        "time_stamp": "2022-03-08 08:46:06"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2022-03-08 07:10:57",
    "text": "1. The only way to accomplish testing more than 2 versions would be to do it manually. Split your contacts manually 4 ways, and send the 4 emails, one to each group.\n2. I haven't read anything in the documentation on how it's split. I assume it's just randomized."
  },
  {
    "poster": {
      "poster_name": "Benjamin Murray",
      "poster_handle": "bmurr22"
    },
    "time_stamp": "2022-03-08 08:46:06",
    "text": "1. HubSpot only supports A/B testing. Testing with more than 2 versions can lead to too small of a significance in the results or make it difficult to tell what resonates well with your audience. For instance if you are testing header images and two have people, two don’t, colors/tones are different - how do you pick a winner?\n2. It’s randomized\nIf you are looking for ways to control this better, you could use workflows to break out users by their contact ID for example and pull out whether the id ends odd/even, or ending in 1/3 vs 2/4 vs 5/7 vs 6/8."
  }
]