[
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-22 09:02:57",
    "text": "any guidelines  on creating Custom modules which are compatible with the new drag n drop email builder?"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-02-22 09:04:23",
    "text": "i have a coworker dealing with this issue right  now"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-02-22 10:51:37",
    "text": "They _should_ just work, any particular issues you're seeing?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-22 10:52:25",
    "text": "well it’s more that it’s not obvious what the outer structure of the drag n drop template is going to do  to our modules"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-22 10:53:22",
    "text": "for example I assume you guys wrap a table around our modules"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-22 10:54:06",
    "text": "andthat table is nested in a a TD in the outer part of the email template.\n\nall of this stuff affects how we may have to treat our modules because it can affect email client compatibility"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-22 10:57:09",
    "edited": {
      "time_stamp": "2019-02-22 10:57:40"
    },
    "text": "for example if you nest tables more than 6 levels deep you sometimes run into problems. on top of that, if the drag n drop email is controlling things and has an outer padding of say 25px. but our custom modules are coded based on the assumption they’re allowed to go full width, our modules may cause the width of the email to display wonky in outlook"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-02-22 11:11:39",
    "text": "basically everything he said"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-02-22 13:40:59",
    "text": "Gotcha, appreciate the detail. We have some solutions on the roadmap to open up some of these, like allowing custom (and removal of) padding on all modules including all built in modules. I'll bring the rest of your feedback to the team to keep an eye on as we merge the templating for drag and drop and Design Manager together."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-02-22 13:43:15",
    "text": "Would appreciate any and all feedback about the older \"Classic\" templating you have too, this is a chance for us to clean things up moving forward. If you have a chance I'd really appreciate if you could share your \"I hate that it does this\" list with me and I can make sure we either fix, or don't make the same mistakes again, as we merge them back together. You can email me directly on <mailto:shay@HubSpot.com|shay@HubSpot.com> :+1:"
  }
]