[
  {
    "time_stamp": "2024-09-04 08:00:18",
    "text": "Reminder: There are lots of great ways to stay connected with what’s happening in HubSpot development. To be made aware of any changes that affect developers we recommend <https://developers.HubSpot.com/changelog|subscribing to our developer changelog>. We post announcements about new developer facing functionality as well as communicate from there if we need to make <https://developers.HubSpot.com/docs/breaking-change-definition|breaking changes>."
  },
  {
    "poster": {
      "poster_name": "Hannah Seligson - Developer Advocate",
      "poster_handle": "hseligson"
    },
    "time_stamp": "2024-09-04 11:47:48",
    "text": "Hi, everyone; we have an update on this recent public beta launch for generic webhook subscriptions. Please see below for more information:\n• *ENGAGEMENT:* The ENGAGEMENT object type is no longer supported in generic webhook subscriptions.\n• *EMAIL:* Subscriptions to the EMAIL object type are allowed, but creation of subscriptions for the `hs_email_html` and `hs_email_subject` properties is restricted.\n• *COMMUNICATION:* Subscriptions to the COMMUNICATION object type are also allowed, but creation of subscriptions for the `hs_communication_body` property is restricted.\n    ◦ *Note:* Existing subscriptions for `hs_communication_body` in COMMUNICATION objects will be left as-is and continue functioning as expected.\nEvery other property and every other subscription type for these objects is allowed. Thank you!"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-09-04 12:33:44",
    "text": "Thanks <@U7SL518D6> for your reply. Genuinely hope the new update will help developers be in a loop of the areas of HubSpot they specialized in since the product is sooo diverse at this point.\n\nI would be happy to discuss with anyone on the team who is planning to conduct user research, or whatever, to share my thoughts on how I am monitoring the updates :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Martin Christiansen",
      "poster_handle": "mac067"
    },
    "time_stamp": "2024-09-04 13:00:23",
    "text": "Great news <@U03MLCLS5BN> :+1: \n\nAny eta on when EMAIL will be possible to opt in to? (It is still not visible via UI)"
  },
  {
    "poster": {
      "poster_name": "Hannah Seligson - Developer Advocate",
      "poster_handle": "hseligson"
    },
    "time_stamp": "2024-09-04 13:03:06",
    "text": "Ah! Yes, thank you! Our engineer estimated 30 minutes - I apologize for the inconvenience!"
  },
  {
    "poster": {
      "poster_name": "Hannah Seligson - Developer Advocate",
      "poster_handle": "hseligson"
    },
    "time_stamp": "2024-09-04 13:27:42",
    "text": "This should be updated now!"
  }
]