[
  {
    "poster": {
      "poster_name": "Heena Vanjani",
      "poster_handle": "heena"
    },
    "time_stamp": "2022-09-21 01:36:31",
    "text": "Hi <@U042ZSGKQLB>\n\nSent you a DM, Please check.\nThanks;\nHeena\n<https://www.zealousweb.com/>"
  },
  {
    "poster": {
      "poster_name": "Lizzie",
      "poster_handle": "hunter.herrneckar"
    },
    "time_stamp": "2022-09-21 10:52:13",
    "text": "Hackbright is calling all Devs with at least 1 year of experience. Walmart has a partnership with them and are looking for 10-15 more devs (Python, Java, Javascript, React experience etc) to join a FREE class( _yes, it is free because Walmart is paying for the cohort!_ ) for several weeks. After completion of the class, the entire group interviews with Walmart. From my knowledge, they've had a high success rate of hiring those who complete the class!!\n\nIf you think you are looking for a new environemnt, way to scale your skills, caught in a layoff or know a dev who was - I just wanted to share that you can apply / register or reach out to the sourcers for this class via this link - <https://hackbrightacademy.com/walmart-x3/> .\nYou can also email <mailto:jackie@hackbrightacademy.com|jackie@hackbrightacademy.com> for more details if you think you might be interested.:blush: *Applications close on September 30th though so time is a factor!*\n\n_Additionally, If you like to give back/ help out the next generation of software engineers and have been searching for the right opportunity...._ Hackbright is also seeking Professional Volunteer Mentors to help and support the Hackbright SWE student community. If you are able and willing to remote mentor students in a Hackbright cohort ( 6 weeks, 1hr meetings virtually per week) please feel free to fill out this form.(<https://hackbrightacademy.com/mentor-at-hackbright/#apply_mentor>)\nThis will put you in contact with a member of Hackbright’s Team to get more details before committing. Hackbright Mentors have long had a great impact on Hackbright’s Mission to change the ratio in Tech and leave a wonderful impact on their mentee's outcomes in the job search!\n*Hackbright Academy Coding Bootcamp*\n*<https://hackbrightacademy.com/walmart-x3/|Apprenticeship for women and others in Software Engineering - Hackbright Academy and Walmart>*\nHackbright Academy's gender equality mission is shaping the tech world, and apprenticeships help ensure everyone is included. Change the ratio.\n*Est. reading time*\n6 minutes\n\t<https://hackbrightacademy.com/walmart-x3/>\n*Hackbright Academy Coding Bootcamp*\n*<https://hackbrightacademy.com/mentor-at-hackbright/#apply_mentor|Mentor a student at Hackbright Academy | Change the Ratio>*\nMentors are an exeptionally meaningful part of the program at Hackbright Academy. Join our mentor community and help to #changetheratio and diversify tech.\n*Est. reading time*\n3 minutes",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-09-22 06:56:55"
      },
      {
        "time_stamp": "2022-09-22 10:25:41"
      }
    ]
  }
]