[
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2022-01-05 09:20:14",
    "text": "I currently have a meeting link embed code in my form post success message to follow-up with a meeting request. Is there anyway to forward the first/last name and email fields from the intial form to autcomplete on the meeting module so that users dont have to fill a second form with the same questions?",
    "reply_count": 4,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-01-05 09:29:04"
      },
      {
        "time_stamp": "2022-01-05 10:14:30"
      },
      {
        "time_stamp": "2022-01-05 10:25:25"
      },
      {
        "time_stamp": "2022-01-05 10:34:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-05 09:29:04",
    "edited": {
      "time_stamp": "2022-01-05 09:31:53"
    },
    "text": "I’m not sure how you have things set up, so it might not be the exact same situation for you, but we’ve done something similar to this in the past, where we passed the form field values as URL parameters in onFormSubmitted, and then parse those to auto-fill in the corresponding fields on the follow-up form. It’s a bit messy to implement, but it did work.\n\nThat was for multi-page forms though. When you say module, I’m a bit hesitant--- there’s no way to use dynamic values in module fields as far as I’m aware, if that’s what you’re going for."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-05 10:14:30",
    "text": "Doubt this would be possible in a meeting widget though, as those are iFramed. You _might_ have luck if there’s a page refresh, as the property values should now be available via cookies, but I’m not totally sure even that would work"
  },
  {
    "poster": {
      "poster_name": "CJ Herrmann",
      "poster_handle": "cj"
    },
    "time_stamp": "2022-01-05 10:25:25",
    "text": "Thanks for the reply. Yeah I have had some success with url paramters (firstname, lastname, email) to populate but didn't know if there was any specific things that iframe was looking for when it instantiated"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-05 10:34:45",
    "text": "Oh, it’s using an iFrame? Good luck…"
  }
]