[
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2023-10-03 07:36:50",
    "text": "Sorry for the delay in answering here <@U04MN8Q0PA7>! Per Carter and Sejal, updating the CLI is the path go. :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-10-03 19:34:26",
    "text": "Is it just me or is there currently no way to tell which object type the card is currently being displayed on? The context var doesn't tell you and I don't see a way you could do it with fetchProperties",
    "reply_count": 7,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-03 19:52:46"
      },
      {
        "time_stamp": "2023-10-03 20:00:50"
      },
      {
        "time_stamp": "2023-10-03 20:01:28"
      },
      {
        "time_stamp": "2023-10-03 20:02:06"
      },
      {
        "time_stamp": "2023-10-04 15:02:55"
      },
      {
        "time_stamp": "2023-10-04 15:06:38"
      },
      {
        "time_stamp": "2023-10-10 12:03:15"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Sejal Parikh (HubSpot PM)",
      "poster_handle": "sparikh"
    },
    "time_stamp": "2023-10-03 19:52:46",
    "text": "Great callout. This is something we are thinking about, but it requires a little more deliberation with future consideration on more extension points. Say, if you could access which object the card is being rendered on, how would you use that information? Do you care more about the object type, or the page (record page) or location(sidebar/tab)?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-10-03 20:00:50",
    "text": "Well I mean the same card can be rendered across multiple record types, but say I want to display the same card across multiple record types but with different data. EX:\nI have an association table that will pull in the associated object for the deal and contact record pages, but there's no way to get the associations because I don't know which record type the card is currently being rendered on"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-10-03 20:01:28",
    "text": "If you provide the ability to display the same card across multiple record types, you definitely should be able to get the record type through some variable"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-10-03 20:02:06",
    "text": "I know the team is really protective of the context var, but something like this should definitely be included in the context var"
  }
]