[
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2023-12-21 04:46:58",
    "text": "Did you disconnect the domain in HubSpot settings &gt; Domains?"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2023-12-21 04:47:37",
    "text": "And are the pages still live in Website pages?"
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2023-12-21 04:50:07",
    "text": "Hey Goran, yes it is currently disconnected.\nYes they are also still live in the Website Pages.\n\nAn IT from the domain handler says that it's possible that the current host is redirecting it back to HubSpot but is that even possible with wordpress?\n\nI also checked the log and I don't see a redirect from the DNS recorded IP to HubSpot IP. I'm thinking that can this have something to do with the nameserver?"
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2023-12-21 15:24:17",
    "text": "You got yourself a weird issue here I have to say. It could be the nameserver but I'm not sure.\nPerhaps try to unpublish the pages on HubSpot but not sure if that's going to result in 404s or if the WordPress pages will just take over."
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2023-12-21 20:18:39",
    "text": "Yes this is also the first time I encounter this! I already tried unpublishing pages and it triggers 404 like the domain is connected to HubSpot but in this case it is not. We already contacted the wordpress host to check on their system for any redirects just to make sure."
  },
  {
    "poster": {
      "poster_name": "Goran Ilievski",
      "poster_handle": "goran308"
    },
    "time_stamp": "2023-12-21 21:04:05",
    "text": "What if you tried to publish the pages on the HubSpot system domains? Not sure it will help."
  },
  {
    "poster": {
      "poster_name": "Christensen Magtoto",
      "poster_handle": "chris858"
    },
    "time_stamp": "2023-12-21 23:29:44",
    "text": "It will publish the pages. The only thing we can think of right now is that somehow the wordpress hosting company is redirecting us to the HubSpot IP which was triggered when we first change our IP to HubSpot."
  }
]