[
  {
    "poster": {
      "poster_name": "Antoine Ravet",
      "poster_handle": "aravet"
    },
    "time_stamp": "2021-04-21 01:02:01",
    "text": "Hello,\n\nI have a table in the HubDB with a list of products.\nThe listing works very well and under the three languages, in this table I have labels in French, English, German to manage the translations.\n\nIn my code template, I can locate the language via the url and display the right fields for single product pages.\nHowever I have an SEO problem with the &lt;link rel=\"alternate\"&gt; specifying the wrong href. Obviously HubSpot doesn't understand that we have multiple languages for these pages and doesn't include the correct urls.\n\nDo you have a solution for this?\n\nThanks a lot :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Hanna Storaker",
      "poster_handle": "hs054"
    },
    "time_stamp": "2021-04-21 06:20:45",
    "edited": {
      "time_stamp": "2021-04-21 06:22:33"
    },
    "text": "Hi! My team is experiencing that every time we make changes to a blog post template, the content on blog posts built with that template disappears (besides title, featured image and other global content variables). Have anyone else experiences this? Could it be something wrong with my blog post template? We are going to have above 1000 blog posts, so its very scary if the content disappears when we make modifications to the template.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-21 06:48:57"
      },
      {
        "time_stamp": "2021-04-21 07:20:25"
      },
      {
        "time_stamp": "2021-04-22 05:30:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-04-21 06:48:57",
    "text": "So the good thing here is the data is rarely totally lost, which you can verify by looking at the JSON output using the \"developer info\" link in the sprocket menu when looking at a post. What I suspect is happening is you are removing or otherwise editing the module/tag names at the post level, which disconnects the JSON data stored for the page with the output from the template."
  },
  {
    "poster": {
      "poster_name": "Hanna Storaker",
      "poster_handle": "hs054"
    },
    "time_stamp": "2021-04-21 07:20:25",
    "edited": {
      "time_stamp": "2021-04-21 07:20:42"
    },
    "text": "Thank you for answering! So if we are adding new modules to the template (and it’s a drag and drop template) it shouldn’t change the module names? Do you know how to prevent this? <@U26BLKGE4>"
  }
]