[
  {
    "poster": {
      "poster_name": "Stuart Grant",
      "poster_handle": "stuart-g"
    },
    "time_stamp": "2022-02-24 12:41:12",
    "edited": {
      "time_stamp": "2022-02-24 12:51:32"
    },
    "text": "The `watch` command issue I mentioned previously - where my module HTML files are uploaded without any content, completely blank file - continues to occur. I've worked with several versions of the CLI, with a dozen different enterprise accounts, and found that the issue persists in most of the newer accounts that I manage though local development. Sandbox or production, doesn't seem to matter one way or another - blank template uploads with the `watch` command. `upload` works as a stop-gap, or I use the design mgr and drop it in.\n\nI'm wondering if there could be some setting or issue related to the environment itself and not the CLI. Is there anything I may be overlooking in regards to the access key settings or in the overall account settings for a client that could be causing the issue? I have full design management access for all environments.\n\nFolder structure, files are contained within a `src` directory, with HubSpot's standard template structure managed one level below. I'm running concurrent functions to compile TS and Tailwind classes at the same time for most development. However, even running the `watch` command in isolation, the issue persists. Seems to be happening with my `/modules` directory. I have seen a CSS file upload blank, as well.\n\nAny help would be greatly appreciated.\n\n`v3.0.11`  locally, tested `v3.0.10` and `v3.0.8`  of the `@HubSpot/cli` .\nDebugging the CLI provides ~no valuable information~ provided a \"failed\" upload message, with a \"retry\" message and then...the file successfully uploaded after the retry. No success message, though. When I do get a success message, it uploads blank.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-02-25 09:21:10"
      }
    ]
  }
]