[
  {
    "poster": {
      "poster_name": "Gonzalo Torreras",
      "poster_handle": "gonzalo"
    },
    "time_stamp": "2022-02-01 01:18:12",
    "edited": {
      "time_stamp": "2022-02-01 01:19:55"
    },
    "text": "In terms of coding, you can use them but for the content builder (previewing) we are limited to HubSpot capabilities.\nThere is a <https://HubSpotdev.slack.com/archives/CCQ7H31D5/p1641560281006100|WIP> from the community (probably as a Chrome extension), that expands such features. Although, unless you agree upon with the client I can't recommend it. For general themes to be sold in the marketplace or multiple clients you are creating a third party dependency of an unofficial component (so it may break in the future with HubSpot updates)."
  },
  {
    "poster": {
      "poster_name": "Chad Alderson",
      "poster_handle": "chad754"
    },
    "time_stamp": "2022-02-01 12:38:45",
    "text": "Hi - I'm new here. Hopefully this is a very easy question. Let's assume you have two devs working on a theme. One uses HubSpot's built-in editor, the other uses their own IDE and is running HubSpot CLI. Will these two workflows play nicely? My assumption is yes and that the built-in editor uses the exact same CLI. That said, I don't like to assume anything so please let me know! Thanks in advance :smile:",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2022-02-01 12:53:25"
      },
      {
        "time_stamp": "2022-02-01 14:44:58"
      },
      {
        "time_stamp": "2022-02-01 17:45:41"
      },
      {
        "time_stamp": "2022-02-01 17:55:25"
      },
      {
        "time_stamp": "2022-02-01 17:56:39"
      },
      {
        "time_stamp": "2022-02-01 18:49:57"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-01 12:53:25",
    "text": "This does work, as long as your developers are clear about which assets they are editing and when; there is the chance with this situation that one dev (most likely the one using the CLI) can overwrite an asset while the other is active. There is built-in revision history so these changes can be reverted, but using `watch` will lead to A LOT of publish versions. Best practice would be to have both devs use local development and git, just in case."
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2022-02-01 14:44:58",
    "text": "Agreed .."
  },
  {
    "poster": {
      "poster_name": "Chad Alderson",
      "poster_handle": "chad754"
    },
    "time_stamp": "2022-02-01 17:45:41",
    "edited": {
      "time_stamp": "2022-02-01 17:46:17"
    },
    "text": "<@U26BLKGE4> thanks for the reply here. Does the possibility of code collision happen if both are working from the HubSpot built-in editor as well, or is the risk applicable to just this hybrid scenario I described above?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-01 17:55:25",
    "text": "as you mentioned, the risk is also present if both are using the cloud editor"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-01 17:56:39",
    "text": "The only exception is editing anything at the page level, generally there will be a warning that another user is currently active. Additionally, the risk is a _bit_ lower because, presumably, a dev using the design manager will not publish as often as a local dev would."
  },
  {
    "poster": {
      "poster_name": "Chad Alderson",
      "poster_handle": "chad754"
    },
    "time_stamp": "2022-02-01 18:49:57",
    "text": "Thanks guys - truly appreciate your time and insight. Enjoy the rest of your week."
  }
]