[
  null,
  null,
  {
    "poster": {
      "poster_name": "Alice Mills",
      "poster_handle": "amills"
    },
    "time_stamp": "2018-10-10 09:41:39",
    "text": "Hi from sunny England! I've been using HubSpot for 9 months, leading the onboarding process at my company. Any other franchise companies in this channel? We've faced lots of interesting challenges trying to partition team access so regional franchisees can't see what their neighbours are up to. Hoping the new team developments announced recently will be the key to getting this off the ground.",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-10-10 09:53:53"
      },
      {
        "time_stamp": "2018-10-10 09:54:34"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-10-10 09:52:24",
    "text": "brilliant! - Well HubSpot CMS hopefully will be a great option... as we offer a few different ways to build - visual editors, design managers (1/2 code, 1/2 drag-n-drop), or locally (pure code)."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-10-10 09:53:16",
    "text": "You've accessed the new-to-HubSpot CMS Developer Discovery Kit, right <@UDA3F01U4>?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-10-10 09:53:53",
    "text": "Welcome <@UDB2BRH52> - great to have you a part of the developer community."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-10-10 09:54:34",
    "text": "Yes! lots of the new enterprise features helps with permissioning ... both in the HubSpot tool itself, ad the new \"Memberships\" feature for restricting public facing content on the website."
  },
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Vivi Lam",
      "poster_handle": "vivi"
    },
    "time_stamp": "2018-10-11 00:07:07",
    "text": "Thank you so much Luke! :smile: Well, I started working as a web developer in Aug after and now we have started with a big project and first time ever using HubSpot CMS so I thought it might be a good idea to have a helpline in case I get stuck :grimacing: For the moment I don't have any questions but they will come I bet, thanks for asking :relaxed:"
  },
  {
    "poster": {
      "poster_name": "Vivi Lam",
      "poster_handle": "vivi"
    },
    "time_stamp": "2018-10-11 00:09:19",
    "text": "Oh, wanted to say after graduating from university as a web programmer but that was in 2016 so haven't work in this field until now so feel kind of rusty but am learning and things are slowly coming back to me :laughing:"
  }
]