[
  {
    "poster": {
      "poster_name": "Martin Angeletti",
      "poster_handle": "martin041"
    },
    "time_stamp": "2024-08-01 05:57:10",
    "text": "Yes, the Identify method aligns more with what other applications do to link user activity with their current status, doesn't it? For instance, I mean apps like Intercom."
  },
  {
    "poster": {
      "poster_name": "Andrei Axinoi",
      "poster_handle": "andreiaxinoi"
    },
    "time_stamp": "2024-08-01 08:08:12",
    "edited": {
      "time_stamp": "2024-08-01 08:08:32"
    },
    "text": "I am working on enhancing our real estate website by introducing a feature that generates a \"Property Evaluation Report\" for each property listed. Each property is displayed on a dynamic page, and we aim to allow users to directly generate a downloadable PDF report from these pages. The PDF reports would feature detailed tables and dynamic charts tailored to each specific property. Since these charts and tables are not static components of the webpage, generating a PDF from a screenshot of the page would not be appropriate. Instead, I'm looking to develop a dynamic PDF template that can dynamically populate data via a POST request, ensuring each report is customized to the property being viewed."
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-08-01 08:13:09",
    "text": "Dynamic pages are perfect for this type of work, but you can use an HTML to PDF library. You set up the print stylesheet to get it right! This allows that to happen on the page itself.\n<https://www.npmjs.com/package/html-to-pdf-js>"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2024-08-01 08:15:43",
    "text": "You can also set up this in a workflow using some bundled package to do this, and then store the pdf in a property on the object/hubdb table. Whatever the source of your data is.  Trigger the workflow on whatever property updates happen or do it on a daily basis"
  },
  {
    "poster": {
      "poster_name": "Andrei Axinoi",
      "poster_handle": "andreiaxinoi"
    },
    "time_stamp": "2024-08-01 08:30:07",
    "text": "The workflow approach is not feasible as the client I'am working with, does not have  the Operations Hub therefore I don't have access to programmable automation in workflows."
  },
  {
    "poster": {
      "poster_name": "Andrei Axinoi",
      "poster_handle": "andreiaxinoi"
    },
    "time_stamp": "2024-08-01 08:37:56",
    "text": "Thank you so much for this idea! It's a great approach."
  }
]