[
  {
    "poster": {
      "poster_name": "Victoria Gumaer",
      "poster_handle": "vgumaer"
    },
    "time_stamp": "2019-09-25 05:26:13",
    "text": "<@U6W3H6YN8> any ideas on the above?"
  },
  {
    "poster": {
      "poster_name": "Chris Sciolla",
      "poster_handle": "csciolla"
    },
    "time_stamp": "2019-09-25 09:56:47",
    "edited": {
      "time_stamp": "2019-09-25 09:57:00"
    },
    "text": "having a twilight moment over here in our design manager and templates. we recently created a Wootric NPS email from a base email template that we use for a lot of emails. we added the html source code from Wootric, into a new marketing email. that's all that's been done. we now have the NPS form showing up in a few specific (meaning not every one) HubSpot HTML modules that are being used in a landing page template. the base template has no Wootric code anywhere. it shows up in the template preview as well for the landing page. which makes me believe HubSpot is loading this server side somehow, and it feels like a bug. our current solution is to delete the HTML modules from the landing page template where the form shows, leaving our pages very messy. but we don't want that form public, so it's our only option at the moment. I've been through every setting and integration in HubSpot and can't find any answers as to why this is happening to an isolated template and module.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-25 10:09:36"
      },
      {
        "time_stamp": "2019-09-25 10:09:57"
      },
      {
        "time_stamp": "2019-09-25 10:29:20"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "mherzog"
    },
    "time_stamp": "2019-09-25 10:09:36",
    "text": "Hey <@UM1PPQS2V>, want to DM me one of the LPs you're referring to, and I can take a look?"
  },
  {
    "poster": {
      "poster_name": "Chris Sciolla",
      "poster_handle": "csciolla"
    },
    "time_stamp": "2019-09-25 10:09:57",
    "text": "sure!"
  },
  {
    "poster": {
      "poster_name": "Chris Sciolla",
      "poster_handle": "csciolla"
    },
    "time_stamp": "2019-09-25 10:29:20",
    "text": "so, the culprit was that the original HTML module source was modified. didn't think it would actually have been something I needed to check for, but thank you for helping <@UBFA10FMF>!"
  }
]