[
  {
    "poster": {
      "poster_name": "Karman Li",
      "poster_handle": "karman.li"
    },
    "time_stamp": "2019-09-11 06:47:04",
    "text": "Hello, is it possible to implement a vidyard video in a popup? Currently the video does not get loaded when it’s in a popup"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2019-09-11 07:26:59",
    "text": "My main issue is a visual one - a few words sometimes doesn't cut it. I'd love to see a thumbnail view of each module (maybe an uploaded image?)"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-11 07:28:58",
    "text": "The hard part about doing a thumbnail is it won’t necessarily be accurate.\n\nFor example if you pull a module from the marketplace but your sites or emails styles affect it in any way(which likely they will) that screenshot will not be a perfect comparison"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-11 07:29:23",
    "text": "perhaps what would help in your case <@UJL4N3WN8> is kind of a middleground. you can change the icon used for the module."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-09-11 07:29:47",
    "text": "So for example if you had a series of modules purpose built for your email templates you could make them all have the same or similar icons"
  },
  {
    "text": "",
    "time_stamp": "2019-09-11 07:32:05"
  },
  {
    "poster": {
      "poster_name": "Steven Hambleton",
      "poster_handle": "steven994"
    },
    "time_stamp": "2019-09-11 07:48:41",
    "text": "Isn't that icon tiny though? But the concept is the same, a larger preview of the template in the context of the main template its intended for.\n\nI'm not considering commercially available modules, this is purely from an in-house perspective.\n\nI think my best bet is Airtable and a strong naming convention!"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:46:42",
    "text": "Question, in relation to my never-ending quest to clone a portal... There is `copy to portal` functionality available in the design manager. It looks like in an older version of the design manager, there was the ability to 'select all' and perform that action.  However, in the current DM, when you try to select everything, `copy to portal` is disabled.  I think you might be able to open up each folder and individually select each element, but because of the irregular folder structure on our site that can be tedious and error-prone.  Is there a good way in the current DM to copy everything to another portal?"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:49:10",
    "text": "(OR use the API's to do that... the API the DM is using to do this requires a \"shhkey-v1\" to use externally, and I don't have that)"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-09-11 08:49:24",
    "text": "via ftp?"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:50:04",
    "text": "FTP ignores DnD templates, which at this point in time wouldn't give us a very good replica of our production site"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:51:42",
    "text": "Yeah, so that still requires selecting each individual file.",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-11 08:53:29"
      },
      {
        "time_stamp": "2019-09-11 08:55:34"
      },
      {
        "time_stamp": "2019-09-11 08:57:12"
      },
      {
        "time_stamp": "2019-09-11 08:58:13"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2019-09-11 08:53:29",
    "text": "I’d recommend having a look at the new HubSpot CLI"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:55:34",
    "edited": {
      "time_stamp": "2019-09-11 08:55:48"
    },
    "text": "Yeah, tried that... I think that will work just fine for coded templates, but for DnD there is a behind-the-scenes connection of ID's between Layouts &amp; Generated-Templates that is not maintained"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:57:12",
    "text": "There is an API that the DM uses that does maintain those connections when you use the `copy to portal` functionality, but don't have credentials to use that externally"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 08:58:13",
    "text": "So I'm just trying to find a way to do this through the DM without having to individually select every file"
  },
  {
    "poster": {
      "poster_name": "Doug Osborne",
      "poster_handle": "doug.osborne"
    },
    "time_stamp": "2019-09-11 09:04:33",
    "text": "(and quite possible individual file selection is the best way right now, just checking if anyone had found a better solution)"
  },
  {
    "poster": {
      "poster_name": "Melvin Cruz",
      "poster_handle": "email"
    },
    "time_stamp": "2019-09-11 21:06:50",
    "edited": {
      "time_stamp": "2019-09-11 21:06:54"
    },
    "text": "Hi There,\n\nJust wanna suggest or I think it is a good idea that HS has auto detect feature when having same linked file attach, it will load once in a page. when you create a custom module having a linked file and when you create a template with linked file, I've noticed that it is rendered both. see screenshot, Thanks\n<https://prnt.sc/p503g1>"
  }
]