[
  {
    "text": "Hi There - If I accidently mark a module as a global page module is there a way to undo that? I'd like to make it non-global so the contents can be edited.",
    "time_stamp": "2019-09-03 11:15:05",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-04 02:23:08"
      },
      {
        "time_stamp": "2019-09-09 07:44:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brandon Seekins",
      "poster_handle": "brandon.seekins"
    },
    "time_stamp": "2019-09-03 12:09:21",
    "text": "Hey I'm having some issues with a template for related articles anybody know much about that kind of thing?"
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2019-09-03 12:19:14",
    "text": "Can anyone explain to me how HubSpot combines and minifies CSS? I don’t see consistent results. I will put a page through Speed Insights and it looks like each CSS file is still loaded separately, including custom modules having their own CSS files. I have taken to just using style tags for custom modules instead of the dedicated CSS location. Should I be minifying CSS files myself instead of waiting for HubSpot? We make updates often enough to global CSS files that it seems like they never get to being minified.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-03 12:41:39"
      },
      {
        "time_stamp": "2019-09-03 12:44:51"
      },
      {
        "time_stamp": "2019-09-03 12:55:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Libo Song",
      "poster_handle": "lsong"
    },
    "time_stamp": "2019-09-03 12:41:39",
    "text": "It takes some time to get the CSS combined, and verified by our backend before we serve it. If you update one or more of the CSS, it would be in constant processing, thus not serving it. For minification, the combining is separate process. Currently, the combining does not auto minify the CSS."
  },
  {
    "poster": {
      "poster_name": "Jonathan Stanis",
      "poster_handle": "jstanis"
    },
    "time_stamp": "2019-09-03 12:44:51",
    "text": "So you would recommend for a site with regular updates for us to handle that manually? Not rely on HubSpot’s automation?"
  },
  {
    "poster": {
      "poster_name": "Libo Song",
      "poster_handle": "lsong"
    },
    "time_stamp": "2019-09-03 12:55:48",
    "text": "HubSpot will auto minify the CSS if they can. It will be picked up by the CSS combiner when that happens."
  },
  {
    "poster": {
      "poster_name": "Michelle Tullis",
      "poster_handle": "mtullis"
    },
    "time_stamp": "2019-09-03 15:55:54",
    "text": "How can I change the background color of sections in my landing pages? Thanks!",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-09-04 10:21:17"
      }
    ]
  }
]