[
  {
    "poster": {
      "poster_name": "Sylvio Carvalho",
      "poster_handle": "sylvio"
    },
    "time_stamp": "2019-09-09 04:38:41",
    "text": "Hello! Don’t how if I’m really slow or if it is not that intuitive, but I’ve made changes to a custom module in the drag and drop window. Is there a way to overwrite the module at template level?"
  },
  {
    "poster": {
      "poster_name": "Theodor Dumitriu",
      "poster_handle": "theodor.dumitriu"
    },
    "time_stamp": "2019-09-09 07:40:08",
    "edited": {
      "time_stamp": "2019-09-09 07:40:43"
    },
    "text": "Hi, the new local works fine to retrieve or push code or directories to a HubSpot account, but the point of developing localy is to have a local server which interprets Hubl, so here it is :\n<https://designers.HubSpot.com/docs/tools/local-hubl-server>\nCan’t wait when they will deliver a NPM package for a local-HubSpot-server"
  },
  {
    "poster": {
      "poster_name": "Andreas Wessolly",
      "poster_handle": "webdesign"
    },
    "time_stamp": "2019-09-09 07:40:46",
    "text": "thanks Theodor"
  },
  {
    "poster": {
      "poster_name": "Theodor Dumitriu",
      "poster_handle": "theodor.dumitriu"
    },
    "time_stamp": "2019-09-09 07:44:19",
    "text": "hi, I thing if you right click on the global module you can make a local copy."
  },
  {
    "poster": {
      "poster_name": "Frank Ladd",
      "poster_handle": "frank"
    },
    "time_stamp": "2019-09-09 19:00:32",
    "text": "New to HubSpot. I need to have a video play in a modal lightbox overlay when the user clicks on a thumbnail. I'm uploading the video into HubSpot File Manager. The only way I've found to play video so far is with the video option in the Rich Text module — but that places and plays the video inline. Is there a way to do modal video popups using HubSpot player? I'm building my templates via code rather than the drag-and-drop builder (but sometimes use the drag-and-drop to generate HTML code to copy-and-paste), if that gives more options.  Thanks.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-09-09 19:51:40"
      },
      {
        "time_stamp": "2020-09-30 00:07:16"
      }
    ]
  },
  {
    "text": "Here's how I do it (if I understand your original question correctly). I make my templates via HTML code, but this gives the problem of how to embed or import HubSpot's various modules into the custom code. I created a dummy template using the Drag-and-Drop interface and placed an example of each the different modules that I wanted to use—mostly Rich Text and CTA buttons and a few others. I saved, then right-clicked and cloned this template to HTML so I could see the code. This is where you'll find the module_id for each of the modules.",
    "time_stamp": "2019-09-09 19:31:06"
  },
  {
    "poster": {
      "poster_name": "Trish Lessard - Media Junction",
      "poster_handle": "trish"
    },
    "time_stamp": "2019-09-09 19:51:40",
    "text": "Use Wistia"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-09-10 00:01:41",
    "text": "heya, my test account expired and i am trying to renew, but dont see that option.  from the help docs: ```Expiration and renewal\n\nTest accounts automatically expire after 90 days, so if you're using a test account you'll need to renew it using the Renew button in the row for the account. Renewing an account sets it to expire 90 days from when you click the renew button.```"
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2019-09-10 00:01:55",
    "text": "what row is this renew button in?"
  }
]