[
  {
    "poster": {
      "poster_name": "Jose Luis Partoza",
      "poster_handle": "jldpartoza"
    },
    "time_stamp": "2022-11-05 05:04:50",
    "text": "hello guys, I am actually new in HubSpot and is currently doing the HubSpot CMS for Developers. I am at Building HubSpot CMS Templates, Drag and drop areas in the HubSpot CMS. In the video it shows directly that the speaker has the \"dnd-demo\" folder, I didn't know or see on how he did acquire that, can anybody help me?"
  },
  {
    "poster": {
      "poster_name": "Julia Torres",
      "poster_handle": "jtorres"
    },
    "time_stamp": "2022-11-05 11:46:49",
    "edited": {
      "time_stamp": "2022-11-05 11:58:05"
    },
    "text": "Hi all! I am having trouble with *spambot* submissions on all my forms. I am trying to figure out how I can hide a honeypot field on all my forms. The idea would be that the field (a simple checkbox field) would be undetectable to humans, but detectable for bots. I'd like to use the field on all my forms. The outcome would be to filter out any form submissions where the honeypot field has a \"Yes\" value- something only a bot could do. I would update criteria on suppression lists to catch contacts where \"honeypot field\" value is \"yes\". This would help me to eliminate or greatly reduce the amount of spam bot submissions leads my sales reps are getting and dealing with. *Any one have any ideas how to tackle this?* I've turned on captcha and other out of the box features that are supposed to catch spambots, but evidently those aren't working as well as I'd like them to. Worth noting that I am not a developer and the whole modules and hubL thing has me super confused. I come from the Salesforce world and HubSpot development is a steep learning curve for me.",
    "reply_count": 12,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-11-05 12:15:01"
      },
      {
        "time_stamp": "2022-11-05 15:25:37"
      },
      {
        "time_stamp": "2022-11-05 16:11:17"
      },
      {
        "time_stamp": "2022-11-05 16:11:46"
      },
      {
        "time_stamp": "2022-11-05 16:44:17"
      },
      {
        "time_stamp": "2022-11-05 16:57:51"
      },
      {
        "time_stamp": "2022-11-05 16:58:12"
      },
      {
        "time_stamp": "2022-11-05 21:33:32"
      },
      {
        "time_stamp": "2022-11-06 13:17:59"
      },
      {
        "time_stamp": "2022-11-06 13:18:34"
      },
      {
        "time_stamp": "2022-11-07 11:14:22"
      },
      {
        "time_stamp": "2022-11-07 12:01:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-05 12:15:01",
    "text": "Have you tried using the hide this field option? I don't know if that would work but would definitely be interested in knowing the outcome"
  },
  {
    "poster": {
      "poster_name": "Julia Torres",
      "poster_handle": "jtorres"
    },
    "time_stamp": "2022-11-05 15:25:37",
    "text": "I asked HubSpot support about this and they told me that a hidden field using the ‘hide this field’ setting doesn’t make the field available on the ui. Which would defeat the purpose of my intended use."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-05 16:11:17",
    "text": "Yeah, I thought it might do that. You could add this css to your page. I believe it should work fine as long as you're not using an iframe form.\n```[name=\"email\"] {\n  display: none;\n}```"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-05 16:11:46",
    "text": "This will hide the email field so change email depending upon the name of your field"
  },
  {
    "poster": {
      "poster_name": "Julia Torres",
      "poster_handle": "jtorres"
    },
    "time_stamp": "2022-11-05 16:44:17",
    "text": "Forgive my ignorance here, I’m very new to HubSpot, but when you say “you could add this CSS to your page” —- where do I navigate to for that?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-05 16:57:51",
    "text": "Is the website built on HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2022-11-05 16:58:12",
    "text": "You're totally good, we're were all new to HubSpot at one point in time"
  },
  {
    "poster": {
      "poster_name": "Julia Torres",
      "poster_handle": "jtorres"
    },
    "time_stamp": "2022-11-05 21:33:32",
    "text": "It’s a HubSpot form on a HubSpot landing page. Thanks for helping out :relaxed:"
  }
]