[
  {
    "poster": {
      "poster_name": "Twentyninetimes",
      "poster_handle": "tech817"
    },
    "time_stamp": "2022-11-24 01:17:36",
    "edited": {
      "time_stamp": "2022-11-24 01:19:24"
    },
    "text": "I think you hit the nail on the head <@U04AQA0QM8E>\n\nI’m just hoping that for the future that HubSpot will acknowledge the importance of doing things ‘right’ and not only focus on ‘things that sell’. Doing things right will for the most part also sell in the long run (word of mouth etc.).\n\nAnd I’m not talking about banning or removing the flexible content builder. However I’m referring to:\n\n• Hammering down on bloat\n• Giving developers the option to develop without the grid\n• Not monetising every feature that makes HS shine (custom objects)\n• Not abandoning simple feature requests for 3+ years (Link title field anyone?)\n• Giving developers more control in regards to performance optimisation \nDon’t get me wrong. In a larger scope I really do see the benefits of HubSpot as a platform, but I think that more effort can be made to enable us to make HubSpot CMS shine more - deservedly"
  },
  {
    "text": "Hello everybody! Im trying to make each page of the blog have a meta title and description. Like, our blog home has a title, but when we click on the tags, we go to a page where there is only those articles with said tag. like tag/china or tag/technology.\n\nI need to change the title on those for \"china blog\" and \"technology blog\" e.g.. can someone help out? I've tried some solutiions, just like this:",
    "time_stamp": "2022-11-24 08:51:10",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-12-08 07:50:30"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kevin Vanantwerpen",
      "poster_handle": "kevin.vanantwerpen"
    },
    "time_stamp": "2022-11-24 10:48:46",
    "text": ":wave: Hi everyone!. I'm Kevin, living in Belgium and getting started with HS :smile:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-11-24 11:47:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dusan Mitrovic",
      "poster_handle": "deunanknute08"
    },
    "time_stamp": "2022-11-24 11:47:55",
    "text": "Hi Kelvin\nDusan here\nI am also joining HS to learn more from other guys"
  },
  {
    "poster": {
      "poster_name": "Matt Collis",
      "poster_handle": "mtcollis"
    },
    "time_stamp": "2022-11-25 00:27:15",
    "text": "Hi there :wave: This year we built a few 1:many HubSpot apps (i.e. ‘productized’), and created this step-by-step guide we thought others might find useful. Hope it’s useful - please let us know if you have any feedback or suggestions to improve it.\n\n<https://stackgo.io/resources/building-a-productized-integration-with-HubSpot/>"
  }
]