[
  {
    "poster": {
      "poster_name": "Michael Niemeijer",
      "poster_handle": "michael915"
    },
    "time_stamp": "2022-02-21 05:23:32",
    "text": "Hi all, My question concerns my HubSpot form in combination with a slider. in short: my form only loads on the first slide. when going through my other slides, the HS form does not load. Any idea’s on this?? love to here from you:raised_hands:"
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-02-21 06:02:34",
    "text": "Hi all,\n\nBy default, HubSpot uses the browser cookie to identify contacts, but we have a SaaS web application where our customers need to login, so I’m able to use the e-mail address of all of the people that visit our application as a method to identify them. I would like to know if it’s possible to add some sort of email attribute to the HubSpot tracking code, mainly for me to identify all people answering the NPS survey we are currently running via the Service Hub.\n\nDo you know if it’s possible to identify contacts that fill in our NPS survey via their email address by making some changes to the standard tracking code? I’ve done this before with other Javascript tracking codes, so I imagine HubSpot is able to do this as well, but I wasn’t able to find the correct documentation myself.\n\nThank you in advance for reading my message and helping me out. I highly appreciate it!",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-02-21 14:18:47"
      },
      {
        "time_stamp": "2022-02-22 00:56:35"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-02-21 14:18:47",
    "text": "Hey Stan, one way you could accomplish this is via a hidden optional email field in the form tool that you would then populate via client-side JS wherever that form appears."
  },
  {
    "poster": {
      "poster_name": "Stan Zeehandelaar",
      "poster_handle": "stan225"
    },
    "time_stamp": "2022-02-22 00:56:35",
    "text": "Hi Mark, thank you for replying to this. I’m not using a form, but I’m using the NPS survey that is part of the Service Hub. Unfortunately, I cannot add a hidden field there."
  }
]