[
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2020-11-05 09:43:20",
    "text": "You can specify a default language, for domains, as well for smart-content and global-content. The default act like a fallback. HubSpot tries to detect the language of the user, by the IP-address. If it is a known user, you can set a preferred language for them. But if the url contain a specific language parameter, it will go directly to the specified page in the parameter.\n\nChanging the default language from EN to DA seems the best way. But keep in mind, that once the page is indexed by search engines, the most users will directed to the correct language. So, maybe you dont need to change the default. But pls @HubSpot-Team correct me if I am wrong."
  },
  {
    "poster": {
      "poster_name": "Mitja Lewin",
      "poster_handle": "m.lewin"
    },
    "time_stamp": "2020-11-05 10:06:15",
    "edited": {
      "time_stamp": "2020-11-05 10:16:23"
    },
    "text": "Anyway, this may be useful for you:\n\n*Checkpoints:*\n\n1. Define the primary language for domains (settings)\n2. _Opt_. Decide the type of Language switch based on Domain, URL or query parameters (settings)\n3. Add the language changer module to the templates (Design Manager)\n4. _Opt_. Data policy texts - GDPR standard for forms (settings)\n5. _Opt_. language-specific subscriptions - only if realy needed! (settings)\n6. Cookie notification text and config the banner display by lang-URL (settings)\n7. Translate system pages (global content, design manager)\n8. Language-specific propertie values, like salutation (settings)\n9. Translate forms, texts and property labels in forms\n10. Call-to-Actions via smart content or better as a copy (CTAs)\n11. Social media platform and sharing links inside the Blog and Footer elements\n12. Modules, and as well check blog for hardcoded string - create a mulilang file (Design Manager)\n13. Translate global module contents (global content)\n14. Navigation and menus (site settings)\n15. Translate page title, URL and meta description (for each)\n16. Blog translation (settings) and article translation (for each)\n17. Single Page and Landing-Page translation, including links to other pages. (Team-HubSpot)\n18. If applicable Exchange media such as videos or audios (team content)\n19. Mail templates, DOI, newsletter and blog notifications (emails)\n20. Language-specific workflows, e.g. Mail dispatch (automation)\n21. Do not forget the Downloads and content offers (file manager)\n22. If applicable Chat flow on pages and display, possibly domain bound (chat)\n23. _Opt_. Change currency and timezones if needed. (settings)\n24. _Opt_. At last configure a Tracking-Report for the Language: /en etc. (settings)\n\n*Hints:*\n\n1. Better do not translate internal title, keep them and append a language-code hint.\n2. Multilingual double opt-in emails do not currently work without their own workaround.\n3. The chat flows, which only partially work in several languages, for example: absence message."
  },
  {
    "poster": {
      "poster_name": "Julia Soto",
      "poster_handle": "julia"
    },
    "time_stamp": "2020-11-05 12:04:19",
    "edited": {
      "time_stamp": "2020-11-06 09:34:11"
    },
    "text": "wow! That's impressive. Thank you very much for this answered :smile:"
  }
]