[
  null,
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2018-09-10 08:09:31",
    "text": "curious about HubSpot's AMP appearance for blog articles, is there really nothing that can be added beyond turning the setting on/off?\nIt just seems extremely restrictive (not just what AMP requires) in what I can do as a developer beyond what's available in the main portal settings."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-10 08:20:07",
    "text": "For now yes, it’s only the options they give you. I’ve heard whisperings of AMP in site pages eventually and that developers would have more control there. That doesn’t however mean that the blogs AMP configuration is changing.\n\nThat said I personally am kinda okay with the AMP configuration being kind of a “you can’t screw it up” level of complexity. Could there be more options, yes. Do they need to go nuts on it. I don’t actually think so.\n\nI haven’t tested recently but load time of my normal blog posts compared to amp posts isn’t monumentally different, and personally I’d rather people see the responsive version of the page, and just use AMP posts as a post preview so they can read everything and see if they want to visit the real site. Also obviously to get better ranking in Google and the news carousel.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-09-10 08:49:59"
      },
      {
        "time_stamp": "2018-09-10 09:03:21"
      },
      {
        "time_stamp": "2018-09-10 09:06:51"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joe",
      "poster_handle": "joe"
    },
    "time_stamp": "2018-09-10 08:29:12",
    "text": "Thanks Jon, I was fairly certain that'd be the case.\nI do agree the \"can't screw it up\" aspect is good, less I'd have to go back through and cleanup cause a client thought they could just edit the template when they don't fully understand the inner-workings. However, I think a way to have some more control would be nice, ie: adding an Advanced Menu for instance, specifically for AMP."
  },
  null,
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2018-09-10 08:49:59",
    "text": "That’s definitely all great info, Jon. Thanks! So you’ve found that load time is fairly comparable? Personally, our agency has shied away from AMP on both HubSpot and our WordPress sites because we didn’t find a significant benefit that would offset the sacrifice in UX. I’m definitely interested in hearing others opinions on this as well."
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-09-10 08:59:45",
    "text": "<@U25C65C3S> For our sites we almost exclusively use the WP Bakery Visual Composer builder. It has a built in RSS module that can pull in the feeds. However, both this plugin and others I’ve found are only able to pull in a very basic listing of the article titles. What we need to be able to do is specifically pull the featured image, a title, and the snippet (at a minimum). For example: Here’s a client’s page that pulls in a community-specific blog towards the bottom. Right now, we have to manually pull over this information. But we really need to be able to automate it. I feel like this should be simple, but we keep running into roadblocks with it.\n<http://thebristal.wpengine.com/find-a-community/long-island-ny/east-meadow/>"
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-09-10 09:00:14",
    "text": "",
    "reply_count": 6,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-09-10 09:21:11"
      },
      {
        "time_stamp": "2018-09-10 09:22:35"
      },
      {
        "time_stamp": "2018-09-10 09:28:29"
      },
      {
        "time_stamp": "2018-09-10 09:29:50"
      },
      {
        "time_stamp": "2018-09-10 09:40:53"
      },
      {
        "time_stamp": "2018-09-10 09:41:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-10 09:03:21",
    "text": "AMP is kind of a controversial thing in general with opinionated people on both ends. I think ultimately you have to figure out what makes sense for your team.\n\nPerformance wise our sites tend to perform almost as well as the AMP version and so the pros don’t outweigh the cons for us but we get the best of both worlds viewing amp as being more of a preview of the posts."
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-09-10 09:06:51",
    "text": "That’s pretty much what I figured :slightly_smiling_face: We are fairly opinionated one way (anti-AMP), but always interested in hearing others viewpoints on it!"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-09-10 09:21:11",
    "text": "Is the issue that it doesn't pull this in automatically right now from HubSpot blog?"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-09-10 09:22:35",
    "text": "Or just that you need to add more to what is pulled in?"
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-09-10 09:28:29",
    "text": "We need to add more to what is pulled in."
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-09-10 09:29:50",
    "text": "Similar to this page under Nonprofit Technology\nBlog: <https://techimpact.org/>"
  },
  {
    "poster": {
      "poster_name": "Jenna Schultz",
      "poster_handle": "jenna"
    },
    "time_stamp": "2018-09-10 09:40:53",
    "text": "Yep!"
  },
  {
    "poster": {
      "poster_name": "Kyle Barkins",
      "poster_handle": "kyle068"
    },
    "time_stamp": "2018-09-10 09:41:38",
    "text": "Happy to share the code - we created a custom shortcode/widget for that"
  },
  null,
  null,
  {
    "text": "Currently have a row of hardcoded \"cards\" i'd like to re-do w/ modules to give the end user the ability to \"add new\" in theory, it'd start a new row and add a new card. Thoughts on how to achieve this?",
    "time_stamp": "2018-09-10 13:19:18"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-10 13:21:22",
    "edited": {
      "time_stamp": "2018-09-10 13:26:19"
    },
    "text": "yea, inside a custom module, create a repeater group, in that group have all the fields you need for 1 card, image, text, links etc. roll your own grid or find one online then loop through generating your cards"
  },
  {
    "poster": {
      "poster_name": "Chandler Ives",
      "poster_handle": "cives"
    },
    "time_stamp": "2018-09-10 13:24:10",
    "text": "Ok, cool. Thanks."
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-09-10 16:31:07",
    "text": "So I enabled the video vidyard integration in our test portal... how do i get to using it? lol I am not seeing anything else after enabling it",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-09-11 03:58:02"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-09-10 16:35:41",
    "text": "is it only for use in the sales email sending portion of the HS product?"
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-09-10 18:58:34",
    "text": "This may help out <@U2H3TT8F2> -- <https://blog.HubSpot.com/customers/introducing-HubSpot-video>"
  },
  {
    "poster": {
      "poster_name": "Jeffrey Vocell",
      "poster_handle": "jvocell"
    },
    "time_stamp": "2018-09-10 18:59:09",
    "text": "(Video is integrated across Marketing Hub, Sales Hub, and Service Hub)",
    "reply_count": 6,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2018-09-11 10:47:56"
      },
      {
        "time_stamp": "2018-09-11 10:48:22"
      },
      {
        "time_stamp": "2018-09-11 11:05:10"
      },
      {
        "time_stamp": "2018-09-11 11:05:36"
      },
      {
        "time_stamp": "2018-09-11 11:14:10"
      },
      {
        "time_stamp": "2018-09-11 11:14:39"
      }
    ]
  }
]