[
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-18 11:01:25",
    "edited": {
      "time_stamp": "2022-01-18 15:48:19"
    },
    "text": "It would be great if we could somehow set help/inline help text, and perhaps even other field property, values conditionally. It’s currently possible to achieve essentially the same results, but it involves creating entirely new fields and showing/hiding those fields conditionally and using fallbacks and then having to have conditionals in the markup as well, and just makes things very convoluted. I don’t know how it would be able to be implemented exactly, but it would definitely be a nice thing to have."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-18 12:55:43",
    "edited": {
      "time_stamp": "2022-01-18 12:57:14"
    },
    "text": "It would be nice if HubSpot’s docs were open-sourced, preferably on GitHub. Then the community could easily create PRs to help polish it and make sure everything is up-to-date and consistent, and it would be useful to see what’s been changed in newer versions."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-18 15:52:48",
    "edited": {
      "time_stamp": "2022-01-18 15:53:54"
    },
    "text": "I may have recommended it before, but allow global theme settings variables to be used as controlling fields for field visibility in a module. You can accomplish the same thing by creating a new hidden field and using the theme variable as the default fallback value and then using that field as the controlling field, but why should we have to do such a thing? Global theme variables are already working for module field fallback values, they should be able to be incorporated into controlling fields for visibility as well."
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-18 20:42:34",
    "edited": {
      "time_stamp": "2022-01-18 20:44:00"
    },
    "text": "It would be cool if we could incorporate calculations into our field values as well. For instance, if we have a number field default to 16, and we have a second number field and we want its default value to be set to 4x the first number field's value. This would allow us to set up things like Fibonacci sequences while remaining mostly transparent to the editor.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-19 09:26:13"
      },
      {
        "time_stamp": "2022-01-19 09:44:14"
      },
      {
        "time_stamp": "2022-01-19 09:51:51"
      }
    ]
  }
]