[
  {
    "poster": {
      "poster_name": "Alberto Zordan",
      "poster_handle": "alberto.zordan"
    },
    "time_stamp": "2023-11-26 04:42:12",
    "text": "Maybe this will help\n<https://developers.HubSpot.com/docs/cms/building-blocks/modules/export-to-template-context#retrieving-parameters-from-modules-already-rendered-on-the-template|https://developers.HubSpot.com/docs/cms/building-blocks/modules/export-to-template-context#retrieving-parameters-from-[…]dy-rendered-on-the-template>"
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-11-26 14:53:32",
    "text": "Hello. I am blocked and would love some help please. I'm writing some hubl within a custom module. My goal is to access more (ideally all) of the values associated with the properties that I have stored in my custom data object ('CDO'). I'm using code like this to access a dictionary of property name and values for a specific custom data object: {% set thisCDO = crm_object(\"fullyQualifiedName\", id)%} then when I enter {{thisCDO}} I am returned a very short dictionary with type items {CDO_id = number, id = number}} I defined CDO_id as a primary display property when I set the object up - so perhaps that is why it is coming back. What I want help with is: How do I get a complete(or more complete) dictionary of properties and values returned. So, for example, I also defined a property called CDO_balance (a number field) that I would love to be able to return for the website viewer to see. Any ideas? Thanks Dave",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-26 15:16:09"
      },
      {
        "time_stamp": "2023-11-29 20:02:25"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dave Corbett",
      "poster_handle": "dave613"
    },
    "time_stamp": "2023-11-26 15:16:09",
    "text": "Hey - I have solved this problem through some good old fashioned hacking.  Sharing the solution for anyone else who has the same issue.  I found that when I modified my code, as follows, it tailored the dictionary returned to me: {% set thisCDO = crm_object(\"fullyQualifiedName\", id,'id,cdo_id,cdo_balance')%}  when then typing {{thisCDO}} I was then returned with a dictionary with three properties, this time including cdo_balance.  Anyway, as I said, positing in case you've been banging your head against this brick wall also."
  },
  {
    "poster": {
      "poster_name": "Ranjith VK",
      "poster_handle": "ranjith.vk"
    },
    "time_stamp": "2023-11-26 23:56:37",
    "text": "I couldn't find the solution to the first question I have but the second one was more of an issue from my side where the JSON data was not stored correctly within HubDB. If the JSON format is correctly stored then using the following code prints the JSON as required to JS.\n\nHubL JSON Object:\n{{ jsonObject | tojson }}\n\nJSON String from HubDB:\n{{ jsonString }}"
  }
]