[
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-11-01 06:43:25",
    "text": "Hey everyone. Is there a way to export a gradient field to the template context?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-11-01 11:51:02"
      },
      {
        "time_stamp": "2023-11-01 12:51:23"
      },
      {
        "time_stamp": "2023-11-06 13:55:45"
      },
      {
        "time_stamp": "2023-11-07 11:17:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Ana",
      "poster_handle": "aparadis"
    },
    "time_stamp": "2023-11-01 06:44:51",
    "text": "Thanks! That is what I ended up doing, and then I pulled in the tags dynamically, so from the client’s perspective it’s working just like the original related posts, but unfortunately it does lose some of the neat things about related posts, and wont get related posts based on content anymore, just tag."
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-11-01 11:51:02",
    "text": "I don’t _believe_ so. A good number of default modules don’t use standard style fields, but have a special type of style field that can’t be accessed or set through HubL. (see: why you can’t set default margins or padding on a rich text element)\n\nAccording to <https://developers.HubSpot.com/docs/cms/building-blocks/modules/export-to-template-context|the documentation on >`export_to_template_context`, it can’t be used on custom modules. To my knowledge, there aren’t any default modules which use standard style fields _and_ which have a gradient field included.\n\nIn what context do you need an exported gradient field?"
  },
  {
    "poster": {
      "poster_name": "Taylor O'Reilly",
      "poster_handle": "taylor699"
    },
    "time_stamp": "2023-11-01 12:51:23",
    "edited": {
      "time_stamp": "2023-11-01 12:51:44"
    },
    "text": "I need it for a overlay on a hero image. Normally id just do this in a custom module but because it need dnd areas in the hero I have to do it in the template. I was able to use the image field and export it to the context. I guess ill have to do it with two text fields"
  }
]