[
  {
    "poster": {
      "poster_name": "vijai",
      "poster_handle": "vijaivcx338"
    },
    "time_stamp": "2023-10-11 05:19:02",
    "text": "hello team I want to get mail integration data from  , how can I do it?"
  },
  {
    "poster": {
      "poster_name": "Mary Cate Spires",
      "poster_handle": "marycate"
    },
    "time_stamp": "2023-10-11 07:16:32",
    "text": "Are there any HubSpot apps to ensure landing pages are accessible?",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-10-11 07:21:42"
      },
      {
        "time_stamp": "2023-10-11 11:37:26"
      },
      {
        "time_stamp": "2023-10-23 16:11:40"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Federico Mozzo",
      "poster_handle": "federico.mozzo"
    },
    "time_stamp": "2023-10-11 07:21:42",
    "text": "accessibility is not something that you can achieve with an app, you could try something like the accessiway widget but the landing page should be designed in an accessible manner from the start"
  },
  {
    "poster": {
      "poster_name": "Evelynn Ulsh",
      "poster_handle": "evelynn"
    },
    "time_stamp": "2023-10-11 11:37:26",
    "text": "Seconding Frederico’s comment — accessibility really can’t be implemented via apps or purely technological means. Anything that claims to be able to is an outright scam, and usually makes your site _less_ accessible.\n\nThat said, there _are_ some tools that can help give you a reading of the current status of a page’s accessibility and compliance. Personally, I recommend the Accessibility Tools in the Firefox inspector panel: it provides a fairly good “Scan for Accessibility Issues” tool, which can inform you of common issues like missing alt text and insufficient color contrast.\n\nIt’s far from comprehensive, and will never be a replacement for manual review and testing, but it’s a decent starting point — especially for someone who isn’t an expert.\n\nHere’s an article that goes into a bit more depth about its use and limitations: <https://www.a11yproject.com/posts/using-firefox-for-accessibility-testing/|The A11y Project – Using Firefox for Accessibility Testing>"
  }
]