[
  {
    "poster": {
      "poster_name": "Tony Sova",
      "poster_handle": "tony187"
    },
    "time_stamp": "2020-07-02 06:36:11",
    "text": "Hello everyone,  We are hiring for a HubSpot developer, freelance contractor which is part time but ongoing indefinitely.  Needs to be US based, available during normal business hours.  Pay up to $50/hr DOE.  Please message me for more details.  Thanks!",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-31 04:43:40"
      },
      {
        "time_stamp": "2020-08-31 04:43:41"
      },
      {
        "time_stamp": "2020-09-08 01:32:52"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dillon Nuanes",
      "poster_handle": "dnuanes"
    },
    "time_stamp": "2020-07-02 07:33:25",
    "text": "My team at the University of Berkeley, Haas School of Business is growing. We are hiring a *Marketing Analyst.*\n\n*Details:*\nFirst Application Review Date: *July 14*\nSalary: up to *$110,800/year* (while I cannot guarantee a precise salary, I can say we typically get at or near the range maximum)\nLocation: *Berkeley, CA*. We are currently remote until 2021. Remote applicants are welcome to apply. However, this person *will likely be expected* to report to the office in Berkeley once we are able to. Therefore, if you do apply, consider that location component.\nTeam: Small, but nimble. There are currently three of us: myself (Email Marketing Manager), a Content Marketing Manager, and our supervisor (Director of Program Marketing &amp; Analytics). We are also adding a Marketing Specialist to the team, likely next month.\n\n*Description:*\n• This person will leverage their experience in analytics to improve our marketing operations in service of recruiting MBA students to the Haas School of Business\n• Strong marketing acumen, with the ability to translate quantitative data into actionable insights and recommendations. Ability to communicate complex data concepts and reasoning in ways that marketing and admissions teams, senior management, and the wider organization will understand. Ability to produce high-quality, consumable reports and documentation in our marketing (*HubSpot*) and application (Slate) tools. \n• Thorough knowledge of business intelligence functions, analytics, industry standards and best practices. Hands-on experience conducting customer segmentation, cohort performance, and customer funnel analysis.\n<https://careerspub.universityofcalifornia.edu/psp/ucb/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_APP_SCHJOB.GBL?Page=HRS_APP_JBPST&amp;JobOpeningId=8756&amp;PostingSeq=1&amp;SiteId=21&amp;languageCd=ENG&amp;FOCUS=Applicant|Full job posting can be found here>. If you've got questions, DM me."
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2020-07-02 10:36:04",
    "text": "I'm hiring a Junior Front-End Developer!  Would love to find someone in this community to help me make CLEAN the single best and most flexible theme on the HubSpot platform.\n\nMore details here!\n<https://www.HubSpothero.com/jobs/front-end-dev>",
    "reply_count": 3,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2020-08-31 04:42:20"
      },
      {
        "time_stamp": "2020-08-31 04:42:21"
      },
      {
        "time_stamp": "2020-10-07 05:15:05"
      }
    ]
  }
]