[
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-08-07 07:54:19",
    "text": "The email field is disabled intentionally and you should not be trying to remove that. The way the membership app works, a user must click the link in the email they receive, which is automated. You can not send it manually. Once a contact is added to the list that is associated with your private content, it triggers the email. So the user is already on the list WITH their email address. They receive the email with the button to accept the membership. They get to the page that has the email field disabled as this is where they create their password. This is NOT when they are signing up to become a member. This is when they're already on the list and just setting their desired password. The last step.\n\nYou can customize a registration form for someone to become a member and then use a workflow or hidden field in the form to trigger the contact being added to your membership list. That form would of course have a functioning email field. Hope this clarifies the process a bit! :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Nathan Gifford",
      "poster_handle": "ngifford949"
    },
    "time_stamp": "2023-08-07 07:56:28",
    "text": "The form that someone fills out to become a member is completely customizable. You can use any form. You have to get from that form to adding the contact to a list, the list that is associated with your private content. Then they'll receive an invite email with a button that takes them to the page that shows their email address and a field to create their password and complete the process."
  },
  {
    "poster": {
      "poster_name": "Atul Singh",
      "poster_handle": "atul564"
    },
    "time_stamp": "2023-08-07 08:22:32",
    "text": "Thank you Nathan. I have done membership functionality the same as you said above."
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2023-08-07 13:43:51",
    "text": "<@U0397BZRK6G>, Thanks Nathan but I am talking specifically about the self registration flow, the one that skips the whole email thing and allows the user to sign up directly on the website"
  },
  {
    "text": "",
    "time_stamp": "2023-08-07 13:43:53"
  },
  {
    "poster": {
      "poster_name": "Joshua Beatty",
      "poster_handle": "joshua429"
    },
    "time_stamp": "2023-08-07 13:48:10",
    "text": "Then after they do that they get an email to confirm their email and are redirected to the content, so they only have to fill out a single form"
  }
]