[
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2023-08-17 06:12:07",
    "text": "Hi there,\n\nI recently got contacted by a potential client about improving their HubSpot CMS portal. They have almost every enterprise subscription and use HubSpot extensivly with 7 custom objects, 8 ticket pipilenes and a whole lot of other mess of entagled data.\n\nTheir Portal runs extremly slow and after doing a bit of a dive into the code it didn't see that bad to me. And although half the CSS could be removed and JS optimized all in all I doubt I'd improve the website performance by much.\n\nMy question here is what are the exact limitations when it comes to HubSpot on this, is this just something that doesn't function well on HubSpot and is just way to complex to justify not using a modern tech stack on a cloud provider and have that integrate with HubSpot via APIs (also I'm guessing we'd have to go the Developer App route there)\n\nDoes anyone have any experience with this and can give any usefull insight? Thank you!",
    "reply_count": 5,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-17 06:31:13"
      },
      {
        "time_stamp": "2023-08-17 06:43:06"
      },
      {
        "time_stamp": "2023-08-17 06:44:19"
      },
      {
        "time_stamp": "2023-08-17 11:53:27"
      },
      {
        "time_stamp": "2023-11-27 19:49:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-17 06:31:13",
    "text": "Can you clarify what is slow? Are you specifically referring to membership pages? And are those custom objects all integrated in the membership site?\n\nJust like website pages, membership pages can be optimized, some more context around the data feeds would be helpful"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2023-08-17 06:43:06",
    "edited": {
      "time_stamp": "2023-08-17 06:43:50"
    },
    "text": "All of the membership pages are super slow, I'm guessing this is due to the mass amount of data being fecthed.\n\nIts all done via graphql or crm_association hubl functions via some macros.\n\nAround 4-5 custom object types are fecthed on all page and in total between 10-100 objects depending on the contact"
  },
  {
    "poster": {
      "poster_name": "Anze",
      "poster_handle": "anzekopko2002"
    },
    "time_stamp": "2023-08-17 06:44:19",
    "text": "Is there any other info I'd need to provide?"
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2023-08-17 11:53:27",
    "text": "Thanks for the DM - I followed up there, this might be something <@U25PYL3Q8> can help with"
  }
]