[
  {
    "poster": {
      "poster_name": "Neil Junsan",
      "poster_handle": "neiljunsan09"
    },
    "time_stamp": "2023-06-13 02:47:22",
    "text": "Hey guys,\n\nAny thoughts about this error on console sir. Im using api to fetch it . it was working lately suddenly today it says  `error TypeError: Cannot read properties of undefined (reading 'contacts')`   \n\non this line of code `const partnerContact = curr.associations.contacts.results.find((result=&gt;\"partner_contact\" === result.type || curr.associations.contacts.results[0]));` (edited)"
  },
  {
    "poster": {
      "poster_name": "Vladislav Ivanov",
      "poster_handle": "vlad-ivanov"
    },
    "time_stamp": "2023-06-13 03:40:38",
    "text": "<https://HubSpotdev.slack.com/archives/CBA9UA4EN/p1686648418234559>"
  },
  {
    "text": "Hi guys, I’m integrating live chat widget. I got the issue that widget’s iframe create a transparent overlay over the content, so user get confused when interact with those content. I need advice from you guys any suggestion for this situation. Thanks!",
    "time_stamp": "2023-06-13 03:53:34"
  },
  {
    "poster": {
      "poster_name": "Casper Kraken (HubDo)",
      "poster_handle": "casper928"
    },
    "time_stamp": "2023-06-13 03:56:42",
    "text": "Hey Guys, is there anybody in here with experience in customizing responses for the public app settings page? I am returning the correct response format (from the docs) and the toggle behavior works as intended, but the returned message is not being displayed on screen."
  },
  {
    "poster": {
      "poster_name": "Achille Baudino",
      "poster_handle": "achille.baudino"
    },
    "time_stamp": "2023-06-13 06:53:09",
    "text": "Hi to everyone. I need some help about Looker Studio connection to HubSpot Contacts table.\nWe have an issue using a Looker Studio connector with our HubSpot account. The connector cannot get data from Contacts table. The table has mode than 430000 records, so could be this the issue? I've check with two different connectors (payed) and the issue is the same"
  },
  {
    "text": "Hello Everyone, i am doing integration my cloud telephony system with HubSpot. i have made webhook subscriptions to listen some events. for local development purpose i have set ngrok url to the webhook targeturl and mention events type (contact-&gt; creation, propertyChange) . But every time i made change. i got 404 error response i have set url correctly though . Can anyone help me out.",
    "time_stamp": "2023-06-13 08:56:44",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-06-13 11:28:37"
      },
      {
        "time_stamp": "2023-06-13 21:18:32"
      },
      {
        "time_stamp": "2023-06-13 22:24:14"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "dennis edson",
      "poster_handle": "dennis261"
    },
    "time_stamp": "2023-06-13 10:57:41",
    "text": "<https://HubSpotdev.slack.com/archives/CEQQ9NFK2/p1686675374562629>"
  },
  {
    "poster": {
      "poster_name": "Justin Givens - Level 2",
      "poster_handle": "jgivens"
    },
    "time_stamp": "2023-06-13 11:28:37",
    "edited": {
      "time_stamp": "2023-06-13 11:28:51"
    },
    "text": "your ngrok looks good.\n\nAre you running the python code from the ngrok request? Is the webserver up and running to handle the python code?\n(these are just guesses, not a python person)."
  },
  {
    "poster": {
      "poster_name": "Jeremy Ross",
      "poster_handle": "jeremy.scott.ross"
    },
    "time_stamp": "2023-06-13 16:14:55",
    "text": "I wanna know if it’s possible to have an instance of HubSpot with several users that can each only see the contacts they create. If so, is it possible to send emails via HubSpot from each of those users to contacts that they own?\n\nfor more context, I’m interacting with HubSpot via API currently. I hacked together a way to read and write contact info. But wanted to know about the email sending so I might also send emails via API."
  },
  {
    "poster": {
      "poster_name": "Sharad Bhandari",
      "poster_handle": "sharad"
    },
    "time_stamp": "2023-06-13 21:18:32",
    "edited": {
      "time_stamp": "2023-06-13 21:19:13"
    },
    "text": "Thank you justin for your reply, Actually i have set my localhost to ngrok, and set the secure url given by ngrok to webhook targeturl."
  },
  {
    "poster": {
      "poster_name": "Sharad Bhandari",
      "poster_handle": "sharad"
    },
    "time_stamp": "2023-06-13 22:24:14",
    "text": "Thank you so much justin for this help, i resolved the issue , it was on my python side."
  }
]