[
  {
    "poster": {
      "poster_name": "Stefan Pfadt",
      "poster_handle": "s.pfadt"
    },
    "time_stamp": "2023-03-30 02:57:50",
    "edited": {
      "time_stamp": "2023-03-30 02:58:51"
    },
    "text": "Hi, sorry, not sure if this is the right channel to pose my question:    Are there additional options to prevent spam in HubSpot form submission?\nApart from the regular ReCaptcha field, recently I came across many forms that include a simple match calculation field, e.g. \"What is 4+9?\", so that the person submitting a form needs to enter a valid/correct answer. This prevents bots from filling/submitting the form.\nIs something like this possible in HubSpot? Either by adding few lines of code or maybe even by adding a calculation field/property?\nAny insight is highly appreciated :)",
    "reply_count": 11,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-03-30 08:51:20"
      },
      {
        "time_stamp": "2023-03-30 08:51:25"
      },
      {
        "time_stamp": "2023-03-30 09:00:08"
      },
      {
        "time_stamp": "2023-03-30 09:00:59"
      },
      {
        "time_stamp": "2023-03-30 09:03:22"
      },
      {
        "time_stamp": "2023-03-30 09:07:02"
      },
      {
        "time_stamp": "2023-03-31 01:45:10"
      },
      {
        "time_stamp": "2023-03-31 01:45:23"
      },
      {
        "time_stamp": "2023-03-31 01:58:49"
      },
      {
        "time_stamp": "2023-04-25 04:04:40"
      },
      {
        "time_stamp": "2023-04-25 08:17:08"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Rodrigo Manara",
      "poster_handle": "r.manara"
    },
    "time_stamp": "2023-03-30 05:10:30",
    "text": "I am build a app webhook and I cannot see the email out field ? how can do set that.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2023-03-30 08:47:36"
      },
      {
        "time_stamp": "2023-03-30 08:48:55"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Weslley Silva",
      "poster_handle": "weslley.silva"
    },
    "time_stamp": "2023-03-30 07:38:57",
    "text": "Hi, Good morning I am unable to publish my app on the marketplace\nI need help."
  },
  {
    "poster": {
      "poster_name": "Weslley Silva",
      "poster_handle": "weslley.silva"
    },
    "time_stamp": "2023-03-30 07:43:40",
    "text": "The app is only in draft",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-03-30 08:43:14"
      },
      {
        "time_stamp": "2023-03-30 08:43:41"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 08:43:14",
    "text": "did you go through the review process?"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 08:43:41",
    "text": "<https://developers.HubSpot.com/docs/api/listing-your-app>"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 08:47:36",
    "text": "Sorry not exactly sure what you mean by this, you're trying to send a webhook with the email whenever a contact is created?"
  },
  {
    "poster": {
      "poster_name": "Rodrigo Manara",
      "poster_handle": "r.manara"
    },
    "time_stamp": "2023-03-30 08:48:55",
    "text": "I figure out,  custom fields does not display automatically , so I have to  add it manually on the app"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 08:51:20",
    "text": "You could definitely do that. just create a number field in contacts, and limit the values to 13"
  },
  {
    "text": "",
    "time_stamp": "2023-03-30 08:51:25"
  },
  {
    "poster": {
      "poster_name": "Stefan Pfadt",
      "poster_handle": "s.pfadt"
    },
    "time_stamp": "2023-03-30 09:00:08",
    "text": "Hi Carter, thanks for your reply :slightly_smiling_face: Have not thought of that way. However, what will happen if a user enters a wrong number? The idea is that the form can only be submitted once this math recaptcha is filled out correctly. So the number needs to be checked against a valid number. Do you think your suggestion will still work? I am trying to find a workaround to prevent more spam submissions as apparently HubSpot does not have/use math recaptchas.... Cheers, mate ;)"
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 09:00:59",
    "text": "You can make it a required field so the person has to put a number in to submit the form, and obviously the field will not accept wrong numbers"
  },
  {
    "poster": {
      "poster_name": "Stefan Pfadt",
      "poster_handle": "s.pfadt"
    },
    "time_stamp": "2023-03-30 09:03:22",
    "text": "So, first off, since today I how to create a new property (like in your screenshot) but how do I insert it into a already created form and to me more specific only into one form and not all forms that I have created? And secondly, once I inserted the property will there be an option that lets me select to make the field required? Or how can I make it required because I do not see that option when I create a new property."
  },
  {
    "poster": {
      "poster_name": "Carter McKay - Level 17",
      "poster_handle": "carter"
    },
    "time_stamp": "2023-03-30 09:07:02",
    "text": "To insert a new property into a specific HubSpot form and make it required, follow these steps:\n1.\tLog in to your HubSpot account.\n2.\tIn the main navigation menu, go to Marketing &gt; Lead Capture &gt; Forms.\n3.\tLocate the form you want to edit and click on its name to open the form editor.\n4.\tIn the form editor, on the left side, you'll see a list of properties that you can add to your form. If you've already created the new property, you can find it under the \"Contact properties\" or \"Company properties\" tab, depending on the type of property you created.\n5.\tSearch for the property you want to add to the form by using the search bar or scrolling through the list.\n6.\tClick and drag the property from the list to the form builder area on the right side. This will add the property to your specific form only, and not to all of your forms.\n7.\tOnce the property is added to the form, click on the property field in the form builder area to open its settings.\n8.\tIn the field settings, you'll find an option called \"Make this field required.\" Check the box to make the field required.\n9.\tAfter making the necessary changes, click the Publish or Update button in the top-right corner to save your changes.\nNow, you've successfully added a new property to a specific form and made it required. Visitors will need to complete this field before they can submit the form.\n\n#aigenerated"
  }
]