[
  {
    "poster": {
      "poster_name": "Ryan Gibbons",
      "poster_handle": "ryan805"
    },
    "time_stamp": "2021-12-22 09:45:53",
    "text": "Hi there, we’re trying to set an appropriate tabindex value on checkboxes in a HubSpot form.  This doesn’t seem to be something that can be modified and Googling hasn’t turned anything up, but I can’t imagine tab navigation of checkboxes is something that HubSpot has overlooked.  Any pointers on where we should be looking?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-12-22 09:56:53"
      },
      {
        "time_stamp": "2021-12-22 10:01:30"
      },
      {
        "time_stamp": "2021-12-22 10:12:07"
      },
      {
        "time_stamp": "2021-12-22 10:23:27"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2021-12-22 09:56:53",
    "text": "Hey <@U02MFJMM145>! Can you share more about why you’re looking to add a `tabindex`? Since they’re `input` elements, they should be tabbable by default. Are you looking for the tab navigation to be in a different order than the markup?"
  },
  {
    "poster": {
      "poster_name": "Ryan Gibbons",
      "poster_handle": "ryan805"
    },
    "time_stamp": "2021-12-22 10:01:30",
    "text": "Hi <@U02NJACH5QS> thanks for the response!  They don’t seem to be navigable by default which is why we’re looking into this.  We don’t need any custom order.  We’ve inherited a HubSpot implementation from another design/dev agency and are try to help our client resolve a few issues like this.  You can see the user-facing live example of this here (<https://www.advisorengine.com/schedule-a-demo>) if you click on the first CTA link for “TRY IT FREE” a little ways down on the page in the 3 column section."
  },
  {
    "poster": {
      "poster_name": "Michele Herzog",
      "poster_handle": "michele.herzog24"
    },
    "time_stamp": "2021-12-22 10:12:07",
    "edited": {
      "time_stamp": "2021-12-22 10:13:44"
    },
    "text": "Ah! I see what you mean- the checkboxes are actually psuedo-elements, so they’re not in the tab order, and the checkboxes themselves have `display:none`.\n\n<http://jsfiddle.net/maxshuty/qxakwcy3/|This JS fiddle> might help, as it uses fontAwesome icons (which your site uses). Essentially, instead of completely hiding the real checkbox `input` elements, this moves them behind the icon (using `position: absolute` and a negative z-index) so when you focus the hidden checkbox, it also adds a focus outline to the icons. Not a tabindex solution, but one you could probably do with just some CSS tweaks."
  },
  {
    "poster": {
      "poster_name": "Ryan Gibbons",
      "poster_handle": "ryan805"
    },
    "time_stamp": "2021-12-22 10:23:27",
    "text": "Incredibly helpful, thank you <@U02NJACH5QS>!  I appreciate your assistance."
  }
]