[
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2022-12-21 06:31:41",
    "text": "Does this email nurture run on the contact?\n\nWhere does referral partner property live currently?\n\nI think referral partners need to be a custom object. They need to be associated with the deal and contact.\n\nYou could set the nurture on the deal, that way if you had different referral partners with different deals, they could work fine.\n\nYou could do something like copy over specific properties from referral partner to the deal object just before sending email, or you can set up the email so that it reads the stuff"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 06:32:56",
    "text": "I’m doing a combination of these in different portals. I don’t know which one is right, or what a best practice would be — I’m not up on how emailing works so this is the way we put it together"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 06:33:49",
    "text": "maybe you could do this in an iframe but it would likely be messy"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 06:35:48",
    "text": "Has anyone created a smart content email via the api or is that only doable through a gui inside HubSpot?"
  },
  {
    "poster": {
      "poster_name": "Lucas Nicolau",
      "poster_handle": "lucas208"
    },
    "time_stamp": "2022-12-21 07:28:27",
    "edited": {
      "time_stamp": "2022-12-21 07:31:48"
    },
    "text": "yeah, I don't think iframe is the right solution. I would like to know if they have something like stripe elements (for the UI part). I know for sure that is possible because *xoxoday* has achieved this in their interface. And if they achieve that, probably they have found a documentation or support for that."
  },
  {
    "poster": {
      "poster_name": "Lucas Nicolau",
      "poster_handle": "lucas208"
    },
    "time_stamp": "2022-12-21 07:33:36",
    "text": "Unfortunately, their documentation is lacking a lot of information on that matters. :disappointed: Like basic stuff are cover, but more complex tasks there is nothing cover..."
  },
  {
    "poster": {
      "poster_name": "Alex Biardo",
      "poster_handle": "alex.biardo"
    },
    "time_stamp": "2022-12-21 10:15:25",
    "text": "Did you every figure out how to add these images to an email?"
  },
  {
    "text": "Hey Nicholas, thanks for your thoughts, the association to the contact is the problem as there could be more than referring brand that needs to be associated and emails only look at the primary association. I can’t use the HubDB as that doesn’t allow for personalisation tokens to run as filters for emails. I tried custom objects but same issue persisted. What I’ve landed on was using line items - they have a relationship with the deal directly copied from the product table providing an association with the contact as a subtable. This required a number of API calls to create the deal, find the product ID, create the line item and then associate the line item to the deal using a platform called n8n as a way to manage the workflow\n\nI did try to copy over the information to the deal, but it was proving complicated without operations hub..",
    "time_stamp": "2022-12-21 14:21:41"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 14:22:15",
    "text": "I can’t use the HubDB as that doesn’t allow for personalisation tokens to run as filters for emails.\n\nCan you elaborate on that?"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 14:22:57",
    "text": "OH YES, if you don’t have operations hub that would be very difficult to manage in that regard"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 14:24:37",
    "text": "I am interested in the hudb item — no rush on answering.\n\nOverall I’ve done quite a bit of crazy emails using hubdb and allowed for personalization. I had a broken email for weeks and HubSpot wasn’t able to fix it, in the end I found a work around to bring other tokens into the email"
  },
  {
    "poster": {
      "poster_name": "Nicholas Decker - Level -22",
      "poster_handle": "nickdeckerdevs"
    },
    "time_stamp": "2022-12-21 14:26:53",
    "text": "also, is this a product of so much testing you just name things like this? <https://share.getcloudapp.com/qGuZEDj4>\n\nBecause I get it lol"
  }
]