[
  {
    "poster": {
      "poster_name": "Joe O'Hara",
      "poster_handle": "johara"
    },
    "time_stamp": "2022-12-20 04:32:45",
    "text": "The only way to enable the beta is to do it at the template level or pull in a module with the beta. You could pull in a totally empty module with the beta enabled and it will still work"
  },
  {
    "text": "One question, Is there any way to add a HubSpot Email Drag and Drop Editor into React website?\n\nI am trying to create a application very similar to <https://app.HubSpot.com/portal-recommend/l?slug=ecosystem/marketplace/apps/marketing/marketing-automation/xoxoday-plum-226124|xoxoday plum>. I noticed that they are somehow allow editing the email on their website, then probably saving using this <https://api.hubapi.com/content/api/v2/templates|Template API> and then sending the email using <https://legacydocs.HubSpot.com/docs/methods/email/transactional_email/single-send-overview|single email send API>.\n\nSo I am kind of stuck on how to edit the email template from my own website, similar to how the are doing. Because I need to allow user to select some email content, like:\n\n\"Hello, {First Name}. Welcome to my new public app!\"\n\nand add a video generated from the text above to the email before sending.",
    "time_stamp": "2022-12-20 10:52:18",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-21 06:33:49"
      },
      {
        "time_stamp": "2022-12-21 07:28:27"
      },
      {
        "time_stamp": "2022-12-21 07:33:36"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Richard Owens",
      "poster_handle": "rich151"
    },
    "time_stamp": "2022-12-20 16:39:00",
    "text": "Hey guys, I’m trying to create an automated email nurture which updates leads based on a lead status. Leads can have 2+ deals running at any one time. The challenge is that there are referral partners that need to be mentioned when the emails get sent out. This personalises the from email address and name, branding, links, a lot of the elements of the email. What I’ve tried unsuccessfully is to associate the contact with a deal, which has associations to a company or even a custom object that it is pulling the data into. We have about 500 referral partners and dealing with about 10,000 leads per month. Pulling from HubDB could be another option but it could be difficult to manage email changes for general admins and then there’s the option of copying the referrers data form another object to the deal at the deal creation and sending from there. If someone has come across this sort of scenario with any advice, that would be great!",
    "reply_count": 9,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-12-21 06:31:41"
      },
      {
        "time_stamp": "2022-12-21 06:32:56"
      },
      {
        "time_stamp": "2022-12-21 14:21:41"
      },
      {
        "time_stamp": "2022-12-21 14:22:15"
      },
      {
        "time_stamp": "2022-12-21 14:22:57"
      },
      {
        "time_stamp": "2022-12-21 14:24:37"
      },
      {
        "time_stamp": "2022-12-21 14:26:53"
      },
      {
        "time_stamp": "2022-12-22 17:08:21"
      },
      {
        "time_stamp": "2022-12-22 17:08:52"
      }
    ]
  }
]