[
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 10:46:32",
    "text": "Hi all -- I'm an OSS loving full stack developer (Current Stack: API = Rails; UI = React; CI/CD = Git + Docker + Serverless + AWS) working for a start up in the insurtech space. We're adding a marketing service targeted towards independent insurance agents, and part of this will be providing a central analytic dashboard to aggregate all of their KPIs and activities. We use HubSpot internally for sales and marketing, and a couple of our initial marketing clients use HubSpot already. In the package we're developing to onboard new marketing clients we're setting them up on HubSpot if they aren't already attached to a system. -- So, I've been tasked with learning HubSpot integrations. :slightly_smiling_face: I'm hoping for some hints, tips, and smart advice that might save me a little time or headache, and I'm completely willing to share anything I come across with the community in turn. \"ELI5\" as far as HubSpot internals please -- maybe reach up to ELI10 for general development stuff. :wink: I'm at the point right now of wondering even what kind of account I need to set up, figuring out permissions, etc. First goal is to write something useful for internal use, like adding a new agent to contacts when they sign up on our website. Then to be able to pub/sub for events -- looks like there are webhooks -- so I can feed those into a timeline of some kind on a dashboard. Next phase -- be able to do these things for clients. Third phase -- possibly integrate as much as possible into the HubSpot UI -- not sure how extensible that is but from a midnight dash through the docs, looks like more than I would have thought. If we can piggyback into what's already in use that'd be a quicker path to done. -- Sorry for long post, just trying to give context for anyone who might be kind enough to provide some direction. Feel free to DM or post to thread. Thanks again.",
    "reply_count": 36,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2018-11-28 11:13:50"
      },
      {
        "time_stamp": "2018-11-28 11:16:09"
      },
      {
        "time_stamp": "2018-11-28 11:17:32"
      },
      {
        "time_stamp": "2018-11-28 11:17:45"
      },
      {
        "time_stamp": "2018-11-28 11:19:31"
      },
      {
        "time_stamp": "2018-11-28 11:19:56"
      },
      {
        "time_stamp": "2018-11-28 11:20:03"
      },
      {
        "time_stamp": "2018-11-28 11:21:45"
      },
      {
        "time_stamp": "2018-11-28 11:21:57"
      },
      {
        "time_stamp": "2018-11-28 11:24:13"
      },
      {
        "time_stamp": "2018-11-28 11:24:22"
      },
      {
        "time_stamp": "2018-11-28 11:25:51"
      },
      {
        "time_stamp": "2018-11-28 11:27:17"
      },
      {
        "time_stamp": "2018-11-28 11:27:24"
      },
      {
        "time_stamp": "2018-11-28 11:27:54"
      },
      {
        "time_stamp": "2018-11-28 11:28:14"
      },
      {
        "time_stamp": "2018-11-28 11:28:57"
      },
      {
        "time_stamp": "2018-11-28 11:29:15"
      },
      {
        "time_stamp": "2018-11-28 11:30:07"
      },
      {
        "time_stamp": "2018-11-28 11:31:00"
      },
      {
        "time_stamp": "2018-11-28 11:31:17"
      },
      {
        "time_stamp": "2018-11-28 11:31:22"
      },
      {
        "time_stamp": "2018-11-28 11:32:27"
      },
      {
        "time_stamp": "2018-11-28 11:36:39"
      },
      {
        "time_stamp": "2018-11-28 11:38:21"
      },
      {
        "time_stamp": "2018-11-28 11:39:20"
      },
      {
        "time_stamp": "2018-11-28 11:40:51"
      },
      {
        "time_stamp": "2018-11-28 11:40:55"
      },
      {
        "time_stamp": "2018-11-28 11:41:33"
      },
      {
        "time_stamp": "2018-11-28 11:43:03"
      },
      {
        "time_stamp": "2018-11-28 11:43:23"
      },
      {
        "time_stamp": "2018-11-28 11:46:35"
      },
      {
        "time_stamp": "2018-11-28 11:52:49"
      },
      {
        "time_stamp": "2018-11-28 11:54:31"
      },
      {
        "time_stamp": "2018-11-28 12:11:05"
      },
      {
        "time_stamp": "2018-11-28 12:11:59"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:13:50",
    "edited": {
      "time_stamp": "2018-11-28 11:14:04"
    },
    "text": "What's up <@UEE9HSQ4S>!! - First off, let me welcome you to the community! We're excited to have you - excited to hear your thoughts, ideas, and collab together.\n\nSecondly, for API related items - you'll want to:\n1. Jump into <#C2YHAHB6K|api>\n2. Create a API developer portal for tokens: <https://developers.HubSpot.com/>\n3. Bookmark API forum for technical support questions: <https://integrate.HubSpot.com/>\n4. Bookmark the API docs: <https://developers.HubSpot.com/docs/overview>\n5. Subscribe to the API Changelog: <https://developers.HubSpot.com/changelog>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:16:09",
    "text": "I will say - Generally speaking this slack conversation is around CMS development... but there are plenty of full-stack / API devs (as you must use our API's to custom build many CMS-related items)."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:17:32",
    "text": ":point_up_2: This is not intentional, this slack is open to anything development related. But CMS Dev's have just gravitated here. BUT - you can help share your knowledge and we get more and more full-stack dev's in this slack."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:17:45",
    "text": "I've done some of that. I actually made a HubSpot dev account for myself, and had one of our users do so, and was a little confused as to which key to use. The one that seemed to get some data was the key made by one of my users while  logged in though it said API Key vs hapi key. but a couple things it didn't seem to have access to. Does the key inherit the permissions of the user who generates it?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:19:31",
    "text": "hummm... let me repost this question in <#C2YHAHB6K|api> and tag people"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:19:56",
    "text": "Oh, I'm open to CMS learning too, ha. Another thing we'll be doing is spinning up websites for any clients that don't already have one and the business case for using WordPress is pretty strong there so that's probably what I'll have to do."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:20:03",
    "text": "thanks!"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:21:45",
    "text": "Beautiful - did you check out the CMS Developer Discovery Kit?\n\nIt includes a free sandbox CMS account, quick-start activity, and overview/links of major HubSpot CMS areas."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:21:57",
    "text": "<https://designers.HubSpot.com/discoverykit>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:23:09",
    "edited": {
      "time_stamp": "2018-11-28 11:23:18"
    },
    "text": "Sounds great! ... if you want a little more ideas on how community dev's are building locally - check this out: <https://community.HubSpot.com/t5/Content-Design-Questions/Can-you-setup-local-development-on-HubSpot-CMS/td-p/199430>"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:24:13",
    "text": "Is that the \"design manager\"?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:24:18",
    "text": "Also <@UEC65BQV8> - we're exploring a total revamp of local development on hubSpot. Let me know if you have specific ideas/frustrations with local dev"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:24:22",
    "text": "Do you guys host websites as well?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:25:51",
    "edited": {
      "time_stamp": "2018-11-28 11:26:30"
    },
    "text": "&gt; - Discovery Kit = CMS Developer onboarding.\n&gt; - Design manager is our in-app editing interface for developers. This is one of three ways to build on HubSpot CMS. The other options are visually with our drag-n-drop editor (usually used by marketers) and coding locally with FTP."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:27:17",
    "text": "But where would FTP"
  },
  null,
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:27:24",
    "text": "files go?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:27:54",
    "text": "<https://designers.HubSpot.com/docs/tools/HubSpot-ftp>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:28:14",
    "text": "Oh - we host the sites."
  },
  {
    "poster": {
      "poster_name": "Derek Gervais",
      "poster_handle": "dgervais"
    },
    "time_stamp": "2018-11-28 11:28:57",
    "text": ":wave:  An API key has access to everything in a portal; it sounds like you might have had trouble distinguishing between the developer API key and a \"regular\" API key. If you're making a request to create a contact, update a template, or anything else related to a specific HubSpot account, you'll need to get that account's API key <https://knowledge.HubSpot.com/articles/kcs_article/integrations/how-do-i-get-my-HubSpot-api-key>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:29:15",
    "text": "Thanks <@U9F22AQH5>!!!"
  },
  {
    "poster": {
      "poster_name": "Derek Gervais",
      "poster_handle": "dgervais"
    },
    "time_stamp": "2018-11-28 11:30:07",
    "text": "The API key you can find in your _developer account_ is your Developer APi key, which is used to make configuration requests to your developer account (e.g. updating webhook subscriptions, adding timeline event definitions, etc.)"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:31:00",
    "edited": {
      "time_stamp": "2018-11-28 11:31:06"
    },
    "text": "RE: Hosting - HubSpot takes care of all the hosting, server maintenance, backups, security, etc.\n\nSee points 3 and 6 here: <https://designers.HubSpot.com/web-developers-love-HubSpot-cms>"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:31:17",
    "text": "Thanks so much <@U9F22AQH5>"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:31:22",
    "text": "So when you FTP, you'll FTP directly into your HubSpot account."
  },
  null,
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:32:27",
    "edited": {
      "time_stamp": "2018-11-28 11:32:31"
    },
    "text": "Also for local CMS development... I'd check out this thread for a few examples: <https://community.HubSpot.com/t5/Content-Design-Questions/Can-you-setup-local-development-on-HubSpot-CMS/td-p/199430>"
  },
  null,
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 11:36:39",
    "text": "Hey Ken, welcome to the community! One thing I do want to point out that a lot of new developers familiar with full-stack run into is that HS hosting is 100% managed and does not offer some things you may expect it to (for example, while HS uses a Jinja-based templating language for its sites, it does not allow you to run vanilla python, use pip, anything like that.) If you ever need anything translated from Full-Stack to HS, feel free to DM :slightly_smiling_face: I've built a bunch of sites and a few custom integrations over my time on the platform and would be happy to help out. You will also want to play around with the workflows tool more than likely, the webhooks functionality in there can be really helpful."
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 11:38:21",
    "text": "thanks for the help/offer <@U26BLKGE4>!! :raised_hands: #Community :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:39:20",
    "text": "Ok, this is clearly a much larger product than I realized, ha. I understand I'm going to have to just knuckle down some night and pore over the docs. I hadn't even considered using HS as a CMS -- I didn't realize it had one, I kept thinking you meant CRM. :man-facepalming: On the CRM -- is there a demo site or something I could ping to test responses? If I could hand off the marketing pages to our super-capable but only semi-technical staff, and just integrate them into our app, I'd see that as a win. That's what I was planning to do with spinning up WP sites, but then I'm going to have to build and maintain the backend to manage all that. :disappointed: If there's an acceptable alternative, I'm certainly willing to pitch it to the CTO."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 11:40:51",
    "text": "The CRM is free, as are all CRM APIs :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:40:55",
    "text": "Thanks <@U26BLKGE4>! Yeah, as a rule the totally hosted thing would be a non starter. But in this case, the MVP used a uxi (Marketing360) site for the marketing stuff, so the creative team could iterate quickly."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:41:33",
    "text": "And the complaint with that was basically SEO stuff they weren't doing and don't allow us to do manually -- metas, titles, etc."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:43:03",
    "text": "Sorry, this time *I* meant CMS and wrote CRM. What's the performance of the hosted stuff?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 11:43:23",
    "text": "HubSpot would definitely be a good fit for that, but it is priced more comparatively to products like WP Engine or FlyWheel than a simple self-hosted flavor WordPress. Worth the investment in my mind, but it's worth mentioning"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 11:46:35",
    "text": "I have rarely had an issue with performance, and I've been on the platform nearly 5 years. There are a couple little things that Google Page Insights dings sites for, but in general HS does a great job at making optimization a breeze. Things like auto-minifying images and converting them to .webp if possible, the new modules system is pretty similar to a simple react component - webpack kind of system (without us having to manage any of the configuration) to bundle shared assets and make sure they appear at the right position in the compiled markup."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 11:52:49",
    "text": "That's encouraging, thanks. Cost wise, it's like any build vs. buy call -- given enough time and resources, I can build pretty much anything. Whether that's the best use of the time is another issue. To self host WP for us would be a negligible cost -- WP is free, we already have reserved instances on AWS, so sunk cost there. So the real cost is me building the dockerfiles and templates to integrate them into our pipeline, a system to track and manage the instances, and ongoing maintenance. That's a CTO call not for a lowly dev, ha. But amounts to what they most want me doing, or what they want first. Have you ever migrated anything off of HS hosting? One thing that really irks me about the Uxi is they don't allow you to export the theme (which my company built). You can get the content out and all the assets, but they consider the rest their property evidently. So basically they say \"stay with us or recreate everything from scratch\". Which of course isn't such a big deal, but struck me as a chintzy thing to do."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 11:54:31",
    "text": "I have migrated from HS to WP before. While there isn't a \"export all\" button or anything like that, if you know your way around the APIs, you should be able to get everything migrated pretty easily."
  },
  {
    "poster": {
      "poster_name": "Ken",
      "poster_handle": "ken"
    },
    "time_stamp": "2018-11-28 12:11:05",
    "text": "Cool, thanks. As long as it's available. I'm going to start with trying to use the API key and write a couple simple services. Then look at what I can do around integrating the workflows into the HS CRM. By the time I get that going, I should have some clarity on what I'll need to do on the CMS side. My vote is use HS and hand it off, but of course I'm biased because there are other things I'd rather build, ha. Thanks again to everyone here, I have to say this is an excellent community. Cheers all!"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-28 12:11:59",
    "text": "\"there are other things I'd rather build\" :joy:"
  },
  {
    "poster": {
      "poster_name": "Don Villareal",
      "poster_handle": "don.villareal"
    },
    "time_stamp": "2018-11-28 13:03:13",
    "text": "The experience has been pretty good. What do I have to look forward to by being in the Slack?"
  },
  {
    "poster": {
      "poster_name": "Luke Summerfield",
      "poster_handle": "lukesummerfield"
    },
    "time_stamp": "2018-11-28 13:59:56",
    "text": "great :slightly_smiling_face: The slack is a great place to ask technical questions and get help from other devs. There are also great open source projects you can get involved in (for example <#CCQSQ2C6L|crankshaft> or <#CBBAW6Z3R|community-browser-extension> ), also great place to give the HubSpot product team direct feedback in channels like <#C960Q64G4|design-manager>. Lastly, you can stay up to date with product releases and ask questions about new products."
  },
  null
]