[
  null,
  {
    "poster": {
      "poster_name": "Jurjen Sytsma",
      "poster_handle": "jurjen"
    },
    "time_stamp": "2018-11-29 10:56:10",
    "text": "Hi guys! Actually not new to the HubSpot CMS, but new to the community, so reason enough for an intro :slightly_smiling_face: After having run a creative development agency and being the tech guy there I've recently been pulled into a Diamond agency to make their development department even more awesome. In my former occupation we've been developing on HubSpot for our clients, although not being a HubSpot partner ourselves. Our challenge; make the Design Manager what we wanted it to do, which caused me to loose all my hairs, but gave me a lot of fun with hacking, pushing and bending the CMS. We made some happy dances after we've managed to get a multilingual 404 page (when multilingual wasn't supported yet by HubSpot) and (still) being listed on the first page of the HubSpot inspire page as the only non-agency. My background is being a developer, but having had designers around me for whole my life (actually my brother is one) I try to 'think as a designer' and consequently, 'think as a human', which helped me a lot with being creative and finding solutions that actually work for problems that could not be solved (or so they said, ha!). In my new role I'll continue my work of the past few years with building awesome stuff on HubSpot, but I'll dive head first into the bigger hemisphere that's called HubSpot to contribute in all areas of this awesome platform, from the development side. Mainly building tools, utilities, websites, connections, or whatever makes the live of people using HubSpot easier. I hope to learn a lot from you guys as I realize that although I've got quite some experience poking around in the Design Manager, I still am a toddler in all other area's of HubSpot, and I hope I can contribute to the community by sharing awesome stuff we've built or came up with. Thanks for having me here! And forgive me for my long intro :slightly_smiling_face:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2018-11-29 11:12:19"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-11-29 11:12:12",
    "text": "Welcome to the hacking party!"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-11-29 11:12:19",
    "text": "we’re all a little hackery here and love to push the CMS’s boundaries, you’ll fit right in, welcome!"
  },
  null,
  null,
  null,
  null
]