[
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 08:36:39",
    "edited": {
      "time_stamp": "2024-07-17 08:38:25"
    },
    "text": "Hi! we want to create a subfolder (not a subdomain) on our main domain  that will contain tens of thousands of dynamic landing pages. This subfolder will be hosted on a separate server, while our primary website remains hosted on HubSpot.\nWhat would be the best approach to doing this?",
    "reply_count": 8,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2024-07-17 14:18:40"
      },
      {
        "time_stamp": "2024-07-17 14:23:20"
      },
      {
        "time_stamp": "2024-07-17 14:28:37"
      },
      {
        "time_stamp": "2024-07-17 14:31:27"
      },
      {
        "time_stamp": "2024-07-17 14:57:27"
      },
      {
        "time_stamp": "2024-07-17 14:59:36"
      },
      {
        "time_stamp": "2024-07-17 17:59:43"
      },
      {
        "time_stamp": "2024-07-19 13:01:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-17 14:18:40",
    "text": "You'd have to do a reverse proxy, since you're hosting that content externally it will depend on that server if you can do it. Reverse proxy for HS is only available for enterprise accounts but I've never done one in this direction (usually the opposite).\n\nWhy not use HubDB to create the dynamic LPs directly in HS?"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-07-17 14:23:20",
    "text": "A great question from <@U03AKL6Q1B2>\nSounds reasonable to have everything in one place"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 14:28:37",
    "text": "Hi Jennifer, appreciated however we tried the HubDB approach and we need far more than what HS allows, in addition to significant performance impact we suffered resulting in low SEO performance. Happy to share privately what our more specific issues/experiences were. We even reached out to product mgt and it was made clear that our requirements for HubDB were not among their priorities."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-17 14:31:27",
    "text": "That's interesting, I can understand exceeding the limits, but no reason to have SEO impact. I've built hundreds of dynamic sites/LPs and never had a performance issue (theme and developer are critical for this). Would love to know what your use case is that is exceeding the limits. Are you trying to create more than 10 /sub-pages (not dynamic pages) from a single hubDB?"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 14:57:27",
    "text": "Yes in 10k increments per table (every page specific to a single part # search) and Google pegged us at 220K plus pages total"
  },
  {
    "poster": {
      "poster_name": "EJ Schmidt",
      "poster_handle": "sipjeensopje88"
    },
    "time_stamp": "2024-07-17 14:59:36",
    "text": "We also have a subdomain with 350k pages however given slow ramp of domain authority buildup we are rethinking our approach and wonder if the subfolder path could work so that we can build on the domain authority of our corporate HubSpot site."
  },
  {
    "poster": {
      "poster_name": "Jennifer Nixon",
      "poster_handle": "jnixon"
    },
    "time_stamp": "2024-07-17 17:59:43",
    "text": "I'm really questioning if this is being built efficiently...(Sorry was on a flight between messages).\n\nPower of dynamic pages is that you don't need thousands of individual pages, but you can surface different product information on the same page.\n\n350k product pages seems like overkill from an SEO perspective, unless the search volume for each part is in the thousands/month. If each product has a low search volume, it's a highly over engineered solution that won't yield big results.\n\nObviously I don't know your full use case, but my gut is telling me you're headed toward huge spend without equally valuable return."
  }
]