[
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-15 01:28:37",
    "edited": {
      "time_stamp": "2024-07-15 01:43:24"
    },
    "text": "Hey <@U058XK120QH> - those issues are mostly related too the theme you're using and can be addressed by optimizing the code"
  },
  {
    "poster": {
      "poster_name": "Puneet Sood",
      "poster_handle": "puneetsood51"
    },
    "time_stamp": "2024-07-15 03:21:22",
    "edited": {
      "time_stamp": "2024-07-15 03:21:39"
    },
    "text": "i don't know how to fix this issues or not"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-07-15 03:38:06",
    "text": "I find these reports too stressful, being all red and mandatory.\nIt's better to rely on Google speed test directly rather than this disastrous UX\n\nFirst of all, direct Google reports suggest hints to how you can fix the issue when in the HubSpot report it's too vague and not necessarily helpful. After helping several clients with these reports, I just go to the source — Google page speed\n\nIt's important to remember that different business goals can influence website priorities. For instance, sometimes aesthetics take precedence over technical elements like the number of DOM elements on a page, which can impact loading time. This is just one example of how priorities can vary.\n\nBut in the HubSpot interface there is no option to ignore those issues that are not aligned with website goals. The overall design of the SEO report makes marketing managers stressed and think that those things are critical when they might not be so.\n\nI submitted a proposal with improvements for this section last year but, unfortunately, have never heard from the HubSpot team.\n\nJust my rant here to say that I understand <@U058XK120QH> and how it might be frustrating to work with this SEO report.\n\nI strongly believe that HubSpot could greatly benefit from user research in improving this part of the platform"
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-07-15 03:48:58",
    "text": "<@U058XK120QH> - <https://developers.HubSpot.com/beta-docs/guides/cms/content/performance/speed|this doc> is a good start to get into \"what a developer can optimize\" and \"what HubSpot will optimize for you\".\nMy recommendation is to:\n• don't rely only on the HubSpot SEO recommendation like <@UMZFZHVUJ> said and test your page with different tools like <https://pagespeed.web.dev/?hl=DE|google page speed/lighthouse>, <https://gtmetrix.com/|gtmetrix>, <https://en.ryte.com/website-checker/|ryte>, <https://website.grader.com/|HubSpot website grader>(their \"own version\" of lighthouse) and similar\n• work with a developer to optimize the code side of things\n• many themes load everything at once. This might be the root of a potentially long loading. If this should be the case you should consider rewriting it to a more component/atomic based approach so each page will load only the required assets. (Depending on your theme it  can be quite an effort)"
  }
]