[
  {
    "subtype": "tombstone",
    "text": "This message was deleted.",
    "time_stamp": "2018-09-13 05:50:29",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2018-09-13 06:58:09"
      },
      {
        "time_stamp": "2018-09-13 07:05:17"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 06:58:09",
    "text": "I’m not sure I have the correct answer to this myself, but I’d suggest posting this in <#C22PU4LV8|general> as it’s still related to HubSpot. Someone there might have an answer"
  },
  {
    "poster": {
      "poster_name": "Uwe Peukert",
      "poster_handle": "uwe"
    },
    "time_stamp": "2018-09-13 07:05:17",
    "text": "Alright, I’ll do it! Thank you"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 09:58:05",
    "edited": {
      "time_stamp": "2018-09-13 09:58:36"
    },
    "text": "*Anyone have a good resource or blog post that talks about css `image-set`?*\nI specifically want to know if the sizing unit HAS to be 1x 2x etc.\n\nI kinda feel like those units are meaningless, as frankly it seems like what we should do instead is be telling the browser what the dimensions are of the image, so it can make the determination itself"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-09-13 10:03:14",
    "text": "Are you talking about source set?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:04:08",
    "text": "nope"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:04:33",
    "text": "CSS image-set - same basic principle as srcset but for CSS"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:04:49",
    "text": "main use-case being background-images, no?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:04:54",
    "text": "correct"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:06:09",
    "text": "I found a few blogs and stuff complaining about how IE and Edge don’t yet support it but no one really explains what values are allowed. I want to know if it supports the same unit types as srcset does basically."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:07:18",
    "text": "looks like the multiplier (1x 2x) aren't mathematical, rather they're aligned with variables of the user agent. So obviously, safari on a retina screen is going to use the 2x. It doesn't necessarily line up mathematically with resolution."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:07:53",
    "text": "AKA, Thanks ~Obama~ Apple"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:11:12",
    "edited": {
      "time_stamp": "2018-09-13 10:12:21"
    },
    "text": "right, so personally I feel 1x and 2x and whatnot is useless for this purpose. where as specifying a width of an image is more relevant.\n\nFor example with src set the browser picks the image based on the vw of the image and does it’s calculation of screen size and resolution and whatnot, picking the appropriate one.\n\nWhere as if I tell it I have a 1x and 2x image that’s kinda dumb. because say I have an image  that’s 2x for iphone size. that’s not necessarily 2x for desktop size, because if the image is displayed larger on desktop than it was on mobile, then that is innacurate."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:17:10",
    "text": "Jon, you want web variables to be logical according to the content we're trying to display to users? Are you insane? /s\n\nWould be a total PitA, but I would think you could combine media queries and image-set in that case. Again, 1x and 2x are about non-specific measurements of pixel density rather than screen size, so if you have a QHD phone, you would display the mobile 2x image. Low-res desktop, min-width 768px use desktop image at 1x."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:23:44",
    "text": "I think you’re miss-understanding.\nI want it to act exactly like the img srcset attribute does.\n\nIn general a 2x resolution image is double that of a normal resolution image. So say you had an image for mobile that is 375px, you’d load a 2x version for devices supporting retina, meaning the actual px dimension of that image would be 750px.\n\nHere’s the issue: as developers we can add media queries for resolution and whatnot and force an image but that actually is not a good thing for us to do.\n\nThe way srcset works the browser decides based on several contexts what image is appropriate."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:24:45",
    "text": "It takes into account many different factors like resolution, internet speed, and how large the image will actually be displayed on the page when rendered."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:25:44",
    "text": "So instead of say forcing a person on a really crappy internet signal to download a massive version of a graphic, the browser would determine - hey it’s not worth it right now I’m going to load the lower res one for now."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:27:45",
    "edited": {
      "time_stamp": "2018-09-13 10:28:04"
    },
    "text": "when defining images in this way, 1x 2x is relative and meaningless, and frankly results in having to write a lot of media queries - if you wanted to do it right."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:30:54",
    "text": "yes. lol. We're saying the same thing, other than \"meaningless.\" They're there for a reason, it just doesn't make sense in most cases. I was just explaining how they could be used, not that it's the best way forward. It's a dumb attribute. I'd rather just use a low-res fallback."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-13 10:31:55",
    "text": "but yeah, to answer your original question, it has to be 1x or 2x because it's basically a browser-level boolean, that's all I meant lol"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-13 10:37:01",
    "text": "yea, I don’t like that lol. I want to define a width instead so I don’t have to create a bunch of media queries. Make the browser to the work lol"
  }
]