[
  null,
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 08:22:32",
    "text": "I’m not sure honestly how to do this, I would ask in <#C22PU4LV8|general> you’ll get more eyes on your question"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 08:23:47",
    "edited": {
      "time_stamp": "2018-09-28 08:24:26"
    },
    "text": "Question for Mac using Devs, *have you installed Mojave yet? and have you run into any issues?* I usually lag a behind a bit between apple updates because I’ve found they’re not always smooth or tools I have aren’t compatible yet, and I need my computer for work."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-28 08:29:29",
    "text": "Have not upgraded yet, apparently it breaks our conference call software lol. Once that's patched though, gimme that dark mode."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 08:44:00",
    "text": "what conference call software do you use? zoom?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-28 08:46:26",
    "text": "RingCentral, which is \"powered by Zoom\" and basically the same thing, plus physical VOIP phones"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 08:51:58",
    "edited": {
      "time_stamp": "2018-09-28 08:58:44"
    },
    "text": "hmm…. might just upgrade just so I can’t use zoom “no I’m sorry guess we’re going to have to use one of the other 100 apps because y’know zoom doesn’t run on Mojave yet.” lol\n\nI don’t know what it is about zoom, but I feel like it’s not at all unique or significantly better than most of the similar services I’ve used in the past. I just don’t get the buzz around it. Sorry if anyone likes it, I just don’t really get why it’s “better” than slack, google hangouts, google chat for work, slack video conferencing, uberconference, <http://join.me|join.me>, goToMeeting… It’s not bad, it’s just… average to me and I’m not a fan of installing software I’m only going to use once every other month."
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2018-09-28 08:58:54",
    "text": "Not sure on the hype. Been wanting to try the Slack video conferencing, but we're on the free plan, so we can't share screens :confused:"
  },
  {
    "poster": {
      "poster_name": "AJ LaPorte",
      "poster_handle": "ajlaporte"
    },
    "time_stamp": "2018-09-28 08:59:14",
    "text": "slack's screen sharing is pretty awesome"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 08:59:28",
    "text": "I have it on a client’s slack. it works as expected, nothing bad to say about it"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2018-09-28 09:01:08",
    "text": "in-fact that client hilariously pays for 3 or 4 teleconferencing programs right now.\n\nThey have zoom, they have uberconference, and they have slack’s conferencing(the owner exclusively added this just so he didn’t have to open zoom to continue a conversation that started in slack)"
  },
  {
    "poster": {
      "poster_name": "Chad Pierce",
      "poster_handle": "chadbluleadz"
    },
    "time_stamp": "2018-09-28 09:15:48",
    "text": "We use it here internally as we pay for slack. Works great. We also use Uber."
  },
  {
    "poster": {
      "poster_name": "Ian McIlwain",
      "poster_handle": "ian-mcilwain"
    },
    "time_stamp": "2018-09-28 10:16:54",
    "text": "+1 for slack."
  },
  null
]