[
  {
    "poster": {
      "poster_name": "Daniela Koegel",
      "poster_handle": "finance"
    },
    "time_stamp": "2022-01-04 09:04:50",
    "edited": {
      "time_stamp": "2022-01-04 09:07:34"
    },
    "text": "Hi everyone, my name is Daniela, I am not a developer but have just learned and gotten more acquainted with the CMS Hub after purchasing the HubSpot CRM Suite. Although not a coder, the developer account does seem to give quite a lot of additional options (lead capture, SEO) compared to the regular acc. I have been creating landing pages and forms in my regular account where all my marketing contacts, tasks and sales emails are also saved. Would you recommend doing all CMS work (website, landing pages, forms) in the developer account and is there a way to connect the two accounts going forward? I am unsure how this would work, f.ex. now the regular account can check the contacts database and update activitiy from leads and contacts that sign up through forms and landing pages that are set up in the same account. Also where would the analytics be tracked? Probably in the dev account? Thanks a lot for some guidance.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-04 09:14:37"
      },
      {
        "time_stamp": "2022-01-04 09:31:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-04 09:14:37",
    "edited": {
      "time_stamp": "2022-01-04 09:15:17"
    },
    "text": "Hey Daniela, developer accounts are for developers who are learning, testing, and/or creating assets for the marketplace. Many of those assets require access to the full HubSpot Suite, which is why so many features are available in these types of portals. Their main limitation is that a production domain can’t be connected, so you would not be able to run a website with a branded URL on one of these accounts, for example.\n\nIt’s not ideal to use multiple HubSpot portals for one brand, so if there are CMS features you’re missing I would encourage you to reach out to HS to figure out if adding a CMS Hub package to your primary account makes sense."
  },
  {
    "poster": {
      "poster_name": "Daniela Koegel",
      "poster_handle": "finance"
    },
    "time_stamp": "2022-01-04 09:31:48",
    "text": "Hi Mark, got it, thanks for the clarification!"
  }
]