[
  {
    "poster": {
      "poster_name": "Brydon Holsey",
      "poster_handle": "brydon"
    },
    "time_stamp": "2022-01-07 08:00:43",
    "text": "Hey Everyone! I am trying to create a custom value in the rich text module, but for some reason it is still populating the default text. Here is my syntax: {% module \"rich_text\" path=\"@HubSpot/rich_text\", label=\"Quote\", value=\"A block of editable content here\" %}",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2022-01-07 08:16:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Brydon Holsey",
      "poster_handle": "brydon"
    },
    "time_stamp": "2022-01-07 08:01:22",
    "text": "I would like the default value to be what i place in value=\"\" but that doesnt seem to work and the default rich text is still populating in that spot. Any ideas?"
  },
  {
    "poster": {
      "poster_name": "Dustin Perolio",
      "poster_handle": "dustin305"
    },
    "time_stamp": "2022-01-07 08:16:29",
    "edited": {
      "time_stamp": "2022-01-07 08:53:21"
    },
    "text": "Hey there <@U02SDDQ3B3N>,\n\nTry this:\n```html=\"&lt;p&gt;A block of editable content here&lt;/p&gt;\"```\ninstead of:\n```value=\"A block of editable content here\"```"
  },
  {
    "poster": {
      "poster_name": "Kelly Gitre",
      "poster_handle": "kelly916"
    },
    "time_stamp": "2022-01-07 09:00:50",
    "edited": {
      "time_stamp": "2022-01-07 09:03:22"
    },
    "text": "Hey everyone! Nice to meet you - I recently was tasked out with designing an email template in HubSpot. I'm used to creating editable templates for Campaign Monitor clients. I've been trying to go through the Developer resources in HubSpot and I'm stuck on what next steps and specific template language needs to go in the HTML and a few other things. Would anyone be willing to help me out? I'm at a standstill and feeling a little bit overwhelmed. For example - do we need to build modules within HubSpot and then copy the code over to the HTML editable template code? Or am I completely off?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-01-07 09:18:22"
      },
      {
        "time_stamp": "2022-01-10 07:39:25"
      },
      {
        "time_stamp": "2022-01-10 07:40:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-01-07 09:18:22",
    "text": "Hey Kelly, happy to help answer some questions.\n\nHS email templates come in two primary flavors: coded and drag-and-drop. Coded email templates are built using a combination of HTML and HubL (HubSpot’s templating language, very similar to Jinja2). Drag-and-Drop emails are built almost entirely in the GUI email tool and then “saved” as templates, similarly to MailChimp.\n\nHonestly, if possible, I’d suggest simply building the email template in the drag-and-drop editor as it takes care of a lot of the pain of email development. It’s not fully-featured and it’s tedious to individually set padding and other styles in a GUI rather than code, but it’s the best experience for marketers going forward.\n\nIf you do want to go coded, I suggest starting in the cloud Design Manager and creating your base template that way, then bringing it down to your local environment if you so choose. This will generate a lot of the boilerplate code you’ll need to get going. I would also suggest getting some free templates from the marketplace and looking at their code for inspiration."
  }
]