[
  {
    "poster": {
      "poster_name": "Abdullah Ba Abbad",
      "poster_handle": "baabbad"
    },
    "time_stamp": "2022-07-05 06:07:18",
    "text": "Hello Everyone!\nI have deployed the HubSpot integration to production in my company's app but I am getting this error in rollbar:\n`You have reached your secondly limit.`\n\nCan anyone please help me? It is urgent :disappointed_relieved:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-05 11:42:49"
      },
      {
        "time_stamp": "2022-07-06 03:18:24"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kjersti Bakke",
      "poster_handle": "kjersti"
    },
    "time_stamp": "2022-07-05 06:38:43",
    "text": "I have received an api key from a client who want me to connect a form to this api key. The goal is to send data from the from to a different system that my client is using. I have searched the development content for some documentation with no luck. Does anyone have any idea on how to get this done?"
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2022-07-05 11:11:39",
    "edited": {
      "time_stamp": "2022-07-05 11:16:59"
    },
    "text": "~Anyone have any idea why a private app with the following scopes:~\n```oauth\ncrm.objects.contacts.read\ncrm.objects.contacts.write\ncrm.schemas.custom.read\ncrm.objects.custom.read\ncrm.objects.custom.write\ncrm.schemas.custom.write\ncrm.schemas.contacts.read\ncrm.schemas.contacts.write```\n~Would be able to read, and update schemas and contact objects, but receive the following error when trying to create a custom object:~\n~`The scope needed for this API call isn't available for public use. If you have questions, contact support or post in our developer forum.`~\n\n~I am making a pretty basic object definition which is only associated with contacts. I don’t see any other scopes that I think I would need, but could be wrong. Traditionally I’ve used HAPIkeys for object creation, so maybe there are required scopes I don’t know about.~\n\nFigured it out, it’s a subscription level issue. Would be nice if the error message could specify something like “custom objects are not available for the given portal, please contact XXX to upgrade the subscription tier”"
  },
  {
    "poster": {
      "poster_name": "Erik Pettersson",
      "poster_handle": "erik529"
    },
    "time_stamp": "2022-07-05 11:42:49",
    "text": "Throttle your requests. See what limits are enforced here: <https://developers.HubSpot.com/docs/api/usage-details#rate-limits>"
  }
]