[
  {
    "poster": {
      "poster_name": "Stephanie O'Gay Garcia",
      "poster_handle": "stephanie"
    },
    "time_stamp": "2022-07-18 10:04:18",
    "text": "I've created a simple enough membership site and, apart from some CSS, am just using the standard member_register and password_reset_request modules in their respective system pages (I started from the boilerplate). However, I've noticed an issue with both registration and resetting passwords.\n\n*Registering:* the user fills out a form, gets on a list, is sent the registration email. On the register page they fill out their password and, on clicking submit, gets an error \"This email address has already signed up\". But then their login works.\n\n*Password reset:* the user requests a password reset, gets the email. On the password reset page they save it and then get an error \"This password reset link has expired. Please request another reset link and try again.\" But it's worked.\n\nI think it's loading the same page and giving the error because the action's already been taken, but I can't see how to change that. On the password reset above, for example, this is the URL I get after resetting the password (I've replaced sensitive content): `<https://account.domain.com/_hcms/mem/reset?redirect_url=/_hcms/mem/login?success%3Dtrue%26content_id%3D12345%26redirect_url%3Dhttps://account.domain.com/account-overview&amp;verificationCode=12345&amp;emailAddress=12345&amp;utm_medium=email&amp;utm_content=0&amp;utm_source=hs_email>`  - I notice there are two redirect_url parameters?\n\nUnder Private Content &gt; After someone registers I have it set to go to the \"account overview\" page, for example. But I don't see any redirect url parameters I can add to the modules.\n\nDoes anyone have any ideas? Thanks! :blush:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-19 07:50:48"
      },
      {
        "time_stamp": "2022-07-19 13:43:58"
      }
    ]
  }
]