[
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2019-02-01 06:53:51",
    "text": "Anyone changed HubSpot date field form with js? I’ve tried the jquery change function with a date field in HubSpot form but it gets cleared constantly."
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-01 06:56:08",
    "text": "you have to trigger a keypress or certain other event if I remember right. The forms use react so if you don’t trigger it like a person would it wont see the change"
  },
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2019-02-01 07:01:10",
    "text": "Yep I need to trigger change event using jquery based on HubSpot documentation on that. It is all fine on pretty much everything else except when I try to fill value into a date property. For some reason it gets the value but then after a short moment it goes empty &gt;.&lt;"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-01 07:04:45",
    "text": "hmm, yea, seems like it’s not recognizing the change trigger then.  ’fraid I’m not sure what to tell ya. one option you could do is make the date field a text field, then apply your date picker to that. text inputs do properly support change"
  },
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2019-02-01 07:07:34",
    "text": "Yea I’m throwing all sorts of curveballs at this I’ll get it sorted soon surely. Had to check if anyone got some ready neat way to tackle this. Thanks Jon!"
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2019-02-01 07:19:59",
    "text": "<@U7WV8C5LN> what are you trying to set the value to?  If you are trying to set it a datetime that likely won’t work since it’s not a datetime but just date picker",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-02-01 07:21:46"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Joni L.",
      "poster_handle": "joni.laukkonen"
    },
    "time_stamp": "2019-02-01 07:21:46",
    "text": "Yea I’ve figured that HubSpot seems to at least on some parts use Pikaday for the datepicker. I got everything working fine but then ran into an issue that I guess makes me backtrack a little and approach this with a different way since on mobile devices datepicker is ditched and the devices own native datepicker is used"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2019-02-01 14:11:21",
    "text": "<@U7SL518D6>, I am getting a console JS error on my HTML template:\nUncaught ReferenceError: _hsq is not defined, do you know why this is or how to resolve it?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-01 14:12:00",
    "text": "looks like it’s referring to the HubSpot tracking code. not sure why you’d be getting that error"
  },
  {
    "poster": {
      "poster_name": "Chris Abplanalp",
      "poster_handle": "cabplanalp"
    },
    "time_stamp": "2019-02-01 14:13:19",
    "text": "I have the HS standard headers and footers in the html template and just basic HTML/CSS and JS code in there"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2019-02-01 14:17:20",
    "text": "then your js code may have an error"
  }
]