[
  {
    "text": "Hi everyone, I'm trying to pass information from a HubSpot form submission to a calendly URL when a lead requests a demo, preventing them from having to enter the same info twice. I had this working a few months ago but now when I try the same method it's not adding the variables to the end of the redirect as expected. This is the custom embed code I am using in Elementor, which I copy pasted and adjusted from a HubSpot forum post that I can no longer find. Any guidance would be highly appreciated :slightly_smiling_face: :pray:",
    "time_stamp": "2021-06-02 03:27:19",
    "reply_count": 2,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-06-02 03:28:21"
      },
      {
        "time_stamp": "2021-06-02 04:04:15"
      }
    ]
  },
  {
    "text": "when I test it it does take me to the calendly page, but instead of adding the variables to the end of the URL it adds a bunch of random stuff",
    "time_stamp": "2021-06-02 03:28:21"
  },
  {
    "poster": {
      "poster_name": "Dave Askin",
      "poster_handle": "daskinw"
    },
    "time_stamp": "2021-06-02 04:04:15",
    "text": "ahh nvm, my issue was that I had to disable the redirect URL in the HubSpot form GUI and extend the milliseconds from 10 to 100 - got it working!"
  },
  {
    "poster": {
      "poster_name": "Mohammad Abdulkhalek",
      "poster_handle": "mohammad.abdul"
    },
    "time_stamp": "2021-06-02 04:49:10",
    "text": "Hi everyone\n\nI'm using Usercentrics tool to manage the cookies for GDPR purpose,\n\nI'm using\n\nvar _hsp = window._hsp = window._hsp || [];\n_hsp.push(['revokeCookieConsent']);\n\nto remove the HubSpot cookies if the user denied but, the question is.\n\nIf the user selects one or more of the cookies' categories, how can I push the HubSpot Cookies under the selected categories?\n\nI tried to follow the\n\n<https://developers.HubSpot.com/docs/api/events/cookie-banner>\n\nBut there is nothing there to show how can I push a single category's cookie.\n\nSo, what is the way to push a single HubSpot single category cookies.",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2022-07-04 07:21:49"
      },
      {
        "time_stamp": "2023-02-14 08:12:19"
      },
      {
        "time_stamp": "2023-02-14 08:12:45"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jason Bar",
      "poster_handle": "jason.bariamis"
    },
    "time_stamp": "2021-06-02 06:14:04",
    "text": "Hello!\nAnyone here familiar with the Quotes API, by chance?\n\nTrying to figure out why quotes that are listed on a HubSpot Deal are getting removed and attached over to the corresponding Renewal Deal that gets generated by my Custom Code Action workflow.\n\nI am not using any quotes API at all and want them to stay attached to the original deal.\n\nCan find anything in the docs and was hoping someone might have some insight.  Thanks!"
  },
  {
    "text": "Ok, I give up...  Does anyone know how to remove the dynamic language switcher from showing up on a blog that is NOT TRANSLATED in multiple languages or is this a bug?\n\nI get asked this question from so many customers and experience this on my own Blog.  How can this be turned off when the blog is only in one language?",
    "time_stamp": "2021-06-02 09:30:47",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-06-02 10:27:43"
      },
      {
        "time_stamp": "2021-06-02 10:35:53"
      },
      {
        "time_stamp": "2021-06-02 11:56:15"
      }
    ]
  },
  {
    "subtype": "thread_broadcast",
    "time_stamp": "2021-06-02 10:27:43",
    "text": "see <https://github.com/HubSpot/cms-theme-boilerplate/blob/09ad0b2c3bbc8400e64c5617268cb0504392e8e5/src/templates/partials/header.html#L28|the boilerplate> (line 28)"
  },
  {
    "poster": {
      "poster_name": "Kevin Fremon",
      "poster_handle": "kevin"
    },
    "time_stamp": "2021-06-02 10:35:53",
    "text": "Thanks <@U3T21PDBK>!"
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-06-02 11:56:15",
    "text": "of course!"
  },
  {
    "poster": {
      "poster_name": "Vinicius de Castro",
      "poster_handle": "vinicius.nogueira"
    },
    "time_stamp": "2021-06-02 13:14:25",
    "text": "Hello everyone! I'm Vini , I'm a full stack developer and this is my first interaction here haha. I'm trying to use HubSpot live chat script in another application (Nextjs) and I want to load the chat in AMP pages. amp.dev says it's possible to run scripts in AMP pages by using amp-script tag but the documentation also says that we still won't be allowed to create another script tags with this script. Well, It seems that HubSpot live chat script tries to create a script tag and after the creation it tries to use parentNode (which can't be found so I receive an error message). So I wanna know if anyone knows how to use HB live chat script in a JS project for AMP pages. Is it possible?\n\n\n\nThank you very much for all the attention",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-06-02 14:11:53"
      },
      {
        "time_stamp": "2021-06-04 08:22:44"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "John Fuller - Blames Bugs",
      "poster_handle": "john.ascendinbound"
    },
    "time_stamp": "2021-06-02 14:11:53",
    "text": "I’ve never done it. But putting live chat on an AMP seems counter intuitive. The whole point is to have limited scripts and styles to accelerate the mobile page.\n\nMaybe you can put a “live chat button” link in the right hand corner and just link users to a dedicated page with live chat?"
  }
]