[
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2021-11-10 06:39:34",
    "text": "Correct, one function for the image to upload, and then the hosting url is returned in the body of a successful request."
  },
  {
    "text": "Hey all! I'm new here and just wanted to introduce myself. I'm marketer and an automation specialist at an agency. I'm dipping my toe a bit into development but I'm not a developer. I'm trying to set up my first email template using the drag-and-drop template in Design Tools... I'm not sure if we are adding the code the correct way to make the logo dark mode friendly. Here's how I have it set up (attached), but it isn't working (and nothing is showing up in the HTML of a test email either). Any suggestions? Not sure if this belongs here or the template channel, so let me know if I should be dropping this elsewhere. Thanks so much!",
    "time_stamp": "2021-11-10 12:16:05",
    "edited": {
      "time_stamp": "2021-11-10 13:00:05"
    }
  },
  {
    "poster": {
      "poster_name": "Marty",
      "poster_handle": "marty"
    },
    "time_stamp": "2021-11-10 13:07:04",
    "edited": {
      "time_stamp": "2021-11-10 13:59:31"
    },
    "text": "We are a payments company thinking about integrating into Hub spot.  I wanted to flesh out the decision process between building something internally and integrated with HubSpot vs. an external application that uses the API.\n\nWhat programming language is used if I were to build an internal application?\nHow do the internal application interact with the HubSport data model?\nCan I use Javascript and call to external services?\n\nAnything else I should be thinking about when making this decision?  I really want to have flexibility in the application and want to understand the limitations of both approaches.\n\nThank you!"
  },
  {
    "poster": {
      "poster_name": "Ashley Connell",
      "poster_handle": "ashley427"
    },
    "time_stamp": "2021-11-10 19:17:27",
    "text": "Hi!  I'm Ashley Connell, CEO of <https://prowessproject.com/|Prowess Project>.  We help women in the workforce via training, networking and access to jobs.  We have many employers looking for HubSpot talent and many female jobseekers interested in HubSpot development, so I'm here to learn a bit more about both. If looking for work, feel free to reach out - <mailto:hello@prowessproject.com|hello@prowessproject.com>"
  }
]