[
  {
    "poster": {
      "poster_name": "Fortune Mwagambo",
      "poster_handle": "fortuneniguel"
    },
    "time_stamp": "2021-01-11 05:03:11",
    "text": "hello"
  },
  {
    "poster": {
      "poster_name": "Phil Vallender",
      "poster_handle": "phil"
    },
    "time_stamp": "2021-01-11 06:02:55",
    "text": "<@U0149PQC0HK> did you make any more progress on this?"
  },
  {
    "poster": {
      "poster_name": "Vesa Poikajärvi",
      "poster_handle": "vesa.poikajarvi"
    },
    "time_stamp": "2021-01-11 06:08:56",
    "edited": {
      "time_stamp": "2021-01-11 06:10:52"
    },
    "text": "No, not really. Time to first byte is the issue from Finland at least, and just ran PageSpeed and it reported 1,700 ms for our production site."
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-01-11 09:14:46",
    "text": "Hi HubSpot team.... A couple of issues:\n\n1. It would be really helpful if there was a channel devoted to Workflows. I spend most of my time in workflows and there is no place to discuss them here.\n2. Where do we best report bugs? The Workflow notifications mobile push action does not push mobile alerts. Have tested with numerous users, quite simply, nobody ever gets a mobile push.",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-01-11 09:51:32"
      },
      {
        "time_stamp": "2021-01-11 10:54:48"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Zack Wolfson",
      "poster_handle": "zwolfson"
    },
    "time_stamp": "2021-01-11 09:51:32",
    "text": "1. It looks like you are already in <#C019VT42R8X|workflows> which is what I was going to recommend. I can see about creating a dedicated workflows or automation channel however \n2. The customer support team or community forums are the best place for bug reports"
  },
  {
    "poster": {
      "poster_name": "Arlo Gilbert",
      "poster_handle": "a"
    },
    "time_stamp": "2021-01-11 10:54:48",
    "text": "1. Doh!\n2. Thanks."
  },
  {
    "poster": {
      "poster_name": "Aaron Dadap",
      "poster_handle": "wesleyadwebster"
    },
    "time_stamp": "2021-01-11 10:55:34",
    "text": "Not sure where to put this or categorize it. I have a site that holds events, and some events listing. Beside the point, is there a native HubSpot way for registration form to grab user data say email?\n\nWe could use eventbrite, but its not quite an event. Something along the ways of collecting users info in a sign up way. Something like a google form but if there's a native HubSpot equivalent",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2021-01-11 12:20:28"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "BJ Szyjakowski",
      "poster_handle": "bj.s"
    },
    "time_stamp": "2021-01-11 12:20:28",
    "text": "<@U019EKLPY90> If youre asking about keeping track of users that fill out hs forms — HubSpot automatically grabs all form fields and stores them under the email provided by the user. All of that can be retrieved using hubl.\n\nIf youre asking about prepopulating form fields of a known user - agian HS should automatically do that if a user is known.\n\nIf youre asking something else you will need to clarify a bit more what youre looking to do"
  }
]