[
  {
    "poster": {
      "poster_name": "Krishna Dhongade",
      "poster_handle": "kdhongade"
    },
    "time_stamp": "2024-11-19 13:41:18",
    "text": ":wave: Hello, team!\nCan someone help me find an answer for this :\nWe have a setup in HubSpot where contacts are associated with custom objects in a 1-to-1 or 1-to-many relationship. Let me explain the flow and what we want to achieve:\n1. A user fills out a form on our website, creating a *Contact* record in HubSpot.\n2. During background processing, we:\n    ◦ Store calculated values in a *Custom Object* (e.g., \"Value Table\") using API calls or workflows.\n    ◦ Associate the *Value Table* custom object with the contact using association labels or the Association API.\n3. In some cases, the *Value Table* custom object is also associated with another custom object, e.g., a *Rate Table*.\n4. When the user navigates to a specific page, we want to display the values stored in the *Value Table* (and potentially the *Rate Table*) that are associated with the user’s contact.\n*Key Requirements:*\n1. The page needs to dynamically display the data stored in the custom object records associated with the contact (not in the contact record itself). Each user will have their own set of values in the associated custom object records, which should be displayed as tables or other UI components on their page.\n2. Additionally, I want the content area of the page to update dynamically when new data is added to the backend. Specifically:\n    ◦ Instead of the user refreshing the webpage, I’d like to implement a long-polling mechanism where the page automatically refreshes the content when the backend receives new data.\n    ◦ In frameworks like React or JavaScript, we can fetch backend data periodically or via subscriptions and render it on the frontend. I’d like to achieve similar functionality on the HubSpot side *without making repeated HubSpot API calls*.\n*Questions:*\n• Does HubSpot support dynamically pulling values from custom objects associated with a contact and rendering them on a webpage?\n• Is there a native way in HubSpot to implement a long-polling or dynamic content refresh mechanism without requiring manual page refreshes or excessive API calls?\n",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-11-20 05:16:14"
      },
      {
        "time_stamp": "2025-01-23 00:37:25"
      }
    ]
  }
]