[
  {
    "poster": {
      "poster_name": "Rens Bekkers",
      "poster_handle": "rens927"
    },
    "time_stamp": "2024-10-16 01:09:07",
    "text": "Hi Everyone, We are looking into a way in how we can send invoices to our customers/partners in an automated fashion. The <https://developers.HubSpot.com/docs/api/commerce/invoices> is a read only API. Does anyone have ideas in how we can create automated invoices?\n\nIn a nutshell. We collect money for transactions, create an invoice (credit note) for this and pay out the partner through the bank.\n\nWe would want to find a way to create the invoices using HubSpot. Any thoughts?\n\nThank you :innocent:",
    "reply_count": 2,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2024-10-16 04:36:02"
      },
      {
        "time_stamp": "2024-10-23 08:28:03"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Stefan Jaeger",
      "poster_handle": "stefanjaeger8305"
    },
    "time_stamp": "2024-10-16 04:36:02",
    "text": "have u tested the post urls? like quote? could be not documented"
  },
  {
    "poster": {
      "poster_name": "Max Addison",
      "poster_handle": "max.addison"
    },
    "time_stamp": "2024-10-16 14:58:13",
    "text": "*Missing Page Visit Tracking After Cookie Consent and Before Form Submission in HubSpot*\n\nHello HubSpot Devs!\n\nI’m facing an issue on our WordPress website, where *page visits after cookie consent is given but before form submission are not being tracked properly in HubSpot*. This is also negatively impacting the tracking of ads I’m running.\n\n*Key Problem:*\nWhen a user visits my site, clicks on an ad, then navigates through multiple pages (e.g., from a pricing page to a “How It Works” page), and finally submits a form on the “Contact Us” page, HubSpot is only capturing the contact creation event as direct traffic from the final page where the form was submitted. *I’m losing the entire page visit history leading up to the form submission.*\n\n*For example, I only see:*\n• “This contact was created from Direct Traffic from <http://www.blah.com/contact-us|www.blah.com/contact-us>”\n• No data about visits to previous pages (like pricing, how it works, etc.) or the ad click that brought them to the site.\n*Current Setup:*\n1. WordPress: I’m using the HubSpot WordPress plugin.\n2. CookieYes: I use CookieYes for cookie consent, with HubSpot’s `setHubSpotConsent` function invoked once consent is granted.\n*Issue:*\n• Page Visits Not Tracked After Consent: Despite consent being granted via CookieYes, page views after consent are not logged in HubSpot before a form submission.\n• No Pre-Form Data: As a result, all page visits leading up to a form submission are missing in the HubSpot contact timeline.\n• Ad Tracking is Affected: This is also impacting my Google Ads tracking, as the only source information I see is the contact creation event, without any data linking the user’s journey from ad click to form submission.\nQuestion:\n• How can I ensure that page visits after cookie consent but before form submission are tracked in HubSpot?\n• Are there any known conflicts between CookieYes, GTM, and the HubSpot WordPress plugin that could be causing this? (maybe I should swap to using the HubSpot consent banner?)\n• What’s the best way to track the entire user journey from ad click through multiple page views, leading up to form submission in HubSpot?\nIve been in touch with HubSpot support for a while but they’ve said this community is my best bet - so I’m hopeful for some advice!\n\nHoping that this community can help and thanks in advance :pray:",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2024-11-19 17:11:37"
      }
    ]
  }
]