[
  {
    "poster": {
      "poster_name": "Jamie Cartwright",
      "poster_handle": "jamie.cartwright"
    },
    "time_stamp": "2021-04-03 09:45:29",
    "text": "Workflow question from a new here - If using Github for CI, how do folks handle testing out changes? Do you deploy a branch to a test portal? In between the Github-oriented docs and the docs focused on local development, I can't seem to find a clear answer",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2021-04-03 10:08:20"
      },
      {
        "time_stamp": "2021-04-03 10:31:47"
      },
      {
        "time_stamp": "2021-04-03 10:35:39"
      },
      {
        "time_stamp": "2021-04-03 11:06:23"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-03 10:08:20",
    "text": "<https://developers.HubSpot.com/docs/cms/guides/creating-an-efficient-development-workflow|https://developers.HubSpot.com/docs/cms/guides/creating-an-efficient-development-workflow>\n\nWe suggest in our docs having each dev use a sandbox portal if they need to dev at the same time. You can use github actions to auto deploy branches like main or a develop branch to your production portal or to a shared test portal.\n\nEach team or individual will have different preferences on how they want to set that up. For example if you only have 1 developer they may only care to have the production and testing/develop portal. \n\nYou can adjust the workflow to fit your team and your teams needs."
  },
  {
    "poster": {
      "poster_name": "Jamie Cartwright",
      "poster_handle": "jamie.cartwright"
    },
    "time_stamp": "2021-04-03 10:31:47",
    "edited": {
      "time_stamp": "2021-04-03 10:31:56"
    },
    "text": "Thanks Jon! So, we can set up a shared test portal, and use HS actions to deploy a branch to a different test portal, even with the HubSpot Deploy Action set for `main` . That correct?"
  },
  {
    "poster": {
      "poster_name": "Jon McLaren",
      "poster_handle": "jon558"
    },
    "time_stamp": "2021-04-03 10:35:39",
    "text": "Im away from computer atm but basically you could make it so merging to a develop branch triggers an auto deploy to your test portal, while a merge to your main branch triggers a deploy to your production portal.\n\nFor an individual devs sandbox i just use watch to upload changes"
  },
  {
    "poster": {
      "poster_name": "Jamie Cartwright",
      "poster_handle": "jamie.cartwright"
    },
    "time_stamp": "2021-04-03 11:06:23",
    "text": "Awesome! That’s what I needed! Thank you Jon!"
  },
  {
    "poster": {
      "poster_name": "Stefan Dzalev",
      "poster_handle": "stefan632"
    },
    "time_stamp": "2021-04-03 14:56:07",
    "text": "Hey all, i am new to HubSpot and i have a an issue loading some css files and i cant figure it out why, i have a custom html css site that i need to implement in the CMS. On Local the owl carousel is working great but when i put the code to HubSpot the carousel is not working and the code is completely the same i haven't changed anything. i have no idea what's going on. is HubSpot somehow rendering the styles differently ? anyone had some issue like this using owl carousel or something simmular? any help is much welcomed! thanks"
  }
]