[
  {
    "poster": {
      "poster_name": "Jim Rogers",
      "poster_handle": "jrogers"
    },
    "time_stamp": "2019-12-12 07:36:51",
    "text": "Hey. Does anyone know if there will be further font styles added to the default email settings other then the usual. Eg Times/Arial? Thanks",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2019-12-12 08:24:33"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Mark Ryba",
      "poster_handle": "mryba"
    },
    "time_stamp": "2019-12-12 08:24:33",
    "text": "Unfortunately that's mainly due to the limited number of supported fonts across email clients; some clients will respect and properly display webfonts, but others do not. In general, you can set up the web font import manually and then use it via CSS, but you should also provide a fallback font for those programs that don't support webfonts. The only alternative is to incorporate your typography into an image instead of HTML, which would render the same across email programs but obviously comes at the cost of being actual text.\n\nHere's more information on using fonts in HTML emails: <https://www.emailonacid.com/blog/article/email-development/best-font-for-email-everything-you-need-to-know-about-email-safe-fonts/>"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-12-12 09:55:17",
    "text": "Do you have a few examples of that pre-made code that you could share? We've made several passes at reducing the size and complexity of the code outputted from the DnD email editor recently and I'm interested in comparing how our outputted code might compare to yours to see if there's ways we could simplify. Mainly I'm trying to wrap my head around how our pre-made chunks of code might differ from yours :slightly_smiling_face:"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-12-12 09:57:02",
    "text": "Accessibility, and srcset should all work out of the box with the default modules, i.e. they're automatically set in the background for all content, but you can create custom modules in the Design Manager and they can be used in the DnD email editor just like our standard modules which would give you a much deeper level of control around the outputted code. We haven't made any huge progress on dark mode, but max-width customisation and custom fonts are something that we're thinking about"
  },
  {
    "poster": {
      "poster_name": "Dillon Nuanes",
      "poster_handle": "dnuanes"
    },
    "time_stamp": "2019-12-12 16:17:24",
    "text": "Is there a variable, similar to `{{ unsubscribe_link }}` but for updating email preferences?",
    "reply_count": 3,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-12-12 16:26:38"
      },
      {
        "time_stamp": "2019-12-12 16:28:04"
      },
      {
        "time_stamp": "2019-12-12 16:59:05"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2019-12-12 16:26:38",
    "text": "Not that I'm aware of. We created our own preference center landing page in HubSpot, put a form on it, and link to that, in addition to the unsubscribe/communication preferences link."
  },
  {
    "poster": {
      "poster_name": "Dillon Nuanes",
      "poster_handle": "dnuanes"
    },
    "time_stamp": "2019-12-12 16:28:04",
    "text": "What I found in the docs is you can use `{{ unsubscribe_link }}` to link to the HubSpot preference center and `{{ unsubscribe_link_all }}` for unsubscribe"
  },
  {
    "poster": {
      "poster_name": "Courtney Fantinato",
      "poster_handle": "courtneyfantinato"
    },
    "time_stamp": "2019-12-12 16:59:05",
    "text": "`{{ unsubscribe_link }}` isn't really a \"preference center\". It's just for communication preferences, to unsubscribe or subscribe to different types of communication subscriptions that you create. A preference center to be able to update things like your name or birthday or other properties you want to collect, you'd need to create your own of."
  }
]