[
  {
    "poster": {
      "poster_name": "Shirley",
      "poster_handle": "shirley.lau"
    },
    "time_stamp": "2019-12-04 08:40:34",
    "text": "Hi all, does anyone know whether or not smart CTAs will work in emails based on device type? But seeing as they look at user agents of visitor browser then they can’t determine what the device the user is using if it is open via a email client not browser right?",
    "reply_count": 4,
    "reply_users_count": 4,
    "replies": [
      {
        "time_stamp": "2019-12-04 10:41:39"
      },
      {
        "time_stamp": "2019-12-04 16:38:53"
      },
      {
        "time_stamp": "2019-12-05 05:08:29"
      },
      {
        "time_stamp": "2019-12-10 10:01:56"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kristopher Combs",
      "poster_handle": "kcombs"
    },
    "time_stamp": "2019-12-04 09:59:14",
    "text": "<@U24DCSJBE> We’ve recently looked at the DnD email tool and while it’s fairly flexible for manual content, the RSS module is not. There’s no code view and the styles don’t offer line-height, which looks extremely tight. Are you planning on more flexibility for that in the future?",
    "reply_count": 4,
    "reply_users_count": 2,
    "replies": [
      {
        "time_stamp": "2019-12-04 16:42:32"
      },
      {
        "time_stamp": "2019-12-11 11:29:36"
      },
      {
        "time_stamp": "2019-12-13 04:08:06"
      },
      {
        "time_stamp": "2019-12-17 06:50:07"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Dillon Nuanes",
      "poster_handle": "dnuanes"
    },
    "time_stamp": "2019-12-04 10:41:39",
    "text": "Pretty sure smart CTAs are for blogs and web pages, not email"
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-12-04 16:38:53",
    "text": "You can use a smart CTA inside an email, but only the Lifecycle Stage and List Membership rules will work. I _think_ we have a warning in-app about that if you insert a CTA that has unsupported rules."
  },
  {
    "poster": {
      "poster_name": "Shay Redmond",
      "poster_handle": "shay"
    },
    "time_stamp": "2019-12-04 16:42:32",
    "text": "Hey Kristopher! At the moment we don't have any plans to introduce a source code view for the RSS module, but the line height issue actually just looks like an oversight. I'll take a look at it on our side :+1: out of interest what would you like to be able to do that the source code view would enable? (besides the line height issue)"
  }
]