[
  {
    "poster": {
      "poster_name": "Andy",
      "poster_handle": "amartin853"
    },
    "time_stamp": "2025-01-09 08:36:51",
    "text": "Just to close this thread out... The question i was asking was whether our dev sandbox had rights to the Enterprise restricted api endpoints... It appears they do for anyone else wondering."
  },
  {
    "poster": {
      "poster_name": "Tony Timberlake",
      "poster_handle": "tony.t"
    },
    "time_stamp": "2025-01-09 11:49:26",
    "text": "<#CCQ7H31D5|developer-tools> anybody here can help with successfully verifying webhooks requests from HubSpot? I followed the documentation for v3 validation and wrote my own tests which passed the same steps; however, when sending tests from a test request in my automation workflow, the validation on my server fails even though all the values are there. To my knowledge, there's no way to see plaintext requests I send via HubSpot, so I can't really make a 1 to 1 comparison like I could in my test environment with my own scripts."
  },
  {
    "poster": {
      "poster_name": "Aleksandar Perisic",
      "poster_handle": "fizikaneri"
    },
    "time_stamp": "2025-01-09 13:14:04",
    "edited": {
      "time_stamp": "2025-01-09 13:17:45"
    },
    "text": "Do you want to disable cache forever or just when you work?\n\n01 Lets say adding a variable will stop page from caching:\n• <https://developers.HubSpot.com/docs/reference/cms/hubl/variables>\n    ◦ `{{ local_dt }}`\n02 You can use HubSpot Chrome extension, or add params like this:\n• <https://www.website.com/?hsDebug=true&hsCacheBuster=1849>\n    ◦ `?hsDebug=true&hsCacheBuster`\n    ◦ <https://chromewebstore.google.com/detail/HubSpot-developer-extensi/gebemkdecnlgbcanplbgdpcffpdnfdfo>\n03 If you work with a large file  (main CSS gets minified)\nyou can always try something like timestamp so it always loads the latest (should not use on production):\n```{{ require_js(get_asset_url('../../js/main.js') + '?' + unixtimestamp()) }}```"
  }
]