[
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-12-11 01:58:56",
    "text": "Hey!\n\nI'm so frustrated with this new documentation.\nIs there a way to access the old one?\n\nThe new content structure makes it hard to find necessary content (absolutely different from the previous). Time goes by, and it doesn't get easier.\n\nWith the old docs, a search was a savior whenever you didn't know where to find things. In this new version, the search isn't as efficient as the old one was.\n\nFor example, I'm trying to refresh my memory on blog tags for CMS development. I can't find this piece `content.tag_list`. Neither new structure nor search helps to locate information within new documentation.\n\nIt's so upsetting and super hard to stay positive about new developer docs.\n\nDoes anyone know how to approach this new documentation in an efficient way?",
    "reply_count": 8,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2024-12-11 08:47:21"
      },
      {
        "time_stamp": "2024-12-11 13:06:02"
      },
      {
        "time_stamp": "2024-12-11 13:12:39"
      },
      {
        "time_stamp": "2024-12-11 13:13:37"
      },
      {
        "time_stamp": "2024-12-11 13:15:17"
      },
      {
        "time_stamp": "2024-12-11 14:19:24"
      },
      {
        "time_stamp": "2024-12-12 03:29:56"
      },
      {
        "time_stamp": "2024-12-12 03:33:29"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Anton Bujanowski - Level 36",
      "poster_handle": "info748"
    },
    "time_stamp": "2024-12-11 08:47:21",
    "text": "Yep... Same here. The new one is cool in terms of design and functionalities, but UX wise it's often so hard to navigate compared to the old one (which I miss aswell)\nNavigating to(!) the CMS docs is soo freaking akward. Like why is there no direct link to it from the navigation of <http://developers.HubSpot.com|developers.HubSpot.com> - it seems like everything is about API and CRM development... Unfortunately.\n\nDo you mean this variables?\n<https://developers.HubSpot.com/beta-docs/reference/cms/hubl/variables#blog-variables>\n\nIt also might have been removed for some reason"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-12-11 13:06:02",
    "edited": {
      "time_stamp": "2024-12-11 13:18:36"
    },
    "text": "> Like why is there no direct link to it from the navigation of <http://developers.HubSpot.com|developers.HubSpot.com> - it seems like everything is about API and CRM development... Unfortunately.\nThese are my thoughts as well every time I go to developer docs\nLike people doing CMS don't exist on the HubSpot devrel team radar :disappointed:"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-12-11 13:12:39",
    "text": "Absolutely agree with you, <@UJAPS2K4N>\n\nTo be honest, I'm not a big fan of the UI either (because of proper contrast with all those light backgrounds and unnecessary shadows), but it's not that important. One can tolerate such UIs, but worsened UX can not be ignored because you just can't do what this documentation is supposed to help you to do — to find right information\nSo frustrating…\nI've been quiet for a while about this, but when you rely on the doc in your work, and it disrupts your workflow, you can't be silent anymore"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-12-11 13:13:37",
    "text": "&gt; Do you mean this variables?\n&gt; <https://developers.HubSpot.com/beta-docs/reference/cms/hubl/variables#blog-variables>\n<@UJAPS2K4N> yes! There is no mention of tag_lists anymore somehow"
  },
  {
    "poster": {
      "poster_name": "Olia Gozha",
      "poster_handle": "olia"
    },
    "time_stamp": "2024-12-11 13:15:17",
    "text": "I've been wondering for some time what could possibly be so wrong with the old doc that required a revamp from scratch :thinking_face:"
  },
  {
    "poster": {
      "poster_name": "Robyn Naragon (HubSpot PM)",
      "poster_handle": "rnaragon"
    },
    "time_stamp": "2024-12-11 14:19:24",
    "text": "Hi All! Thank you for providing your feedback here, it's super important for us to hear this. I definitely hear you on the search pain, and this has unfortunately come up quite a bit. I'm happy to say that improving search is a priority of ours for next year!\n\nI've brought this thread to our tech writing team to see how we can do some content improvements here, but I'd also love to hear more about how else we can improve the Docs. If you're open to chatting, here is <https://www.HubSpot.com/meetings/rnaragon1/developer-docs-feedback|my meeting link> :slightly_smiling_face:\n\nI would also advise against using the cloned site, since our teams are not maintaining this site, meaning it could have outdated content or inaccurate info that's since been corrected on the real site!"
  }
]