[
  {
    "poster": {
      "poster_name": "Mubariz Muneer",
      "poster_handle": "mubariz.muneer"
    },
    "time_stamp": "2023-08-31 06:23:38",
    "text": "sure"
  },
  {
    "poster": {
      "poster_name": "Harris Kenny (Intro CRM)",
      "poster_handle": "harris"
    },
    "time_stamp": "2023-08-31 14:47:33",
    "text": "hi! my company is a solutions partner and we’re looking to hire a *HubSpot implementation and automation specialist* to help me serve our clients. i’m doing this work right now and stretched very thin. our HubSpot practice is growing quickly. this is initially a part-time, hourly position, remote with base in the Americas. more details in the thread. :arrow_down:",
    "reply_count": 3,
    "reply_users_count": 3,
    "replies": [
      {
        "time_stamp": "2023-08-31 14:47:54"
      },
      {
        "time_stamp": "2023-08-31 22:55:07"
      },
      {
        "time_stamp": "2023-09-01 02:55:38"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Harris Kenny (Intro CRM)",
      "poster_handle": "harris"
    },
    "time_stamp": "2023-08-31 14:47:54",
    "text": "*Job Description: HubSpot Specialist*\n\n*Company Overview:*\nIntro CRM is a growing HubSpot solutions partner that helps B2B sales teams adopt cutting edge sales strategies and tactics. The company actively works to be inclusive, foster a culture of mutual respect, and deliver exceptional services to our clients.\n\n*Position Overview:*\nWe are currently seeking a HubSpot Specialist who is experienced in implementing the HubSpot CRM for clients, including importing data, setting up integrations, and managing properties, templates, sequences, workflows, and more. The specialist will work remotely and should be based in the Americas.\n\n*Key Responsibilities:*\n- Implementing HubSpot CRM for various clients, ensuring integrated workflows, product adoption, and customer satisfaction.\n- Configuring HubSpot portals, creating documentation, importing data, setting up integrations with tools as-needed, and managing various elements within HubSpot.\n- Meeting remotely with clients (30-40% of the time), to conduct scoping, walkthroughs, and ensuring their queries are resolved and they are satisfied with our service.\n- Collaborate independently, working alongside the outbound specialist and reporting directly to the founder.\n- Document and explain work procedures and outcomes, ensuring clarity for all stakeholders.\n- Manage and close tickets within HubSpot CRM, ensuring tasks are completed in a timely manner.\n\n*Requirements:*\n- 2-5 years of experience using HubSpot.\n- Must have at least one HubSpot certification.\n- Proven ability to work proactively, creatively solve problems, and request assistance when necessary.\n- Strong ability to document and explain work processes.\n- Familiarity with B2B sales and US business practices is beneficial.\n- Experience with <http://Make.com|Make.com>, creating API calls, and/or <http://Supered.io|Supered.io> is a plus.\n\n*Preferred Qualities:*\n- Comfortable working in a casual and independent environment.\n- Dedicated to delivering top-notch work and ensuring client satisfaction.\n- Strong commitment to inclusivity and respect in all communications and practices.\n\n*Additional Information:*\n- This is a part-time, hourly position.\n- Compensation ranges from $30-$45 per hour, based on experience.\n- Candidates will receive hands-on training, have access to documentation, and be given paid time for relevant certifications. There may also be additional professional development funds available.\n- This role reports directly to the founder and does not involve managerial or supervisory responsibilities.\n\nWe are excited to find a HubSpot Specialist who aligns with our company values and can drive our HubSpot practice forward. If you are dedicated, skilled, and ready for a new challenge, we look forward to hearing from you!"
  },
  {
    "poster": {
      "poster_name": "valor wide",
      "poster_handle": "valorwide"
    },
    "time_stamp": "2023-08-31 22:55:07",
    "text": "Please check your inbox <@U0435G4JZK3>"
  }
]