[
  {
    "poster": {
      "poster_name": "Mark",
      "poster_handle": "mimimixalove"
    },
    "time_stamp": "2023-08-24 03:35:19",
    "edited": {
      "time_stamp": "2023-08-24 03:43:20"
    },
    "text": "Hey folks! I'm looking for a developer that could either consult me on a build or develop a ready solution.\nThe objective is to implement a script that ideally would be triggered as a custom code block in a HubSpot chatbot.\nThe script should get and process the visitor's data and messages from the conversation and send it as a JSON to our server.\nThe data we need:\n• First Name, Last Name, Email (from Visitor Id);\n• Conversation Thread id;\n• Visitor's messages.\nPlease share your offers and rates. I'd appreciate a dm, or you may also contact me via <mailto:mimimixalove@gmail.com|mimimixalove@gmail.com>.",
    "reply_count": 1,
    "reply_users_count": 1,
    "replies": [
      {
        "time_stamp": "2023-08-24 06:06:11"
      }
    ]
  },
  {
    "poster": {
      "poster_name": "Kotikalapudi Prabha",
      "poster_handle": "prabha44.kp"
    },
    "time_stamp": "2023-08-24 05:58:13",
    "text": "Hi, At our agency, we specialize in harnessing the full potential of your online presence by utilizing the power of HubSpot CMS. Our team of seasoned professionals is dedicated to crafting visually stunning websites and modules that not only captivate the eye but also provide exceptional functionality. Through our innovative designs and seamless integration, we guarantee that your online platform will truly reflect the vision and values of your brand. Join forces with us today and witness the remarkable transformation as we propel your business to unprecedented heights. <https://hubdoormarketing.com/stunning-HubSpot-websites-landing-pages>"
  },
  {
    "poster": {
      "poster_name": "Shakil Sumra",
      "poster_handle": "sumramca"
    },
    "time_stamp": "2023-08-24 06:06:11",
    "text": "I can help you to extract given data from the HubSpot chatbot."
  }
]